[
    {
        "comment_id": "lvqq03w",
        "subreddit": "books",
        "body": "Man Reddit is gonna be unusable for the next week or so. I don’t want my escape subreddits to be full of political doom and gloom lol",
        "time": "2024-11-06 17:03:47 UTC",
        "score": 2,
        "link_id": "t3_1gl2yie",
        "parent_id": "t3_1gl2yie"
    },
    {
        "comment_id": "lvm0hm5",
        "subreddit": "books",
        "body": "I wish I had. I usually like stuff like that series but the second one had an extremely graphic violence and rape scene 2/3 of the way through that served no real purpose. Stuck with me for a while. It was disgusting",
        "time": "2024-11-05 23:36:22 UTC",
        "score": 5,
        "link_id": "t3_1gketck",
        "parent_id": "t1_lvky83s"
    },
    {
        "comment_id": "lsx3ump",
        "subreddit": "books",
        "body": "Finished, Everybody Loves Large Chests (Vol. 1), by Neven Iliev",
        "time": "2024-10-20 22:53:36 UTC",
        "score": 1,
        "link_id": "t3_1g3c8ey",
        "parent_id": "t3_1g3c8ey"
    },
    {
        "comment_id": "lsx3i4a",
        "subreddit": "books",
        "body": "Oof. Yeah self published works can be good but you’re basically hunting for gems in a coal mine. I’d equate that to when YouTubers try to start a music career and fail miserably. Being good at one area of artistic expression does not usually translate to related fields",
        "time": "2024-10-20 22:51:32 UTC",
        "score": 1,
        "link_id": "t3_1g7jezo",
        "parent_id": "t3_1g7jezo"
    },
    {
        "comment_id": "lrlawyp",
        "subreddit": "books",
        "body": "Rarely but it has happened where I’ve been more terrified than anything I’ve seen in a movie. This web series called Ar’Kendrithyst has a part where there is a group of monsters hunting the protagonist, and every time you see them you forget they exist for a second. Was absolutely horrifying because the protagonist kept getting injured and then stopped to try and figure out what was going on. Eventually just escaped and someone else filled her in on it. So well written and honestly just terrifying.",
        "time": "2024-10-12 17:07:32 UTC",
        "score": 1,
        "link_id": "t3_1g1vfsk",
        "parent_id": "t3_1g1vfsk"
    },
    {
        "comment_id": "kroqx5r",
        "subreddit": "books",
        "body": "The main one lol. Any list that has overdue on it by listener numbers, it’s the highest one. Green book as the profile picture. “About the books you’ve been meaning to read”",
        "time": "2024-02-22 23:52:52 UTC",
        "score": 1,
        "link_id": "t3_17chfby",
        "parent_id": "t1_k5rito7"
    },
    {
        "comment_id": "kptd3pi",
        "subreddit": "books",
        "body": "Kindle unlimited is great for that",
        "time": "2024-02-10 18:43:07 UTC",
        "score": 1,
        "link_id": "t3_1an26qo",
        "parent_id": "t1_kppmixz"
    },
    {
        "comment_id": "kptd1fo",
        "subreddit": "books",
        "body": "My voracious appetite is barely sated by my own dozen library memberships. I’ve got warrants in 13 states for devouring entire stacks",
        "time": "2024-02-10 18:42:43 UTC",
        "score": 2,
        "link_id": "t3_1an26qo",
        "parent_id": "t1_kppmixz"
    },
    {
        "comment_id": "k9dvvof",
        "subreddit": "books",
        "body": "You’re being downvoted but you’re completely right. I used to live in China and have traveled extensively in Japan, South Korea, and India. Acting like cultural differences in writing and basic values don’t exist is asinine. I’m sure the person responding to you is some college kid who’s never left their privileged first world country before",
        "time": "2023-11-15 17:50:24 UTC",
        "score": -6,
        "link_id": "t3_17v24oi",
        "parent_id": "t1_k9amyxv"
    },
    {
        "comment_id": "k9dvlq3",
        "subreddit": "books",
        "body": "They do though and it is self evident. Stating factual analysis is not racism. That in itself is a shallow criticism",
        "time": "2023-11-15 17:48:46 UTC",
        "score": -9,
        "link_id": "t3_17v24oi",
        "parent_id": "t1_k9ak3ip"
    }
]