[
    {
        "comment_id": "lxk8qhu",
        "subreddit": "books",
        "body": "Been on my list but I've read reviews like yours that say it drags in parts. But it's an important book historically, as one of the first psychological novels ever written. So I commend you for persisting and getting it done.",
        "time": "2024-11-17 07:24:04 UTC",
        "score": 2,
        "link_id": "t3_1gt22wq",
        "parent_id": "t3_1gt22wq"
    },
    {
        "comment_id": "lxk8hiy",
        "subreddit": "books",
        "body": "Prioritize.\n\nAs with everything in life, you gotta choose what you focus on in the limited time you dedicate to a task. There are books that have so many words that are new to me that i could spend more time looking them up in the dictionary than reading. But I pick the ones that are hardest to guess (check the context, the root) and then let the rest go. This way I'm actually more likely to remember the meaning of the four or five new words I learn than if I were to look up 25 words a day.",
        "time": "2024-11-17 07:21:29 UTC",
        "score": 1,
        "link_id": "t3_1gt578k",
        "parent_id": "t3_1gt578k"
    },
    {
        "comment_id": "lxk884v",
        "subreddit": "books",
        "body": "Pirsig's Zen and the Art of Motorcycle Maintenance. I read it when I was quite young and it blew my mind.\n\nIt sparked my interest in philosophy at a time when I really thought I wanted nothing to do with it. The book has its critics (some find the author smug or feel he muddles things), but I think it's one of the best ways to introduce people to philosophical thinking without overwhelming them with names and theories. Once you know more philosophy,",
        "time": "2024-11-17 07:18:48 UTC",
        "score": 2,
        "link_id": "t3_1gt7mwa",
        "parent_id": "t3_1gt7mwa"
    },
    {
        "comment_id": "lpekzav",
        "subreddit": "books",
        "body": "The Catcher in the Rye. Almost everybody in my class hated it. I liked it.",
        "time": "2024-09-28 22:08:28 UTC",
        "score": 14,
        "link_id": "t3_1frosi6",
        "parent_id": "t3_1frosi6"
    },
    {
        "comment_id": "lpdsq5n",
        "subreddit": "books",
        "body": "\"For the first time, I see you are a man like me. I thought of your hand-grenades, of your bayonet, of your rifle; now I see your wife and your face and our fellowship. Forgive me, comrade. We always see it too late. Why do they never tell us that you are poor devils like us, that your mothers are just as anxious as ours, and that we have the same fear of death, and the same dying and the same agony--Forgive me, comrade; how could you be my enemy?”",
        "time": "2024-09-28 19:18:57 UTC",
        "score": 10,
        "link_id": "t3_1freksj",
        "parent_id": "t3_1freksj"
    },
    {
        "comment_id": "lc0e0su",
        "subreddit": "books",
        "body": "A series is a bigger investment than a book, needless to say, so I would not continue if I didn't enjoy the first one.\n\nIn rare cases, there are other factors too that might encourage you to stick with it. Like if you like the author and have enjoyed previous books by them, and if you also know them to take a while to set things up and get the story going, then naturally you might want to  try the second book before giving up on the series.",
        "time": "2024-07-07 07:26:29 UTC",
        "score": 1,
        "link_id": "t3_1dwu25l",
        "parent_id": "t3_1dwu25l"
    },
    {
        "comment_id": "lc0dgfd",
        "subreddit": "books",
        "body": "Personally not Twitter because some of the stuff\n\nthat gets a lot of love\n\nthere\n\nis not exactly poetry but things\n\nformatted\n\nas if they were\n\npoetry.\n\nSeriously though, I find new poetry by visiting the website for Kenyon Review, American Poetry Review, and other lit magazines. Some of the poems posted there are free to read but unfortunately not many.",
        "time": "2024-07-07 07:19:55 UTC",
        "score": 17,
        "link_id": "t3_1dx5gal",
        "parent_id": "t3_1dx5gal"
    }
]