[
    {
        "comment_id": "ltmksll",
        "subreddit": "books",
        "body": "No, *petulant* is not esoteric, of course. Neither am I suggesting one need make things overly simple. I certainly prefer Nabokov or Joyce's flourishes over Hemingway's directness, but that's taste. I am noting, though, that each allowed their art to speak for itself. Style guides suggest one avoid excess use of adjectives in no small part because it's impossible to make something stand out if everything is written in the extreme. Some dramas allow the reader to gloss over apocalyptic tragedies; some cause the reader to cry over the death of a mouse. Here we encounter a \"confidential voice\" that was \"interrupted at frequent intervals\" by \"loud, petulant\" voices. I can infer frequency and petulancy. I want a story, not adjective salad. I am not an idiot lecteur, but I shouldn't be the one trying to construct the scene. \"Unenterprising and deplorably uninteresting\"? *Unenterprising* alone is excessive, but \"deplorably uninteresting\" is unenterprisingly, deplorably, uninterestingly redundant given the definition of *unenterprising*. Describe the character and allow the reader the respect of their own intuition. \"[W]ith immense conviction\"? The character's words stand on their own; they don't need to be embellished by the author's self-conscious desire to convince the reader of their intelligence. \"[M]urmured repetition\"? Come. It doesn't even make sense in its own context. It all screams \"Look at me! I even understand college-level vocabulary!\" Authors—or any artist—should never prioritize their craft as a dim-witted status signal, nor should any innocent reader be taken for such a fool as to fall for it.",
        "time": "2024-10-25 03:17:29 UTC",
        "score": 1,
        "link_id": "t3_1ga8sdx",
        "parent_id": "t1_ltk9w5o"
    },
    {
        "comment_id": "lthn15b",
        "subreddit": "books",
        "body": "While I grasp the intent, the writing is, to me, unbearable. I understand that Saki was born in 1870, and that Victorian literature was often a bit overwrought, but this is uniquely stuffed with so many unnecessary adjectives and adverbs and uncreative motifs that it feels like the author is screaming at me through the text \"hey! I'm really smart! I even know the definition of *petulant*!\" Maybe it's some satire that I don't quite follow.",
        "time": "2024-10-24 10:21:36 UTC",
        "score": -1,
        "link_id": "t3_1ga8sdx",
        "parent_id": "t1_ltcexr3"
    },
    {
        "comment_id": "jcyz78t",
        "subreddit": "books",
        "body": "If they had massacred the movies, it would have had a huge impact on the franchise as a whole.",
        "time": "2023-03-20 17:07:54 UTC",
        "score": 4,
        "link_id": "t3_11w8kxj",
        "parent_id": "t1_jcyilm2"
    },
    {
        "comment_id": "jcwkc3e",
        "subreddit": "books",
        "body": "That happens to be one of my all-time favorite openers, too, and you're in for a treat when you read the rest. The hits keep coming throughout the book.",
        "time": "2023-03-20 02:39:52 UTC",
        "score": 5,
        "link_id": "t3_11vy91y",
        "parent_id": "t1_jcw18hu"
    },
    {
        "comment_id": "itu0k40",
        "subreddit": "books",
        "body": "What? He's got the surest claim to the throne. He doesn't have to take it, and he could cede it, but of course it makes sense.",
        "time": "2022-10-26 08:56:57 UTC",
        "score": 5,
        "link_id": "t3_yd3vx3",
        "parent_id": "t1_itriuql"
    },
    {
        "comment_id": "itu0bpm",
        "subreddit": "books",
        "body": "Be nicer if Jon ended up on the throne, fulfilling his legacy, and then ceded his power to Bran, cementing his nature as a true custodian of the realm, looking out for its well-being, justifying his betrayal of Dany (and he should not have been such a muppet in front of her).\n\nBut then again, in-show even *that* didn't make sense, because Bran didn't deserve jack shit. He didn't alter the story line at all, didn't use his immense knowledge to clinch any victory, just sat around creepily telling people what he knows about them.",
        "time": "2022-10-26 08:53:25 UTC",
        "score": 4,
        "link_id": "t3_yd3vx3",
        "parent_id": "t1_itr90fl"
    }
]