[
    {
        "comment_id": "lvqusqz",
        "subreddit": "books",
        "body": "no, but it helps to have read the other Watch books in the series, starting with Gaurds! Gaurds!",
        "time": "2024-11-06 17:25:10 UTC",
        "score": 25,
        "link_id": "t3_1gl0f00",
        "parent_id": "t1_lvqu0kw"
    },
    {
        "comment_id": "ljslowl",
        "subreddit": "books",
        "body": "it's wild to me that teaching Shakespeare without watching it is the norm. These are plays! you don't study movies by reading the screenplay.",
        "time": "2024-08-25 01:34:05 UTC",
        "score": 10,
        "link_id": "t3_1f0h1n2",
        "parent_id": "t1_ljsledp"
    },
    {
        "comment_id": "ljrvm7r",
        "subreddit": "books",
        "body": "watch an adaptation if you're truly lost. sometimes it helps to actually see what is going on and get a feel for the way people are supposed to be speaking. the book is very old, and if you aren't used to that type of writing style just jumping in unprepared can be confusing.",
        "time": "2024-08-24 22:39:15 UTC",
        "score": 60,
        "link_id": "t3_1f0h1n2",
        "parent_id": "t3_1f0h1n2"
    },
    {
        "comment_id": "leguceg",
        "subreddit": "books",
        "body": "I think this is implying that he bought the books himself to make it look like it sold more. sometimes politicians do do that",
        "time": "2024-07-23 00:13:33 UTC",
        "score": 4,
        "link_id": "t3_1e9tfqg",
        "parent_id": "t1_legu40m"
    },
    {
        "comment_id": "leavfju",
        "subreddit": "books",
        "body": "I'm not usually a fan of it, but then you have stuff like the Young Wizards books, where the author made some pretty big edits to Wizard Alone because she learned more about Autism and rewrote it to be kinder to autistic folks. It mostly just depends on if it's done well.",
        "time": "2024-07-21 23:25:30 UTC",
        "score": 17,
        "link_id": "t3_1e8y3kf",
        "parent_id": "t3_1e8y3kf"
    },
    {
        "comment_id": "l01oo46",
        "subreddit": "books",
        "body": "they supported separation of Church and State",
        "time": "2024-04-17 21:02:04 UTC",
        "score": 1,
        "link_id": "t3_1c5zxkc",
        "parent_id": "t1_kzy71w5"
    },
    {
        "comment_id": "kriycb9",
        "subreddit": "books",
        "body": "not only that, the girly girl who has sewing magic and believes in the power of friendship, loves fashion, and is afraid of the dark is a badass. Briar calls her the bravest person he knows, and people who look down on her for being a stitch witch are proven to be very wrong. She's also good at navigating social situations. Being feminine doesn't make her weak and useless, she just likes girly things",
        "time": "2024-02-21 23:15:48 UTC",
        "score": 11,
        "link_id": "t3_1aweboi",
        "parent_id": "t1_krh4k6u"
    },
    {
        "comment_id": "jakorer",
        "subreddit": "books",
        "body": "How to Train Your Dragon is an in name only adaptation. and I prefer it to the series it was based on",
        "time": "2023-03-02 02:48:06 UTC",
        "score": 1,
        "link_id": "t3_11f3vot",
        "parent_id": "t3_11f3vot"
    },
    {
        "comment_id": "j9yoe6l",
        "subreddit": "books",
        "body": "The New Mellinium versions of the Young Wizards books update the setting and remove some harmful language (like the word g*psie). Most notably, A Wizard Alone is changed rather dramatically to be more sympathetic and aware of autism and autistic characters. These versions are then made Canon since they're the versions of characters and events that show up in newer books added to the series.",
        "time": "2023-02-25 15:19:06 UTC",
        "score": 3,
        "link_id": "t3_11b9up4",
        "parent_id": "t3_11b9up4"
    },
    {
        "comment_id": "j4jf7gk",
        "subreddit": "books",
        "body": "can't you just like, print out the covers and glue them onto some cardboard? do they need to be real books? do you need to be Gatsby or something? why do this??",
        "time": "2023-01-16 03:22:59 UTC",
        "score": 2,
        "link_id": "t3_10cr55l",
        "parent_id": "t3_10cr55l"
    },
    {
        "comment_id": "ikuexcx",
        "subreddit": "books",
        "body": "People keep forgetting Austen's work is largely satirical. The language might be antiquated by today's standards, but it's still not as uptight as whatever your high-school English class tells you. I would recommend Northanger Abbey next. Austen took the criticisms of novels poisoning the minds of young girls (who obviously can't tell the difference between fiction and reality) by writing a story of a girl who is absolutely convinced she's in a Gothic romance novel",
        "time": "2022-08-18 20:44:11 UTC",
        "score": 362,
        "link_id": "t3_wroe53",
        "parent_id": "t3_wroe53"
    },
    {
        "comment_id": "ik0vs3x",
        "subreddit": "books",
        "body": "There's a lot of Dicworld that will never leave me, but special mention to \"words in the heart cannot be taken\" and the Sam Vimes Boots Theory of Socioeconomic Unfairness",
        "time": "2022-08-12 17:56:35 UTC",
        "score": 1,
        "link_id": "t3_wmipq9",
        "parent_id": "t3_wmipq9"
    },
    {
        "comment_id": "ijry5xa",
        "subreddit": "books",
        "body": "The Prydain Chronicles got me into reading as a kid, but I was also a big fan of The Enchanted Forest Chronicles, the Young Wizard/Feline Wizard books, Animorphs, Howl's Moving Castle/Castle in the Air, and just about everything written by Tamora Pierce. Oh, and Dragonlance. Lots of Dragonlance (it probably wasn't appropriate for my age at the time, but that never stopped me.) I tried to get into Harry Potter since I was the right age for them when they were coming out, but I could never get myself to read past the first half of Goblet of Fire.\n\nIn other words, lots of fantasy books from the 80s.",
        "time": "2022-08-10 21:43:46 UTC",
        "score": 1,
        "link_id": "t3_wkmq5q",
        "parent_id": "t3_wkmq5q"
    },
    {
        "comment_id": "ii0pvrn",
        "subreddit": "books",
        "body": "When people tell me men can't write women I tell them they can pry Tiffany Aching from my cold, dead hands. Pratchett in general wrote amazing women.",
        "time": "2022-07-28 17:59:44 UTC",
        "score": 7,
        "link_id": "t3_wabfms",
        "parent_id": "t3_wabfms"
    },
    {
        "comment_id": "huh3fkz",
        "subreddit": "books",
        "body": "I think the problem with more contemporary books in this case is that it erases the fact that this type of behavior actually existed. There's a lot of people out there who like to pretend that it never happened, and it IS important to see how far we've come (while explaining that we still have far to go). Earasing the bad parts history doesn't actually help. \n\nMind you, we should also have students read more contemporary about racism. There's no rule saying students have to be limited to one book on the subject. The point of English class is to teach crititcal thinking, and comparing how things change (and stay the same) would be a perfectly acceptable unit.",
        "time": "2022-01-27 18:49:45 UTC",
        "score": 22,
        "link_id": "t3_sdwg43",
        "parent_id": "t1_hufpbry"
    },
    {
        "comment_id": "htgd8ri",
        "subreddit": "books",
        "body": "Fiction IS important, not only does it teach crititcal thought, but people have been telling stories since they were people. It's how we pass on values and culture. A satirical work might not have actually happened, but it's commenting on the real world in a way that more people understand and exaggerating things to prove a point. Also, a fair ammount of technology exists because someone saw something in a piece of media and though \"but what if that were real?\"",
        "time": "2022-01-20 13:16:42 UTC",
        "score": 1,
        "link_id": "t3_s81qex",
        "parent_id": "t3_s81qex"
    },
    {
        "comment_id": "hqro1rm",
        "subreddit": "books",
        "body": "or a Witch book. Especially the ones with Tiffany.",
        "time": "2022-01-01 03:56:34 UTC",
        "score": 5,
        "link_id": "t3_rsyjml",
        "parent_id": "t1_hqq1rqk"
    },
    {
        "comment_id": "hqrnuis",
        "subreddit": "books",
        "body": "I still cannot believe people thought Pratchett was transphobic. The dwarfs are right there.",
        "time": "2022-01-01 03:54:47 UTC",
        "score": 66,
        "link_id": "t3_rsyjml",
        "parent_id": "t1_hqqmlzc"
    },
    {
        "comment_id": "hfprl6l",
        "subreddit": "books",
        "body": "Yes, Nico is the gay one. And the collaborator on this book is a gay author as well.",
        "time": "2021-10-07 11:14:19 UTC",
        "score": 2,
        "link_id": "t3_q2xtif",
        "parent_id": "t1_hfoul52"
    },
    {
        "comment_id": "hcmardz",
        "subreddit": "books",
        "body": "there's more to a story than plot. For me anyway. \n\nI like going back and catching all the little clues and foreshadowing I missed the first time, I like revisiting the characters and thinking about their motives and character arcs and how that plays into each part of the story. And honestly I spent a long time imagining the voices and appearances and every little detail about this world, and I'm not always ready to just drop it completely.",
        "time": "2021-09-12 22:16:24 UTC",
        "score": 1,
        "link_id": "t3_pmsnlp",
        "parent_id": "t3_pmsnlp"
    },
    {
        "comment_id": "hc626j7",
        "subreddit": "books",
        "body": "People like to use Barns and Nobles as free childcare. they let their kids run around and then yell at the employees when we don't babysit them. I suppose having to take care of a kid when you think you don't have to is stressful, but that's not really on the store.",
        "time": "2021-09-09 11:07:59 UTC",
        "score": 17,
        "link_id": "t3_pkkzb6",
        "parent_id": "t1_hc5dhzh"
    },
    {
        "comment_id": "hbr99de",
        "subreddit": "books",
        "body": "Dispite being the perfect age for it when they were coming out, I never got into Harry Potter. They aren't bad or anything, I just found them uninteresting and was more into other fantasy worlds.",
        "time": "2021-09-06 01:32:50 UTC",
        "score": 4,
        "link_id": "t3_pigzrp",
        "parent_id": "t3_pigzrp"
    },
    {
        "comment_id": "guv4h5k",
        "subreddit": "books",
        "body": "If you read 'Wuthering Heights' I would recommend following it up with 'Northagner Abbey'",
        "time": "2021-04-17 15:41:31 UTC",
        "score": 1,
        "link_id": "t3_msdo7i",
        "parent_id": "t3_msdo7i"
    },
    {
        "comment_id": "gqr8k8q",
        "subreddit": "books",
        "body": "\"Strength enough to build a home, time enough to hold a child, love enough to break a heart\"\n\nGNU Sir Terry Pratchett",
        "time": "2021-03-13 01:40:16 UTC",
        "score": 13,
        "link_id": "t3_m3qvoz",
        "parent_id": "t3_m3qvoz"
    },
    {
        "comment_id": "gqn81cp",
        "subreddit": "books",
        "body": "Silent protagonists aren't the norm anymore, and games take a lot of cues for camera work from movies. Hell, something like The Last of Us (or anything from Naughty Dog on modern consoles really) practically is a movie already. Games are no more permeating into movies than movies were already permeating into TV or books.",
        "time": "2021-03-12 02:03:06 UTC",
        "score": 25,
        "link_id": "t3_m2zg1w",
        "parent_id": "t1_gqn1hpa"
    },
    {
        "comment_id": "gqn6t2f",
        "subreddit": "books",
        "body": "that depends entirely on the type of game. RPGs are going to be story heavy, while something like Minecraft is focused on what you can DO in the world and the story is more of an option. and then there's stuff like Undertale where the gameplay is important to the story. There are many different types of games and those will appeal to different people, Games are no different than any other medium in that way",
        "time": "2021-03-12 01:52:07 UTC",
        "score": 3,
        "link_id": "t3_m2zg1w",
        "parent_id": "t1_gqn1095"
    }
]