[
    {
        "comment_id": "ly7v4fw",
        "subreddit": "books",
        "body": "When I had to transit, I would take my books with me on the bus and read during the ride. I have a nice set of ASOIAF books with very thin pages and unobtrusive covers, and no less than four separate times did a kindly old lady sit next to me on the bus and ask if I was reading the Bible. Every time I said I wasn't and showed them the cover, they spent the rest of the bus ride looking disappointed and uncomfortable, with the occasional awkward glance towards me. Different lady each time.",
        "time": "2024-11-21 07:18:22 UTC",
        "score": 10,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t3_1gw3qpe"
    },
    {
        "comment_id": "llussyp",
        "subreddit": "books",
        "body": "You would know better than any how cool it is! I'd love to be able to watch a stage production of some of Euripides plays, one with the Chorus and everything.",
        "time": "2024-09-06 20:51:55 UTC",
        "score": 2,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_lltlx4d"
    },
    {
        "comment_id": "llus7ne",
        "subreddit": "books",
        "body": "It's mostly that it gets shoved in my face so much. Like, if it helps people get into classical studies, then great, more power to them. It just annoys me when people use it as a reference for my whole field of study, or assume my interest is just due to these children's books.",
        "time": "2024-09-06 20:48:47 UTC",
        "score": 5,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llshleq"
    },
    {
        "comment_id": "llurocm",
        "subreddit": "books",
        "body": "I've not read The Song of Achilles, but I enjoyed Circe well enough. It's an interesting angle on the myths.",
        "time": "2024-09-06 20:45:55 UTC",
        "score": 1,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llrljve"
    },
    {
        "comment_id": "lluqlkc",
        "subreddit": "books",
        "body": "I've never read it, but I've got nothing against it. It's not brought up to me like Percy Jackson is",
        "time": "2024-09-06 20:40:07 UTC",
        "score": 1,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llumber"
    },
    {
        "comment_id": "llrfb79",
        "subreddit": "books",
        "body": "YES! Finally, someone gets it! I'm not insane! \n\nWe didn't need Percy Jackson to get us interested in mythology, that happened because mythology is interesting all on its own!",
        "time": "2024-09-06 07:31:31 UTC",
        "score": 23,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llrcc6q"
    },
    {
        "comment_id": "llr7x82",
        "subreddit": "books",
        "body": "Percy Jackson. \n\nI love history and mythology. I grew up loving it. I studied it in university, it's my greatest passion. And when I was young, Percy Jackson was recommended to me. I read the first two when I was probably about 9. I thought they were boring and stale. Caricatures of the myths that I was familiar with. But I didn't hate it, I just thought it was dull. \n\nBut then every time I would talk about my interest in mythology and history, someone would mention Percy Jackson. Every. Single. Time. How much I **must love** Percy Jackson. How I *have* to read Percy Jackson. How they loved Percy Jackson too! \n\nHaving Percy Jackson jammed in my face every time I talked about the thing I was most passionate about was taxing. It went from a series I thought was boring, to a book from hell that existed to mock me. It hasn't stopped either. It follows me around. Every new person I meet, they find out I like mythology and then ***boom*** Percy Jackson. It got bad again when the new show was released. \n\nPeople need new mythology material. Just *once* I want someone to bring up \"Iphigenia at Aulis\" instead. Or \"The Aeneid\", or even \"Mythos\" by Stephen Fry, please, anything but Percy Jackson, I'm begging you. Καθικετεύομαι!",
        "time": "2024-09-06 06:11:46 UTC",
        "score": 163,
        "link_id": "t3_1fa6cze",
        "parent_id": "t3_1fa6cze"
    }
]