[
    {
        "comment_id": "lvu9ijm",
        "subreddit": "books",
        "body": "So you could say it's a...Chinese whisper?",
        "time": "2024-11-07 03:37:35 UTC",
        "score": 10,
        "link_id": "t3_1gl0f00",
        "parent_id": "t1_lvsrko0"
    },
    {
        "comment_id": "kr48kim",
        "subreddit": "books",
        "body": "My favourites are the ones that have positive review soundbytes on the front, back, inside both covers, and for several pages inside — but no blurb. I really hope that sort of thing is the marketing team's decision and not the author's, because it's unbelievably pretentious.",
        "time": "2024-02-19 09:47:55 UTC",
        "score": 14,
        "link_id": "t3_1aufu4n",
        "parent_id": "t3_1aufu4n"
    },
    {
        "comment_id": "kq8lwli",
        "subreddit": "books",
        "body": "*In Memoriam*. The main characters do get a happy escape in the end, but almost everyone they know dies and/or or loses everything, and the MCs themselves are in pieces (figuratively and literally). It actually hits harder with each successive read. Unbelievably good book.",
        "time": "2024-02-13 14:51:33 UTC",
        "score": 1,
        "link_id": "t3_1ap6o85",
        "parent_id": "t3_1ap6o85"
    },
    {
        "comment_id": "kp2kaft",
        "subreddit": "books",
        "body": "One of my all-time favourite books.\n\n\n>*For the greatest fear of death is that it will pass us by. And leave us there alone.*\n\nI had to stop the audiobook, because I zoned out for a hot minute contemplating that one.",
        "time": "2024-02-05 19:53:10 UTC",
        "score": 5,
        "link_id": "t3_1ajn9oy",
        "parent_id": "t1_kp2612c"
    },
    {
        "comment_id": "kjfab9r",
        "subreddit": "books",
        "body": "No Longer Human by Osamu Dazai",
        "time": "2024-01-24 23:39:20 UTC",
        "score": 1,
        "link_id": "t3_19erjr6",
        "parent_id": "t3_19erjr6"
    },
    {
        "comment_id": "kjevq6n",
        "subreddit": "books",
        "body": "Curious, why did you hate The Song of Achilles?",
        "time": "2024-01-24 22:13:40 UTC",
        "score": 4,
        "link_id": "t3_19erzut",
        "parent_id": "t1_kjepgm7"
    },
    {
        "comment_id": "kj1ahtm",
        "subreddit": "books",
        "body": "Greek mythology retellings.",
        "time": "2024-01-22 13:13:04 UTC",
        "score": 9,
        "link_id": "t3_19cscqf",
        "parent_id": "t3_19cscqf"
    },
    {
        "comment_id": "ki734l8",
        "subreddit": "books",
        "body": "Hanya Yanagihara. Persevered through 20 pages of _To Paradise_ and noped out. Why is every sentence a million words long? We're not in Victorian times anymore. It's not a flex. It doesn't make the book smarter or better, just longer.\n\nOn doing further research, it turns out I wasn't missing much by resolving to avoid her (a straight woman who can't stop torturing her gay male MCs, just what we need...🙄), but yeah. Immediate \"this zoom call could've been an email\" vibes. No thanks. ~~In all honesty, the eight pages of glowing review soundbites with no actual blurb should've been the first red flag, but nvm~~",
        "time": "2024-01-16 22:55:40 UTC",
        "score": 1,
        "link_id": "t3_198eqmo",
        "parent_id": "t3_198eqmo"
    },
    {
        "comment_id": "kgolhfl",
        "subreddit": "books",
        "body": "I remember really liking the HBO adaptation of Olive Kitteridge (even though it was so long ago that I can't remember anything about it lol). Thanks for reminding me it was a book too. ~~and also fuck you for adding to my TBR pile grr~~",
        "time": "2024-01-07 03:38:09 UTC",
        "score": 1,
        "link_id": "t3_190clah",
        "parent_id": "t1_kgnepei"
    },
    {
        "comment_id": "kax54q6",
        "subreddit": "books",
        "body": "*Notre Dame de Paris* by Victor Hugo. The chapter 'This Will Kill That' was absolutely fascinating as a dissertation, but godDAYUM that whole book was crying out for an editor.",
        "time": "2023-11-27 01:59:53 UTC",
        "score": 1,
        "link_id": "t3_184jjxu",
        "parent_id": "t3_184jjxu"
    },
    {
        "comment_id": "k8suud9",
        "subreddit": "books",
        "body": "● *It is just meat, hamu. The beautiful part of you is still here.*   — **Sheehan Karunatilaka**, 'The Seven Moons of Maali Almeida'\n\n\n\n● *In the end, that was the problem with romance. It was so easy to romanticise romance because it was everywhere. It was in music and on TV and in filtered Instagram photos. It was in the air, crisp and alive with fresh possibility. It was in falling leaves, crumbling wooden doorways, scuffed cobblestones and fields of dandelions. It was in the touch of hands, scrawled letters, crumpled sheets and the golden hour. A soft yawn, early morning laugher, shoes lined up together by the door. Eyes across a dance floor. I could see it all, all the time, all around, but when I got closer, I found nothing was there. A mirage.*   — **Alice Oseman**, 'Loveless'\n\n\n\n● *For the greatest fear of death is always that it will pass us by. And leave us there alone.*   — **Fredrik Backman**, 'A Man Called Ove'\n\n\n\n● *It was the Hell you’d feared in childhood, come to devour the children. It was treading over the corpses of your friends so that you might be killed yourself. It was the congealed evil of a century.*   — **Alice Winn**, 'In Memoriam'",
        "time": "2023-11-11 16:28:13 UTC",
        "score": 2,
        "link_id": "t3_17sqkx2",
        "parent_id": "t3_17sqkx2"
    },
    {
        "comment_id": "k8e2avj",
        "subreddit": "books",
        "body": "Seeing the words **A Novel** stamped across it. If I rolled my eyes any harder, I'd sever an optic nerve. It's *so* freaking pretentious, but books do it *all the time*. Yes, I can see that this is, in fact, a novel. It's not the first of its kind, I don't need it to tell me what it is, only what it's about. \n\n\nImagine if every single movie poster or game cover had **A Film**, or **A Video Game** scrawled across it. How stupid would that be? It just comes across as pesudointellectual fart-huffing, and I don't understand why it's such a thing for books — sorry, ✨️nOvELs✨️",
        "time": "2023-11-08 18:30:29 UTC",
        "score": 25,
        "link_id": "t3_17qnguq",
        "parent_id": "t3_17qnguq"
    },
    {
        "comment_id": "k5ioltu",
        "subreddit": "books",
        "body": "Partly, you're just maturing. Sometimes people grow out of interests, sometimes not.\n\nBut I'm sure a lot of it is due to the issues gaming faces nowadays that books just... don't have. A game costs as much as, like, 6 or 7 softbacks nowadays, so it's a much higher risk of disappointment because of the financial inestment vs a £7–10 on a novel. Also, publishers can't shoehorn microtransactions into books, and they don't cut parts out of manuscripts to sell as overpriced DLC either lol. Same with movies and TV — again, cinemas and streaming subs are extortionate compared to a book.\n\nAlso, I think it's the sheer limitlessness of fiction books that keeps things exciting. You really just never know what you could discover in a book. Not to say that games/movies/TV can't surprise us anymore, but you'll never find the truly out-there stuff you can come across in literature.",
        "time": "2023-10-19 08:03:58 UTC",
        "score": 0,
        "link_id": "t3_17bcnwd",
        "parent_id": "t3_17bcnwd"
    },
    {
        "comment_id": "k4tnjwj",
        "subreddit": "books",
        "body": "Thank you. I had to study this for my A Level and I completely zoned the fuck out. Rich American tosser spends 400 pages throwing soirées for other rich American tossers while simping for a rich American tosser. If I cared about that, I would just watch Made In Chelsea. 🤷‍♂️",
        "time": "2023-10-14 09:39:35 UTC",
        "score": 3,
        "link_id": "t3_177btk5",
        "parent_id": "t1_k4sskmb"
    },
    {
        "comment_id": "k4jis0d",
        "subreddit": "books",
        "body": "Yes! Joan Walker is a superb narrator. A Man Called Ove is hands-down the best audio book I've ever listened to.",
        "time": "2023-10-12 10:05:06 UTC",
        "score": 3,
        "link_id": "t3_175j3mw",
        "parent_id": "t1_k4gsi6h"
    }
]