[
    {
        "comment_id": "lym2q4r",
        "subreddit": "books",
        "body": "I love everything I’ve read by her! I’ve read Parable of the Sower (2x), Kindred, and Bloodchild and Other Stories. Do you have a recommendation for which of her works I should try next?",
        "time": "2024-11-23 18:14:10 UTC",
        "score": 3,
        "link_id": "t3_1gxzoor",
        "parent_id": "t1_lylg1uv"
    },
    {
        "comment_id": "lsofxu0",
        "subreddit": "books",
        "body": "I just listened to a book where the narrator pronounced “draught” as “drought” instead of “draft”. It was pretty clear from the context what was meant (e.g. the character took a draught of wine) and it happened twice in the story. I loved the narrator’s voice and the mispronunciations were the one thing that pulled me out of the story.",
        "time": "2024-10-19 12:54:49 UTC",
        "score": 4,
        "link_id": "t3_1g72q8z",
        "parent_id": "t3_1g72q8z"
    },
    {
        "comment_id": "ls5c41y",
        "subreddit": "books",
        "body": "Ah, true. I’ve just been reading the Wayfarers books, so that is more forefront in my mind.",
        "time": "2024-10-16 03:25:23 UTC",
        "score": 1,
        "link_id": "t3_1g4do4x",
        "parent_id": "t1_ls5amq7"
    },
    {
        "comment_id": "ls56eej",
        "subreddit": "books",
        "body": "I love Becky Chambers! I just finished my 5th book of hers. She gives the cozy feels, but created through interpersonal relationships and not through lack of plot. I wouldn’t call anything about her books low stakes (quite the opposite) which seems to go against how some people are defining cozy, but I think her books feel like a big warm hug nonetheless.",
        "time": "2024-10-16 02:44:27 UTC",
        "score": 2,
        "link_id": "t3_1g4do4x",
        "parent_id": "t1_ls3zuj5"
    },
    {
        "comment_id": "l3tz8i6",
        "subreddit": "books",
        "body": "I have to disagree with you. I work in a library, and realistic fiction circulates way more than sci-fi. For authors like Grisham, we literally buy dozens (maybe around 60) copies of his new releases. For sci-fi, we often only get 3 copies of a new title, or 6 if it’s hotly anticipated. If the last of a sci-fi title is withdrawn, we won’t usually replace it due to lack of demand. Sci-fi is my personal favorite and I often find myself doing an inter library loan just to get a title I want because they’re not popular enough for us to keep on our shelves.",
        "time": "2024-05-13 10:44:28 UTC",
        "score": 1,
        "link_id": "t3_1cq4myx",
        "parent_id": "t3_1cq4myx"
    },
    {
        "comment_id": "kvf67of",
        "subreddit": "books",
        "body": "Same! I love the Vorkosigan Saga so much, and I just got into Murderbot last month. They are both phenomenal.",
        "time": "2024-03-18 13:06:52 UTC",
        "score": 2,
        "link_id": "t3_1bgp1jl",
        "parent_id": "t1_kv8yn28"
    },
    {
        "comment_id": "ksgmibt",
        "subreddit": "books",
        "body": "I loved The Martian. Then I read Artemis. I almost never get rid of books, but I got rid of that one. I resolved never to read another Weir book after that. It took soooo many recommendations before I chanced reading Project Hail Mary.",
        "time": "2024-02-28 00:30:03 UTC",
        "score": 1,
        "link_id": "t3_1b1dy3j",
        "parent_id": "t3_1b1dy3j"
    },
    {
        "comment_id": "kpx7uy1",
        "subreddit": "books",
        "body": "I once had that same policy. Now that I’ve scrapped that policy, I find that I read and finish so many more books than I used to because I’m reading the books I want to read. \n\nI still finish some poorly written books just to finish them, and I’ll let myself give up on books that aren’t that bad if it’s a struggle for me to make progress. But I went from reading 2-5 books/year a few years ago to 60 books last year. I’ve also been able to expand the genres that I read, so I definitely this it’s been worth it to end my “no DNF” policy.",
        "time": "2024-02-11 12:53:09 UTC",
        "score": 9,
        "link_id": "t3_1answ7j",
        "parent_id": "t1_kpvnwb8"
    },
    {
        "comment_id": "kpx72ix",
        "subreddit": "books",
        "body": "I almost want to say Seven Eves. Parts one and two were definitely worth reading and were not a waste of time at all. But part three— eugh! I’ll never get that time back. The book should have ended at the end of part two.",
        "time": "2024-02-11 12:45:59 UTC",
        "score": 1,
        "link_id": "t3_1answ7j",
        "parent_id": "t3_1answ7j"
    },
    {
        "comment_id": "kpx6tm8",
        "subreddit": "books",
        "body": "The Overstory by Richard Powers. I didn’t connect to any of the characters. Everyone felt so flat and two dimensional. I kept reading because it had been recommended to me by so many people but it took me months to get through. This book almost ruined my habit of reading on my lunch break because I kept avoiding it.",
        "time": "2024-02-11 12:43:42 UTC",
        "score": 3,
        "link_id": "t3_1answ7j",
        "parent_id": "t3_1answ7j"
    }
]