[
    {
        "comment_id": "ltmcs0b",
        "subreddit": "books",
        "body": "Honestly, it's one of the few books I actually *do* re-read.",
        "time": "2024-10-25 02:26:24 UTC",
        "score": 7,
        "link_id": "t3_1gbirhj",
        "parent_id": "t1_ltm7448"
    },
    {
        "comment_id": "lqto4tb",
        "subreddit": "books",
        "body": "A big theme of the story was that much her life was constructed without her say it. It's addressed a couple of times, though mostly through subtext.",
        "time": "2024-10-07 19:20:40 UTC",
        "score": 2,
        "link_id": "t3_1fyeuvk",
        "parent_id": "t1_lqtgnxo"
    },
    {
        "comment_id": "lqtmk71",
        "subreddit": "books",
        "body": "Honestly, I loved it. \n\nAs a piece of time travel fiction, it's a fantastic achievement in literature. \n\nAs for the relationship issues you're referring to, I do agree it can be uncomfortable at times. Maybe even a little fucked up *on the face of it*.\n\nI reconciled with it like this - wouldn't it be neat to travel back and meet your current spouse at different times in their life before you knew them? Like, I think my wife is one of the coolest people, and it'd be fascinating to spend short moments with who she used to be. And that's pretty much what Henry does in the book, albeit through no real choice of his own. \n\nWith that said, the story and the characters do address it the elephant in the room, at least a bit. I recall it being a concern for Henry a couple of times. Clare loves him directly because of his existence throughout her life, but (iirc) he isn't even aware of this until they're already married, and he goes back there for the first time. This is far from the central plot or conflict in the novel, but it does come up a bit. And a \n\nThe story also has much more to it. A big aspect is how his interfering sort of constructed her whole life without her say in the matter. I dont want to spoil it by saying much more, but i think you won't be disappointed. I say keep going.",
        "time": "2024-10-07 19:12:17 UTC",
        "score": 2,
        "link_id": "t3_1fyeuvk",
        "parent_id": "t3_1fyeuvk"
    },
    {
        "comment_id": "lmyepi9",
        "subreddit": "books",
        "body": "I feel like a lot of people miss the ultimate theme in The Road through all the darkness, which is hope. \n\nThe father and his son teach each other this. \"Carrying the fire\", I think, is something the father comes up with before the story begins as a way to keep the boy from being too scared, and to keep them both going. Really, though, he didn't believe in it himself, but the boy did. The boy teaches him that that fire is real when they meet the old man - there are people who are still good in the world aside from them, and they must have hope. It's for this reason, and out of desperation, that the father has hope his son will be okay. That the family who has been following them are good people, that they too carry the fire.",
        "time": "2024-09-13 17:02:27 UTC",
        "score": 2,
        "link_id": "t3_1ffbycz",
        "parent_id": "t1_lmuxpt0"
    },
    {
        "comment_id": "lbxpxw9",
        "subreddit": "books",
        "body": "🤣",
        "time": "2024-07-06 19:28:29 UTC",
        "score": 17,
        "link_id": "t3_1dwlm0j",
        "parent_id": "t1_lbxisi6"
    },
    {
        "comment_id": "khw8p4v",
        "subreddit": "books",
        "body": "I really enjoyed the Outsider on audio - the formatting of the novel really lends itself well to the format. But idk if I'd have enjoyed it as much had I read it.",
        "time": "2024-01-15 00:31:05 UTC",
        "score": 1,
        "link_id": "t3_196pr8s",
        "parent_id": "t1_khv7eh5"
    },
    {
        "comment_id": "kg57rj3",
        "subreddit": "books",
        "body": "He personally aquired the rights from King himself. It's been his dream project since forever. I have a lot of faith in him. It'll just depend on the studio. He currently has a contract at Amazon, and Amazon has shown interest before having given Glen Mazzara a (cancelled) pilot. And Flanagan dropped a photo a while back on Twitter of his wife reading The Gunslinger.",
        "time": "2024-01-03 16:34:06 UTC",
        "score": 5,
        "link_id": "t3_18xi8sz",
        "parent_id": "t1_kg4hbir"
    }
]