[
    {
        "comment_id": "luuakmc",
        "subreddit": "books",
        "body": "OP, what do you consider to be an average book?",
        "time": "2024-11-01 11:33:08 UTC",
        "score": 7,
        "link_id": "t3_1gh2yz6",
        "parent_id": "t3_1gh2yz6"
    },
    {
        "comment_id": "luhnw9s",
        "subreddit": "books",
        "body": "There is a massive difference here. The government has power to misuse, the proprietor of a little free library has ownership. It is her right to choose what gets to stay in the book box that she paid for and which is on her property. Everything in it belongs to her, and she is merely kind enough to offer to share with the neighborhood. In taking materials out of her book box, she is not banning them. She is not preventing their distribution. She is not stopping anyone from going out and getting a copy and reading them. She is tossing an unwanted gift, which belongs to her, and she has every right to do so. Whatever books end up in her library, they are hers. It is up to her if she wants to keep them, share them, or throw them away.",
        "time": "2024-10-30 08:24:19 UTC",
        "score": 24,
        "link_id": "t3_1gfdbjx",
        "parent_id": "t1_luh1igu"
    },
    {
        "comment_id": "lt5p6ty",
        "subreddit": "books",
        "body": "Prologue - Yes. It's part of the story. Not reading it would be absurd.\n\nAuthor's Note - If it's short (and at the beginning of the book instead of the end, as they often are) and seems to be relevant to my reading experience, I will read it.\n\nIntroduction/Preface/Foreword - No. They often contain spoilers, and are usually written by people other than the author. I don't care what anyone else has to say about the story. I want to experience it with fresh eyes.",
        "time": "2024-10-22 11:50:13 UTC",
        "score": 149,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "ll8s3gf",
        "subreddit": "books",
        "body": "You can also attach it to a computer with a cable and drop the files directly into the book folder on the kindle. This is best when you want to transfer many files at once. \n\nPersonally, I don't like the paperwhite screens, so I have a Kindle Fire tablet. I love it. I had one of the original Kindle Fires from 2011, and just this last year I started having difficulties with it (diminished battery life, difficult to charge, Amazon no longer supports it, etc.) So I bought a Fire 8 tablet (newer ones are too big for my purposes). I think the battery isn't as long lasting as the one from my OG Kindle Fire before it started declining, but I can still read for several days before I need to charge it. \n\nAnd the rest of OP's criteria is also met. I paid a little extra to have no lock screen ads and extra space, and there is also a micro SD card slot for added storage.\n\nWith my old Kindle, one problem I ran into is that books I transferred via email lost their cover art. (I avoided this by doing cable transfers instead.) I haven't tested it with my new Kindle yet.",
        "time": "2024-09-03 02:09:46 UTC",
        "score": 1,
        "link_id": "t3_1f7npbx",
        "parent_id": "t1_ll8n90a"
    }
]