[
    {
        "comment_id": "lpv8zjr",
        "subreddit": "books",
        "body": "When I graduated from high school in 1996, it was normal for my teachers to say “read Chapters 9-12 of (whatever novel) tonight. Quiz tomorrow!”  \n\nBy the time I started teaching high school English in 2000, I was not allowed to assign any independent reading.  \n\n 1/4 of the school year was devoted to the study of a novel, but we were required to read said novel aloud in class.  If we didn’t read it aloud in class, we weren’t allowed to test students on it.  \n\n Specifically what I mean here is that we could skip parts if we wanted to, but if there was a quiz or writing assignment or any other type of assessment based on anything from the 9th chapter of To Kill a Mockingbird, then the 9th chapter of TKAM had to be read out loud in class. \n\nEdit to add:  this rule applied to all texts, not just novels. Weren’t allowed to assign a short story or poem as independent reading and then do even a low-stakes basic comprehension quiz. \n\nIf any text was used in an assessment, we were required to read it out loud in class. Period. \n\nExcept for the state test, which the students had to pass to graduate. They were expected to read that independently. lol. ",
        "time": "2024-10-01 20:16:59 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt4fnc"
    },
    {
        "comment_id": "lhgvnv6",
        "subreddit": "books",
        "body": "Dude. Sometimes when I watch a movie that is based on a book I have read, I legitimately feel like I haven’t read the book at all. \n\nI don’t mean that in the book snob sense either. There are plenty of books where I feel like the movie version is better. \n\nBut yeah there are plenty of books where if I read them  again, it would be like reading them for the first time. \n\nThis is only true for fiction, though. ",
        "time": "2024-08-10 17:56:02 UTC",
        "score": 1,
        "link_id": "t3_1eou4cu",
        "parent_id": "t3_1eou4cu"
    },
    {
        "comment_id": "l6t0mgt",
        "subreddit": "books",
        "body": "My next door neighbor installed one that is partly on my property. \n\nIt is constantly full of religious nutcase books. \n\nI am often tempted to cull them. \n\nThanks for reading my confession. ",
        "time": "2024-06-02 19:13:28 UTC",
        "score": 20,
        "link_id": "t3_1d6c6ap",
        "parent_id": "t3_1d6c6ap"
    }
]