[
    {
        "comment_id": "lwwmaoq",
        "subreddit": "books",
        "body": ">But, he seems to be the first brick in the construction of a crematorium— an element of a growing structure that could fuel something far more dangerous.\n\nOh now that's a BAR",
        "time": "2024-11-13 12:17:07 UTC",
        "score": 1,
        "link_id": "t3_1gq5czz",
        "parent_id": "t1_lwvk9u1"
    },
    {
        "comment_id": "lvish49",
        "subreddit": "books",
        "body": "Fourth Wing",
        "time": "2024-11-05 13:53:28 UTC",
        "score": 19,
        "link_id": "t3_1gk0qo1",
        "parent_id": "t1_lvhkc79"
    },
    {
        "comment_id": "luwgatv",
        "subreddit": "books",
        "body": "I think they mean, \"No, it was common in mainstream religious sects, too, and not just isolated to religious cults.\"",
        "time": "2024-11-01 18:53:45 UTC",
        "score": 22,
        "link_id": "t3_1ggztbr",
        "parent_id": "t1_luwcaw2"
    },
    {
        "comment_id": "lukgh6n",
        "subreddit": "books",
        "body": "I had a feeling this post was botted or generated by AI. Something about the tone and way it's worded just feels...off.",
        "time": "2024-10-30 18:52:41 UTC",
        "score": 4,
        "link_id": "t3_1gfpzo4",
        "parent_id": "t1_luk0gyw"
    },
    {
        "comment_id": "lti02s0",
        "subreddit": "books",
        "body": "Maybe this theory is entirely out of my ass, but I feel like the people who complain so loudly about trigger warnings in books never read any kind of fanfiction where this practice is already common place. Authors tagging their work to make readers aware of any sensitive/triggering content it contains is far from a new concept.",
        "time": "2024-10-24 12:09:46 UTC",
        "score": -3,
        "link_id": "t3_1gb05s1",
        "parent_id": "t3_1gb05s1"
    },
    {
        "comment_id": "lrv196f",
        "subreddit": "books",
        "body": "Yeah that tracks tbh. With costs of living skyrocketing through the roof, I wouldn't be opposed to the fantasy of having a young, hot, billionaire BF paying for all my needs and still having money left over to spend on fun stuff, either. 🤷🏾‍♂️",
        "time": "2024-10-14 11:44:33 UTC",
        "score": 6,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lruho9s"
    },
    {
        "comment_id": "lrv0l65",
        "subreddit": "books",
        "body": "Not naming names...Fourth Wing 👀 but seriously, WTF is the point in labeling Violet and Xaden's relationship as \"enemies to lovers\" when >!Xaden was actually in love with Violet since day one the whole time and the furthest they got as \"enemies\" was Violet being moderately suspicious of his motives (even though most of their interactions involved Xaden being helpful towards her)? !< 🤡",
        "time": "2024-10-14 11:38:44 UTC",
        "score": 110,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtm9lv"
    },
    {
        "comment_id": "lnfqwxg",
        "subreddit": "books",
        "body": "💯💯💯",
        "time": "2024-09-16 17:14:17 UTC",
        "score": 1,
        "link_id": "t3_1fi82uj",
        "parent_id": "t1_lnffezk"
    },
    {
        "comment_id": "llulw1z",
        "subreddit": "books",
        "body": "Some people take issue with the way she portrays relationship dynamics in her books, mainly that a lot of them feature aspects of abuse and toxicity that either go unacknowledged or are even actively romanticized. Her writing itself is also criticized as just being generally juvenile, cringy, and not well done, especially for an author that's supposed to be a bestseller.",
        "time": "2024-09-06 20:14:42 UTC",
        "score": 10,
        "link_id": "t3_1faoale",
        "parent_id": "t3_1faoale"
    },
    {
        "comment_id": "lj8oghp",
        "subreddit": "books",
        "body": "The dragons are as underdeveloped and barebones as every other aspect of the worldbuilding. The convos the MC had with her dragons were entertaining and everything, but if you're hoping for interesting and engaging dragon lore, I can't say you'll be satisfied.",
        "time": "2024-08-21 17:21:30 UTC",
        "score": 14,
        "link_id": "t3_1expxhi",
        "parent_id": "t1_lj86anz"
    },
    {
        "comment_id": "lj7te50",
        "subreddit": "books",
        "body": "It's not really worth the read I would say, especially if you lose interest so early on",
        "time": "2024-08-21 14:41:13 UTC",
        "score": 20,
        "link_id": "t3_1expxhi",
        "parent_id": "t1_lj7qq63"
    },
    {
        "comment_id": "lj7t9s9",
        "subreddit": "books",
        "body": "The romance is definitely one of the weakest parts of this book given how laughably surface level and barebones it is. I was legit so confused when the MC proclaimed how in \"love\" she was with her LI when there was little to no development in their relationship to warrant such a statement.",
        "time": "2024-08-21 14:40:35 UTC",
        "score": 30,
        "link_id": "t3_1expxhi",
        "parent_id": "t1_lj7pwxh"
    },
    {
        "comment_id": "lj7m6dg",
        "subreddit": "books",
        "body": "I decided to pick up Fourth Wing because I kept seeing people talk about how supposedly amazing or awful it was and wanted to see for myself what all the fuss was about. I can safely say that I lean more towards the reviews saying it was awful. Probably not the *worst* thing I've ever read in my life, but definitely not nearly as great as people on Booktok would have you believe.",
        "time": "2024-08-21 14:01:41 UTC",
        "score": 115,
        "link_id": "t3_1expxhi",
        "parent_id": "t3_1expxhi"
    },
    {
        "comment_id": "li8gnc6",
        "subreddit": "books",
        "body": "Those were what sank him",
        "time": "2024-08-15 13:13:00 UTC",
        "score": 5,
        "link_id": "t3_1esj9ue",
        "parent_id": "t1_li7y9v0"
    },
    {
        "comment_id": "li6hjmz",
        "subreddit": "books",
        "body": "And then the baby dies just mere moments after this godforsaken line 💀",
        "time": "2024-08-15 02:42:40 UTC",
        "score": 172,
        "link_id": "t3_1esj9ue",
        "parent_id": "t1_li6e2pd"
    },
    {
        "comment_id": "lgler5h",
        "subreddit": "books",
        "body": "WithCindy is peak, I loved her roast of this book and especially her breakdown of how wildly inaccurate the portrayal of the trafficking is",
        "time": "2024-08-05 11:56:05 UTC",
        "score": 10,
        "link_id": "t3_1ekbl3r",
        "parent_id": "t1_lgjs1gj"
    },
    {
        "comment_id": "lgldke6",
        "subreddit": "books",
        "body": "The author wants Zade to be a \"morally gray\" character so badly, but absolutely NONE of the shit he does to the FMC is \"morally gray\" in the slightest; it's actually objectively heinous. Like, my brother in fucking Christ and all things holy, you can NOT seriously be out here waxing poetic about the plights of vulnerable women and girls being victims of crimes like r*pe and stalking and how supposedly disgusted you are by the people who commit these crimes when you do *the exact same fucking things to the FMC!!!* ✋🏾😭\n\nThe author clearly wants to have her cake and eat it, too; make Zade do all these horrible, fucked up things to the FMC but then also try to make him \"redeemable\" by having him save all these other women and girls from p*do and human trafficking rings. But that's not a \"morally gray\" character, that's a *hypocritical* one. Honestly, the author should've just committed to making Zade an obsessive stalker who haunts FMC's house because all her attempts to make him seem like a \"good\" guy actually made him MORE hatable than if he was just a stalker alone.",
        "time": "2024-08-05 11:46:43 UTC",
        "score": 12,
        "link_id": "t3_1ekbl3r",
        "parent_id": "t3_1ekbl3r"
    },
    {
        "comment_id": "ldnxgiw",
        "subreddit": "books",
        "body": "Friendship is Magic soundin ahh",
        "time": "2024-07-17 20:10:33 UTC",
        "score": 1,
        "link_id": "t3_1e5co83",
        "parent_id": "t1_ldmlodn"
    },
    {
        "comment_id": "ldlfo88",
        "subreddit": "books",
        "body": "The casual classism...",
        "time": "2024-07-17 11:36:41 UTC",
        "score": 67,
        "link_id": "t3_1e5co83",
        "parent_id": "t1_ldl2dhx"
    },
    {
        "comment_id": "ldlfc8v",
        "subreddit": "books",
        "body": "Sounds like a name you'd give a character in a fantasy book lmao",
        "time": "2024-07-17 11:33:56 UTC",
        "score": 227,
        "link_id": "t3_1e5co83",
        "parent_id": "t1_ldl4rg3"
    },
    {
        "comment_id": "ldley8d",
        "subreddit": "books",
        "body": "What a prick oml 😭",
        "time": "2024-07-17 11:30:40 UTC",
        "score": 15,
        "link_id": "t3_1e5co83",
        "parent_id": "t1_ldkx335"
    },
    {
        "comment_id": "ldfqmcv",
        "subreddit": "books",
        "body": "I'm *still* reading Warriors, and I can confirm, it is indeed kind of a hot mess at times 😭💀 but I just can't let go of my silly little battle cats series 🫶🏾",
        "time": "2024-07-16 11:52:21 UTC",
        "score": 18,
        "link_id": "t3_1e4gr3p",
        "parent_id": "t1_ldexlo0"
    },
    {
        "comment_id": "latjw2b",
        "subreddit": "books",
        "body": "It'd be one hell of a bed time story lmao",
        "time": "2024-06-29 11:57:36 UTC",
        "score": 4,
        "link_id": "t3_1dr00z2",
        "parent_id": "t1_las8sn3"
    },
    {
        "comment_id": "l9dqaac",
        "subreddit": "books",
        "body": "💯",
        "time": "2024-06-19 22:58:13 UTC",
        "score": 6,
        "link_id": "t3_1djtxh6",
        "parent_id": "t1_l9dm9cq"
    },
    {
        "comment_id": "l8q0t64",
        "subreddit": "books",
        "body": "You can def tell that the author made Dain super overbearing and protective of Violet to justify Violet choosing Xaden...even though Xaden doesn't really respect her autonomy either by not involving her in discussions about how to increase her own safety at Basgiath. 😐",
        "time": "2024-06-15 13:31:40 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l8olctc"
    },
    {
        "comment_id": "l86ynk0",
        "subreddit": "books",
        "body": "It desperately needed a few--or several--more rewrites before the final draft was submitted for publishing",
        "time": "2024-06-11 23:27:56 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l86tn4c"
    },
    {
        "comment_id": "l85wahj",
        "subreddit": "books",
        "body": "Mind sharing the title?",
        "time": "2024-06-11 19:39:50 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l85vnsl"
    },
    {
        "comment_id": "l85vy0p",
        "subreddit": "books",
        "body": "My guy, I hardly engaged in any discussion or critique of this book prior to reading it and went in with the benefit of the doubt, wanting to give it a fair chance. I came out the other end disappointed and frustrated with what I personally thought didn't work, and now I want to discuss my takeaways with other people who read the same book. If you thought this was just more \"echo chamber circle jerk hate for Fourth Wing\", you were more than free to just scroll by.",
        "time": "2024-06-11 19:37:57 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l85izw0"
    },
    {
        "comment_id": "l84j25r",
        "subreddit": "books",
        "body": "That's why I just can't really get behind defenses that are along the lines of, \"Oh, but the war college is ruthless and cut throat! It's _supposed_ to be deadly!\" Fine, but that doesn't negate the fact that the way they're weeding out weaker cadets is still stupid as hell and really shouldn't work, and the story hardly has any real critique or displays any real consequences for how Basgiath functions as a whole",
        "time": "2024-06-11 15:07:57 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l845np8"
    },
    {
        "comment_id": "l83vs5l",
        "subreddit": "books",
        "body": "Last time I make this mistake 🥲",
        "time": "2024-06-11 12:40:18 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l83fp51"
    },
    {
        "comment_id": "l83vof8",
        "subreddit": "books",
        "body": "Why tf did I write descend in my OG comment 💀😭 and all of this would've required Yarros to do some creative thinking to explain MC's circumstances rather than relying on pure plot contrivance 🙃",
        "time": "2024-06-11 12:39:31 UTC",
        "score": 6,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l834qa8"
    },
    {
        "comment_id": "l83vach",
        "subreddit": "books",
        "body": "😔",
        "time": "2024-06-11 12:36:34 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l830qaw"
    },
    {
        "comment_id": "l83v86b",
        "subreddit": "books",
        "body": "💯",
        "time": "2024-06-11 12:36:07 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l829ck2"
    },
    {
        "comment_id": "l83v3lh",
        "subreddit": "books",
        "body": "No, it's actually called Basgiath War College, I just nicknamed it the \"Carnage College\" in my post for the frequent deaths lol",
        "time": "2024-06-11 12:35:08 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l828bp3"
    },
    {
        "comment_id": "l81wtx5",
        "subreddit": "books",
        "body": "See, *so* much of the dialogue is anachronistic that I totally glossed over how many times modern phrases like this pop up ✋🏾😭",
        "time": "2024-06-11 01:30:21 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l81vd7y"
    },
    {
        "comment_id": "l81whup",
        "subreddit": "books",
        "body": "I've seen very mixed thoughts from disabled people on the portrayal of Violet's disability, most thoughts leaning negative, but I'm not disabled myself so I won't chime in 🤷🏾‍♂️",
        "time": "2024-06-11 01:27:59 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l81v5t5"
    },
    {
        "comment_id": "l81n3rz",
        "subreddit": "books",
        "body": "Well, she certainly achieved her goal 😭",
        "time": "2024-06-11 00:23:28 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l81mdgv"
    },
    {
        "comment_id": "l817zo9",
        "subreddit": "books",
        "body": ">I stopped a few pages into the sample when the main character was rushing into a high stakes, life defining situation with all the urgency and gravitas of being late for an american high school math class.\n\nLmao 💀",
        "time": "2024-06-10 22:42:16 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l816krh"
    },
    {
        "comment_id": "l814r6w",
        "subreddit": "books",
        "body": "Hey, more power to you that you found something to enjoy about FW 🫡 I guess this is also a good lesson in what to expect from Booktok books going forward so I don't set myself up for disappointment. Also, the records were *very* thorough with their depiction of the sex scenes between Violet and Xaden ✋🏾😭💀",
        "time": "2024-06-10 22:21:22 UTC",
        "score": 6,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l80wjr6"
    },
    {
        "comment_id": "l80sbow",
        "subreddit": "books",
        "body": "I'm hesitant to throw out accusations of AI use on a whim, but I *do* think Fourth Wing is *extremely* derivative. People have pointed out how it takes a lot of inspiration from series like ACOTAR and Red Queen, and it's really apparent when they follow the same story beat-for-beat.\n\nEDIT: I don't think there's even an inherent problem with stories being predictable or formulaic, because they can still be enjoyable, but Fourth Wing just wasn't for me at the end, especially because it doesn't really do anything new or interesting with the tropes it includes.",
        "time": "2024-06-10 21:05:53 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l80juie"
    },
    {
        "comment_id": "l807a5s",
        "subreddit": "books",
        "body": "Like,,, why did you not just execute them all when you had the chance instead?! 🫠",
        "time": "2024-06-10 19:08:20 UTC",
        "score": 5,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l806p6q"
    },
    {
        "comment_id": "l802n0j",
        "subreddit": "books",
        "body": "The killing off of characters felt super cheap, too. Not only was it frequent and thus less impactful each time it happened, but it was happening to background and side characters that we knew next to nothing about, so there's no emotional investment in their deaths. It's so obviously done to make Basgiath look more \"cutthroat\", but it just brings us back to the question of why the lives of the cadets are handled so callously.",
        "time": "2024-06-10 18:42:33 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l801wqp"
    },
    {
        "comment_id": "l801h3m",
        "subreddit": "books",
        "body": "Like, why even bother introducing Dain as a remotely potential love interest when we all know how it's going to play out? The childhood best friend is *never* chosen in these love corner dynamics 😩",
        "time": "2024-06-10 18:36:12 UTC",
        "score": 7,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l8003up"
    },
    {
        "comment_id": "l8018co",
        "subreddit": "books",
        "body": "Ugh, don't even get me *started* on the stupid nickname Xaden gave Violet ✋🏾😭 there was not NEARLY enough development in their relationship to warrant such a corny ass nickname",
        "time": "2024-06-10 18:34:52 UTC",
        "score": 6,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zzuoh"
    },
    {
        "comment_id": "l800yem",
        "subreddit": "books",
        "body": "🫡",
        "time": "2024-06-10 18:33:18 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zxcwa"
    },
    {
        "comment_id": "l800s7y",
        "subreddit": "books",
        "body": "I wish I had realized it sooner so that I didn't wind up wasting *weeks* chipping away at this book 😭💔",
        "time": "2024-06-10 18:32:22 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zwom5"
    },
    {
        "comment_id": "l800k39",
        "subreddit": "books",
        "body": "Read with Rachel pointed out how nonsensical this is, too. If people associated with the rebellion are deemed so \"untrustworthy\", why would are they allowed to ascend to such high positions of power and given fire breathing dragons?? Like, yeah, there's Xaden's whole deal with leadership that if he turns on Navarre, all the other rebellion kids' lives are forfeit, but that's very contingent on HIS individual actions. If literally any of the other kids turned, there wouldn't be this same group punishment, would there? It's all so contrived and really should've been workshopped more before making it to the final draft. :/",
        "time": "2024-06-10 18:31:07 UTC",
        "score": 42,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zw3zy"
    },
    {
        "comment_id": "l7zzu95",
        "subreddit": "books",
        "body": "PLEASE don't waste your money, skimming through the spoiler-tagged reviews on Goodreads will give you all the info you need 🙏🏾😭",
        "time": "2024-06-10 18:27:08 UTC",
        "score": 1,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zvvw3"
    },
    {
        "comment_id": "l7zzapp",
        "subreddit": "books",
        "body": "Oh my god, even though I knew it wouldn't happen, I wanted Violet to end up with Liam SO bad 🙏🏾😭 At least the two of them actually felt like friends and like they had a genuine connection with each other! Compared to Xaden who all I know about is that he's broody, sarcastic, and likes chocolate cake 🗿 This book is painfully heterosexual at times 😭",
        "time": "2024-06-10 18:24:08 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zvqxj"
    },
    {
        "comment_id": "l7zqism",
        "subreddit": "books",
        "body": "Nah, I'll just watch reviews on Youtube to see what I missed lol",
        "time": "2024-06-10 17:36:01 UTC",
        "score": 5,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zpljw"
    },
    {
        "comment_id": "l7zo35a",
        "subreddit": "books",
        "body": "Violet is so down bad for Xaden that it's actually embarrassing. Like, girl, stand \\*up!\\* I know this man is NOT hot enough for you to be drooling over him every other paragraph ✋🏾😭\n\nI can hardly give Violet being just past teenagerhood a fair excuse when we have other teenage protagonists like Katniss Everdeen as reference, and Katniss doesn't show a shred of the same immaturity Violet does. Granted, Katniss and Violet were raised in much different circumstances and Katniss was kinda forced to grow up early, so maybe it's not a totally fair comparison.",
        "time": "2024-06-10 17:22:26 UTC",
        "score": 2,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zgbds"
    },
    {
        "comment_id": "l7zn2r1",
        "subreddit": "books",
        "body": ">I just hated the main character, Violet, who was supposed to be a \"scribe\". Her dialogue, vocabulary, and communication skills didn't align with how her character is presented to us. In my opinion, she fell short in portraying who she was supposed to be. \n\nHer previous training as a scribe was super underutilized, outside of her dumping massive amounts of lore that's explained as her reciting quotes to \"calm herself down\" during stressful situations. And despite her previous training, she just acts kinda dumb at times?? Yet she was somehow also going to be one of the most promising scribes of her generation? Lmao",
        "time": "2024-06-10 17:16:48 UTC",
        "score": 32,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zd3qx"
    },
    {
        "comment_id": "l7zljbq",
        "subreddit": "books",
        "body": "😭 And it's not like the smut was even good, either. I feel like it only got hyped up on Booktok for its \"spiciness\" because they don't consume a ton of smut in the first place, so the smut in this book comparatively looks like the raunchiest, hottest thing to ever be written down.",
        "time": "2024-06-10 17:08:11 UTC",
        "score": 29,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7ziz4v"
    },
    {
        "comment_id": "l7zl3ls",
        "subreddit": "books",
        "body": "This book feels like it blended parts of the The Hunger Games and Divergent together, but it completely missed the social commentary Suzanne Collins was trying to make and just lifted the battle royale and love triangle aspects from that book, and then lifted Divergent's nonsensical worldbuilding habits",
        "time": "2024-06-10 17:05:45 UTC",
        "score": 38,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zglhc"
    },
    {
        "comment_id": "l7zk4ma",
        "subreddit": "books",
        "body": "I plan to, I just wanted to get my thoughts out there before moving on to hopefully far less aggravating books",
        "time": "2024-06-10 17:00:17 UTC",
        "score": 10,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zgjll"
    },
    {
        "comment_id": "l7zgj1j",
        "subreddit": "books",
        "body": "See, but even THIS would be a good idea to expand upon and explore, how the college favoring cocky, hotheaded, or even downright bloodthirsty recruits like Jack and his friends is to their detriment in the long run! But it just goes largely unquestioned or unchecked, and nothing meaningful comes out of it in the story we currently have, and it's such a waste",
        "time": "2024-06-10 16:40:20 UTC",
        "score": 21,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zfemp"
    },
    {
        "comment_id": "l7zdvzp",
        "subreddit": "books",
        "body": "I'm not even on Booktok, I just knew about it from this sub and how often it got criticized and thought, \"It can't be *that* bad!\" No, it really is THAT bad. 😭",
        "time": "2024-06-10 16:25:28 UTC",
        "score": 5,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7zd04w"
    },
    {
        "comment_id": "l7zcjv7",
        "subreddit": "books",
        "body": ">100% agreed. The one thing I will say in it's defense is that I think a lot of these decisions do kinda fall under the \"it's soft worldbuilding\" umbrella, so theoretically rule of cool would apply and it wouldn't really matter, if, the big if, it was sufficiently awesome that it didn't matter that it made no sense. Like how popcorn flicks are often full of plot holes but who cares because there was a big explosion and that was awesome!\n\nI get that, and some people like it just for pure vibes or the aesthetics, which is fine. Different readers look for different things in books. 🤷🏾‍♂️\n\n>That said, I didn't like it enough to give it a pass either. It bothered me as well that they just killed people off left and right even though its a massive waste of resources. Like, even if a cadet wouldn't make a good rider, militaries need other positions too y'know? If nothing else somebody needs to clean the toilets and pick up the charred remains of stupid cadets. \n\nRight?! And there are two other non-active combat squadrants in the same college, so it's not like they don't already have options? Why not retrain failed rider cadets to be healers or scribes instead?\n\n\n>I didn't connect with the human characters, I only moderately liked the dragons, I didn't like people getting killed off for stupid reasons, there wasn't enough fun charming world building stuff that I really like, there was not enough actual romance to go with the sexual tension. \n\nThe dragons were pretty much the only thing I consistently liked, and even then, I specifically liked Tairn and his characterization as a grumpy old man who liked to dunk on Violet from time to time. I really wish we'd gotten more of that instead of whatever pseduo love triangle nonsense we got with Dain and Xaden. 🙄",
        "time": "2024-06-10 16:17:56 UTC",
        "score": 18,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7z5tjz"
    },
    {
        "comment_id": "l7zbcuk",
        "subreddit": "books",
        "body": "Oh, I'm aware. I watched part one of Read with Rachel's Iron Flame review, and Violet sounds downright *insufferable*. Why do books like Fourth Wing have such a bad habit of character assassination in the sequel? ✋🏾😭",
        "time": "2024-06-10 16:11:12 UTC",
        "score": 17,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7z9ujy"
    },
    {
        "comment_id": "l7zawfz",
        "subreddit": "books",
        "body": "TBF, this comment does feel slightly passive-aggressive, but tone aside, at least someone was able to find something enjoyable about this book 🤷🏾‍♂️",
        "time": "2024-06-10 16:08:34 UTC",
        "score": 15,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7z901b"
    },
    {
        "comment_id": "l7z7vj2",
        "subreddit": "books",
        "body": "Just give it up, it's not gonna get any better ✋🏾😭",
        "time": "2024-06-10 15:51:37 UTC",
        "score": 32,
        "link_id": "t3_1dco1a5",
        "parent_id": "t1_l7z6l2n"
    },
    {
        "comment_id": "l7d64du",
        "subreddit": "books",
        "body": "GOOD SHIT 👌🏾",
        "time": "2024-06-06 12:54:09 UTC",
        "score": 1,
        "link_id": "t3_1d9g9z0",
        "parent_id": "t3_1d9g9z0"
    },
    {
        "comment_id": "l7d58ra",
        "subreddit": "books",
        "body": "Closest thing I can think of are visual novels on apps like Romance Club, Choices, Episode, etc., and Youtubers who record themselves playing them will often read out loud, but I doubt the platforms themselves have the kind of genres you're looking for",
        "time": "2024-06-06 12:47:57 UTC",
        "score": 1,
        "link_id": "t3_1d9gwq9",
        "parent_id": "t3_1d9gwq9"
    },
    {
        "comment_id": "l75e6z3",
        "subreddit": "books",
        "body": "Really wish I had an award to give this comment, but in lieu of one, I'm just gonna say Happy Cake Day instead 🥳",
        "time": "2024-06-05 00:39:01 UTC",
        "score": 2,
        "link_id": "t3_1d7uhtb",
        "parent_id": "t1_l73d8bg"
    },
    {
        "comment_id": "l7239i8",
        "subreddit": "books",
        "body": "What on God's cursed green earth could've POSSIBLY convinced him that this was even a remotely good idea?? My brother in Christ, just talk to Black people!! We could've told you everything you wanted to know!! ✋🏾😭",
        "time": "2024-06-04 12:58:53 UTC",
        "score": 38,
        "link_id": "t3_1d7uhtb",
        "parent_id": "t3_1d7uhtb"
    },
    {
        "comment_id": "l4xl6vn",
        "subreddit": "books",
        "body": "Fourth Wing by Rebecca Yarros, and it was,,, an experience🧍🏾‍♂️",
        "time": "2024-05-20 21:23:39 UTC",
        "score": 3,
        "link_id": "t3_1cwbtst",
        "parent_id": "t3_1cwbtst"
    },
    {
        "comment_id": "l1el1cq",
        "subreddit": "books",
        "body": "I'm sorry but this quote took me OUT, imagine being cussed out by a peasant farmer or something in the 15th century ✋🏾😭💀",
        "time": "2024-04-26 20:24:52 UTC",
        "score": 6,
        "link_id": "t3_1cdhwov",
        "parent_id": "t1_l1c2yyo"
    },
    {
        "comment_id": "kz8azfu",
        "subreddit": "books",
        "body": "\"My bowels turned to water\" that just sounds like diarrhea lmao",
        "time": "2024-04-12 13:26:34 UTC",
        "score": 284,
        "link_id": "t3_1c1wwqz",
        "parent_id": "t1_kz77knv"
    }
]