[
    {
        "comment_id": "lqkv3mz",
        "subreddit": "books",
        "body": "Not intentionally. Like I don't sit around thinking that since I have this view about X,, let me challenge it with a particular book that disagrees with that view. It's more like I try to read widely, so naturally some of the books will affect my view of things. In retrospect, I can then say that Books A, B, and C really shaped my views regarding certain issue.",
        "time": "2024-10-06 06:13:58 UTC",
        "score": 23,
        "link_id": "t3_1fx5xwa",
        "parent_id": "t3_1fx5xwa"
    },
    {
        "comment_id": "lqkugwa",
        "subreddit": "books",
        "body": "I can't decide if I like East of Eden more or less than Grapes of Wrath but both are books I wish I hadn't read only so I could read them again and feel how I did that first time.",
        "time": "2024-10-06 06:07:49 UTC",
        "score": 0,
        "link_id": "t3_1fx5kkx",
        "parent_id": "t3_1fx5kkx"
    },
    {
        "comment_id": "lof7zdh",
        "subreddit": "books",
        "body": "She really has a talent for beautiful and profound writing:\n\n>It's a very Greek idea, and a very profound one. Beauty is terror. Whatever we call beautiful, we quiver before it. And what could be more terrifying and beautiful, to souls like the Greeks or our own, than to lose control completely? To throw off the chains of being for an instant, to shatter the accident of our mortal selves? Euripides speaks of the Maenads: head thrown I back, throat to the stars, \"more like deer than human being.\" To be absolutely free! One is quite capable, of course, of working out these destructive passions in more vulgar and less efficient ways. But how glorious to release them in a single burst! To sing, to scream, to dance barefoot in the woods in the dead of night, with no more awareness of mortality than an animal! These are powerful mysteries. The bellowing of bulls. Springs of honey bubbling from the ground. If we are strong enough in our souls we can rip away the veil and look that naked, terrible beauty right in the face; let God consume us, devour us, unstring our bones. Then spit us out reborn.",
        "time": "2024-09-22 20:42:39 UTC",
        "score": 63,
        "link_id": "t3_1fn0rra",
        "parent_id": "t3_1fn0rra"
    },
    {
        "comment_id": "lof7cfg",
        "subreddit": "books",
        "body": "Complete Cthulhu Mythos Tales by Lovecraft\n\n[https://i.imgur.com/NyrxHXR.png](https://i.imgur.com/NyrxHXR.png)",
        "time": "2024-09-22 20:39:20 UTC",
        "score": 1,
        "link_id": "t3_arg7gj",
        "parent_id": "t3_arg7gj"
    },
    {
        "comment_id": "lof5v0o",
        "subreddit": "books",
        "body": "I quite enjoyed Les Miserables but I can't lie and say I liked all of it. I mean there is only so much I wanted to learn about the sewer system in Paris.",
        "time": "2024-09-22 20:31:38 UTC",
        "score": 13,
        "link_id": "t3_1fn1c48",
        "parent_id": "t3_1fn1c48"
    }
]