[
    {
        "comment_id": "lu2asv2",
        "subreddit": "books",
        "body": "But if AI could somehow do those things, you still would not like it or care about what is made with it. That's because the way human brains work, we have emotions first and then we attempt to rationalise those emotions, and that rationalisation we call our opinion, but it's not always an accurate description of what we actually feel. \n\nYou dislike AI because it is not human, possibly also because you perceive it or it's weird fans as threatening to creative fields you value, and \"anything it makes will always be bad because it lacks intention\" is just the explanation your brain has come up with for why AI not being human causes you to feel negative emotions about it. If that was not the case, you'd still dislike AI, but you'd come up with a better explanation for why that was after realising that lack of intention wasn't the reason. That's basically how introspection works, it's progressively refining our understanding of our emotions. \n\nIt's for this reason that I can also predict that you have an objection to this comment which goes something along the lines of \"but AI could never have intention so that's a moot point\". \n\nMy point is that humans as a whole have a greater lack of interest in AI-generated content than any specific criticism of it, that will always result in most people completely ignoring AI works regardless of quality.",
        "time": "2024-10-27 20:07:28 UTC",
        "score": -4,
        "link_id": "t3_1gdfupd",
        "parent_id": "t1_lu27ryi"
    },
    {
        "comment_id": "lu28clk",
        "subreddit": "books",
        "body": "I'd like to see more enemies to lovers except not going to the lovers level. Everything is so dramatic these days, it's like every character is in a contest to take things personally. I want to read more stories where the hero and villain are having a head to head exchange of worldviews, where both respect where the other is coming from and respect that the other has to try to stop them and are going to have an honest showdown to see who will claim victory. \n\nIn other words, I wish characters had more sportsmanship.",
        "time": "2024-10-27 19:55:20 UTC",
        "score": 1,
        "link_id": "t3_1gd96e0",
        "parent_id": "t1_lu0utpi"
    },
    {
        "comment_id": "lu273uv",
        "subreddit": "books",
        "body": "Absolutely. I've done my fair share of shipping just because it would be cute, but that's the junk food of romantic fiction. The bare minimum for an actual romance story is for the two characters to have reasons to like each other beyond \"because the story is about me dating that person\".\n\nI'd go further than \"what they like about each other\" though. A lot of characters are going to have things they like about other characters they're not supposed to be romantically engaged with. I need them to have things that they uniquely get out of that relationship that they wouldn't get out of a relationship with any of the other characters.",
        "time": "2024-10-27 19:49:02 UTC",
        "score": 3,
        "link_id": "t3_1gd96e0",
        "parent_id": "t1_lu09f31"
    },
    {
        "comment_id": "lu25ulz",
        "subreddit": "books",
        "body": "I have only ever read one romance story I genuinely thought was good, which was the fan translation of \"Adachi to Shimamura\". Other romance stories or subplots might be cute, which gives them a certain level of tolerance or even indulgence, but doesn't make them good. \n\nAdachi to Shimamura is the only one I've ever read where the characters really feel like people driven by their own internal desires, rather than hooked up thoughtlessly and kept together by contrivance. It's the only romance story that makes me feel like the characters genuinely belong together, as opposed to just happening to be together, with enough introspection on both characters' parts to explain why what they get out of that specific relationship couldn't come from anywhere or anyone else.\n\nIt's also undramatic. There's no external threat to the relationship that has to be overcome, there's no \"spending ten chapters running about because of a miscommunication\". If anything, the conflicts tend to come from the characters being too keen to say what they mean.",
        "time": "2024-10-27 19:42:48 UTC",
        "score": 2,
        "link_id": "t3_1gd96e0",
        "parent_id": "t3_1gd96e0"
    },
    {
        "comment_id": "lu245tw",
        "subreddit": "books",
        "body": "That's true. We need to be able to believe that there was intention in a work, even if we don't really care what that intention was. Until we start worshipping AI as gods such that we can impose intention upon them, they're going to fail to really capture our imagination.",
        "time": "2024-10-27 19:34:21 UTC",
        "score": 1,
        "link_id": "t3_1gdfupd",
        "parent_id": "t1_lu1vnk3"
    },
    {
        "comment_id": "lu23thd",
        "subreddit": "books",
        "body": "That's not a very creative opinion.",
        "time": "2024-10-27 19:32:41 UTC",
        "score": -3,
        "link_id": "t3_1gdfupd",
        "parent_id": "t1_lu1qvx1"
    },
    {
        "comment_id": "lu23ngk",
        "subreddit": "books",
        "body": "People keep saying AI won't be able to do something distinctly human, then AI does that, and everyone jumps to talking about the new distinctly human thing AI will never be able to do. I'm pretty certain AI will be able to start producing deliberate messiness at some point. \n\nIt also doesn't matter though, cos at the end of the day what everyone who is talking about some unique quality AI could never reproduce is really saying is \"I'm just not interested in AI\". AI could create an artistic masterpiece, undeniable to all beholders, and most people would still just not care.",
        "time": "2024-10-27 19:31:52 UTC",
        "score": -2,
        "link_id": "t3_1gdfupd",
        "parent_id": "t1_lu1nuab"
    },
    {
        "comment_id": "lu21z8p",
        "subreddit": "books",
        "body": "Could be, but probably won't be, if only because if AI ever gets that good, books will have become so disposable and interchangeable that there's no longer such a thing as a favourite. \n\nEven if I accept the premise that one day there will be an AI-generated book better than my current favourite book, that would become overnight a million AI-generated books all equally better than my favourite and in that environment it would be impossible to have a favourite, because I would always be dropping books that weren't quite my taste knowing that there was a functionally infinite number of options.",
        "time": "2024-10-27 19:23:29 UTC",
        "score": 1,
        "link_id": "t3_1gdfupd",
        "parent_id": "t3_1gdfupd"
    },
    {
        "comment_id": "lu1zwcv",
        "subreddit": "books",
        "body": "And even better, many equally deserving recent works that don't require students to pretend 1400s Southern England is interesting to them.",
        "time": "2024-10-27 19:13:07 UTC",
        "score": 38,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t1_lu1oql9"
    },
    {
        "comment_id": "lu1z75f",
        "subreddit": "books",
        "body": "Exactly. I, as a British student, was forced to learn \"Of Mice and Men\", a book about a type of person I knew nothing about, in a period of history I knew nothing about, in a country I knew nothing about, as a commentary on a culture I had no involvement with, when my brain had not yet developed the levels of introspection and empathy necessary to not just laugh at how stupid all the characters are, or how stupid the idea was that the author could possibly have meant anything other than the words on the page.\n\nThat class ended up with the teacher just having us memorise \"correct analysis\" of the book, cos only two or three students were actually engaging with it enough to be able to pass the exam.",
        "time": "2024-10-27 19:09:38 UTC",
        "score": 5,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t1_lu1ns5r"
    },
    {
        "comment_id": "lu1xow3",
        "subreddit": "books",
        "body": "Ain't no school got resources for that. You're getting the copies they've had for 20 years.",
        "time": "2024-10-27 19:01:55 UTC",
        "score": 1,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t1_lu1qm5r"
    },
    {
        "comment_id": "lu1wvkq",
        "subreddit": "books",
        "body": "Better wages and unions. The key difference between the average kid who falls behind and the average kid who keeps up is household wealth. Comfortable parents means less stress, more extracurricular activities, and more attention. Poor parents are less able to take time off work, less able to afford clubs and educational toys, less able to afford weekend trips, less able to afford nutritious food, and may even have to work more hours.",
        "time": "2024-10-27 18:57:53 UTC",
        "score": 18,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t1_lu1nvai"
    },
    {
        "comment_id": "lu1vt2v",
        "subreddit": "books",
        "body": "The teacher is right. Hamlet might be good for a classical literature degree, but for regular teenagers, who already struggle to pay attention, and who aren't reading habitually, it's irrelevant and needlessly hard to digest. The people who would enjoy reading hamlet are already reading on their own time anyway, books taught in school should be ones that more people will be able to engage with than just the literature nerd clique.",
        "time": "2024-10-27 18:52:32 UTC",
        "score": 9,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t3_1gdgvlf"
    },
    {
        "comment_id": "lu10ajx",
        "subreddit": "books",
        "body": "Let's be reasonable now, there are so many new books created every day, how can we possibly read them all before classifying them? I think the practical solution has to be categorising based on a randomly selected portion of the words from all pages. That way you remove the effect of having a stylised prologue.",
        "time": "2024-10-27 16:16:07 UTC",
        "score": -3,
        "link_id": "t3_1gd2kgc",
        "parent_id": "t1_lu0ui6x"
    },
    {
        "comment_id": "lreyi8h",
        "subreddit": "books",
        "body": "\"You won't believe which hotel chain is named after this sex tape star!\"",
        "time": "2024-10-11 14:16:10 UTC",
        "score": 2,
        "link_id": "t3_1g0o72y",
        "parent_id": "t1_lrd8njy"
    },
    {
        "comment_id": "lrey8jw",
        "subreddit": "books",
        "body": "Yep. Everyone knows about clickbait now, so good clickbait has to make you too curious to ignore it. \"If <condition you definitely meet>, you're evil\" is very good at irritating people, but it's not great at capturing clicks because you're giving people the information they need in order to look up the subject of their curiosity elsewhere, like on Wikipedia. If you're going to clickbait, you need to present information in such a way that only clicking on your bait can resolve the curiosity.",
        "time": "2024-10-11 14:14:35 UTC",
        "score": 2,
        "link_id": "t3_1g0o72y",
        "parent_id": "t1_lrch7ty"
    },
    {
        "comment_id": "lpb237u",
        "subreddit": "books",
        "body": "I was listening to an interesting talk on this yesterday that was basically pointing out that the way we do charity is absurdly inefficient. We focus on doing things like teaching the impoverished how to run businesses, when often they already know that and just need the money to start running one. We spend £20,000 to do £1000 worth of work because we're concerned that if we give them £1000 to do the work, they'll just steal it. We've designed charity to be something that pays the salaries of the European and American charity workers, and then distributes whatever's left after all the surveyors and planners have had their share.",
        "time": "2024-09-28 06:57:46 UTC",
        "score": 21,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lpafwlz"
    },
    {
        "comment_id": "lpb1j4q",
        "subreddit": "books",
        "body": "Yep, then you have to figure out what to do about that. Resources are functionally finite, and we currently get more than our fair share of them. If we want to give everyone their fair share, standard of living for people currently living in excess has to decrease significantly, and that's an impossible sell that no one will ever vote for and that the richest people will spend a lot to prevent happening.\n\nAnd for the record, I wish people would stop saying \"global south\" and \"global north\". It's just as bad as saying \"the west\". Australia and New Zealand are south of the equator, for starters, and there are billions of people living north of the equator, like underpaid Chinese labourers, who are being exploited too. \"Global south\" is just another term designed to divide people into exploiters and victims in the easiest way possible, and it feels very Americas-centric.",
        "time": "2024-09-28 06:51:45 UTC",
        "score": 1,
        "link_id": "t3_1fqrr62",
        "parent_id": "t3_1fqrr62"
    },
    {
        "comment_id": "lovq9mu",
        "subreddit": "books",
        "body": "I agree with you on that, there's absolutely space for \"diverse characters\" when you're not explicitly trying to examine, like on a critical level, how someone like that would interact with the complexities of the setting. Indeed, if there wasn't that space, none of my favourite pieces of media would exist. \n\nWhat I'm meaning to say is that you also shouldn't be erasing everything that makes a \"diverse character\" the diversities you've chosen for them, because doing so is just sabotaging yourself by making readers see the default behind the diverse facade (which they're probably going to assume is straight white male, because that's what most writers' default is). If you decide you're going to have an autistic character, the minimum you need to be doing is giving that character one of the many autistic mindsets that exist. If you've just made \"antisocial genius\" again, you're on my naughty list.\n\n>“don’t worry I won’t hold it against you that your ancestors enslaved my people”. \n\nTangentially, this is a whole separate issue, which is that no one wants to write sincerity these days. Everyone is snarky. No character is allowed to have vulnerabilities, no character is allowed to express sentimentality or intimacy. This whole Marvel-style approach to writing just feels like one giant literary \"no homo\" to me.",
        "time": "2024-09-25 16:52:10 UTC",
        "score": 1,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lovaken"
    },
    {
        "comment_id": "lothhab",
        "subreddit": "books",
        "body": "The problem there is that when your primary goal in writing is to minimise all potential criticism, it's impossible to write anything good. No one actually wants superficial diversity. It's better to write only characters you intend to explore, and just accept that you're then going to get criticism from people whose opinions should be irrelevant to you.",
        "time": "2024-09-25 06:52:28 UTC",
        "score": 1,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lork782"
    },
    {
        "comment_id": "lotgyfa",
        "subreddit": "books",
        "body": "We did to begin with, but these days Mary Sue has become gender-neutral.",
        "time": "2024-09-25 06:46:50 UTC",
        "score": 1,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lornt66"
    },
    {
        "comment_id": "lorhbaa",
        "subreddit": "books",
        "body": "You don't. If I was my old English teacher, I'd say you're supposed to decide what the author's opinion is and then write an essay evidencing that decision. As me, I'd say who cares; you don't need to know the author's opinion to be able to come to your own, and knowing what the author believes doesn't change how persuasive the case made is.",
        "time": "2024-09-24 22:11:40 UTC",
        "score": 2,
        "link_id": "t3_1foj488",
        "parent_id": "t3_1foj488"
    },
    {
        "comment_id": "lorgqou",
        "subreddit": "books",
        "body": "I think it's quite easy to describe - it's the same sort of beauty as when you hear a music.",
        "time": "2024-09-24 22:08:16 UTC",
        "score": 1,
        "link_id": "t3_1fn1c48",
        "parent_id": "t1_loh9w56"
    },
    {
        "comment_id": "lorgea1",
        "subreddit": "books",
        "body": "Yes, it's absolutely the opposite of that advice - which I disagree with strongly. You can't just \"write characters and have some of them be women\". Maybe you'll be able to do that three hundred years from now when we've survived three more world wars and build strange egalitarian utopias, but for the foreseeable future, men and women have very different life experiences starting from quite a young age, which is going to manifest in a character. Same way you can't just write neurotypical characters and then say some of them are autistic for example. \n\nAnd incidentally, yes, you do also get quite a few male characters who are basically women. Happens quite a bit in gay romances written by and for female audiences. I once saw an artwork that took this to such an extreme that the character's pecs had become breasts, which was pretty funny.",
        "time": "2024-09-24 22:06:13 UTC",
        "score": 0,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lorexke"
    },
    {
        "comment_id": "lor80t3",
        "subreddit": "books",
        "body": "What you have to remember is that the primary MCU fandom is teenage girls. Teenage girls like Loki because he's a hot baddie with a heart of gold. Sylvie, by not being male, can never be attractive to them in that way.",
        "time": "2024-09-24 21:18:46 UTC",
        "score": 0,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lopvymy"
    },
    {
        "comment_id": "lor7skl",
        "subreddit": "books",
        "body": "Wait Brie Larson and Daisy Ridley are attractive? Is that popular opinion? I thought their aesthetic averageness was an intentional casting choice.",
        "time": "2024-09-24 21:17:29 UTC",
        "score": -2,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loqqutb"
    },
    {
        "comment_id": "lor7kq4",
        "subreddit": "books",
        "body": "Except when we criticise bad writing of male characters, we actually do also use the term Mary Sue, and there are plenty of other terms that have been invented to more accurately describe those problems too - such as male power fantasy. \n\nAnd that \"men are the default therefore women bad\" is exactly what I'm criticising - it's being so immersed in the idea of patriarchy as the root of all evil that you've made this a men vs women thing.",
        "time": "2024-09-24 21:16:19 UTC",
        "score": 2,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loqhze7"
    },
    {
        "comment_id": "lor765b",
        "subreddit": "books",
        "body": "Which is fine. No character is going to be beloved by all, and people who don't like any given trend in media are always going to enjoy criticising it, which is also fine. There are plenty of female characters I love. There are people out there who will loathe those characters, knowing nothing about them, simply because I love them.",
        "time": "2024-09-24 21:14:06 UTC",
        "score": 2,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loq2030"
    },
    {
        "comment_id": "lor69cn",
        "subreddit": "books",
        "body": "I genuinely doubt that's true. I'm not just talking about women with stereotypically masculine interests or presentations. I'm talking about when writers take the generic male protagonist trope, the one so bland that it's sometimes hard to tell characters apart, and making it female. In my experience that actually tends to be quite \"feminine\", because feminine appearance is the only method these writers have of communicating to you that it is indeed a female character. When I read a book or watch a movie with a female protagonist, it's partly because I want to escape the generic male protagonist. Even most real-life men aren't that character.",
        "time": "2024-09-24 21:09:09 UTC",
        "score": 1,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loqf4dl"
    },
    {
        "comment_id": "lops3mi",
        "subreddit": "books",
        "body": "Taking a less cynical stance, I think people are just more invested in female characters being interesting. It feels more like a missed opportunity. I recognise when a male character has been written in a similarly poor way, but ultimately, I don't care, because having a well-written male character doesn't increase my enjoyment of a work anywhere near as much as having a well-written female character does.",
        "time": "2024-09-24 16:48:45 UTC",
        "score": -5,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lopdpfu"
    },
    {
        "comment_id": "lopra0h",
        "subreddit": "books",
        "body": "Or the other thing, where they just write a male character right down to the stoicism and lack of intimacy, then call him Judith.",
        "time": "2024-09-24 16:44:29 UTC",
        "score": 1,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loowku4"
    },
    {
        "comment_id": "lopqvmp",
        "subreddit": "books",
        "body": "I read the words \"feminist retelling\" these days as \"cheap catharsis\".\n\nHey you, are you feeling powerless right now? Are you frustrated with the status quo? Are you inclined to view all social issues through a lens of patriarchy to the point that you've long since lost sight of the specific problems and just see the world as women vs a single dogmatic image of \"men the enemy\"? Then step right up! For just £12.99 transferred directly into the pockets of a primarily male-owned publishing company, immerse yourself in a simpler place, where the answer to all problems in life really is as easy as \"if only men weren't so wicked\"! Lean back and relax, knowing you'll never be expected to form a nuanced opinion or consider more than two pieces of information, and rejoice alongside our protagonist as the villains are overthrown and ridiculed the moment a woman dislodges their masculine malice with the unmitigated might of the madame!",
        "time": "2024-09-24 16:42:22 UTC",
        "score": 9,
        "link_id": "t3_1fo9993",
        "parent_id": "t3_1fo9993"
    },
    {
        "comment_id": "llz640a",
        "subreddit": "books",
        "body": "I can't speak for everyone, but most of the readers I knew as a teenager were already plenty into sex and violence lol.",
        "time": "2024-09-07 16:38:06 UTC",
        "score": 1,
        "link_id": "t3_1f8zdm7",
        "parent_id": "t1_llwvclk"
    },
    {
        "comment_id": "llu5x6x",
        "subreddit": "books",
        "body": "I mean that Orwell wrote 1984 so cynically that it's not interesting. It's like The Handmaid's Tale - it makes important points, but the world it portrays while doing so is so cartoonishly simple, especially in its characterisation of human behaviour, that it doesn't feel real, even if the threats it exaggerates are real, which is vital for a dystopia. Brave New World feels much closer to the kind of future humans could one day find themselves in, because it gives its characters the ability to make decisions besides compliance or revolution and explores what kinds of decisions people might make in that sort of world. \n\nTo put it another way, 1984 only has room for two characters.",
        "time": "2024-09-06 18:48:57 UTC",
        "score": 0,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_llrhqxb"
    },
    {
        "comment_id": "lllvsrn",
        "subreddit": "books",
        "body": "Right, but that's 4 paragraphs of doing the exact same thing I criticised - saying \"you can't say something is a bad story if it's not trying to be a good story\". It's not about whether the product as a whole is good or bad, it's about the way that if someone says something like \"I liked the message but I didn't think the story it was told through was good\", the response is always \"but the story isn't supposed to be good so you aren't allowed to think it wasn't good\", which is nonsense, it's thought-terminating.",
        "time": "2024-09-05 10:29:29 UTC",
        "score": 3,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_llj3duj"
    },
    {
        "comment_id": "lllv9zm",
        "subreddit": "books",
        "body": "That would have been true if the story of \"her\" hadn't also been just another entry into the mad blur of repetition and no think that is romance literature. Maybe it could have been ironic, that the spark of inspiration for Winston was the most uninspiring thing in the world, but it seemed to have been played very straight to me.",
        "time": "2024-09-05 10:24:19 UTC",
        "score": 1,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_llj6p91"
    },
    {
        "comment_id": "llizyin",
        "subreddit": "books",
        "body": "I also found Brave New World more enjoyable within that \"famous dystopian novels\" clade. Both take an interesting look at potential future societies, but where Brave New World is quite tonally neutral and sort of presents a documentary of this strange civilisation, 1984 comes across as much more cynical, and even sadistic, using its plot just to torment Winston, not really to explore what people would be like within that world.",
        "time": "2024-09-04 20:56:12 UTC",
        "score": 4,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_lliv36o"
    },
    {
        "comment_id": "llixpfa",
        "subreddit": "books",
        "body": "If it is an insult, it's an insult as much aimed at myself as anyone else lol. I don't think there's anything inherently wrong with liking as an adult the things you liked as a teenager; Maas's books are in my opinion weak not because they're teenager-oriented, but because the writing style and subject matter don't appeal to my own juvenile tastes. I'm just concerned where this neoteny of the palate might take us in the future, and what if anything we're going to be losing if people stop being interested in what \"adult books\" have to offer. \n\n>Just because the focus is also on relationships doesn't mean that's weaker or less-than literature.\n\nYes it does, but this is true of like 95% of all books. Including many of Shakespeare's.",
        "time": "2024-09-04 20:44:01 UTC",
        "score": 3,
        "link_id": "t3_1f8zdm7",
        "parent_id": "t1_lliwmeq"
    },
    {
        "comment_id": "lliwbqw",
        "subreddit": "books",
        "body": "I do, but then I also take a while to figure out what I want to say before I say it because otherwise my tongue's not getting past the third word.",
        "time": "2024-09-04 20:36:52 UTC",
        "score": 1,
        "link_id": "t3_1f84x6p",
        "parent_id": "t1_llc1ljs"
    },
    {
        "comment_id": "lliw2wh",
        "subreddit": "books",
        "body": "I think that's a completely different problem - one of characterisation rather than style. Clear dialogue can and should still display the personality of the speaker, and you can write clear dialogue without making everyone witty or snarky. And if you're writing clearly, you are better able to contrast that against an unusually nervous or ineloquent character's speech, something that can often be difficult to convey through writing when your \"normal\" casts' speech already contains a lot of run-on sentences and verbal place-holders.",
        "time": "2024-09-04 20:35:36 UTC",
        "score": 1,
        "link_id": "t3_1f84x6p",
        "parent_id": "t1_llc86a1"
    },
    {
        "comment_id": "lliuyao",
        "subreddit": "books",
        "body": "I think I actually take the opposite stance - I don't like dialogue that feels like it's trying to feel \"real\". Communication issues is not a compelling story point for me, and books where every character feels like they have a nervous disposition, or have no control over their tongue, are ones where I have no one to root for. I like books with slightly more robotic dialogue, where the characters are all better at speaking than real people are. And frankly, if I was capable of speaking like that too, I would. My brain thinks thoughts clearly, it's only my disnimble mouth that prevents me from having polished speech.",
        "time": "2024-09-04 20:29:45 UTC",
        "score": 1,
        "link_id": "t3_1f84x6p",
        "parent_id": "t3_1f84x6p"
    },
    {
        "comment_id": "llitufd",
        "subreddit": "books",
        "body": "As far as I've encountered it, it's books that are read primarily for the sake of their genre, rather than their specific story. Like, \"I'm in the mood to read some cyberpunk, someone hand me a random book off the cyberpunk shelf\".",
        "time": "2024-09-04 20:24:03 UTC",
        "score": 1,
        "link_id": "t3_1f86bwb",
        "parent_id": "t3_1f86bwb"
    },
    {
        "comment_id": "llitegr",
        "subreddit": "books",
        "body": "Same reason I comment on the people who comment on other people's comments being droll: for a sense of superiority.",
        "time": "2024-09-04 20:21:48 UTC",
        "score": 6,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_lli2rru"
    },
    {
        "comment_id": "llit3u3",
        "subreddit": "books",
        "body": "But then it's a story that's not intended to be good, so why can't we accept that it's not, why do we feel the need to say \"well it wasn't *supposed* to be good\" with the implication that it therefore *is* good?\n\nNot applying that to Farenheit 451 specifically, just the general approach to criticism where we say \"well it can't have been a bad X because it wasn't trying to be a good X\".",
        "time": "2024-09-04 20:20:16 UTC",
        "score": 6,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_llihzvx"
    },
    {
        "comment_id": "llisdvr",
        "subreddit": "books",
        "body": "On that note, 1984 is drivel. Insightful, obviously, but as an actual story it's a huge waste of its setting.",
        "time": "2024-09-04 20:16:34 UTC",
        "score": 2,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_llhx42t"
    },
    {
        "comment_id": "llis35q",
        "subreddit": "books",
        "body": "But I think there has to be a point where \"the point is that these characters are terribly written and that means they're actually well-written\" no longer holds up. It's just the \"everything's a satire\" argument, where since a story is defined as good, every bad aspect of it has to be reimagined as secretly good through the angle of \"it's a sarcastic commentary on people who write like this\".",
        "time": "2024-09-04 20:15:03 UTC",
        "score": 11,
        "link_id": "t3_1f8yndn",
        "parent_id": "t1_lliis6l"
    },
    {
        "comment_id": "lliqv6j",
        "subreddit": "books",
        "body": "I generally perceive \"rating\" as a measure of novelty or zeitgeistness, rather than quality, cos that's really where the ratings come from. Knowing nothing about Babel except that it is overrated, I find myself entirely unsurprised when I read in the first paragraph of its wikipedia entry that it criticises imperialism and capitalism, and talks about academia's role in them - cos that's the exact formula for being overrated: say \"We all agree that a current popular topic of criticism is bad, but here's how another group of people have done bad things relating to it too, whom you probably haven't thought about in that context before!\". I'd even go so far as to say that most literature ratings are really about rewarding journalism, not prose.",
        "time": "2024-09-04 20:08:44 UTC",
        "score": 6,
        "link_id": "t3_1f8yndn",
        "parent_id": "t3_1f8yndn"
    },
    {
        "comment_id": "llip5tb",
        "subreddit": "books",
        "body": "I don't think it's as harmless as that. Maas's works are YA works. Audiences are not changing in tastes as much as they get older now. They might want slightly more mature themes or word choices, but they want the same substance as adults as they had as teenagers, and in every substantial way, Throne of Glass is not a place for people who grew out of Twilight, it's a place for people who want to be able to read Twilight again. Although I'd say it's slightly more of a Hunger Games rewrite, to be specific. \n\nUnfortunately fae won't be going anywhere for a while. We've still got the entire \"movie/TV industry milking it to death\" phase to get through first.",
        "time": "2024-09-04 19:59:49 UTC",
        "score": 5,
        "link_id": "t3_1f8zdm7",
        "parent_id": "t1_llienvu"
    },
    {
        "comment_id": "llimr5q",
        "subreddit": "books",
        "body": "Nowhere - it is not a cycle, because it does not move. It's just a genre, that'll be the same in all but aesthetics 300 years from now, and was the same in all but aesthetics 300 years ago.",
        "time": "2024-09-04 19:47:26 UTC",
        "score": 10,
        "link_id": "t3_1f8zdm7",
        "parent_id": "t1_lli8tfg"
    },
    {
        "comment_id": "llim6fn",
        "subreddit": "books",
        "body": "No, because every fantasy romance novel was already the same thing decades before Maas was invented; Maas herself is just reiterating the same sorts of YA fantasy premises popular in the 2000s. It's not Maas's influence causing every YA novel to be the same, she just gained success from doing the same thing everyone was already doing in 2010. She even got her start posting on the same amateur fiction sites.\n\nStop me when this sounds familiar:\n\n> A teenage girl with a ridiculous name lives in the worst conditions of an oppressive regime. She's also improbably talented at the story's main plot resolution mechanic (probably combat), which proves useful when she finds herself roped into a deadly contest at the whim of the ruler of the oppressive regime. Throughout the contest, she finds herself developing a romance with a similarly aged male described as attractive, while also learning about the dark secrets behind the regime. She is then tasked with more killings, but this time refuses to do so, which results in her aligning with a rebel faction. In the meantime, she must struggle with her lover being in the grip of the evil power, tricked by some dark magic into being an enemy, while at the same time considering the other option of a lover candidate who is already an ally, and whom fans seem to have divided into teams on. Complicating matters further, she has been granted a very significant role within the rebellion.\n\nThat's the Hunger Games, which concluded the same year Maas's extremely similar story began. That's not saying she copied though, this is just how formulaic the genre is.",
        "time": "2024-09-04 19:44:23 UTC",
        "score": 22,
        "link_id": "t3_1f8zdm7",
        "parent_id": "t3_1f8zdm7"
    },
    {
        "comment_id": "llihtre",
        "subreddit": "books",
        "body": "Ok, but who cares whether a blind person in a self-driving car thinks of themselves as a driver? Absolute worst case scenario when they do that is that they're annoying you because in your mind the title \"driver\" is reserved for people who apply some arbitrary minimum level of skill, a problem you can solve by simply not talking to them.\n\nThe second problem I have with your position here is that it's absurdly absolute. Why are the two options you're operating on here \"blind people don't drive\" and \"blind people sit in self-driving cars\"? What if the technology allowing a blind person to operate a truck was a camera that fed visual information straight to their brain, bypassing broken optic nerves, would they get to be called a driver then? \n\nApplying this analogy to creative disciplines makes absolute binaries like this even less relevant, because all creative disciplines combine many different tasks, and most of the people who are interested in using tools - AI or otherwise - to assist in their creativity are not those blind drivers letting the cars drive themselves. Yes, you can tell an LLM \"Give me a 50,000 word novel about a haddock\", but no one's really doing that except to troll. What people are actually doing with these tools is using them to optimise their creative time and energy, making it easier to get done the bits that don't interest them so that they can put more of their effort into the bits that do interest them. Previously, these are people who would have just winged those bits, or even be put off from doing anything creative at all by the gate that says if you can't do everything well there's no point doing anything. \n\nAnd we've all seen those sorts of writers before, right? The sci-fi writer whose dialogue feels as if they've never had a conversation with a human, the romance writer who couldn't tell you what \"worldbuilding\" meant if it bit them on the uvula. Lacking the tools doesn't make these people become more skilled, it just makes them say \"I don't really care about this bit so I'll do the bare minimum\" - and the sci-fi writer still gets to be perceived as good enough because sci-fi is about concept not dialogue, and the romance writer still gets to be perceived as good enough because romance is about drama not world. Those are the people who are still going to be using AI once the fad wears off (which it really already has), and I guarantee it will not result in any reduction in quality whatsoever, so suddenly withholding the term \"writer\" from them makes no sense.",
        "time": "2024-09-04 19:21:36 UTC",
        "score": -2,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_lli6tz1"
    },
    {
        "comment_id": "lli5mkm",
        "subreddit": "books",
        "body": "This is getting lost in translation. No one is saying that its ableist to not hire a blind person to drive a truck, they're saying that if technology was created that made a blind person perfectly capable of driving a truck, and you still said blind people shouldn't drive trucks, or said that technology shouldn't exist, then you'd be being ableist. \n\nThe theory on display in this article, which to be clear I largely don't agree with, is \"AI tools are helping some disabled people to enjoy hobbies they would have previously struggled to enjoy, and treating the use of those tools as some kind of heresy is therefore ableist\". \n\nOne of the major complications here is that a lot of creative hobbies involve more than one task, which people will have different competencies in and different enjoyments of. Writing is as much about the ideas expressed as the keys pressed to express them.",
        "time": "2024-09-04 18:12:54 UTC",
        "score": 4,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llgfn19"
    },
    {
        "comment_id": "lli2lds",
        "subreddit": "books",
        "body": "I mean, a lot of very popular musicians are people who can't sing very well and use digital editing to compensate, and aside from a few blips in the early 2010s when people used autotune badly, we're all pretty much OK with that because they have something else that appeals to us, like an interesting voice, compelling lyrics, innovative composition, or a relatable persona.\n\nAi writing tools are shoddy and pointless at the moment, but if in 10 years time a sci-fi writer with a great premise uses AI to make their dialogue more bearable, I can't see myself having a problem with that.",
        "time": "2024-09-04 17:56:28 UTC",
        "score": 0,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llft1b7"
    },
    {
        "comment_id": "lli137a",
        "subreddit": "books",
        "body": "They're not wrong though, it's just a very emotionally charged subject at the moment because people are scared, and its hard to have a fair look at the benefits and flaws of AI as assistive tools while we're having to worry about AI as worker replacements. \n\nI personally look forward to the revolution in amateur creativity we're going to see in a few years, since the ability to use AI for the parts of your project you're not as interested in means you don't have to be a polymath to make something serviceable and you can spend a greater proportion of your time on the elements of a multimedia project you enjoy making.",
        "time": "2024-09-04 17:48:33 UTC",
        "score": 2,
        "link_id": "t3_1f8nukm",
        "parent_id": "t3_1f8nukm"
    },
    {
        "comment_id": "ljzjsfe",
        "subreddit": "books",
        "body": "And only in the food halls of mineworks did the concept of worker's rights exist. You're on the wrong side of history mate.",
        "time": "2024-08-26 09:19:39 UTC",
        "score": 3,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljzgewj"
    },
    {
        "comment_id": "ljzd9da",
        "subreddit": "books",
        "body": "They're still selling at $60 because \"games cost $60\" has become so ingrained in people's minds that it's difficult to sell at anything higher - people just don't accept higher prices, same way Costco can never raise the price of its iconic foods. It's not about the feeling of getting a deal, it's about not feeling like you're being scammed. That's why they've gone so hard in on tiered editions and preorder bonuses, it's a way to charge more for the game that will circumvent people's mental blocks on tolerating price increases. It's not altruism, they're just making do with the reality of what their customers will buy.",
        "time": "2024-08-26 08:04:07 UTC",
        "score": 1,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljwcw4j"
    },
    {
        "comment_id": "ljzcxj0",
        "subreddit": "books",
        "body": "It's not just that, Blizzard are constantly changing how the game mechanics work. I enjoy playing a character, so I buy a skin for the character, then they change how the character plays such that I no longer enjoy playing it, and I can't get a refund for that skin. I could put up with Overwatch 2, but the frequent changes to healers to make them more damage focused and less manoeuvrable ruined the game for me regardless of number of players.",
        "time": "2024-08-26 08:00:17 UTC",
        "score": 5,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljz03er"
    },
    {
        "comment_id": "ljzcq8w",
        "subreddit": "books",
        "body": "That sentence doesn't even make logical sense, IP isn't something you can steal.",
        "time": "2024-08-26 07:57:55 UTC",
        "score": 7,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljzb9rw"
    },
    {
        "comment_id": "ljx7wld",
        "subreddit": "books",
        "body": "Provided the plane has enough fuel to complete the journey safely with an extra passenger, I have no moral objection to that, and I don't see why I should. No one is harmed by it, it's not depriving anyone else of a seat if he stands in the aisle, and the airline was never going to sell an extra ticket. What would be the actual problem with that, except that it's not legal?",
        "time": "2024-08-25 21:54:54 UTC",
        "score": 4,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljwz9rf"
    },
    {
        "comment_id": "ljws6hw",
        "subreddit": "books",
        "body": "And morality is not restricted to legality.",
        "time": "2024-08-25 20:23:39 UTC",
        "score": 18,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljwjr8v"
    },
    {
        "comment_id": "ljwebs2",
        "subreddit": "books",
        "body": "And people do get paid for their work anyway, it's the shareholders who lose out when a pirate pirates, since the employees who did the work are salaried, not paid out of royalties.",
        "time": "2024-08-25 19:05:22 UTC",
        "score": -2,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljvds67"
    },
    {
        "comment_id": "ljwe3xg",
        "subreddit": "books",
        "body": "Except that you're not taking anything, you're cloning a file. In a world where your purchases are just access keys to an online repository, piracy is conceptually closer to trespassing than theft.",
        "time": "2024-08-25 19:04:07 UTC",
        "score": 24,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljwa227"
    },
    {
        "comment_id": "ljwduib",
        "subreddit": "books",
        "body": "Right, and just like what we saw in gaming... it's actually fine. The gaming industry never collapsed, it's doing better than ever from a profit angle. That's because piracy is a matter of convenience, not price, and for a good while now Steam has acted as the ultimate convenience. People mostly preferred to just buy the game themselves, rather than going through the hassle of getting a friend to give you a copy or finding a safe and well-seeded torrent. And it happened with Netflix too. Piracy of movies and TV shows dropped quite a bit thanks to Netflix, because Netflix's content delivery mechanisms and library were fantastic, and then began crawling back up again as Netflix got worse. \n\nBooks do fall closer to the music end of the media spectrum than the gaming end, being much easier to download than games, but that's still fine - music piracy is at the lowest point in over a decade now thanks to spotify and youtube music being more convenient for most users. Plus, as media types go, books probably have the audience most willing to pay for content even if they don't strictly have to. So book sales will be fine, as long as book distribution platforms focus on offering greater convenience than piracy options, which for books is pretty easy to do.",
        "time": "2024-08-25 19:02:39 UTC",
        "score": 2,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljvt28n"
    },
    {
        "comment_id": "ljwbl8f",
        "subreddit": "books",
        "body": "Although incidentally, patent law is also pretty broken right now, usually just resulting in companies rushing to patent in hopes of being purchased by a conglomerate.",
        "time": "2024-08-25 18:50:10 UTC",
        "score": 3,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljw3qwu"
    },
    {
        "comment_id": "ljwb7st",
        "subreddit": "books",
        "body": "Always remember the common adage: if buying isn't owning, piracy isn't stealing.",
        "time": "2024-08-25 18:48:08 UTC",
        "score": 262,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljvu7wo"
    },
    {
        "comment_id": "ljwb09g",
        "subreddit": "books",
        "body": "We really need an overhaul of what we consider \"ownership\" of digital products, and outlaw as much as is reasonable the selling of these sorts of \"licenses to access\". The reason they'd never do this with real books is only because they can't do it - they should be unable to do it digitally, too.",
        "time": "2024-08-25 18:46:59 UTC",
        "score": 2,
        "link_id": "t3_1f0whdx",
        "parent_id": "t3_1f0whdx"
    }
]