[
    {
        "comment_id": "lwk9891",
        "subreddit": "books",
        "body": "Fantasy world. Uses our calendar names and all\n Weekday names. Month names. Fuck all of that.",
        "time": "2024-11-11 10:51:46 UTC",
        "score": 3,
        "link_id": "t3_1gom7rk",
        "parent_id": "t3_1gom7rk"
    },
    {
        "comment_id": "lgqss33",
        "subreddit": "books",
        "body": "Yes,  I good thing I have anti depressants that makes me fall tired enough to fall asleep without em I'd stay upp until 5 in the morning no matter what. I did A LOT of reading before getting that prescription.\n\nDuring the summer vacation I didn't take the pills as regularly as I did when I'm working so I read until like 2 am lmao",
        "time": "2024-08-06 09:05:19 UTC",
        "score": 1,
        "link_id": "t3_1ekx3em",
        "parent_id": "t3_1ekx3em"
    },
    {
        "comment_id": "kgmw1z1",
        "subreddit": "books",
        "body": "at least its not japan level of stupid where they explain the whole plot in the title.",
        "time": "2024-01-06 21:06:02 UTC",
        "score": 2,
        "link_id": "t3_1903t4p",
        "parent_id": "t3_1903t4p"
    },
    {
        "comment_id": "kgmvwpi",
        "subreddit": "books",
        "body": "they all went to the same name generator website.",
        "time": "2024-01-06 21:05:08 UTC",
        "score": 7,
        "link_id": "t3_1903t4p",
        "parent_id": "t3_1903t4p"
    },
    {
        "comment_id": "k44p09a",
        "subreddit": "books",
        "body": "i barely got started on the first book of 12. they described a fantastic fantasy world with strange names , monsters, fae and elves.\n\nthe seasons of that alien world was named \"winter, spring, summer and fall\".\n\nmy suspension of disbelief....where did it go? you had me, i believed in your fake world but you just had to fuck up something.",
        "time": "2023-10-09 13:52:13 UTC",
        "score": 1,
        "link_id": "t3_173inth",
        "parent_id": "t3_173inth"
    },
    {
        "comment_id": "k3ux8j0",
        "subreddit": "books",
        "body": "i read everything, when you look at a word you see the other words beside it.\n\nin ops text i focus on \"over\" and read the rest ish untill my eye jumps to \"noticed\" and reads the words around that on both sides \"about\" is the next one and \"word\" is the last. \nreading that sentence took me like 0.5 seconds, couldnt be bothered to time it since it feels pretty much instant.\n compared to 5.81 seconds if i speak aloud in my skull.\n\nyou dont actually need to read every single word and hear it inside your skull at the same time. its so painfully slow. like children needing to speak letters aloud before saying the word they form and then moving onto the next. mindnumbingly slow to read.\n\ni used to read like that, slowly pronouncing every word. looked up on how to read faster and it was to stop doing just that. by counting up to 3 over and over while you read.\nyou pretty much murder that voice in your head slowing things down.  its time for ludicrous speed.",
        "time": "2023-10-07 14:48:19 UTC",
        "score": 1,
        "link_id": "t3_171ob99",
        "parent_id": "t3_171ob99"
    },
    {
        "comment_id": "jgqibc8",
        "subreddit": "books",
        "body": "yes,  anything brandon sanderson please.",
        "time": "2023-04-18 12:19:54 UTC",
        "score": 1,
        "link_id": "t3_12pwaq9",
        "parent_id": "t3_12pwaq9"
    }
]