[
    {
        "comment_id": "lrohxyh",
        "subreddit": "books",
        "body": "Scrolled ages to find this as it's the first book that popped in my head for this question. 'Guts' still sets my teeth on edge and I can't remember the title of the chapter but the one with the police dolls (keeping as vague and spoiler free as possible) still leaves me unsettled.",
        "time": "2024-10-13 05:35:07 UTC",
        "score": 2,
        "link_id": "t3_1g1vfsk",
        "parent_id": "t1_lrkoywm"
    },
    {
        "comment_id": "lodpg54",
        "subreddit": "books",
        "body": "Ella Minnow Pea by Mark Dunn is a new favourite that I would recommend to any book lover or word enthusiast.",
        "time": "2024-09-22 16:10:16 UTC",
        "score": 1,
        "link_id": "t3_1fmvx2e",
        "parent_id": "t3_1fmvx2e"
    },
    {
        "comment_id": "lo99v94",
        "subreddit": "books",
        "body": "Was reading a dairy free recipe book recently and didn't get past the third page. The author was explaining the virtues of a dairy free diet and included something about it being an effective \"treatment\" for \"children with autism.\"\n\nNope. Done. Knew I wouldn't be able to take anything she said seriously after that.",
        "time": "2024-09-21 19:52:59 UTC",
        "score": 1,
        "link_id": "t3_1flpj1z",
        "parent_id": "t3_1flpj1z"
    },
    {
        "comment_id": "lo99e0m",
        "subreddit": "books",
        "body": "Ended up studying that book at three separate points, age 13, 16 and 17.\n\nPretty sure I never had a chance of liking it after picking it apart so much.",
        "time": "2024-09-21 19:50:14 UTC",
        "score": 2,
        "link_id": "t3_1flpj1z",
        "parent_id": "t1_lo4tody"
    },
    {
        "comment_id": "ln4zzv3",
        "subreddit": "books",
        "body": "I loved Jam by Yahtzee Crashaw. He's the game reviewer Zero punctuation and the book is very much his trademark humour. It's an apocalypse story if the world was taken over by carnivorous strawberry jam.",
        "time": "2024-09-14 20:16:57 UTC",
        "score": 1,
        "link_id": "t3_1fgnkx6",
        "parent_id": "t3_1fgnkx6"
    },
    {
        "comment_id": "ln4yw6w",
        "subreddit": "books",
        "body": "Signed copy of the Hobbit with a fairly rare cover. Battered to bits because it was a library book in the 70s and was previously my Nanna's but I love it.",
        "time": "2024-09-14 20:11:33 UTC",
        "score": 1,
        "link_id": "t3_1fgb84i",
        "parent_id": "t3_1fgb84i"
    }
]