[
    {
        "comment_id": "lvm0hwv",
        "subreddit": "books",
        "body": "Lol me too, brother",
        "time": "2024-11-05 23:36:25 UTC",
        "score": 1,
        "link_id": "t3_1gketck",
        "parent_id": "t1_lvlyzv6"
    },
    {
        "comment_id": "lvl8t9p",
        "subreddit": "books",
        "body": "I agreed for so long and still do but someone convinced me to keep reading and now I find I will turn to these books if I just need a filler book.\n\nHarry really is a mall wizard, though, and he comes off as a character the author desperately wishes he was.",
        "time": "2024-11-05 21:13:44 UTC",
        "score": 9,
        "link_id": "t3_1gketck",
        "parent_id": "t1_lvkzr80"
    },
    {
        "comment_id": "lvl7zlf",
        "subreddit": "books",
        "body": "Don't take it off. It's such a funny book and the Mc is suppose to be despicable.",
        "time": "2024-11-05 21:09:43 UTC",
        "score": 5,
        "link_id": "t3_1gketck",
        "parent_id": "t1_lvl5jz9"
    },
    {
        "comment_id": "lu7hx1c",
        "subreddit": "books",
        "body": "In my small experience with unreliable narrators you, as the reader, start with the utmost faith in the narrator telling the story to the best of their ability. As the story goes on, though, the narrator leaves small inconsistencies that begin to erode the reads confidence. I never felt this way about Robin in Babel. Robin never came off as lying or delusional to me so if that was the intention of the author, I think she missed the mark.\n\nI'm always a bit critical of Kuang on this subreddit but I think I just realized why. Her books are pretentious, they try to be so much more than what they are. If she said Robin was suppose to be an unreliable narrator in an interview, that makes me think she's just tacking on a cool and mysterious literary device to her book.",
        "time": "2024-10-28 17:27:58 UTC",
        "score": 7,
        "link_id": "t3_1gdxxkg",
        "parent_id": "t3_1gdxxkg"
    },
    {
        "comment_id": "lu7cgji",
        "subreddit": "books",
        "body": "Don't Tell Mom I Work on the Rigs: She Thinks I'm a Piano Player in a Whorehouse by Paul Carter.\n\nI was already working on a rig when reading it but it made me want to double down on the lifestyle. It's just a collection of funny and strange stories from a offshore directional driller but very entertaining.",
        "time": "2024-10-28 17:00:55 UTC",
        "score": 2,
        "link_id": "t3_1ge53vw",
        "parent_id": "t3_1ge53vw"
    },
    {
        "comment_id": "lsp1xm7",
        "subreddit": "books",
        "body": "I read the first book and a part of the second before putting it down. It started to become apparent that the author didn't know how to handle the serious topics of the book.\n\nI was disappointed because this series is always on grimdark book lists but it's grimdark written by a 22 year old. I really like grimdark but it can't just be grotesque with a dash of mean characters and some substance abuse.",
        "time": "2024-10-19 15:14:39 UTC",
        "score": 4,
        "link_id": "t3_1g771ul",
        "parent_id": "t3_1g771ul"
    },
    {
        "comment_id": "lsoyzio",
        "subreddit": "books",
        "body": "I think Kuang lacks depth in all of her writing. I don't understand why she's as popular as she is but I suspect it's because the subject matter is interesting and her lack of subtlety makes for easy reading.",
        "time": "2024-10-19 14:57:44 UTC",
        "score": 16,
        "link_id": "t3_1g71d0w",
        "parent_id": "t3_1g71d0w"
    },
    {
        "comment_id": "ls01p3j",
        "subreddit": "books",
        "body": "You're listening to 3 books a week? I don't think anyone can help you get to 1 book a day. Mostly because the research into reading speed doesn't seem to have any definitive answers. The only solid improvement to reading speed, as far as I could tell from looking into this, was from reading more. If you read a lot more your reading speed will improve. You can't really hack your brain to read faster without reading a lot.",
        "time": "2024-10-15 06:21:25 UTC",
        "score": 1,
        "link_id": "t3_1g405rm",
        "parent_id": "t3_1g405rm"
    },
    {
        "comment_id": "lrw6lny",
        "subreddit": "books",
        "body": "I use to find myself exhausted from reading for any length of time. After lots and lots of reading, though, I now read for hours at a time. It's just something that improved over time",
        "time": "2024-10-14 16:02:50 UTC",
        "score": 1,
        "link_id": "t3_1g3fun9",
        "parent_id": "t3_1g3fun9"
    },
    {
        "comment_id": "lrl9mt2",
        "subreddit": "books",
        "body": "I realized when I was younger that I can read multiple books in the same way I can watch different tv shows. The only issue is time I set aside to read. If I'm reading a lot I'll have a book in my washroom and a book on my computer but if I'm just reading an average amount I'll have 1 or 2 books on my kindle.",
        "time": "2024-10-12 17:00:28 UTC",
        "score": 1,
        "link_id": "t3_1g1vl4i",
        "parent_id": "t3_1g1vl4i"
    },
    {
        "comment_id": "lqztzlt",
        "subreddit": "books",
        "body": "I think that's great that you can disengage with those feelings and thoughts. I do think you're side stepping my question, though, and I suspect you continue to practice creating situations in your head. In fact, I saw another comment of yours in this thread where you made an unfounded accusation of OP and when OP defended themselves you replied with something rude and dismissive.\n\nI think it best we both exercise some restraint here and move on. I wish you the best.",
        "time": "2024-10-08 20:32:26 UTC",
        "score": 2,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqzrxx0"
    },
    {
        "comment_id": "lqzq6p2",
        "subreddit": "books",
        "body": "No, I'm not arguing, I'm exploring. That's why I said it's hard for me to express why I find it weird. Since I can't assert why I'm uncomfortable with the concept we can only speak in hypotheticals. Without accusation or judgement, why do you think someone would be uncomfortable with the a person reading this kind of content in public?\n\nIf I were to do the same for you, I'd say it's not hurting anyone, what a person reads is none of anyone's business, there is no risk of accidental exposure, and there isn't necessarily any physical or emotional reaction to the content.",
        "time": "2024-10-08 20:11:17 UTC",
        "score": 2,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqzoegi"
    },
    {
        "comment_id": "lqyllbv",
        "subreddit": "books",
        "body": "Well, fair enough. Live and let live",
        "time": "2024-10-08 16:26:56 UTC",
        "score": -1,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqyld48"
    },
    {
        "comment_id": "lqyksso",
        "subreddit": "books",
        "body": "I guess it depends on what Icebreaker would be considered if it was a visual medium.",
        "time": "2024-10-08 16:22:43 UTC",
        "score": -3,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqyk9j0"
    },
    {
        "comment_id": "lqyjv5h",
        "subreddit": "books",
        "body": "Is it ok if you sit at the back of the bus with headphones in so no one can see or hear your phone?",
        "time": "2024-10-08 16:17:40 UTC",
        "score": -4,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqyje8o"
    },
    {
        "comment_id": "lqyh15p",
        "subreddit": "books",
        "body": "I have mixed feelings about it. On one hand, I feel like it is akin to watching something sexually explicit on your phone but it's not quite the same. I can't put my finger on why they aren't the same, though. None the less, it makes me feel a bit weird and I think it's also a bit strange to absolutely deny there is something weird about it. On the other hand, it's just reading and I'd rather mind my own business.",
        "time": "2024-10-08 16:02:21 UTC",
        "score": -5,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t3_1fz2l5t"
    },
    {
        "comment_id": "lqintsi",
        "subreddit": "books",
        "body": "I can safely say Steven Pacey is too talented to be negatively affected by the speed at which I listen to him.",
        "time": "2024-10-05 21:11:55 UTC",
        "score": 1,
        "link_id": "t3_1fwwz1g",
        "parent_id": "t3_1fwwz1g"
    },
    {
        "comment_id": "lqbtnrd",
        "subreddit": "books",
        "body": "The series was so great. Ideas for technologies that were so unique and interesting and the consequence of them taken to their absolute conclusion. It was a very fun read",
        "time": "2024-10-04 17:06:18 UTC",
        "score": -2,
        "link_id": "t3_1fvvy9g",
        "parent_id": "t3_1fvvy9g"
    },
    {
        "comment_id": "lpzyh07",
        "subreddit": "books",
        "body": "People are out here predetermining themes before writing? I knew people planned but that just seems like it would get in the way of writing.",
        "time": "2024-10-02 16:31:07 UTC",
        "score": 5,
        "link_id": "t3_1fug7f3",
        "parent_id": "t3_1fug7f3"
    },
    {
        "comment_id": "llocm60",
        "subreddit": "books",
        "body": "Oh, for sure. I think you're exactly right, it is about practice. Or, at least, the practice and life experience come in tandem.",
        "time": "2024-09-05 19:20:16 UTC",
        "score": 2,
        "link_id": "t3_1f94116",
        "parent_id": "t1_lln8j3j"
    },
    {
        "comment_id": "lll8wk8",
        "subreddit": "books",
        "body": "I liked Babel but felt it read like teen fiction. Then I was reading Poppy War and again felt like it was reading like teen fiction despite some of the reviews referring to the mature content of the books. It all made sense once I realized how old Kuang is. She started writing Poppy War at 19 years old and I'm assuming Babel at 23 or 24. Her writing feels immature and makes it obvious that she only understands some of the concepts of her books at a superficial level.\n\nHearing Takehiko Inoue took a break from writing Vagabond because he felt he doesn't have the life experience to continue the story has made me wonder if you do need a depth of experience to write exceptional stories.",
        "time": "2024-09-05 06:15:31 UTC",
        "score": 5,
        "link_id": "t3_1f94116",
        "parent_id": "t1_lljp262"
    },
    {
        "comment_id": "lk1gb27",
        "subreddit": "books",
        "body": "Dnf",
        "time": "2024-08-26 17:05:01 UTC",
        "score": 1,
        "link_id": "t3_1f1snw9",
        "parent_id": "t3_1f1snw9"
    },
    {
        "comment_id": "lid6uup",
        "subreddit": "books",
        "body": "I think I'd prefer 'said' to be used 90% of the time. It's concise. The exceptions might be: sung, yelled, and whispered.",
        "time": "2024-08-16 06:17:41 UTC",
        "score": 17,
        "link_id": "t3_1etgdto",
        "parent_id": "t3_1etgdto"
    },
    {
        "comment_id": "lhsq99e",
        "subreddit": "books",
        "body": "You can only cook what's in the fridge. How can you be creative when you don't fill your fridge up with creative things?\n\nHere's a question: now that you're a developer, is playing games a waste of time? Now that you're creating things are you expected to be in such an absolute creative space that you no longer pull inspiration from other people? Do writers stop reading other people's work once they start writing?",
        "time": "2024-08-12 19:54:34 UTC",
        "score": 1,
        "link_id": "t3_1eqmhvw",
        "parent_id": "t3_1eqmhvw"
    },
    {
        "comment_id": "lhrqlq5",
        "subreddit": "books",
        "body": "Easily one of the most self righteous pieces of shit I've ever read.  Lol I'm still mad about it.\n\nThough, I think her behaviour is where a lot of the \"sexism\" criticisms come from but I'm not sure if it's sexism or one glaringly horrible character. Maybe a little of both.",
        "time": "2024-08-12 16:49:57 UTC",
        "score": 3,
        "link_id": "t3_1eqdogp",
        "parent_id": "t1_lhrmbrz"
    },
    {
        "comment_id": "lhrle7s",
        "subreddit": "books",
        "body": "It was infuriating to watch her repeatedly make these choices.",
        "time": "2024-08-12 16:22:28 UTC",
        "score": 4,
        "link_id": "t3_1eqdogp",
        "parent_id": "t1_lhr0ccy"
    },
    {
        "comment_id": "lhlmnw3",
        "subreddit": "books",
        "body": "The Three Body Problem series by Liu Cixin left me thinking about time in a really weird way. This is my first time trying to verbalize it so bear with me.\n\nIt left me feeling that I had a very short time on Earth by making multiple centuries feel like a short period of time. I guess, it just made time feel very fleeting and I've been left very sad about it. I don't want to say too much about the books except they had a way of shifting my point of reference of time and I had never experienced such a big shift like that from literature.",
        "time": "2024-08-11 15:25:42 UTC",
        "score": 1,
        "link_id": "t3_1epgcex",
        "parent_id": "t3_1epgcex"
    },
    {
        "comment_id": "lf8vcq8",
        "subreddit": "books",
        "body": "Books don't cast curses. Read whatever you want",
        "time": "2024-07-27 21:25:01 UTC",
        "score": 1,
        "link_id": "t3_1ednxpa",
        "parent_id": "t3_1ednxpa"
    },
    {
        "comment_id": "lektllg",
        "subreddit": "books",
        "body": "I love self help books but I know most things said are just derivative of stoic or buddhist philosophy. Ya, I know I'm giving my money away for things I probably already know or have heard before but there is something satisfying about everyone confirming the same things.",
        "time": "2024-07-23 17:50:02 UTC",
        "score": 3,
        "link_id": "t3_1eaa17q",
        "parent_id": "t1_lek48y0"
    },
    {
        "comment_id": "leksgcz",
        "subreddit": "books",
        "body": "Trying to find fantasy book recommendations is a nightmare right now.",
        "time": "2024-07-23 17:44:05 UTC",
        "score": 6,
        "link_id": "t3_1eaa17q",
        "parent_id": "t1_lek2exh"
    },
    {
        "comment_id": "lcjbi4v",
        "subreddit": "books",
        "body": "TIL: Rothfuss and Martin are the same person",
        "time": "2024-07-10 16:53:40 UTC",
        "score": 0,
        "link_id": "t3_1dzzu0q",
        "parent_id": "t3_1dzzu0q"
    },
    {
        "comment_id": "lazg9d9",
        "subreddit": "books",
        "body": "I think the argument for the Bible being so influential is because it was so widely printed and distributed in times where books were an extreme privilege to have.",
        "time": "2024-06-30 14:50:39 UTC",
        "score": 11,
        "link_id": "t3_1ds19qb",
        "parent_id": "t1_lazfkh6"
    },
    {
        "comment_id": "laz97rv",
        "subreddit": "books",
        "body": "Oh man, the deeper you go the sadder it gets. It's some of the best writing I've ever seen for capturing feelings I've never told anyone about and didn't know other people had.",
        "time": "2024-06-30 14:06:16 UTC",
        "score": 2,
        "link_id": "t3_1drq5g3",
        "parent_id": "t1_laym1r8"
    },
    {
        "comment_id": "laxn59n",
        "subreddit": "books",
        "body": "You have similar fantasy taste for books as me. Maybe try Chainsaw Man or Jujutsu Kaisen if you want something fun, Berserk, Vagabond, or Vinland Saga if you want something a bit more serious, or Goodnight Punpun if you want to feel unbelievably sad.\n\nThe great thing about manga is how diverse the genres can be. I feel like mangaka are given a lot more freedom from their publishers to write what they want. I would think a lot of manga stories would be considered unmarketable by wester publishers.",
        "time": "2024-06-30 04:21:33 UTC",
        "score": 3,
        "link_id": "t3_1drq5g3",
        "parent_id": "t3_1drq5g3"
    },
    {
        "comment_id": "l96lj9d",
        "subreddit": "books",
        "body": "At first I had my hackles up reading this but I started thinking about it. I think you're right about men and woman seeing the world differently or, at least, are interested in different things. For me, I'm always trying to replicate the experience I had reading Joe Abercrombie's The First Law series. I can't name a single female author that writes grimdark fantasy, though, so I find I don't read a lot of female writers.\n\nThat said, when I recommend books to people, Educated by Tara Westover is always one of them. It has some of the nicest prose I've ever read. I'm also reading R. F. Kuang, I read Babel and I am currently reading The Poppy War. For whatever reason, I can tell these books were written by a woman. I don't know why, I certainly can't put my finger on it but I can feel it.\n\nI'll often put a good effort into reading anything anyone recommends me but more often than not I don't care for the books woman recommend me. My sister burned me with Forth Wing recently... lol. Maybe it's just one of those things, men and woman are different and we like different things.",
        "time": "2024-06-18 17:23:28 UTC",
        "score": 1,
        "link_id": "t3_1dii3d3",
        "parent_id": "t3_1dii3d3"
    },
    {
        "comment_id": "l8wtmht",
        "subreddit": "books",
        "body": "Oh, for sure. When the mistakes are that few, though, I don't make note of them. I've just noticed people complaining about grammar and spelling and assumed it must be frequent enough to not ignore.",
        "time": "2024-06-16 20:57:28 UTC",
        "score": 2,
        "link_id": "t3_1dh36d3",
        "parent_id": "t1_l8wmlvw"
    },
    {
        "comment_id": "l8wted4",
        "subreddit": "books",
        "body": "That makes sense. I did see a lot of encouragement a while ago for people to self publish.",
        "time": "2024-06-16 20:56:06 UTC",
        "score": 3,
        "link_id": "t3_1dh36d3",
        "parent_id": "t1_l8wl1ga"
    },
    {
        "comment_id": "l8vupnf",
        "subreddit": "books",
        "body": "I've seen this a few times now, I almost never come across spelling or grammar errors in the books I read. I keep wondering what books people are reading where these occur?",
        "time": "2024-06-16 17:20:18 UTC",
        "score": 14,
        "link_id": "t3_1dh36d3",
        "parent_id": "t1_l8ukfc1"
    },
    {
        "comment_id": "l8m7nik",
        "subreddit": "books",
        "body": "I've been reading Meditations by Marcus Aurelius. I'd like to say that I like the irony of it, profound thought goes in, shit comes out. The reality, though, is I've been waiting for a post like this so that I can brag about reading philosophy.",
        "time": "2024-06-14 18:21:36 UTC",
        "score": 3,
        "link_id": "t3_1dfqjkv",
        "parent_id": "t3_1dfqjkv"
    },
    {
        "comment_id": "l87fq6v",
        "subreddit": "books",
        "body": "Booktok convinced me to read A Court of Thorns and Roses and I learned Booktok is just a bunch of horny people. Years later, I read Fourth Wing on my sisters recommendation after she assured me the horniness wasn't the main point of the book and that \"it's actually good\". I was skeptical because I was fairly confident Fantasy Romance was just code for girl porn. I was right, she tricked me :(",
        "time": "2024-06-12 01:28:34 UTC",
        "score": 3,
        "link_id": "t3_1dco1a5",
        "parent_id": "t3_1dco1a5"
    },
    {
        "comment_id": "l87d0w8",
        "subreddit": "books",
        "body": "For me, \"this book is bad\" is when actions from characters or occurrences within the plot don't align with the reality the author has already established. On the other hand, \"this book isn't for me\" is when I recognize that the specific things I like and pursue in literature are not present. Though, the latter isn't always obvious and is prone to change through well written books.\n\nI typically like strong dialogue, bad characters doing good things or good characters doing bad things, characters striving to improve, and magic or technology that is novel and interesting. I will typically know a book isn't for me before I know it's bad if it lacks some or all of these qualities.\n\nI think, if you're going to have a discussion of whether a book is bad or just not to your taste you need to know exactly what you like and dislike about books in general.",
        "time": "2024-06-12 01:09:27 UTC",
        "score": 1,
        "link_id": "t3_1dct23u",
        "parent_id": "t3_1dct23u"
    },
    {
        "comment_id": "l878bly",
        "subreddit": "books",
        "body": "Shit, I agree with you but was giving it more credit because I thought it was young adult or teen fiction. It certainly reads that way. Goodreads has it as adult fiction but I don't think that's right. It reads like entry level fantasy.",
        "time": "2024-06-12 00:35:24 UTC",
        "score": 1,
        "link_id": "t3_1dct23u",
        "parent_id": "t1_l80fjcy"
    },
    {
        "comment_id": "hc56ti6",
        "subreddit": "books",
        "body": "Fuck... He does her voice too!!! It's obvious looking back but, man, it's seamless",
        "time": "2021-09-09 03:51:57 UTC",
        "score": 1,
        "link_id": "t3_pkbrpp",
        "parent_id": "t1_hc36w8o"
    }
]