[
    {
        "comment_id": "lv6u42h",
        "subreddit": "books",
        "body": "Yes. Genre is descriptive, not prescriptive (or proscriptive!), and this one more than most.\n\nMR is a term invented, as near as I can tell, by critics attempting to comprehend Gabriel Garcia Marquez and describe what he was doing.  \n\nIt is intersectional - it requires both a magical element *and* the grounded, familiar, relatable elements of realism. It's a bridge into both worlds. \n\nTo me, *Little, Big* is fantasy. Minus the fairies, the realism loses coherence. Likewise, *Foucault's Pendulum,* in spite of phantasmogorical interludes, is realism including irrational, but not supernatural, elements. *Bellefleur* to me hits that sweet spot right in the middle and is what I think of as magical realism. But others may describe it merely as gothic, and we could have a friendly disagreement about it over coffee.\n\nBut the term is subjective, and doesn't pretend not to be.",
        "time": "2024-11-03 15:23:14 UTC",
        "score": 4,
        "link_id": "t3_1gioxz1",
        "parent_id": "t3_1gioxz1"
    },
    {
        "comment_id": "lsvv05i",
        "subreddit": "books",
        "body": "In part, you are correct. I have little doubt that Eco was venting some of his frustrations at the absurd and counterproductive elements of Academe - he was, after all, a professor. \n\nBut he's doing so by showing the hidebound certainty of knowledge of the medieval Scholastics, as his means of cautioning against vainglory in our own learning which, ultimately, is always outstripped by what we do not know.\n\nWere the Benedictine monks of the Abbey innocents?  How do the villagers live? The monks curate a treasure-trove of learning. Are the peasants schooled, educated, informed? Abo shows William the Abbey's accumulation of jeweled wealth. Are the people in the Abbey's charge well provided-for?\n\nIt was all politicking around the replacement Librarian. By this point, only the oldest monks recalled the old controversies around Jorge and the succession. Abo got the outward prestige of office; Malachi ended up *notional* Librarian but actually Jorge's puppet. \n\nAre monks meant to squabble over prestige, prominence, and fame? \n\nAbo was indeed beyond saving once the fire was started. Before the fire was started, understanding Jorge - and saving the book - were William's priority. Had Jorge been dealt with, the mechanism to release Abo could have been repaired. \n\nIt's all fully developed, but it's related as it is because, all these years later, Adso is trying to make it make sense to him - which, since he is a medieval Scholastic, with an Aquinan understanding of the structure of the universe, it doesn't. \n\nThe real key to the novel is when (as he says, for the first and only time), Adso ventures a theological question: \n\n\"...Isn't affirming God's absolute omnipotence and His absolute freedom with regard to His own choices tantamount to demonstrating that God does not exist?\"  \n  \nAnd in William's reply:  \n  \n\"How could a learned man go on communicating his learning if he answered yes to your question?\" \n\nA very carefully balanced, safely ambiguous, Socratic response, which Adso calls out, but William declines to clarify.\n\n*The Name of the Rose* is a deconstruction of detective fiction, and exploration of its limitations and the failure of its assumptions. It wasn't written to answer questions, but to ask them.\n\nIt is a very challenging, difficult, and uncomfortable work. Like Adso, we may take time to make sense of it, or question whether it can make sense.",
        "time": "2024-10-20 18:55:12 UTC",
        "score": 78,
        "link_id": "t3_1g84w0r",
        "parent_id": "t3_1g84w0r"
    }
]