[
    {
        "comment_id": "lyv0rbf",
        "subreddit": "books",
        "body": "A House So Smoke and Shadow",
        "time": "2024-11-25 05:01:39 UTC",
        "score": 5,
        "link_id": "t3_1gyw7rk",
        "parent_id": "t1_lytsv7e"
    },
    {
        "comment_id": "lyt70pc",
        "subreddit": "books",
        "body": "I've also seen A Blank So Blank and A Blank So Blank And Blank",
        "time": "2024-11-24 22:08:20 UTC",
        "score": 17,
        "link_id": "t3_1gyw7rk",
        "parent_id": "t1_lys0pef"
    },
    {
        "comment_id": "lyt6vwp",
        "subreddit": "books",
        "body": "Bone blood smoke ash shadow flame",
        "time": "2024-11-24 22:07:36 UTC",
        "score": 34,
        "link_id": "t3_1gyw7rk",
        "parent_id": "t1_lyrtuwa"
    },
    {
        "comment_id": "lxh8my2",
        "subreddit": "books",
        "body": "Yeah. IIRC there've been incels who've had that kind of thought process.",
        "time": "2024-11-16 19:33:23 UTC",
        "score": 1,
        "link_id": "t3_1gr3l07",
        "parent_id": "t1_lx3ommi"
    },
    {
        "comment_id": "lxbhtsr",
        "subreddit": "books",
        "body": "Very. But that would involve reading the Bible to begin with",
        "time": "2024-11-15 19:59:58 UTC",
        "score": 1,
        "link_id": "t3_1gpswnm",
        "parent_id": "t1_lxbh480"
    },
    {
        "comment_id": "lxbcmyf",
        "subreddit": "books",
        "body": "Not really. But when I was reading the Lunar Chronicles, I noticed the author used \"gulp/gulped\" a lot and it started to annoy me. I have a shelf on Goodreads called \"You Keep Using That Word\" and the Lunar Chronicles ended up on it.",
        "time": "2024-11-15 19:32:57 UTC",
        "score": 1,
        "link_id": "t3_1gom7rk",
        "parent_id": "t3_1gom7rk"
    },
    {
        "comment_id": "lxbbn1u",
        "subreddit": "books",
        "body": "Their heads would explode if they read Song of Songs",
        "time": "2024-11-15 19:27:51 UTC",
        "score": 2,
        "link_id": "t3_1gpswnm",
        "parent_id": "t1_lwt9rcb"
    },
    {
        "comment_id": "lxbbkkw",
        "subreddit": "books",
        "body": "Probably because the wife puts perfume on her nips and crotch",
        "time": "2024-11-15 19:27:30 UTC",
        "score": 1,
        "link_id": "t3_1gpswnm",
        "parent_id": "t1_lwssuj1"
    },
    {
        "comment_id": "lxbbby5",
        "subreddit": "books",
        "body": "Those books are hilarious. Can't have teens laughing about relatable experiences. Can't have teens even LOOKING at the word \"thong\" either, or learning some British slang. *clutches pearls*",
        "time": "2024-11-15 19:26:19 UTC",
        "score": 2,
        "link_id": "t3_1gpswnm",
        "parent_id": "t1_lwtgvkz"
    },
    {
        "comment_id": "lxbad86",
        "subreddit": "books",
        "body": "The ACOTAR series is because of horny fairies. The first book is closer to YA but starting at the second book, there's more sex scenes on page.\n\nI read *Animal Farm* in middle school. I was too young to understand it but I went back and read it in my 20s and it blew my mind. I won't be surprised at all if *Warriors Don't Cry* ends up on the list, since it's a memoir about the Little Rock Nine.",
        "time": "2024-11-15 19:21:31 UTC",
        "score": 1,
        "link_id": "t3_1gpswnm",
        "parent_id": "t1_lwsty2u"
    },
    {
        "comment_id": "lxb8uwu",
        "subreddit": "books",
        "body": "They're really telling on themselves by banning The Handmaid's Tale",
        "time": "2024-11-15 19:13:56 UTC",
        "score": 1,
        "link_id": "t3_1gpswnm",
        "parent_id": "t3_1gpswnm"
    },
    {
        "comment_id": "lw75c3q",
        "subreddit": "books",
        "body": "So it goes.\n\nAll animals are equal but some are more equal than others",
        "time": "2024-11-09 03:51:22 UTC",
        "score": 4,
        "link_id": "t3_1glywrd",
        "parent_id": "t1_lw72oed"
    },
    {
        "comment_id": "lw5rqb7",
        "subreddit": "books",
        "body": "I won't be surprised if they come for us, tbh.",
        "time": "2024-11-08 22:49:42 UTC",
        "score": 10,
        "link_id": "t3_1glywrd",
        "parent_id": "t1_lw3p3cj"
    },
    {
        "comment_id": "lvfh5cu",
        "subreddit": "books",
        "body": "Yes it is.",
        "time": "2024-11-04 22:58:38 UTC",
        "score": 2,
        "link_id": "t3_1gh8ssc",
        "parent_id": "t1_lv7ddhu"
    },
    {
        "comment_id": "lvfgu9p",
        "subreddit": "books",
        "body": "Banned BY a local public library system? None that I'm aware of. Libraries are pretty anti-book ban. I work in a library and one of my trainings was on [Intellectual Freedom](https://www.ala.org/advocacy/intfreedom).",
        "time": "2024-11-04 22:56:57 UTC",
        "score": 2,
        "link_id": "t3_1gh8ssc",
        "parent_id": "t1_lv1b0xf"
    },
    {
        "comment_id": "lvfgg0e",
        "subreddit": "books",
        "body": "Their tiny little brains would implode if they saw what's available on Tumblr and AO3 lmao.",
        "time": "2024-11-04 22:54:48 UTC",
        "score": 1,
        "link_id": "t3_1gh8ssc",
        "parent_id": "t1_luxawfs"
    },
    {
        "comment_id": "lvfg8qd",
        "subreddit": "books",
        "body": "Hey remember that part where Noah gets tanked and passes out naked in his tent? Or that one part called the Song of Songs?\n\nYeah no neither do I /s",
        "time": "2024-11-04 22:53:42 UTC",
        "score": 1,
        "link_id": "t3_1gh8ssc",
        "parent_id": "t1_luw7p67"
    },
    {
        "comment_id": "luxatd4",
        "subreddit": "books",
        "body": "I hated the ending of *Fathomless* by Jackson Pearce. It was a cool retelling of The Little Mermaid and then >!they became werewolves for some fucking reason!<. It was such a weird twist. One could say I couldn't fathom it.\n\nI'll see myself out.",
        "time": "2024-11-01 21:37:26 UTC",
        "score": 1,
        "link_id": "t3_1gfi66h",
        "parent_id": "t3_1gfi66h"
    },
    {
        "comment_id": "luwbopj",
        "subreddit": "books",
        "body": "I work in a library as well (ASA/Page). I like that libraries host community events and that’s a way we can evolve with the times. Those still have educational and cultural value. But again I draw the line at being a resource on par with social workers/social services.\n\nI’d rather see an expansion of social safety nets that we already have, the creation of those we don’t have, housing first, things like that to take the pressure off libraries. It comes across as a failure of society to put those responsibilities onto library staff.\n\nWe shouldn’t have to justify the existence of a library’s space by doing things we have no business doing. Do we have to justify the existence of a park? Do we have to justify the existence of a community center? So why libraries?\n\nAt most we should be telling people where to find the services they need, and putting pressure on our government to step up and help the people.",
        "time": "2024-11-01 18:29:51 UTC",
        "score": 27,
        "link_id": "t3_1gh3474",
        "parent_id": "t1_luw8r0l"
    },
    {
        "comment_id": "luw9ttw",
        "subreddit": "books",
        "body": "This is because of a lack of social safety nets and housing first, and governments turning to libraries to fix these problems. As someone who works in a library, I think library leadership needs to push back on this and put pressure on local governments to address the problem. We need more day shelters, we need more social safety nets where there aren’t any and to expand what’s already there. We also need housing first and more third spaces.\n\nI hate hearing people call library staff heroes. Libraries are important and I’m proud of that, but I don’t think we’re heroes. Calling us that feels like an easy way to put us on a pedestal, ignore what we need, and to justify making us responsible for stuff that isn’t our job.",
        "time": "2024-11-01 18:20:12 UTC",
        "score": 9,
        "link_id": "t3_1gh3474",
        "parent_id": "t1_luuqv3a"
    },
    {
        "comment_id": "luw59qb",
        "subreddit": "books",
        "body": "I work in a library and went back to school for a career change because I couldn’t handle this anymore. It’s soul-sucking. I just wanted to work with books, not worry about getting assaulted by someone because our local government decided to push the problems THEY should be solving onto US.",
        "time": "2024-11-01 17:56:29 UTC",
        "score": 67,
        "link_id": "t3_1gh3474",
        "parent_id": "t1_luuhtzu"
    },
    {
        "comment_id": "luw4q9c",
        "subreddit": "books",
        "body": "Libraries are educational institutions. A line has to be drawn between what we do and don’t do, and adjusting with the times doesn’t have to include becoming social services. That’s not our job and never should have been in the first place.",
        "time": "2024-11-01 17:53:42 UTC",
        "score": 45,
        "link_id": "t3_1gh3474",
        "parent_id": "t1_luw2r7o"
    },
    {
        "comment_id": "ltxeu1u",
        "subreddit": "books",
        "body": "Yeah I read prologues. The one time I read an intro/Author's word without it being assigned in class was when it was Stephen King's introduction to Carrie back in 2004. Otherwise, I choose not to because it just comes across as whoever writing it jerking off the author or just talking about stuff I don't think I'll actually care about until I've read the work.",
        "time": "2024-10-26 23:19:50 UTC",
        "score": 1,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "lsrt205",
        "subreddit": "books",
        "body": "I work in a library, so my books are alphabetized and in a bit of a dewey decimal run.\n\nFiction books are alphabetized by genre, and within genre (Classics --> Horror --> Romance --> SciFi, etc) by author's last name. If the books are in a series, then they're in series order. If multiple authors have the same last name, then that is further alphabetized by author's first name. My YA books are separated from my adult books. They're also alphabetized like my adult books are, except not sorted by genre.\n\nMy nonfiction was in a rough dewey decimal before my partner and I moved into our new apartment but I never got around to doing that. Whenever I get around to organizing those, I won't have them in Dewey order but instead alphabetized by subject.\n\nOur graphic novels are kept together, with manga and western graphic novels separate. Those aren't alphabetized.\n\nAlphabetizing > color is a hill I am ready to die on.",
        "time": "2024-10-20 00:52:48 UTC",
        "score": 1,
        "link_id": "t3_1g4yf39",
        "parent_id": "t3_1g4yf39"
    },
    {
        "comment_id": "lsrrumx",
        "subreddit": "books",
        "body": "*House of Salt and Sorrows* by Erin A. Craig\n\n*What Moves the Dead* by T. Kingfisher\n\n*She is a Haunting* by Trang Thanh Tran",
        "time": "2024-10-20 00:45:07 UTC",
        "score": 1,
        "link_id": "t3_1g6r334",
        "parent_id": "t1_lsls9uf"
    },
    {
        "comment_id": "lrynz98",
        "subreddit": "books",
        "body": "I loves me some trash, but I won't read mafia or bully romances. I can't imagine falling in love with someone who's done nothing but torment you, nor am I comfortable with books romanticizing organized crime when it has done real-world harm to people. I can turn my brain off with plenty of things but that.\n\nI also won't do enemies-to-lovers when the dynamic is a white supremacist and BIPOC because it comes across as making the oppressed party responsible for reforming their oppressor. I also don't buy the white supremacist actually being reformed when it took falling in love with someone to make them realize that person is, y'know, an actual human being. You can't fuck away racism. Same with romances where it's a liberal and a conservative. It's just the white supremacist/BIPOC dynamic, but more palatable for audiences who are privileged enough to have the \"we can agree to disagree\" stance. As a black woman, I can tell you that there is no agreeing to disagree when it comes to the rights for marginalized people to exist, and I don't want that bullshit in my romance.",
        "time": "2024-10-15 00:12:56 UTC",
        "score": 3,
        "link_id": "t3_1g36fky",
        "parent_id": "t3_1g36fky"
    },
    {
        "comment_id": "lqzzv1b",
        "subreddit": "books",
        "body": "I’ve already started making a list of authors who use AI for their covers and their ad campaigns. I’ve noticed AI often has this weird “glossy” look. More and more recently it has a blurry background while the person in the foreground isn’t blurry. There’ll still be mistakes in things like hands or other parts of the body but I think this is less common now than it used to be. Look up the author Layla Fae. They use AI on their covers.",
        "time": "2024-10-08 21:05:34 UTC",
        "score": 2,
        "link_id": "t3_1fym1np",
        "parent_id": "t1_lqvfspw"
    },
    {
        "comment_id": "lqzz8rb",
        "subreddit": "books",
        "body": "I think it’s the publisher, but if an author is self-published they’re the one who has control over the cover.",
        "time": "2024-10-08 21:01:57 UTC",
        "score": 2,
        "link_id": "t3_1fym1np",
        "parent_id": "t1_lqvt4k0"
    },
    {
        "comment_id": "lqveajl",
        "subreddit": "books",
        "body": "I refuse to read books with Generative AI covers, both because use of GenAI is unethical and because I suspect the author has probably used GenAI to write the book if they’re fine with using it for their covers. I’m already making a list of authors I’ve seen using it so I can avoid giving them my money.",
        "time": "2024-10-08 01:16:50 UTC",
        "score": 35,
        "link_id": "t3_1fym1np",
        "parent_id": "t1_lqv43em"
    },
    {
        "comment_id": "lqho9cv",
        "subreddit": "books",
        "body": "There were Christians in my history of the New Testament class and we were taught this. They didn’t seem that upset.",
        "time": "2024-10-05 18:00:28 UTC",
        "score": 7,
        "link_id": "t3_1fwlyuj",
        "parent_id": "t1_lqgjjqb"
    },
    {
        "comment_id": "lm0emaf",
        "subreddit": "books",
        "body": "I've seen the tropification too. Like...with short-form content, I can see where it works to include some of the tropes in a book, especially where there's specific tropes in the romance genre that people go for. But with BookTube, they're not confined to such a short amount of time anymore; they can actually go more in-depth than \"Here's the trope, here's some titles that have it\". \n\nBut, as both a writer and a reader, I don't think books should be narrowed down to just their tropes. There's more to a book than that--things like plot and character are just as important in a compelling story as tropes. I love the fake dating trope, for example, but I'm not going to be into a fake dating story if it doesn't make sense for the characters to be in that kind of arrangement.\n\nUltimately I think that, now that BookTok is popularizing certain types of books, tropes are just on more people's radars and we're just seeing what that looks like. I don't think well-written stories are going anywhere.",
        "time": "2024-09-07 20:48:45 UTC",
        "score": 5,
        "link_id": "t3_1fb5qy6",
        "parent_id": "t3_1fb5qy6"
    },
    {
        "comment_id": "lm0cgdw",
        "subreddit": "books",
        "body": "*The Girl Who Fell Beneath The Sea* made me cry when I figured out who the children helping the heroine were. Sometimes I still tear up thinking about it.\n\n*A Duet With The Siren Duke* because of Ilryth's kindness toward Victoria in one particular scene. She escaped an abusive marriage and was basically made to feel like shit ever since then, so having Ilryth show up and tell her that she's still a good person and worthy of being loved and treated with kindness just hit me hard, especially since I've had similar self-image issues as her when I was growing up.",
        "time": "2024-09-07 20:36:27 UTC",
        "score": 2,
        "link_id": "t3_1fb6n6f",
        "parent_id": "t3_1fb6n6f"
    },
    {
        "comment_id": "lkx283k",
        "subreddit": "books",
        "body": "Sometimes I read notoriously bad books just so I can see for myself how bad it is. I've got Fifty Shades on the same shelf as Frankenstein hahaha",
        "time": "2024-09-01 00:44:04 UTC",
        "score": 5,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lku2n6v"
    },
    {
        "comment_id": "lkx1vpo",
        "subreddit": "books",
        "body": "Salve!",
        "time": "2024-09-01 00:41:47 UTC",
        "score": 1,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lksmu54"
    },
    {
        "comment_id": "lkptd0g",
        "subreddit": "books",
        "body": "Beautiful. I might have to steal this.",
        "time": "2024-08-30 18:58:20 UTC",
        "score": 2,
        "link_id": "t3_1f2403y",
        "parent_id": "t1_lk6cw6f"
    },
    {
        "comment_id": "lkpt0d7",
        "subreddit": "books",
        "body": "My dad has a rule that if a woman could have shared a lunch table with me when I was in grade school, then he won't date her.",
        "time": "2024-08-30 18:56:27 UTC",
        "score": 1,
        "link_id": "t3_1f2403y",
        "parent_id": "t1_lk4bsiv"
    },
    {
        "comment_id": "lkprgmc",
        "subreddit": "books",
        "body": "I expected to hate *Everneath* but ended up loving it. I breezed through the entire trilogy.",
        "time": "2024-08-30 18:48:08 UTC",
        "score": 1,
        "link_id": "t3_1f31znw",
        "parent_id": "t3_1f31znw"
    },
    {
        "comment_id": "leh0r61",
        "subreddit": "books",
        "body": "The only time I found this grating was when I was reading the book *Oh My Goth* back in high school and the Sidekick phone kept getting mentioned in a way that sounded almost like product placement. (The book was published by MTV so I wouldn't be surprised if that was the case.) It was especially grating because it ended up being important to the plot. By the end of the book I was so annoyed that I ended up not wanting one.\n\nAside from this I don't really care about modern references. Maybe it dates the book but I don't see that as really being detrimental to the plot.",
        "time": "2024-07-23 00:54:01 UTC",
        "score": 1,
        "link_id": "t3_1e8l4js",
        "parent_id": "t3_1e8l4js"
    },
    {
        "comment_id": "legzf3a",
        "subreddit": "books",
        "body": "If a title or cover intrigues me, I'll check out the summary. I read a lot of horror and fantasy so I see covers as a sort of shorthand for the genre. If there's only positive reviews but no summary, then I won't read the book.\n\nRight now I'm going through the books I own and only reading the ones I haven't read yet because I have a lot of books and need to downsize. When I finish a book, I flip it around on my shelf so that the pages are showing. I specifically have two stacks of books next to my bed that I'm working through at the moment. One of those stacks is a bunch of books from my TBR that my boyfriend got me for Christmas. I didn't expect him to get me all the books on the list I gave him! Hahaha!\n\nSince I'm a writer, sometimes I'll read books similar to whatever project I'm working on as a way to research the genre. I try to be careful when I do this though so I don't accidentally end up writing something too similar to what I'm reading.\n\nIf it's specifically from my shelf, it's just whatever looks the most interesting. Sometimes it's one I've been meaning to get to for awhile but just haven't had the chance to yet because of whatever else I'm reading.",
        "time": "2024-07-23 00:45:29 UTC",
        "score": 1,
        "link_id": "t3_1e8w4fh",
        "parent_id": "t3_1e8w4fh"
    },
    {
        "comment_id": "l9nmtul",
        "subreddit": "books",
        "body": "They just ran face-first into the point and still don't get it. Bravo.",
        "time": "2024-06-21 18:57:58 UTC",
        "score": 2,
        "link_id": "t3_1ddhatz",
        "parent_id": "t3_1ddhatz"
    },
    {
        "comment_id": "l9k1xus",
        "subreddit": "books",
        "body": "Fourth Wing took me out when they said “for the win”. Up until that point I’d assumed it was set in generic pseudo-middle-ages Fantasyland, so it was jarring to see a character use a phrase me and my friends were saying back in high school.\n\nI’ll stop reading a book if I learn they don’t use quotation marks, whether they go with something else or just don’t use anything. It’s an annoying stylistic choice that usually makes no sense (the exception being *A Step From Heaven* because it distinguishes between the characters speaking English or Korean) and just serves to make the author look like they think they’re more artsy/clever/creative than they really are.",
        "time": "2024-06-21 02:00:42 UTC",
        "score": 3,
        "link_id": "t3_1dknum8",
        "parent_id": "t3_1dknum8"
    }
]