[
    {
        "comment_id": "lyf0rov",
        "subreddit": "books",
        "body": "The order-and-collect web page of a bookstore close to you, also spares you from messing with deliveries. In many cases, they will be able to retrieve almost any book that has a ISBN.",
        "time": "2024-11-22 14:12:23 UTC",
        "score": 2,
        "link_id": "t3_1gx23mz",
        "parent_id": "t3_1gx23mz"
    },
    {
        "comment_id": "lwzt0su",
        "subreddit": "books",
        "body": "Hmm, I think I didn't come across when I said that AI is irrelevant, my point is that if you're against copyright to begin with there's no point talking about AI, since anything I say about copyright can be dismissed by just 'copyright bad'.",
        "time": "2024-11-13 22:40:04 UTC",
        "score": 1,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_lwywh4f"
    },
    {
        "comment_id": "lwyijrd",
        "subreddit": "books",
        "body": "Given that we still live in a world where people need money to survive, making art profitable helps people make more art than having absolutely no copyright at all. If you want to argue against all copyright that's fine, but in that case AI is entirely irrelevant since those concerns are related to copyright as it exists IRL. Ireland has a pilot program of a kind of UBI for artists, for an example of an alternative (this would cost enormously more money).\n\nBesides, I don't think making a distinction between physical persons and computers is an especially 'huge' extension of copyright law.",
        "time": "2024-11-13 18:42:51 UTC",
        "score": 1,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_lwyhscl"
    },
    {
        "comment_id": "lwyh1gp",
        "subreddit": "books",
        "body": "Maybe we should start making a difference between computers and humans, given that they are not, in fact, the same thing, and that the whole point of copyright is to allow people to make more art.\n\nThis is an example of a copyright extension that would benefit small creatives far more than doing nothing, since small creatives are not computers.\n\nWe should be careful about extending copyright mindlessly like we did for Disney, but this doesn't mean copyright cannot be reformed. Hell we might even be able to sneak in a reduction in total protection time in exchange for stronger protections from data use, that would be nice for a change.",
        "time": "2024-11-13 18:35:18 UTC",
        "score": 1,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_ltl2994"
    },
    {
        "comment_id": "lwygbnd",
        "subreddit": "books",
        "body": "This is roughly what some people are advocating already. The part of art that won't die in this view is making things just for the heck of it, as a hobby exclusively, but of course no one will ever read them, since there will be an infinite amount of free CG work.\n\nA world where artists make art for nobody, and people consume art made by nobody. To me that sounds like a dystopia, but what do I know.",
        "time": "2024-11-13 18:31:43 UTC",
        "score": 1,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_ltjw2dw"
    },
    {
        "comment_id": "lwyf4k1",
        "subreddit": "books",
        "body": "One more reason to mandate data transparency. It's kind of crazy if you think about it that corporations are pushing to use this for things like medical applications, while telling us we can't know what's in it.",
        "time": "2024-11-13 18:25:43 UTC",
        "score": 1,
        "link_id": "t3_1g7cx2t",
        "parent_id": "t1_lspkx4u"
    },
    {
        "comment_id": "lwye3kh",
        "subreddit": "books",
        "body": "It's not that black and white, for example current EU data scraping laws specifically state that it is illegal if an opt-out has been communicated. In my view this is generally ridiculous and data use should be opt-in (same as GDPR), but as long as this is going to be the law, it gives a kind of weird legal backing to these statements. Tech corporations have long argued that opt-outs are a sufficient data control method anyways, so they should have expected this.",
        "time": "2024-11-13 18:20:33 UTC",
        "score": 1,
        "link_id": "t3_1g7cx2t",
        "parent_id": "t1_lsradob"
    },
    {
        "comment_id": "lnmgjml",
        "subreddit": "books",
        "body": "I think this should also include all the indirect CO2 emissions from running and handling extremely extensive DRM and always-on crypto-locks, not just for piracy, but also for locking down the ecosystem. Those are not incurred if you print paper.",
        "time": "2024-09-17 19:56:57 UTC",
        "score": 1,
        "link_id": "t3_1fivcgf",
        "parent_id": "t1_lnk0b6l"
    },
    {
        "comment_id": "lm7egek",
        "subreddit": "books",
        "body": "Yeah, I'd actually argue books have this problem less than other media, because books are certainly easier to make (in pure market-capital terms) than a 100M series even a 10M simple movie.",
        "time": "2024-09-09 00:36:17 UTC",
        "score": 1,
        "link_id": "t3_1fbyr71",
        "parent_id": "t1_lm49crq"
    },
    {
        "comment_id": "llj3ncm",
        "subreddit": "books",
        "body": "Yeah but man, Internet entities really need to stop doing this 'we are just like -far more regulated and specific case- except on the Internet which is somehow just the same' meme, both commercial and charitable.\n\nArchival and reproduction by libraries with well-formed inter-library loan systems and the pretty significant rules that are written in that text cannot really be equated to just fully opening up your archive to everyone at all times.\n\nI really don't like this kind of yeah dude, everything is everything, kind of approach to arguing the law. Digital, Physical, Internet, Offline, Online, Controlled, Open, these are all different things that need to e treated as such.\n\nCopyright law and our governments deserve a lot of blame of course, since they still insist on never updating copyright for the modern age and divining what the rules should be from that 1800s conference or whatever.",
        "time": "2024-09-04 21:20:26 UTC",
        "score": 21,
        "link_id": "t3_1f92cyp",
        "parent_id": "t1_llipn97"
    },
    {
        "comment_id": "llj2qef",
        "subreddit": "books",
        "body": "Also, it's the way authorized digital lending roughly works already.\n\nIf you were able to do smart governance (haha), you might use the previous state of things as an opportunity to regulate the CDL system a little so that buying a CDL license didn't often cost a preposterous amount of money, which libraries really struggle with; you'd just equate it to the cost of one (1) copy of the book instead.\n\nThis was a huge mistake for everyone.",
        "time": "2024-09-04 21:13:55 UTC",
        "score": 23,
        "link_id": "t3_1f92cyp",
        "parent_id": "t1_llir5eh"
    },
    {
        "comment_id": "llj2ers",
        "subreddit": "books",
        "body": "Yeah also, publishers have levied lawsuits against AI corporations. It's not like they're happy with that one, either.\n\nI really hate having to on the side of the company here, but the choice to just open up everything from a status quo that was already somewhat grey was a huge faux pas.",
        "time": "2024-09-04 21:11:41 UTC",
        "score": 29,
        "link_id": "t3_1f92cyp",
        "parent_id": "t1_llipvc6"
    },
    {
        "comment_id": "llj1arc",
        "subreddit": "books",
        "body": "In this context I think it's clear that the topic is generative AI as in point 1, and it's also clear to NaNoWriMo given their talk about how disabled people with certain 'brains' 'require outside help', apparently.\n\nBut yeah, the industry has done an excellent job muddying that term since even my washing machine is said to have 'AI', by which the company apparently means that it counts the number of times a program is run and then sorts them based on that in the interface (I'm not kidding, and it's literally just worse).",
        "time": "2024-09-04 21:04:17 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llj13o7"
    },
    {
        "comment_id": "llisv5g",
        "subreddit": "books",
        "body": "Meanwhile the suggestion tool in Microsoft tools is still atrocious. I don't know why, but it keeps telling me to replace commas with columns, even when there's only a single level to the entire sentence.",
        "time": "2024-09-04 20:19:02 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llgwccn"
    },
    {
        "comment_id": "llis7ne",
        "subreddit": "books",
        "body": "People who pay tons of editors tons of money to make whatever they wrote into an amazing book and trounce the competition, which is definitely a well-known and highly effective path to success in publishing.\n\n^^^/s",
        "time": "2024-09-04 20:15:40 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llftr52"
    },
    {
        "comment_id": "llirrpt",
        "subreddit": "books",
        "body": "How do they work? You speak a prompt and they convert it into a text response like ChatGPT does? Because in that case you are not describing speech-to-text, it's just a ChatGPT frontend with a voice interface.\n\nIf they just use a GPT at the technical level but their actual function is speech-to-text, I don't think anyone cares since the discussion here is obviously about functional generative AI.",
        "time": "2024-09-04 20:13:26 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llho2b1"
    },
    {
        "comment_id": "llirgg6",
        "subreddit": "books",
        "body": "The disability argument is especially weird because writing is literally one of the most practicable creative outlets for disabled people, especially with - ironically enough - the variety of technological aids that allow writing without having to use normative (is that the magic word?) motor skills... you know, by letting you put words on a page, not by replacing you and then wearing your name as a skin-suit.",
        "time": "2024-09-04 20:11:48 UTC",
        "score": 6,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llfv9pp"
    },
    {
        "comment_id": "lliqd7d",
        "subreddit": "books",
        "body": "Even regardless of whether you like or dislike gen-AI, these are just incredibly weird, borderline nonsense points to make in general.\n\nIf your concern is 'classism' over paying editors, it's a pretty well-known issue that you cannot get commercially edited into success and probably not even into good writing. Sometimes paid editing is considered an outright scam. And if you were really that concerned, you'd just make it against the rules, as paid editors are an advantage over ChatGPT still.\n\nWhat they call 'ableism' is literally just, like, doing things, and alongside complaining about minorities being unfairly treated as a justification (I wonder if there might be an actual systemic solution that...), it reads like the parody of a 'SJW' that a right-wing commentator would make.\n\nIf they simply wanted to 'not categorically condemn AI', basically all they had to say was something like *\"We believe in the end, it's the use of technology we make that matters and certainly we can find legitimate uses for this one, so while we do not categorically categorically condemn AI, we also encourage everyone to use these systems responsibly in the course of writing their novel for the month.\"*",
        "time": "2024-09-04 20:06:08 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llft1b7"
    },
    {
        "comment_id": "llip09g",
        "subreddit": "books",
        "body": "Also, some types of projects go in design freeze in December for release early the following year.",
        "time": "2024-09-04 19:59:03 UTC",
        "score": 1,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llg1luf"
    },
    {
        "comment_id": "lliorzp",
        "subreddit": "books",
        "body": "I remember reading the term YAOAIW in a tech space, \"Yet Another OpenAI Wrapper\".\n\n1. Buy license to call GPT-4 over their API\n2. Add cheapo extras on your end of things that barely do anything\n3. Claim to have invented revolutionary AI secret sauce\n4. Sell to people for an insane surcharge over the API fees",
        "time": "2024-09-04 19:57:51 UTC",
        "score": 3,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llglqri"
    },
    {
        "comment_id": "lf3oed5",
        "subreddit": "books",
        "body": "Yeah, I think there's a strong argument that research should be entirely open (perhaps with something like a viral license), unless it is truly privately-funded. Selling it to the private sector for pennies so they can productize it for billions always seemed like a terrible deal, it should remain to all of us anyways and get more funding to compensate. Even better, have the public sector finish the development so the end product can also become open.",
        "time": "2024-07-26 21:58:31 UTC",
        "score": 1,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_lf3na95"
    },
    {
        "comment_id": "lf3iebv",
        "subreddit": "books",
        "body": "Small point of note: final AI models do not retain any copies, but copying the original sources *is* required to construct the dataset, unless you have somehow found a way to perform machine learning on hyperlinks and ISBNs. Copying is normally a copyright violation (except for extremely trivial things such as displaying it in a browser and so), for example, the 2019 EU scraping allowances specifically require material scraped for most purposes to be acquired through the legal avenues as well.\n\n> Copyright in general is BS and was never designed to protect individual creators but instead heavily favors powerful corporations, it really needs a severe overhaul - but IMO researchers and others should be excited by AI taking this into as it should eventually lead to a higher capability AI that could help researchers in their work and propel our technological and scientific discovery forward. \n\nI think if we want to discuss getting rid of copyright and replacing with something else (trillion-dollar arts and research subsidies?) that's fair, but the reason why everyone is mad is that this is the *opposite* of what is happening: copyright is still in full force for the rest of us even in far more benign and trivial cases (someone mentioned that guy who got obliterated for copying some unprinted research), whereas it seems that AI corporations are the only ones that have been granted such little scrutiny.",
        "time": "2024-07-26 21:23:01 UTC",
        "score": 1,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_lese46o"
    },
    {
        "comment_id": "lf3hce2",
        "subreddit": "books",
        "body": "Free access should be viral, like GPL. You have unlimited free access as a physical person for personal use only. Using any more of that access should result in all further work automatically becoming open-access in the same way too. Wouldn't prevent you from doing anything, but you would be expected to share alike.",
        "time": "2024-07-26 21:16:55 UTC",
        "score": 1,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_leqcq0a"
    },
    {
        "comment_id": "lf3g8t4",
        "subreddit": "books",
        "body": "In this case it appears Microsoft actually bothered to buy the rights, but this is a minority occurrence, and your example shows the insane hypocrisy of the law. Just as with art and books: you copy an item to help penniless college kids, you're a criminal; you copy it, use it, dataset it, mulch it, privatize the knowledge that can be learned from it to make a for-profit model for others to buy, you're an innovator.\n\nCorporations can't have it both ways. Either we decide that a lot of copyright gets in the way of stuff including AI and we agree it all belongs to everyone (which would include those proprietary AI models and, of course), or they get in line and pay up same as the rest of us - or get obliterated by the government.",
        "time": "2024-07-26 21:10:40 UTC",
        "score": 1,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_leqazfc"
    }
]