[
    {
        "comment_id": "lzrug5r",
        "subreddit": "books",
        "body": "Ah, i see. It happens. No worries.",
        "time": "2024-11-30 21:26:19 UTC",
        "score": 2,
        "link_id": "t3_1h29i0p",
        "parent_id": "t1_lzru9tk"
    },
    {
        "comment_id": "lzrqxh7",
        "subreddit": "books",
        "body": "This isn’t to jump on the train but you entered a conversation that was tagged with a spoiler warning. You should expect everything within to also potentially be a spoiler. I agree it doesn’t matter when something comes up but you can’t expect spoiler free when it’s directly labeled as the opposite.",
        "time": "2024-11-30 21:06:19 UTC",
        "score": 2,
        "link_id": "t3_1h29i0p",
        "parent_id": "t1_lzibsfy"
    },
    {
        "comment_id": "lyyt9m5",
        "subreddit": "books",
        "body": "I’ll always finish them. I hated “the road” by Cormac McCarthy for most of the time reading it. I was baffled that it was considered great literature. By the time I finished it, I understood why and I’m glad I read it. I’ll probably re-read it someday. \n\nOn the other hand, I’m currently reading “dance of thieves” and oh my god. I wanna DNF it so bad. But I’m sure there’s something in there for me to learn. Even if it’s to say “I never wanna write like that”. + then I can defend my dislike for it.",
        "time": "2024-11-25 20:56:34 UTC",
        "score": 1,
        "link_id": "t3_1gyp1w3",
        "parent_id": "t3_1gyp1w3"
    },
    {
        "comment_id": "lxhw7iu",
        "subreddit": "books",
        "body": "I’m like this. I totally see it like a movie, the environment is top tier, but I don’t assign appearance to the characters unless there’s description of it.\n\nSort of like my inner monologue. It doesn’t actually have a sound and yet I can still hear it. No voice. But innate understanding somehow?",
        "time": "2024-11-16 21:42:00 UTC",
        "score": 36,
        "link_id": "t3_1gsx2m9",
        "parent_id": "t1_lxhsy4t"
    },
    {
        "comment_id": "lwbysh0",
        "subreddit": "books",
        "body": "The only time I will read digitally is fanfic. Everything else i want a physical copy for. I like the act of sitting down to read an actual book. I also enjoy the smell they have. I also enjoy keeping them on my shelves to be reminded of good times. It’s a quick way to re-visit something, especially if I’m having a difficult day.",
        "time": "2024-11-10 00:01:24 UTC",
        "score": 2,
        "link_id": "t3_1gnhwvo",
        "parent_id": "t3_1gnhwvo"
    },
    {
        "comment_id": "lvyt3yf",
        "subreddit": "books",
        "body": "I don’t. I usually finish it so I can defend my distaste for it but also so that I saw it through and I learned everything I could from it. What I don’t like. What I won’t write. What they did right that I could use. Maybe they describe environments well. Maybe they have great character arcs even if I don’t like the plot etc. Even if the story isn’t for me there’s something to be gained.",
        "time": "2024-11-07 21:15:55 UTC",
        "score": 5,
        "link_id": "t3_1gm09hg",
        "parent_id": "t3_1gm09hg"
    },
    {
        "comment_id": "ltizwrr",
        "subreddit": "books",
        "body": "I’ll admit, I’m not well versed with how triggers work for people as I do not have any myself, I’m simply going off of what I’ve personally seen people say and what they’ve told me. I could be wrong. \n\nWhat they were saying, If memory serves, was that seeing a trigger warning for the trauma they had experienced, put them back into that place of the trauma. So sometimes it would trigger an event - sometimes only after multiple exposures online. From the words themselves not the material. So they requested that the word be changed to a code word or abbreviated so they wouldn’t have to see the words describing their traumas. But if that was the case that code word would have to be changed periodically which isn’t applicable for printed materials.\n\nLike I said, I have nothing against trigger warnings. I question their usefulness and how they affect people, but given that I’m not an expert I choose a fairly neutral position. If a compromise can be met where the people who want them can get them and benefit and the ones who don’t want them don’t have to see them, that’s a win/win in my book.\n\nI think a 3rd party option would be optimal because then people could outright exclude certain terms and never have to engage with them. But I also understand the argument of having to seek something like that out.",
        "time": "2024-10-24 15:35:07 UTC",
        "score": 2,
        "link_id": "t3_1gb05s1",
        "parent_id": "t1_ltimc9p"
    },
    {
        "comment_id": "lthzo6v",
        "subreddit": "books",
        "body": "I don’t personally take issue with trigger warnings but imo they should only be inside the book and on the last pages of the book - because I do actually think trigger warnings spoil the story.\n\nNow, it’s true, just like you said, that it merely mentions a topic. Not who it affects or how it manifests. But now I know that it’s going to happen and it’s subconsciously in the back of my mind the entire time I’m reading and not in a way where it makes me excited to read further.\n\nLike when is it going to happen? Who is it happening to? How will it be handled? I don’t want these questions. They’re genuinely distracting. \n\nAlso, I read The Road by Cormac McCarthy last year. The scenes that made that book have impact and made me sit up and consider what had just happened - basically what made it land - was effective because I didn’t know it was going to happen and it would have 100% been a trigger warning. That trigger warning would have softened the blow so much that it wouldn’t have had any impact at all.\n\nBut that’s not to say that people shouldn’t be able to access trigger warnings for books if they want them. That’s fine. I understand why some feel they need them (although I do believe there’s an argument to be made that trigger warnings become triggering. It was discussed that it was happening on twitter some years ago where they had to change the words for the trigger warnings because the warning became triggering as well. So I take the whole thing with a grain of salt. I accept it as a courtesy toward others who could be in vulnerable situations, rather than a scientifically proven effective tool). \n\nJust make it something a reader has to opt in to. Don’t expose me to it if I don’t want to see it. Because that can’t be undone.",
        "time": "2024-10-24 12:06:49 UTC",
        "score": 51,
        "link_id": "t3_1gb05s1",
        "parent_id": "t3_1gb05s1"
    },
    {
        "comment_id": "lrju45j",
        "subreddit": "books",
        "body": "I read it last year and i almost stopped bc i didn't like the way he wrote either. I finished and i have no regrets. I cried. At some points i had to put the book down and really consider what had just happened. This year, I saw someone say that his writing in The Road reflects the bleakness of the world and the characters. It gave me a different appreciation for it, even though i'd never write like that myself. It's worth the read either way imo.",
        "time": "2024-10-12 11:27:31 UTC",
        "score": 10,
        "link_id": "t3_1g1vfsk",
        "parent_id": "t1_lrjodwc"
    },
    {
        "comment_id": "lrcl13n",
        "subreddit": "books",
        "body": "I feel like this has become more popular as social media and book discussions and recommendations have become more popular. The readers who engage in that often also read a lot of fanfics, and fanfics, while I’ve read and loved many, are over tagged like crazy. The smallest thing will be tagged and it ends up in categories it either shouldn’t be in or it has so many tags there’s hardly any point in reading it. It’s starting to apply to books too because the online peeps are the ones that promote the books as that’s where many of the customers are.",
        "time": "2024-10-11 01:53:16 UTC",
        "score": 6,
        "link_id": "t3_1g0izhz",
        "parent_id": "t3_1g0izhz"
    }
]