[
    {
        "comment_id": "lvheg15",
        "subreddit": "books",
        "body": "The First Heretic by Aaron Dembski-Bowden\n\nIt’s a book set in Warhammer 40k universe. Author describes how whole legion of super soldiers fall into chaos. There are things that you would expect to see in demonic cult but the protagonist is written in such a way that it is impossible not to like him. He questions many times what they are doing but at the end always stays loyal to his legion.\n\nIt’s my favorite book. It’s amazing",
        "time": "2024-11-05 06:13:38 UTC",
        "score": 3,
        "link_id": "t3_1gjvtk8",
        "parent_id": "t3_1gjvtk8"
    },
    {
        "comment_id": "lvesoq0",
        "subreddit": "books",
        "body": "Added to my list",
        "time": "2024-11-04 20:52:10 UTC",
        "score": 1,
        "link_id": "t3_1gjbky0",
        "parent_id": "t1_lve10c3"
    },
    {
        "comment_id": "lvbxfuw",
        "subreddit": "books",
        "body": "Finished - Solaris by Stanisław Lem\n\nStarted - Prayers to Broken Stones by Dan Simmons (so far so good)\n\nI didn’t enjoy Solaris but really loved Hyperion and Endymion books so I’m coming back to Simmons. Next will probably be Ilium and Olympus",
        "time": "2024-11-04 11:22:31 UTC",
        "score": 3,
        "link_id": "t3_1gjbky0",
        "parent_id": "t3_1gjbky0"
    },
    {
        "comment_id": "lv5aj7i",
        "subreddit": "books",
        "body": "I just started reading after my first reply. With the books I don’t enjoy much I always tell myself “maybe it will get better” and finish it but now you’re making me questioning if I even want to do that. I’ll try but it’s like you said no need to force anything.",
        "time": "2024-11-03 07:37:14 UTC",
        "score": 0,
        "link_id": "t3_1gi2csb",
        "parent_id": "t1_lv58sra"
    },
    {
        "comment_id": "lv57s5i",
        "subreddit": "books",
        "body": "That’s exactly how I feel about this book. I’m currently reading it (about 80 pages left) and it’s a slog. I’m planning to finish it today and just forget about it tbh. I love sci-fi and heard a lot of great things about this book and I’m so disappointed, guess it’s just not for me 🤷‍♂️",
        "time": "2024-11-03 07:05:37 UTC",
        "score": 0,
        "link_id": "t3_1gi2csb",
        "parent_id": "t3_1gi2csb"
    }
]