[
    {
        "comment_id": "lzd1lt5",
        "subreddit": "books",
        "body": "Same. I think it's fine that it's available in high school. But no 7-10 year old should see the movie and want to read the book, thinking it's a novelization. My sister read it at 12 or 13 and was... *shook*, for a while. I remember is discussing it and deciding to just avoid telling our very Southern Baptist parents. \n\nAlthough, I don't know how well banning the book from school libraries would be - it's currently front and center on just about every book store I've walked into, will be on shelves in the airport, etc. I'd put the book in near the same category as Stephen King's *IT*- but at least the movie adaptations are adult rated. Although, the fact that it's a horror by a famous author kind of negates that - the kids who *love* horror novels are often those who are reading ahead of what's available at their age anyway. Wicked is rated PG, even though the source material, if directly adapted, is NC-17.",
        "time": "2024-11-28 04:59:31 UTC",
        "score": 3,
        "link_id": "t3_1h1ehmg",
        "parent_id": "t1_lzbn7at"
    },
    {
        "comment_id": "lu9who7",
        "subreddit": "books",
        "body": "There might be a sort of tracking disorder that different (seemingly random) things that will help. Sometimes it's just colored paper. Sometimes it's using the \"dyslexic fonts\" that are either weighted differently, or may just have a b, d, p and q are wildly different so they can't be \"spun\" or \"flipped\" - Comic Sans was accidentally good at this. Sometimes they just need an index card or bookmark to slide down the page, so they don't skip lines - thus making what they do read make sense (this is what our youngest needed).\n\nIf you can find what they need, you'll have a plan. It might be that they can really vibe with the comic book/graphic novel format (no paragraphs, different fonts). Once you know what they need, you can also talk with their schools to give them accomodations, which will let them feel more successful, and start snowballing the other way.",
        "time": "2024-10-29 00:59:36 UTC",
        "score": 1,
        "link_id": "t3_1gecyaq",
        "parent_id": "t3_1gecyaq"
    }
]