[
    {
        "comment_id": "lybvxmu",
        "subreddit": "books",
        "body": "My partner and I would sometimes go out with his coworkers on weekends to a local bar. I loved to shoot pool and play darts, but I don’t like to drink, so when everyone got sick of playing and turned to drinking instead, I’d get bored and either whip out a book or a crochet project.\n\nOne night, I was reading at a table in a quiet corner while everyone else was up at the bar. The place we were in was part of a larger building that had a bowling alley and a pool hall for tournaments, so the smaller bar area was always pretty quiet, but especially on tournament nights, which it happened to be. After like 30 minutes of reading, some guy a lot older than me (and definitely tipsier) came up and started picking on me. He was saying comments along the line of “you come to a bar just to read?” And then laughing. My partner had gone to the bathroom and the only one still at the bar at the time was one of his friends’ girlfriends who was already sloshed, so she just thought it was funny. He was just trying to be friendly though and we ended up all sitting up at the bar for a while listening to him tell random stories.",
        "time": "2024-11-21 23:36:38 UTC",
        "score": 1,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t3_1gw3qpe"
    },
    {
        "comment_id": "lxos5f2",
        "subreddit": "books",
        "body": "This is definitely not to put down a book anyone liked, but I didn't like Cloud Atlas. I also read it this year, and I just had a bear of a time getting through it and didn't think it was as profound as it'd been painted to be by the people who recommended it to me. There were good moments, but I felt like the best moments were at the front half of the book to the end of the Sloosha's Crossing section, and everything after was mostly unnecessary or detracted from the stories they were continuing. It was a huge bummer because I really liked Robert Frobisher's story most of all up to the end. I haven't seen the movie yet, but my guess is it'll play out better for me on screen.\n\n  \nI can't remember the context of reccyin', but maybe \"reckoning\"? I'd have to look again to see more examples. If it doesn't fit in the context, then I'd guess the other peoples' guesses are correct.",
        "time": "2024-11-18 01:38:05 UTC",
        "score": 6,
        "link_id": "t3_1gtpch5",
        "parent_id": "t3_1gtpch5"
    },
    {
        "comment_id": "lw5cliz",
        "subreddit": "books",
        "body": "I used to drop books all the time, but now, I like to give them a fair shot if I chose to read them since I’m picky anyway. I’ve found that even if I’m not fond of the book even by the latest parts, there have been many books where the ending made up for quite a bit of the failures throughout.\n\nThere are some though that never recover, like The Lost Apothecary by Sarah Penner and The Testaments by Margaret Atwood. They were just… not good",
        "time": "2024-11-08 21:29:30 UTC",
        "score": 1,
        "link_id": "t3_1gm09hg",
        "parent_id": "t3_1gm09hg"
    },
    {
        "comment_id": "lsw7phs",
        "subreddit": "books",
        "body": "That’s not really a hill, that’s honestly just her schtick lol. My mom has read a bunch of her books and said most of the ones she read are like that, but after My Sister’s Keeper, I just couldn’t stomach it. It’s like M. Night Shyamalan movies. The first time you experience a radical twist like that, it’s like “Oh wow, that’s wild”, but then it’s every movie and you already know to expect some ridiculous explanation or change so it just becomes meh.",
        "time": "2024-10-20 19:59:16 UTC",
        "score": 1,
        "link_id": "t3_1g83ocg",
        "parent_id": "t1_lsvl973"
    },
    {
        "comment_id": "lsvfilp",
        "subreddit": "books",
        "body": "I’m gonna take it a step further and say I felt the movie was superior to the book. It’s one of the few movies I feel that way about, but it’s mainly because the ending of the book just felt ridiculous and emotionally manipulative. It’s been over a decade since I read it and it’s been on my reread list for a while, but I don’t think my opinion would change. I really liked the book and would even say it was one of my favorites until it got to the end",
        "time": "2024-10-20 17:37:57 UTC",
        "score": 11,
        "link_id": "t3_1g83ocg",
        "parent_id": "t1_lsvedfw"
    },
    {
        "comment_id": "lp71nbr",
        "subreddit": "books",
        "body": "To answer your question, yes.",
        "time": "2024-09-27 15:09:36 UTC",
        "score": 5,
        "link_id": "t3_1fqp4j9",
        "parent_id": "t3_1fqp4j9"
    },
    {
        "comment_id": "lodyzov",
        "subreddit": "books",
        "body": "A bunch of people I’ve talked to about it didn’t like it, but I loved the Confessions of a Shopaholic series by Sophie Kinsella. The first book was a great example of satire, while the rest of the series became mostly wacky comedy. I never disliked Rebecca Brandon (née Bloomwood) as a character and felt like most of her shenanigans were well-intentioned/endearing, not selfish or mean-spirited",
        "time": "2024-09-22 16:57:44 UTC",
        "score": 1,
        "link_id": "t3_1fmvx2e",
        "parent_id": "t3_1fmvx2e"
    },
    {
        "comment_id": "lktvmbc",
        "subreddit": "books",
        "body": "If I walk in your house and you have either a) only booktok books, or b) only uncreased paperbacks specifically placed to look aesthetic or make you appear a particular way, that’s at least a little worthy of judgement lol. I have reading and display copies of a few books, so I get why some copies may be unread, but you know when you walk into a book person’s house vs someone who wants to appear as a book person.",
        "time": "2024-08-31 13:31:25 UTC",
        "score": 1,
        "link_id": "t3_1f5euyh",
        "parent_id": "t3_1f5euyh"
    },
    {
        "comment_id": "ljho6u4",
        "subreddit": "books",
        "body": "I’m in the first “present day” part of Cloud Atlas. I’ve liked parts of it, but felt the beginning was quite slow and stylistically not my preference, but the next couple parts interested me a lot more and I’m starting to connect pieces a little more. I’m hoping to feel something a little more profound by the end of it because it gets such rave reviews, but so far, I’d just classify it as a pleasant, interesting, and unique read.",
        "time": "2024-08-23 03:27:30 UTC",
        "score": 2,
        "link_id": "t3_1eyl8bi",
        "parent_id": "t1_ljhlagy"
    },
    {
        "comment_id": "ljex164",
        "subreddit": "books",
        "body": "I haven’t read it yet, but reviews I read said it was an inferior Cloud Atlas, which I’m reading now. I still want to read Sea of Tranquility, but I’m not really even sure how I’m feeling about Cloud Atlas yet lol",
        "time": "2024-08-22 17:54:29 UTC",
        "score": 2,
        "link_id": "t3_1eyl8bi",
        "parent_id": "t3_1eyl8bi"
    },
    {
        "comment_id": "lgzq88k",
        "subreddit": "books",
        "body": "Of Bees and Mist by Erick Setiawan is tied for my first favorite book (Gregory Maguire’s book Wicked is the other) but no one seems to have ever heard of it when I bring it up. It’s a weird book, but like Wicked, it benefits from multiple reads. The first time I read it in 2020, I was a little lukewarm on it. I read it again a year later after something happened to me that closely mimicked something that happens in the book and I fell in love and totally got it.",
        "time": "2024-08-07 19:49:27 UTC",
        "score": 1,
        "link_id": "t3_1em4yyt",
        "parent_id": "t3_1em4yyt"
    },
    {
        "comment_id": "lg9466c",
        "subreddit": "books",
        "body": "I’ve lived in the rural Midwest my entire life and anyone who lives in the middle of nowhere probably uses US Cellular because they have better coverage in the countryside in my region. Unfortunately, that coverage is poor in the cities and towns a lot of the time though. But it’s been how it’s done here for over a decade or more now",
        "time": "2024-08-03 04:20:02 UTC",
        "score": 1,
        "link_id": "t3_1ei8qzc",
        "parent_id": "t3_1ei8qzc"
    },
    {
        "comment_id": "le90s7o",
        "subreddit": "books",
        "body": "I’d be interested to read the bipolar one, too. I have a dear friend that struggles with it, and I’ve never been able to really understand how it feels from her perspective. Lisa Genova is a pretty talented writer, and I didn’t hate the flow of Still Alice, so I’d give her books another shot. Left Neglected looks interesting",
        "time": "2024-07-21 17:01:44 UTC",
        "score": 1,
        "link_id": "t3_1e6uk2d",
        "parent_id": "t1_le7fwtq"
    },
    {
        "comment_id": "le5z9ys",
        "subreddit": "books",
        "body": "I really understand. Your experience is definitely not mine, and that’s okay. I also had family members who have gone through the diseases, though thankfully not my parents, and it’s just not how their disease progressed. They struggled with getting wandering/becoming lost in public spaces and having difficulties remembering certain ADLs, but things like the bathroom and remembering to eat (but not necessarily cooking) were not major issues. Maybe the difference was their housing, being that the two family members that were confirmed to have it and the other we suspect is in early stages had either small ranch style houses or bathrooms on each level of small two story homes.\n\nLike I said, it does happen, it’s not that it can’t. You’re right that the disease presents very differently for everyone. It’s been ages since I’ve read it, maybe I’d change my mind if I read it again, but I remember having some major concerns about the depiction or plot points from midway through to the end. If it is a meaningful story for you and you liked it (painful association notwithstanding) then understand I’m not trying to deny your right to connect with it. It just didn’t work for me and I truly believe for some valid reasons",
        "time": "2024-07-21 01:34:57 UTC",
        "score": 1,
        "link_id": "t3_1e6uk2d",
        "parent_id": "t1_ldz8nm7"
    },
    {
        "comment_id": "ldz6hly",
        "subreddit": "books",
        "body": "She’s a fine writer, but I personally didn’t like Still Alice. I read it while I was working as a CNA on a certified Alzheimer’s unit. The book featured a lot of generalizations of what Alzheimer’s looks like to make for an exciting story because the reality can be significantly more mundane.\n\nFor example, in my time on that unit specifically, I had probably close to 75 different residents in varying stages of disease progression (some, not many, were only in for PT after an injury and behaved otherwise pretty normal aside from needing a higher level of care and reorientation to date and time). Most incontinence in the early stages that we saw came from losing bladder control with age or inability to ambulate or transfer from a chair to a toilet at will. That part where Alice is panicking and has an accident because she can’t remember where the bathroom is was bordering absurd. It could maybe happen, sure, but it’s not likely in the early stages of Alzheimer’s that you’d forget where the bathroom is in a summer home you’ve owned for several years (which I believe was the context of where the scene occurred). The cognitive changes/failings that come with Alzheimer’s/Dementia and the pain of Alice’s family as their loved one’s disease progresses throughout the book were dead on, but they were surrounded by too many tropes to add dramatic flair.\n\nThere were other gripes I had about it plot-wise, but it’s been just shy of a decade since I read it, so I don’t remember most of them. I liked the movie a little better because they casted some great matches for the characters, but even that just felt too unrealistically dramatic. And it’s sad too because I saw a lot of residents who had truly heartbreaking stories that deserved to be heard and connected to, and Still Alice misses the mark in a big way.",
        "time": "2024-07-19 19:32:56 UTC",
        "score": 2,
        "link_id": "t3_1e6uk2d",
        "parent_id": "t1_ldwxovp"
    },
    {
        "comment_id": "l26uqyn",
        "subreddit": "books",
        "body": "Yes, this! I read the shortened version in 6th grade and was surprised when I bought a copy and reread it as an adult. But it's a phenomenal book either way and I reread it often",
        "time": "2024-05-02 02:41:12 UTC",
        "score": 1,
        "link_id": "t3_1cg3ztu",
        "parent_id": "t1_l1txet7"
    },
    {
        "comment_id": "l26uh4a",
        "subreddit": "books",
        "body": "Oh god, same for *A Child Called \"It\"*, but I was in 6th grade. I also started reading Gregory Maguire's *Wicked: The Life and Times of the Wicked Witch of the West* late into 5th grade and while it's still one of my all-time favorite books, I definitely shouldn't have been reading it lol",
        "time": "2024-05-02 02:39:16 UTC",
        "score": 1,
        "link_id": "t3_1cg3ztu",
        "parent_id": "t3_1cg3ztu"
    },
    {
        "comment_id": "k9yy5s5",
        "subreddit": "books",
        "body": "It wasn't a book, but just Emily Dickinson as a poet. We had to read \"'Hope' is the thing with feathers\" and I was one of those super edgy kids back in the day who thought I was too good for sappy poetry (even though I wrote bad sappy poetry). I've come to appreciate her a little more as I've grown older. You can't make me love Shakespeare, though. I hated Romeo and Juliet, and every other play of his I've read or watched stage performances of has just not been my jam, yet they shove him down your throat in public education.\n\n*On the flip side, Flowers for Algernon* (Daniel Keyes), *To Kill a Mockingbird* (Harper Lee), and many of the short stories of Edgar Allan Poe were all required reading for me, and I came out loving them all so much, I reread them often.\n\n  \nEdit for clarity",
        "time": "2023-11-20 02:43:03 UTC",
        "score": 2,
        "link_id": "t3_17y7g1e",
        "parent_id": "t3_17y7g1e"
    },
    {
        "comment_id": "k9yx022",
        "subreddit": "books",
        "body": "I've said it consistently since January when I read it, but the first book of the year I read was *Parasite Eve* by Hideaki Sena and I haven't gotten over it yet. The third act is meh (and a little disturbing), but the first and second act are mind-blowing if you're a science nerd. It has made me reconsider my major, and now, I want to double major in microbiology (my original choice) and molecular biology because I'm so fascinated with the very real and still-relevant science it presented in the story.",
        "time": "2023-11-20 02:33:33 UTC",
        "score": 1,
        "link_id": "t3_17yy3ml",
        "parent_id": "t3_17yy3ml"
    },
    {
        "comment_id": "k9ywave",
        "subreddit": "books",
        "body": "I read part of it in late middle school English as required reading, but have read the book every two or three years since. It's one of my favorite books, but is so heartbreaking.",
        "time": "2023-11-20 02:27:54 UTC",
        "score": 1,
        "link_id": "t3_17yy3ml",
        "parent_id": "t1_k9w541h"
    },
    {
        "comment_id": "k7a25x2",
        "subreddit": "books",
        "body": "No, but only on personal preference. I've reread some of the ones I grew up with (*Unwind* by Neal Shusterman and the *Wake* trilogy by Lisa McMann come to mind) and loved the concepts, but hated some of the writing choices. Like both action and romance happen very suddenly and very often, which is both unrealistic and jarring, and it always feels like YA books propel themselves through a plot through the overuse of tropes. I will say some books are not like that at all and feel much more general fiction in style, like *The Hunger Games*, but I don't like sifting through the ones I don't like to find those.\n\nBut my opinion doesn't mean much. I haven't read any new ones in a long time, so I'm not sure what the genre looks like today versus in 2008 when I entered the age they're marketed to. It might be a totally different landscape for all I know.",
        "time": "2023-10-31 20:40:10 UTC",
        "score": 1,
        "link_id": "t3_17kj7t5",
        "parent_id": "t3_17kj7t5"
    },
    {
        "comment_id": "k79oun4",
        "subreddit": "books",
        "body": "Honestly, I push through a lot of stupid stuff on principle, but choices made by the author that make the book feel suddenly very amateur or overly frustrating for no reason is my biggest pet peeve. My best example is how I felt about *Twilight* (Stephanie Meyer) versus how I felt about *New Moon*. Though it wasn't a great book, I totally got the appeal of *Twilight*. I was all in and ready to push through to *New Moon*, but the ending was so bullshit that I couldn't force myself to finish the series. Like how do you write an entire story only to end it in a way that completely contradicted the plot, reversed any and all character growth, and made the entire book completely pointless? It would be a different story I guess if it was a commentary on something or was parody, but Stephanie Meyer was dead serious.",
        "time": "2023-10-31 19:17:45 UTC",
        "score": 1,
        "link_id": "t3_17ix0p4",
        "parent_id": "t3_17ix0p4"
    },
    {
        "comment_id": "k4fh2cb",
        "subreddit": "books",
        "body": "I’ll fight for the first book any day because it’s my gut pick for my favorite book of all time, but the second and third book in that series were just awful. The third took too much mystery away from some events of the first book, but then over-complicated other things in a way that made them more unclear. The fourth book was a little more fun to read, enough that it makes me want to push through to the spin-off series, but kind of like how Margaret Atwood’s book, The Testaments was, it had weird YA tropes and elements that made it kind of cringey. Not my cup of tea.\n\nBut yeah, Wicked is probably Maguire’s best work, and people who didn’t like it enough to finish it AND reread it will likely never get the appeal. It’s one of those books that gives more the more times you reread it. Had I not jumped on the hype train when I was 12 and the musical was becoming popular, I probably would’ve never finished it. Now I’ve read it six times lol",
        "time": "2023-10-11 15:34:34 UTC",
        "score": 1,
        "link_id": "t3_174dwmf",
        "parent_id": "t1_k4atm1u"
    },
    {
        "comment_id": "k4ff5mz",
        "subreddit": "books",
        "body": "I couldn’t get over the semi-clunky translation. My ex LOOOOVED the book, but I tried three or four times and couldn’t get into it because of how dry it felt.\n\nIf it had interested me more, I might’ve pushed through considering I did so with Parasite Eve, which is equally clunky because it was translated to English lol",
        "time": "2023-10-11 15:22:49 UTC",
        "score": 1,
        "link_id": "t3_174dwmf",
        "parent_id": "t1_k49ubc2"
    },
    {
        "comment_id": "k4fdnva",
        "subreddit": "books",
        "body": "I’ll probably get reamed for this, but The Old Man and the Sea by Ernest Hemingway was so awful to trudge through, I never finished. I was forced to read it my junior year of high school. I hated probably less than half of the books I was ever forced to read in school, but this one was an exception because it was just so offensively boring. I was forced to write a paper (I love writing essays) and come up with symbolism used in the story (some painfully obvious, some a little less so), but the only thing I could glean from the book was that I never wanted to read it or any other Hemingway book ever again. I had to read his short story, Hills Like White Elephants early this year for a literature class and felt similarly.\n\nI dunno, as a more mature person now with much more life experience under her belt, maybe I’d like it or understand it better, but I doubt I’ll ever read it again. I’m still way too bitter about it.",
        "time": "2023-10-11 15:13:35 UTC",
        "score": 1,
        "link_id": "t3_174dwmf",
        "parent_id": "t3_174dwmf"
    },
    {
        "comment_id": "j839bcn",
        "subreddit": "books",
        "body": "I read this book the first time in middle school and have read it five or six times since, and it has always affected me differently (mostly more powerfully) in every stage of my life. It's such a painful story, but one of my all time favorites.",
        "time": "2023-02-11 08:29:00 UTC",
        "score": 1,
        "link_id": "t3_10yun7q",
        "parent_id": "t3_10yun7q"
    },
    {
        "comment_id": "j838505",
        "subreddit": "books",
        "body": "Definitely stick with reading 2 and 3 star reviews for the more honest opinions. 1 and 5 star reviews are usually pretty biased, and people like me who rarely rate a book at 5 stars also abuse 4 star reviews often too lol\n\nPersonally, I write reviews 100% for myself though. I read quite a bit and am a little forgetful, so when I see a book on my shelf and I'm not sure if I've already read it or what I thought of it, it's helpful to go back and read my review to see if it would be a good reread. But some of them have gotten lengthy because I had big opinions, so I'm definitely one of those pretentious people... ope lol",
        "time": "2023-02-11 08:13:06 UTC",
        "score": 1,
        "link_id": "t3_10ywwij",
        "parent_id": "t3_10ywwij"
    }
]