[
    {
        "comment_id": "lywv87m",
        "subreddit": "books",
        "body": "I didn't know this existed, but now I want to see it.",
        "time": "2024-11-25 14:51:37 UTC",
        "score": 1,
        "link_id": "t3_1gzidoi",
        "parent_id": "t1_lywh4du"
    },
    {
        "comment_id": "lykspqg",
        "subreddit": "books",
        "body": "I've read Rosemary's Baby and The Stepford Wives, but it didn't occur to me to look into his other work. Are there any of his that you'd recommend particularly?",
        "time": "2024-11-23 13:50:34 UTC",
        "score": 1,
        "link_id": "t3_1gxzoor",
        "parent_id": "t1_lykqvay"
    },
    {
        "comment_id": "lyksgvw",
        "subreddit": "books",
        "body": "Kurt Vonnegut, Martin Millar (excluding the Thraxas series), and Banana Yoshimoto are the ones that come to mind immediately. But also Shirley Jackson and Laura Ingalls Wilder (as well as many Laura/Little House adjacent histories, biographies, and etc.)",
        "time": "2024-11-23 13:48:55 UTC",
        "score": 1,
        "link_id": "t3_1gxzoor",
        "parent_id": "t3_1gxzoor"
    },
    {
        "comment_id": "lxgo0lg",
        "subreddit": "books",
        "body": "I have a friend from since high school. He was (and is) deeply nerdy, and we connected over anime and old movies and just generally being dorks. When I started hanging out with him, another friend  (a metalhead, so also a nerd, but not one who saw himself as such) commented on the friendship, noting that nerd-guy was SUPER weird and used to walk around the playground in elementary school just randomly falling over for NO REASON. Like, tipping over on his side. So weird! I remembered that it was an odd and mean story, but I never brought it up with nerd friend. \n\nYears later, long out of high school, nerd friend and I were talking about our younger years, and he told me that he was so friendless in elementary school that he just spent recess practicing his Godzilla falls.",
        "time": "2024-11-16 17:43:48 UTC",
        "score": 10,
        "link_id": "t3_1gsq5si",
        "parent_id": "t1_lxgd7mq"
    },
    {
        "comment_id": "lxglu8p",
        "subreddit": "books",
        "body": "Same! And Tasha Tudor's illustrations definitely fueled my gothic lolita phase later in life.",
        "time": "2024-11-16 17:32:17 UTC",
        "score": 3,
        "link_id": "t3_1gsq5si",
        "parent_id": "t1_lxgd9qy"
    },
    {
        "comment_id": "lt33ylz",
        "subreddit": "books",
        "body": "Finished: **When You Find My Body: The Disappearance of Geraldine Largay on the Appalachian Trail, by  D. Dauphine**\n\nI struggle with stories of people who risk their own bodies by taking on big physical challenges. I am so enraged by the wasted life and vigorous health or even the risk of that waste that I can't muster much sympathy for the derring-doers. I'd hoped this one would give me a little more insight into the mindset of the Everest climbers, the extreme hikers, the bull runners, (*Chris McCandless*)  and so on. The title references the note that Largay left before her death due to starvation and exposure after becoming lost in the Maine wilderness, and the whole book hinted at the pages and pages of journals that she kept. Given those details, I'd hoped to read some of her writing and get a chance to see ... I don't know, some sympathetic aspect of her story. Instead, it seems like most of her papers are kept privately, which I have no problem with, except for the uncomfortable sense that her family was likely not involved in the writing and the letdown when it turned out to be just another exercise in getting pissed about people putting themselves in extreme situations, especially when they are romanticizing the experience and may or may not be fully prepared.\n\n#",
        "time": "2024-10-21 23:03:32 UTC",
        "score": 1,
        "link_id": "t3_1g8m07x",
        "parent_id": "t3_1g8m07x"
    },
    {
        "comment_id": "lsx7lik",
        "subreddit": "books",
        "body": "Hi! Thank you so much for this comment! I didn't create the subreddit, and others have worked much harder on it than I have, but there is a little part of me that is quietly proud of the thought, \"It was my idea, though.\"",
        "time": "2024-10-20 23:16:08 UTC",
        "score": 1,
        "link_id": "t3_7mffab",
        "parent_id": "t1_lswmtsz"
    },
    {
        "comment_id": "lsp73ih",
        "subreddit": "books",
        "body": "As an American who listens to the BBC, I remember this so well from the 2010s whenever our president 'Obahmer' was discussed.",
        "time": "2024-10-19 15:44:25 UTC",
        "score": 38,
        "link_id": "t3_1g72q8z",
        "parent_id": "t1_lso6fh3"
    },
    {
        "comment_id": "lf6ld38",
        "subreddit": "books",
        "body": "I just had to comment on your use of Speed 2 as a comparison. It is my jokingly/seriously favorite movie, in spite of the fact that the first 90 minutes are basically unwatchable. The last half hour is just a boat slowly crashing into a town, and I could watch that FOREVER. \n\nI think I have a copy of 'The 100 year old man...' that I got at the thrift shop, but my TBR pile is super deep right now. Beyond the writing and humor, what made it great for you?",
        "time": "2024-07-27 13:00:50 UTC",
        "score": 4,
        "link_id": "t3_1edd42j",
        "parent_id": "t1_lf6ie5h"
    },
    {
        "comment_id": "lacnsyn",
        "subreddit": "books",
        "body": "Have you read The Puppets of Spelhorst by Dicammilo yet? It was so beautiful, I felt like light was shining from my face when I finished it.",
        "time": "2024-06-26 12:05:28 UTC",
        "score": 1,
        "link_id": "t3_1do75nd",
        "parent_id": "t1_laaf3jp"
    },
    {
        "comment_id": "kwkugy4",
        "subreddit": "books",
        "body": "Although she is not as complex as many others, I adore Kitty/Celia. She is so sensible, earthy, and happy compared to her sister. I appreciate Dorothea's journey and growth, but I find her pretty tiresome for most of the book. Celia, on the other hand, is just like, \"Yay! Washing the baby is the best part of the day!\" and she is just such a great contrast to all of the overthinking and often bad choices of the (admittedly) more interesting characters.",
        "time": "2024-03-26 01:24:33 UTC",
        "score": 7,
        "link_id": "t3_1bnm6fy",
        "parent_id": "t3_1bnm6fy"
    },
    {
        "comment_id": "kur1gqs",
        "subreddit": "books",
        "body": "It came off to me as, \"I mean, if it were black guys it would be another thing, but these poor men are White!\" Which I am sure was not his intention, but... given that the Innocence Project focuses on how [black men are more likely to be wrongfully incarcerated](https://innocenceproject.org/race-and-wrongful-conviction/), it seems like a really gross misstep, even without the whole child porn piece.",
        "time": "2024-03-13 22:49:23 UTC",
        "score": 12,
        "link_id": "t3_1bdvzrz",
        "parent_id": "t1_kuq8i12"
    },
    {
        "comment_id": "krplrcl",
        "subreddit": "books",
        "body": "Thank you so much for the rec! I am adding it to my list. I don't know why this dynamic scratches such an itch for me, but it surely does.",
        "time": "2024-02-23 03:09:21 UTC",
        "score": 1,
        "link_id": "t3_1aw2386",
        "parent_id": "t1_krh8afl"
    },
    {
        "comment_id": "krfr2w0",
        "subreddit": "books",
        "body": "Lagoon is definitely in that \"I have never read *anything* like this\" category. \n\nAlso, fwiw, Okorafor prefers not to be described as Afrofuturist? She has some interesting articles and other writing on her reasoning.",
        "time": "2024-02-21 11:57:38 UTC",
        "score": 15,
        "link_id": "t3_1aw2386",
        "parent_id": "t1_krejlgg"
    },
    {
        "comment_id": "krfqmp0",
        "subreddit": "books",
        "body": "I've only seen it in a couple of books, but I love stories that include both high fantasy (specifically fairies) and rock/metal musicians.\n\nGale Baudino's Gossamer Axe is the best for its sincerity and beautiful writing of a story that is basically: Immortal harp player must fight to get her lover back from an evil fairy bard. Luckily she has a secret weapon - Heavy metal guitar! Tad Williams' War of the Flowers was another good one. I think I've read at least one other, and I am always hoping to find more.",
        "time": "2024-02-21 11:53:18 UTC",
        "score": 3,
        "link_id": "t3_1aw2386",
        "parent_id": "t3_1aw2386"
    },
    {
        "comment_id": "kpeo2fg",
        "subreddit": "books",
        "body": "I loved the weeks after the release, when you always saw *someone* (a ten year old kid, the cashier at the drugstore, a grown man in a business suit...) lugging that hefty tome around with them in public. There was really nothing else like it.",
        "time": "2024-02-07 23:31:00 UTC",
        "score": 16,
        "link_id": "t3_1al7me5",
        "parent_id": "t1_kpe1bpc"
    },
    {
        "comment_id": "koj9ewo",
        "subreddit": "books",
        "body": "Boiled peanuts are surprisingly delicious.",
        "time": "2024-02-02 02:55:26 UTC",
        "score": 14,
        "link_id": "t3_1agn8dz",
        "parent_id": "t1_koi1r02"
    },
    {
        "comment_id": "kjxv1z9",
        "subreddit": "books",
        "body": "Just throwing it out there - my dad started reading Faulkner, his now favorite author, with the help of Cliffsnotes style study guides. His defense was pretty solid - It's not for school, he wants to read it, he doesn't get everything, and the notes help him understand it and appreciate it more. I ended up doing the same for Mary Wollstonecraft's Vindication of the Rights of Women, which I would have otherwise DNFed for density and vocabulary. I would recommend grabbing a study guide and sticking with 1984. If you really want to read it, it is worth it.",
        "time": "2024-01-28 11:52:32 UTC",
        "score": 1,
        "link_id": "t3_1acmczb",
        "parent_id": "t3_1acmczb"
    },
    {
        "comment_id": "kjqhfbc",
        "subreddit": "books",
        "body": "Can you share the author? There are a couple by this name.",
        "time": "2024-01-26 23:54:43 UTC",
        "score": 2,
        "link_id": "t3_1abuem5",
        "parent_id": "t1_kjqcitd"
    },
    {
        "comment_id": "khcgzkr",
        "subreddit": "books",
        "body": "Mine too! I reread it about once every five years, and I am always shocked at how many things I think of as just my personal philosophy actually came from that book.",
        "time": "2024-01-11 10:54:09 UTC",
        "score": 13,
        "link_id": "t3_193s10w",
        "parent_id": "t1_khc9whi"
    },
    {
        "comment_id": "kbwsn3b",
        "subreddit": "books",
        "body": "THANK YOU. I couldn't believe how many of my friends were deeply moved by this wish-fulfillment fluff. As a teacher licensed in teaching academically gifted students, I can't get over the misguided and unrealistic portrayal of Mad (the main character's daughter) and her extreme precocity, which is supposedly owed to her mother's assumption that she can reason like an adult. \n\nMy aunt, who was a working woman in the sixties, and I shared an \"I hate this book\" slam fest conversation when we realized we'd both read it recently. She couldn't get past how relatively easy it was for the main character to bypass social norms and have a professional life as an unwed mother. \"It just wasn't like that,\" she said.",
        "time": "2023-12-04 03:51:57 UTC",
        "score": 37,
        "link_id": "t3_18a1brm",
        "parent_id": "t1_kbvmq63"
    },
    {
        "comment_id": "k9mgct3",
        "subreddit": "books",
        "body": "The Mezzanine by Nicholson Baker actually works well as an audiobook. The footnotes are read as asides, and it somehow works.",
        "time": "2023-11-17 11:05:11 UTC",
        "score": 1,
        "link_id": "t3_17x25s5",
        "parent_id": "t1_k9kt6a1"
    },
    {
        "comment_id": "jz199jy",
        "subreddit": "books",
        "body": "I love Murakami and 1Q84. I think having grown up on Kurt Vonnegut innured me to some of Murakami's weird male gaze stuff. It might also have helped that I listened to 1Q84 on audio book, and Allison Hiroto did such an amazing job with Aomame. She was so precise and deliberate and weird... it made Aomame feel like a real (strange) person rather than the product of a man's fantasy.   \n\n\nStill, though, I wish Murakami (and many other male authors) would learn that, as far as I know, most women don't stand in front of their mirrors weighing their breasts in their hands and contemplating their symmetry or the exact shade of their nipples or whatever.",
        "time": "2023-09-04 01:43:15 UTC",
        "score": 13,
        "link_id": "t3_1692f9v",
        "parent_id": "t1_jz0dw8o"
    },
    {
        "comment_id": "j393aqq",
        "subreddit": "books",
        "body": "There is a [subreddit](https://www.reddit.com/r/ayearofwarandpeace/) where people do this, and it is still early enough to get in and catch up. It's a lot of fun.",
        "time": "2023-01-06 21:51:46 UTC",
        "score": 2,
        "link_id": "t3_104vpxb",
        "parent_id": "t1_j37ycsl"
    },
    {
        "comment_id": "izoxz57",
        "subreddit": "books",
        "body": "I think the reason for the vitriol surrounding Twilight was that it was well loved by a lot of young women. There are plenty of poorly written popular novels. Why was hating on this one such a big deal?  Same with boy bands. Somehow anything that resontes with teen girls gets an extra helping of derision. I just assume that it's because men don't like the idea that young beautiful girls actually prefer young beautiful guys (who spend a lot of their time declaring how deeply and passionately in love they are) than guys like them.",
        "time": "2022-12-10 19:20:05 UTC",
        "score": 29,
        "link_id": "t3_zhtr8j",
        "parent_id": "t1_izobjoa"
    },
    {
        "comment_id": "iz2kew2",
        "subreddit": "books",
        "body": "I know this thread is long over, but I started reading your books because Junot Diaz recommended them at a book signing when I mentioned that I was a nerd. He was right.  They are great.",
        "time": "2022-12-06 00:13:45 UTC",
        "score": 1,
        "link_id": "t3_zdar5u",
        "parent_id": "t3_zdar5u"
    },
    {
        "comment_id": "hufy48w",
        "subreddit": "books",
        "body": "> Alan Mendelssohn, the Boy from Mars\n\nOh! Daniel Pinkwater! YES!! Add food from The Snarkout Boys and The Avocado of Death (except for the home cooking at Walter and Winston's  homes).",
        "time": "2022-01-27 14:35:56 UTC",
        "score": 1,
        "link_id": "t3_sdolt5",
        "parent_id": "t1_huefnbb"
    },
    {
        "comment_id": "hue52z0",
        "subreddit": "books",
        "body": "A Dictionopolis Royal Banquet. (I would speak the poem Why I am Not A Painter by Frank O'hara, and I think it would taste like coffee and clove cigarettes, bread and salted butter, and a really good apple or orange when you're really hungry.)\n\nAlso, basically anything Amelia Bedelia ever baked. (I realize that lemon meringue pie and cream puffs and such are real foods, but when I was a kid, I'd certainly never tasted them.) They would taste like they taste, but ne plus ultra.",
        "time": "2022-01-27 03:34:41 UTC",
        "score": 12,
        "link_id": "t3_sdolt5",
        "parent_id": "t3_sdolt5"
    },
    {
        "comment_id": "hsyl604",
        "subreddit": "books",
        "body": "This comment JUST made me remember that there were Jondalar chapters. I skipped them all back then and probably still haven't read them. I am guessing I was about 12-13?",
        "time": "2022-01-16 22:37:40 UTC",
        "score": 3,
        "link_id": "t3_s5cr1t",
        "parent_id": "t1_hsxhkd0"
    },
    {
        "comment_id": "hr59aji",
        "subreddit": "books",
        "body": "Got any suggestions for this trope? (It sounds right up my alley.)",
        "time": "2022-01-04 00:21:41 UTC",
        "score": 10,
        "link_id": "t3_rvelr5",
        "parent_id": "t1_hr51mop"
    },
    {
        "comment_id": "hr4dpph",
        "subreddit": "books",
        "body": "Oh, I thought of another good recommendation, if you're interested. The Mezzanine by Nicholson Baker is just written as a stream of consciousness collection of this young businessman's thoughts on a single escalator ride. It's far more organized and lucid than the phrase \"stream of consciousness\" suggests though, and it has all these amazing descriptions of ordinary objects and daily routines as well as really moving digressions about the guy's childhood and family. A lot of it is told in footnotes, which seems weird, but really works. It hangs together much better as a narrative (albeit a fairly plotless one) than you would imagine given the structure.",
        "time": "2022-01-03 20:52:19 UTC",
        "score": 2,
        "link_id": "t3_rv0jy5",
        "parent_id": "t1_hr2n6md"
    },
    {
        "comment_id": "hr39bhq",
        "subreddit": "books",
        "body": "Set aside all of my own suggestions to agree with this one. Yes. Read Vonnegut!!",
        "time": "2022-01-03 16:42:19 UTC",
        "score": 2,
        "link_id": "t3_rv5eqo",
        "parent_id": "t1_hr38cb2"
    },
    {
        "comment_id": "hr2rw6a",
        "subreddit": "books",
        "body": "I'll have to check that out. I am feeling very out of the loop regarding the Golden Girls these days. It came out when I was firmly of Cartoons Only age, and I never caught it in syndication. \n\nI was actually in pretty dire financial straits the first time I read Down and Out. I found the passages about being free in your own mind (if you can read and think and look at stars) to be really comforting. I've read it many times since then, and I always get something new from it.",
        "time": "2022-01-03 14:40:20 UTC",
        "score": 3,
        "link_id": "t3_rv0jy5",
        "parent_id": "t1_hr2n6md"
    },
    {
        "comment_id": "hr2eyk4",
        "subreddit": "books",
        "body": "David Mitchell is awesome for this. Try Cloud Atlas. \n\nAlso, I am so happy to see a reference to Down and Out in Paris and London. If I had unlimited funds, that's the book I'd be offering to buy for anyone who asked. It's so beautiful and relevant. “The Paris slums are a gathering-place for eccentric people - people who have fallen into solitary, half-mad grooves of life and given up trying to be normal or decent. Poverty frees them from ordinary standards of behavior, just as money frees people from work.”",
        "time": "2022-01-03 12:46:08 UTC",
        "score": 4,
        "link_id": "t3_rv0jy5",
        "parent_id": "t3_rv0jy5"
    },
    {
        "comment_id": "hp7ortn",
        "subreddit": "books",
        "body": "I have really severe anxiety. Borrowing and returning things are errands that become huge obstacles in my ridiculous mind. Another whole big deal is the worry that something will happen to them and it will be my fault and someone will be mad/it will be proof that I am bad at life. \n\nOn the other hand, book *buying* is a treat, and selling books back for store credit feels like a mini-windfall. It's a completely different emotional experience, even if it's expensive and illogical.",
        "time": "2021-12-19 21:01:07 UTC",
        "score": 1,
        "link_id": "t3_rjfu02",
        "parent_id": "t3_rjfu02"
    },
    {
        "comment_id": "h55stv4",
        "subreddit": "books",
        "body": "I started reading the Mode series as a kid, and while the naked bleeding contest (!?) and the \"I'll protect my fiance's interest in me by getting my rival a bra!\" parts seemed off to me, it wasn't until I read his autobiography that I realized just how off he was. I was 16-ish, and the part about not allowing his daughters to get their hair cut (after going on and on about his own obsession with breasts and hair) was the breaking point for me. I never finished the Mode series, and I never got in to any of the others.",
        "time": "2021-07-14 15:00:25 UTC",
        "score": 2,
        "link_id": "t3_oje6t4",
        "parent_id": "t1_h530bwi"
    },
    {
        "comment_id": "h1gk0ip",
        "subreddit": "books",
        "body": "That one's on my list for the summer. Folks warned that it would be 'spoiled' by Utopia Avenue, but I feel sufficiently in the dark as to what was happening with Jasper, so the story should still hold my interest.",
        "time": "2021-06-11 23:10:40 UTC",
        "score": 1,
        "link_id": "t3_nxhdnb",
        "parent_id": "t1_h1gbx8c"
    },
    {
        "comment_id": "h1ex6q9",
        "subreddit": "books",
        "body": "**Utopia Avenue by David Mitchell** A novel about a 1960s 'psychedelic folk rock' band's rise to fame. It veers a little into the overarching David Mitchell multiverse (which I only sort of understand), but that didn't detract from the story of the novel. I found myself really invested in all of the characters, and the way Mitchell describes things is somehow both really familiar and really unexpected. \n\nOn another note, I read all three of **Mary H.K. Choi**'s novels (rapidly ordering the second two after loving **Emergency Contact**). They're all about young adults and their relationships, but not quite YA/not quite romance. All three were so, so engaging.",
        "time": "2021-06-11 15:41:40 UTC",
        "score": 6,
        "link_id": "t3_nxhdnb",
        "parent_id": "t3_nxhdnb"
    },
    {
        "comment_id": "gyc0idn",
        "subreddit": "books",
        "body": "The movie version of Jaws cuts several tedious subplots (and some weird casual racism) from the original story. The book is entertaining enough, but it's nowhere near the masterpiece that the movie is.",
        "time": "2021-05-16 15:32:13 UTC",
        "score": 5,
        "link_id": "t3_ndqmgr",
        "parent_id": "t3_ndqmgr"
    },
    {
        "comment_id": "gx7k196",
        "subreddit": "books",
        "body": "Not *exactly* a collection, but the LeVar Burton Reads podcast  consistently delivers excellent short stories.",
        "time": "2021-05-06 22:59:00 UTC",
        "score": 2,
        "link_id": "t3_n6d8vr",
        "parent_id": "t3_n6d8vr"
    },
    {
        "comment_id": "gre98nw",
        "subreddit": "books",
        "body": "Not OP, but Nicholson Baker's The Mezzanine is great. It made me appreciate the mundane aspects of daily life in a new way.",
        "time": "2021-03-18 19:01:18 UTC",
        "score": 3,
        "link_id": "t3_m7j8ds",
        "parent_id": "t1_grc33bd"
    },
    {
        "comment_id": "gmis031",
        "subreddit": "books",
        "body": "Have you read any Shirley Jackson? Her \"We Have Always Lived In The Castle\" came immediately to mind when I thought of mysteries and your FBoaT, though I can't make an immediate logical connection.",
        "time": "2021-02-07 23:11:18 UTC",
        "score": 2,
        "link_id": "t3_ld4uw0",
        "parent_id": "t1_gmicp5a"
    },
    {
        "comment_id": "gkp0v6t",
        "subreddit": "books",
        "body": "I usually do the opposite - buy a paperback and then spring for the ebook when I realize that I'm out of the house with time to read and no book.\n\nI think your plan sounds better.",
        "time": "2021-01-25 10:34:40 UTC",
        "score": 4,
        "link_id": "t3_l4l9jr",
        "parent_id": "t3_l4l9jr"
    },
    {
        "comment_id": "gkkfbwr",
        "subreddit": "books",
        "body": "Rock on! I don't even mind not fully 'getting it'. (After 3 reads, I still don't.) There are so many small moments in that book that I just love being in.\n\nETA: I understand that after the book came out in Japan, the publishers set up a Q&A website for readers to try to get clarity. I think Murakami answered over 1000 questions about the book. Unfortunately, it hasn't been translated AFAIK.",
        "time": "2021-01-24 13:58:53 UTC",
        "score": 2,
        "link_id": "t3_kzsjno",
        "parent_id": "t1_gkgkr7a"
    },
    {
        "comment_id": "gjq1hvg",
        "subreddit": "books",
        "body": "This is the only book that I ever turned over and started again from the beginning immediately after finishing.",
        "time": "2021-01-18 14:41:05 UTC",
        "score": 4,
        "link_id": "t3_kzsjno",
        "parent_id": "t1_gjpnvew"
    },
    {
        "comment_id": "gjq161x",
        "subreddit": "books",
        "body": "Finished **Writers & Lovers, by Lily King.** Loved the prose, didn't like how neatly things worked out for the protagonist, but I'm questioning whether I should hold my expectations back like that and if that isn't the whole point of the novel. \n\nJust started **An Extraordinary Theory of Objects: A Memoir of an Outsider in Paris, by Stephanie LaCava**. I'm finding the footnotes off-putting and difficult to navigate, which is odd because I really like Nicholson Baker and Mary Roach and other writers who overuse asides like that.",
        "time": "2021-01-18 14:37:47 UTC",
        "score": 1,
        "link_id": "t3_kzsjno",
        "parent_id": "t3_kzsjno"
    },
    {
        "comment_id": "gjq06ol",
        "subreddit": "books",
        "body": "Is this your first time reading the series? What did you think? (It's one of my favorites, so I get a little jumpy-up-and-downy when I see someone starting it.)",
        "time": "2021-01-18 14:27:49 UTC",
        "score": 2,
        "link_id": "t3_kzsjno",
        "parent_id": "t1_gjprjsh"
    },
    {
        "comment_id": "gj0k4if",
        "subreddit": "books",
        "body": "And you seriously don't want to accidentally read Ryu Murakami when someone tells you they think you'd like Murakami. \n\n(Me. I did that. Expecting, like, cats and weird characters and getting In the Miso Soup.)",
        "time": "2021-01-12 16:51:11 UTC",
        "score": 9,
        "link_id": "t3_kvv2qh",
        "parent_id": "t1_gj0jo1y"
    },
    {
        "comment_id": "gj0jqqm",
        "subreddit": "books",
        "body": "I don't think I agree with your criteria, but I definitely think Homegoing has lasting value.",
        "time": "2021-01-12 16:48:15 UTC",
        "score": 1,
        "link_id": "t3_kvm0na",
        "parent_id": "t1_gizq2os"
    },
    {
        "comment_id": "gghrcew",
        "subreddit": "books",
        "body": "Catherine House by Elizabeth Thomas",
        "time": "2020-12-20 16:39:58 UTC",
        "score": 2,
        "link_id": "t3_kgs8pu",
        "parent_id": "t3_kgs8pu"
    },
    {
        "comment_id": "gghqdwq",
        "subreddit": "books",
        "body": "There is also a product called \"reading highlight strips\" that we use with elementary school children. It doesn't magnify the text, but it does filter it through lightly colored plastic which (I think) is supposed to reduce the contrast and visual noise?",
        "time": "2020-12-20 16:31:43 UTC",
        "score": 30,
        "link_id": "t3_kgwelc",
        "parent_id": "t3_kgwelc"
    },
    {
        "comment_id": "ggdyihn",
        "subreddit": "books",
        "body": "I'm not sure if I would call it hugely successful, but I stopped reading the recently acclaimed Daisy Jones & The Six about two chapters away from the ending. I was looking forward to being done with it, and then I realized I could be done with it right away without slogging through whatever happens at the end.",
        "time": "2020-12-19 18:47:53 UTC",
        "score": 14,
        "link_id": "t3_kgc1rh",
        "parent_id": "t3_kgc1rh"
    },
    {
        "comment_id": "fsvgj2b",
        "subreddit": "books",
        "body": "Aren't there hints that he strung some poor girl along and then reneged on the promise to marry her? (This is a vague recollection on my part. Maybe I'm imagining it?) Also, responding to the whimpering ghost child Cathy by scraping her wrists against the broken glass panes was pretty cold blooded.",
        "time": "2020-06-04 16:17:20 UTC",
        "score": 3,
        "link_id": "t3_gwdfms",
        "parent_id": "t1_fsur85x"
    },
    {
        "comment_id": "fslal7h",
        "subreddit": "books",
        "body": "I definitely felt a lot of pressure on Goodreads. It turned reading into a performance of a sort. It may not be that way for everyone, but I'm still working on not being self-conscious or comparing myself to others in general. It was not a good fit for me. \n\nI do like to keep track of my thoughts about reading, so I keep a commonplace book of quotes and annotations and do a lot of reflecting on my reading in my morning pages. \n\nI find that I get a lot more out of writing about reading when there isn't any pressure to write well or for the public. A lot of my written responses go like, \"So, I think the author was saying this ____ , I think this ____ , but I need to learn more about this ____.\" Really clunky stuff. \n\nI don't keep a list of the books that I read any more. Even if it weren't public, I think I would feel pressure from myself to fill a list with the right books and to make sure I was adding to it regularly. I buy all of my books (because I'm foolish), so I do have physical reminders of what I've read before.",
        "time": "2020-06-02 01:57:27 UTC",
        "score": 3,
        "link_id": "t3_guuwqh",
        "parent_id": "t1_fsl6xwx"
    },
    {
        "comment_id": "fsl1yty",
        "subreddit": "books",
        "body": "I quit Goodreads last fall, and it totally invigorated my reading habits.",
        "time": "2020-06-02 00:37:05 UTC",
        "score": 4,
        "link_id": "t3_guuwqh",
        "parent_id": "t1_fskuaiu"
    },
    {
        "comment_id": "fsl1i0j",
        "subreddit": "books",
        "body": "Do you pair the fiction and nonfiction by topic or is it more about keeping even numbers?",
        "time": "2020-06-02 00:32:49 UTC",
        "score": 4,
        "link_id": "t3_guuwqh",
        "parent_id": "t1_fsks8gx"
    },
    {
        "comment_id": "frtgv4i",
        "subreddit": "books",
        "body": "The Little Prince by Antoine de Saint-Exupéry. (Like the 4th graders I teach, I was too excited about sharing my answer to pay attention to the directions in the question...)",
        "time": "2020-05-25 23:41:09 UTC",
        "score": 1,
        "link_id": "t3_gqf9qt",
        "parent_id": "t1_frtcm23"
    },
    {
        "comment_id": "frsku2e",
        "subreddit": "books",
        "body": "External view only. For finding the people I can talk about boa constrictors, primeval forests, and stars with.",
        "time": "2020-05-25 18:51:11 UTC",
        "score": 3,
        "link_id": "t3_gqf9qt",
        "parent_id": "t1_frsiy52"
    },
    {
        "comment_id": "frsjrkg",
        "subreddit": "books",
        "body": "And then, maybe they are related. The link above says that The Drum is based on a folktale called The Pear Drum, and [this site](https://timothyferguson.wordpress.com/2019/02/27/the-pear-drum-the-new-mother/) says The Pear Drum was a source for Coraline.",
        "time": "2020-05-25 18:41:55 UTC",
        "score": 3,
        "link_id": "t3_gqfsq9",
        "parent_id": "t1_frsj6mw"
    },
    {
        "comment_id": "frsj6mw",
        "subreddit": "books",
        "body": "The other mother always reminded me of the mother in The Drum \"with glass eyes and a wooden tail\" from Scary Stories to Tell in the Dark, but I don't think there's any evidence that the two stories are connected. The Drum always scared me way more than any of the other SStTitD. Being tricked and suffering misfortune that is your own fault... ugh. \n\nhttps://scary-stories.fandom.com/wiki/The_Drum",
        "time": "2020-05-25 18:36:54 UTC",
        "score": 3,
        "link_id": "t3_gqfsq9",
        "parent_id": "t3_gqfsq9"
    },
    {
        "comment_id": "frsikta",
        "subreddit": "books",
        "body": "It's been done, but a boa constrictor digesting an elephant.",
        "time": "2020-05-25 18:31:39 UTC",
        "score": 9,
        "link_id": "t3_gqf9qt",
        "parent_id": "t3_gqf9qt"
    },
    {
        "comment_id": "fpl9m1b",
        "subreddit": "books",
        "body": "I am not sure how active the 'ayearof' subreddits are anymore. I did /r/ayearofwarandpeace followed by /r/ayearoflesmiserbles, but /u/AnderLouis_ of the original AYoW&P community keeps an active podcast/book club/subreddit called [The Hemmingway List](https://www.reddit.com/r/thehemingwaylist/) that is reading through  Earnest Hemingway's list of 'must read' literature. It is still pretty active. \n\nThe 'ayearof' subreddits also really surge and take off around the beginning of the year. I got SO much out of my participation in both, but this year (I thought. Ha.) was going to be too busy for me.",
        "time": "2020-05-05 19:59:49 UTC",
        "score": 7,
        "link_id": "t3_ge0i0j",
        "parent_id": "t3_ge0i0j"
    },
    {
        "comment_id": "fpl8pkp",
        "subreddit": "books",
        "body": "Yep. If I underline something when I'm reading, I copy it out in my journal later and write notes then. (This also helps with my writing as I have a goal to write 3 pages each morning. It's much easier when I have something to write about!)\n\nI also write a daily summary of anything I am reading specifically to learn from (nonfiction, essays, self-help, *some* classic literature). It helps me make sense of the information and makes it 'stick' better than just reading alone.",
        "time": "2020-05-05 19:52:22 UTC",
        "score": 1,
        "link_id": "t3_ge44ij",
        "parent_id": "t1_fpl4sro"
    },
    {
        "comment_id": "fn1wa4e",
        "subreddit": "books",
        "body": "Watching the film veriosn of Norwegian Wood changed my view of the book. It's like a slasher film where the killer is just young adults' emotions. I read the book as more of a romance, but the film came off as straight horror to me.\n\nETA: The Murakami I can't get into is Hard Boiled Wonderland at the End of the World. Actually, any time his writing seems to take it's cue from detective novels, it tends to leave me cold. If I had to choose only one book to read for the rest of my life, though, it would probably be Kafka on the Shore.",
        "time": "2020-04-11 02:20:41 UTC",
        "score": 2,
        "link_id": "t3_fyazu9",
        "parent_id": "t1_fn0quj7"
    },
    {
        "comment_id": "fn1vqco",
        "subreddit": "books",
        "body": "Sometimes I get the answer to this question in a single book with King. He'll start out with such a great premise, but it will devolve into Magic and a Big Fight.",
        "time": "2020-04-11 02:14:22 UTC",
        "score": 1,
        "link_id": "t3_fyazu9",
        "parent_id": "t1_fmzdn0g"
    },
    {
        "comment_id": "fn1vjod",
        "subreddit": "books",
        "body": "I love Sandman, American Gods, and Gaiman's short stories. I actually don't like Coraline or The Graveyard Book. They feel too forced and aware of their own attempts to follow truly great children's literature like Alice in Wonderland, The Phantom Tollbooth, and The House With A Clock in its Walls.",
        "time": "2020-04-11 02:12:12 UTC",
        "score": 1,
        "link_id": "t3_fyazu9",
        "parent_id": "t1_fmz4hni"
    },
    {
        "comment_id": "fh9ig41",
        "subreddit": "books",
        "body": "I snuck into the detention room (just got in line when they came to fetch the bad kids) on field day because sitting in a room reading all day > tether ball in the hot sun.",
        "time": "2020-02-11 00:47:50 UTC",
        "score": 1,
        "link_id": "t3_f1puu4",
        "parent_id": "t1_fh8gifo"
    },
    {
        "comment_id": "ffv8rom",
        "subreddit": "books",
        "body": "I don't know if the holly thing is intentional or not, but it's making me laugh.",
        "time": "2020-01-29 00:39:40 UTC",
        "score": 7,
        "link_id": "t3_evbz3t",
        "parent_id": "t1_ffv4bpd"
    },
    {
        "comment_id": "ffv8luz",
        "subreddit": "books",
        "body": "I enjoyed it well enough, but didn't think the narrative voices were varied enough for the diverse group of people they were supposed to represent.",
        "time": "2020-01-29 00:37:52 UTC",
        "score": 4,
        "link_id": "t3_evbz3t",
        "parent_id": "t1_ffv7bu8"
    },
    {
        "comment_id": "ffv8gqa",
        "subreddit": "books",
        "body": "YES! I play D&D and mourn the fact that I can't enjoy these books (or much in the way of High Fantasy). I'm familiar enough with the story to know that there IS plot and character in there, I just can't see it through all the tedious description and worldbuilding. (And I LIKE worldbuilding!)",
        "time": "2020-01-29 00:36:17 UTC",
        "score": 1,
        "link_id": "t3_evbz3t",
        "parent_id": "t1_ffv17by"
    },
    {
        "comment_id": "ffv420p",
        "subreddit": "books",
        "body": "Haha! Thanks for the respect anyway. I think I'm the only woman **I** know who has read it and doesn't like it too, and most people I know respond to my opinion by suggesting that I'm the devil or that I hate all joy.",
        "time": "2020-01-28 23:46:19 UTC",
        "score": 3,
        "link_id": "t3_evbz3t",
        "parent_id": "t1_ffv3t91"
    },
    {
        "comment_id": "ffv36p0",
        "subreddit": "books",
        "body": "As a bookish girl who loves Anne Shirley, Laura Ingalls, and Mary Lennox, I should also love Jo March. I can't. I HATE Little Women with a passion. I think all four sisters are dull and insipid (And Marmee would be sickening even if her daughters called her by a name that didn't sound whiny), but Jo is the worst for being so insufferably full of herself. Her stupid writing outfit fills me with rage. The stupid thing with the gloves and the curl and the scorched dress fills me with rage. The limes make me angry. The jam that will not gel makes me angry. Professor Bhaer and the Boys School is the Worst. Ending. Ever.",
        "time": "2020-01-28 23:36:54 UTC",
        "score": 4,
        "link_id": "t3_evbz3t",
        "parent_id": "t3_evbz3t"
    },
    {
        "comment_id": "ffrzrqg",
        "subreddit": "books",
        "body": "I always notice and note descriptions where Sunlight Streams Through A Window. Once you start noticing it, it's everywhere. Similarly [the green lamp that is in every movie](https://www.google.com/search?q=banker%27s+lamp&safe=strict&source=lnms&tbm=isch&sa=X&ved=2ahUKEwi-7MOu_qTnAhUGTd8KHX3qDIcQ_AUoAXoECA0QAw&biw=1440&bih=788)",
        "time": "2020-01-28 00:00:58 UTC",
        "score": 1,
        "link_id": "t3_euubhq",
        "parent_id": "t3_euubhq"
    },
    {
        "comment_id": "ff9juld",
        "subreddit": "books",
        "body": "That makes me feel a little less like I'm living in the Twilight Zone. (Even if I am still feeling a little real life dystopia going on...)",
        "time": "2020-01-22 17:35:40 UTC",
        "score": 60,
        "link_id": "t3_esaq6z",
        "parent_id": "t1_ff997y4"
    },
    {
        "comment_id": "ff97rci",
        "subreddit": "books",
        "body": "One of the two novels (Talents, I think) includes a charismatic US president who promises to \"make America great again.\" My blood went cold when I read it.",
        "time": "2020-01-22 15:26:52 UTC",
        "score": 233,
        "link_id": "t3_esaq6z",
        "parent_id": "t1_ff93e74"
    }
]