[
    {
        "comment_id": "lqzvhq1",
        "subreddit": "books",
        "body": ">”*I associate sorcerers with magic and philosophers with old bearded men who sit around asking annoying existential questions*”\n\nYou’ve just answered your own question as to why they didn’t use the word Philosopher in the USA!",
        "time": "2024-10-08 20:40:50 UTC",
        "score": 13,
        "link_id": "t3_1fz9dgg",
        "parent_id": "t1_lqztfii"
    },
    {
        "comment_id": "loey2p1",
        "subreddit": "books",
        "body": "Hugo had an incredible knack for catching the entirety of the human spirit (the suffering, the anxiety, the hope, the love) in such clear words that you feel what the characters are feeling.  No matter how many years go by his writing will always stay relevant in one way or another.  In fact, we’re having an excerpt from Les Mis at our wedding !",
        "time": "2024-09-22 19:51:55 UTC",
        "score": 36,
        "link_id": "t3_1fn1c48",
        "parent_id": "t3_1fn1c48"
    },
    {
        "comment_id": "khqd02d",
        "subreddit": "books",
        "body": "That’s when my copy ended too! I’m literally just now finding out that what I thought was a sequel book is actually part of the original everywhere else!",
        "time": "2024-01-13 22:39:28 UTC",
        "score": 2,
        "link_id": "t3_195ynjb",
        "parent_id": "t1_khqazup"
    },
    {
        "comment_id": "khl1xyq",
        "subreddit": "books",
        "body": "I cried for days after that one.  Still cry when I think of “I always have to go before you and show you the way”",
        "time": "2024-01-12 22:19:39 UTC",
        "score": 13,
        "link_id": "t3_1954igw",
        "parent_id": "t1_khkvnz7"
    },
    {
        "comment_id": "ke8nmk3",
        "subreddit": "books",
        "body": "I genuinely felt a sense of loss when I finished all of the Farseer books, like not being able to read about those characters any more was akin to losing people from my life.  They are beautiful stories of relatable characters and few books have ever hit me quite as hard.",
        "time": "2023-12-20 22:03:01 UTC",
        "score": 19,
        "link_id": "t3_18n4ebc",
        "parent_id": "t3_18n4ebc"
    }
]