[
    {
        "comment_id": "lzyei7f",
        "subreddit": "books",
        "body": "Isn't it a little early? There are still books yet to come out. My most awaited for the year isn't out for a few days for example.",
        "time": "2024-12-01 23:59:40 UTC",
        "score": 2,
        "link_id": "t3_1h3c3sx",
        "parent_id": "t3_1h3c3sx"
    },
    {
        "comment_id": "lzqjx0r",
        "subreddit": "books",
        "body": "How is it grooming? She grabbed a book off her mom's shelf and liked the author so she started reading through the rest on her own.",
        "time": "2024-11-30 17:14:06 UTC",
        "score": 10,
        "link_id": "t3_1h39wpf",
        "parent_id": "t1_lzqjncs"
    },
    {
        "comment_id": "lzpleix",
        "subreddit": "books",
        "body": "My best friend came to visit last year. I had not seen him in person in 8 years so I'd not met his daughter.  I was shocked when she showed up and was reading IT at 7 years old. Turns out she's a very good reader and loves Steven king's horror.",
        "time": "2024-11-30 13:39:02 UTC",
        "score": 69,
        "link_id": "t3_1h39wpf",
        "parent_id": "t1_lzpgrb4"
    },
    {
        "comment_id": "lzpl6j1",
        "subreddit": "books",
        "body": "That's what I love about terry pratchett's children/young adult books. He doesn't pull any punches. They're not full on adult books but he understands that kids can usually handle some darker themes and don't always need super simplified meanings and what not.\n\nThe Tiffany aching discworld books for example are spectacular.",
        "time": "2024-11-30 13:37:20 UTC",
        "score": 118,
        "link_id": "t3_1h39wpf",
        "parent_id": "t3_1h39wpf"
    },
    {
        "comment_id": "lz38ncj",
        "subreddit": "books",
        "body": "I agree on that. Just pointing out that most 5 star reviews are not going to be that. Instead they're people who read a book and get excited and then rather than sitting down and going yeah some of the characters were a bit 1 dimensional and there was a bit of a slow down 70% through the book they just go \"amazing book! 5 stars!\"",
        "time": "2024-11-26 15:48:21 UTC",
        "score": 3,
        "link_id": "t3_1h0dcjz",
        "parent_id": "t1_lz34ao8"
    },
    {
        "comment_id": "lz324lt",
        "subreddit": "books",
        "body": "I mean to be fair the 5 star stuff is quite often organic.  It's not that they're being paid it's that people suck at objectively reviewing things. A lot of people get excited about something they liked and jump on to instantly be like yeah that was 5 stars.",
        "time": "2024-11-26 15:13:32 UTC",
        "score": 6,
        "link_id": "t3_1h0dcjz",
        "parent_id": "t1_lz2xnov"
    },
    {
        "comment_id": "lymya9c",
        "subreddit": "books",
        "body": "Not always. A big intricate book sure but I remember reading something from the author of one of those popular young adult books a few years back (think shadow and bone but I don't remember if it was her) and she flat out said she took a week off of work and just wrote the book during that time.\n\nThen there are prolific authors who are pretty quick. Terry prachet was putting out 2 discworld books a year for a pretty big stretch there.",
        "time": "2024-11-23 21:05:10 UTC",
        "score": 23,
        "link_id": "t3_1gy8w0e",
        "parent_id": "t1_lymtn8w"
    },
    {
        "comment_id": "lykp56n",
        "subreddit": "books",
        "body": "Then a few years later he does a charity event and is like if X much gets donated I'll release one chapter and it gets reached. Then he ups it and says you actually need to donate Y amount and I'll have a full cast narrate the chapter and it gets reached. Then several years later and he's yet to even release that one chapter.",
        "time": "2024-11-23 13:25:38 UTC",
        "score": 6,
        "link_id": "t3_1gxtfoa",
        "parent_id": "t1_lyjt1iv"
    },
    {
        "comment_id": "lyfujoc",
        "subreddit": "books",
        "body": "Spot on with reddit. Most people here try to be anonymous.  It's like a general forum and less like hey I'm Steve and I like these books let's be friends.",
        "time": "2024-11-22 16:54:53 UTC",
        "score": 16,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t3_1gxa0r3"
    },
    {
        "comment_id": "ly8fmkb",
        "subreddit": "books",
        "body": "I get stopped from time to time when I'm going for a walk reading by people who want to ask how I can walk and read at the same time.",
        "time": "2024-11-21 11:00:44 UTC",
        "score": 1,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t3_1gw3qpe"
    },
    {
        "comment_id": "lxzsoo1",
        "subreddit": "books",
        "body": "I've only read American gods, good omens(he co-wrote it) and his short story collection but they were all great.",
        "time": "2024-11-19 21:23:25 UTC",
        "score": 2,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxzrj2c"
    },
    {
        "comment_id": "lxz6sw9",
        "subreddit": "books",
        "body": "Gotcha. Yeah that makes sense then.",
        "time": "2024-11-19 19:33:34 UTC",
        "score": 1,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxz4k61"
    },
    {
        "comment_id": "lxyzvll",
        "subreddit": "books",
        "body": "It depends on the style. One big story that doesn't have an end? No but a series of standalone where each is a complete story yeah no problem.",
        "time": "2024-11-19 18:58:09 UTC",
        "score": 1,
        "link_id": "t3_1gv46lc",
        "parent_id": "t3_1gv46lc"
    },
    {
        "comment_id": "lxyyvm2",
        "subreddit": "books",
        "body": ">Just wondering if others had had a similar experience of books or authors whose reputations have tarnished over time. \n\nHe's a big one recently that people have turned on. I'm not really up to date on much so I don't know the why but a lot of threads have come up on here in the past month or so talking about how you should not read his books and he's apparently pretty shitty or something.",
        "time": "2024-11-19 18:53:20 UTC",
        "score": 6,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxyy58c"
    },
    {
        "comment_id": "lxyudyl",
        "subreddit": "books",
        "body": "The big one currently is Neil Gaiman.",
        "time": "2024-11-19 18:31:23 UTC",
        "score": 21,
        "link_id": "t3_1gv1if7",
        "parent_id": "t3_1gv1if7"
    },
    {
        "comment_id": "lxxs4p0",
        "subreddit": "books",
        "body": "Isn't that basically all collecting? Like a stamp collector isn't going out and finding rare stamps for the joy of using them to mail out letters.\n\nI know a guy who collects rare cars and is proud of the fact that they have low miles so he doesn't drive them.",
        "time": "2024-11-19 15:20:35 UTC",
        "score": 1,
        "link_id": "t3_1gu6pqo",
        "parent_id": "t1_lxt5ows"
    },
    {
        "comment_id": "lxxrwa8",
        "subreddit": "books",
        "body": "As the saying goes reading books and collecting books are 2 different hobbies.",
        "time": "2024-11-19 15:19:21 UTC",
        "score": 1,
        "link_id": "t3_1gu6pqo",
        "parent_id": "t1_lxssg96"
    },
    {
        "comment_id": "lxxr59e",
        "subreddit": "books",
        "body": "Plenty of authors hit the ground running with great books. Look at joe Abercrombie for example his first book was the start of a series that's among the best in the last decade. I've yet to read a first law book that I didn't like.",
        "time": "2024-11-19 15:15:22 UTC",
        "score": 1,
        "link_id": "t3_1gu6pqo",
        "parent_id": "t1_lxt2uwf"
    },
    {
        "comment_id": "lxiuj60",
        "subreddit": "books",
        "body": "I dunno what barnes and noble you shop at that's cheaper than Amazon.  Looking at the last book I got barnes and noble is 10% more expensive and that's online.  For whatever reason it's usually a few dollars more expensive in store. \n\nI've got a book pre-ordered that comes out next month. Amazon has it for $25 barnes and Nobel has it for $35 online and that's $5 off so it'll probably be $40 in store.",
        "time": "2024-11-17 01:08:14 UTC",
        "score": 10,
        "link_id": "t3_1gsz0rc",
        "parent_id": "t1_lxif6q4"
    },
    {
        "comment_id": "lxamwbd",
        "subreddit": "books",
        "body": "The expanse did thus at least on the side of the book. The first few start out woth the name of the book in huge letters and then underneath in small letters \"James s.a. corey\" and then from like book 4 on its the opposite. \n\nhttps://www.reddit.com/r/TheExpanse/s/2BUbWQej0I",
        "time": "2024-11-15 17:25:12 UTC",
        "score": 1,
        "link_id": "t3_1goruym",
        "parent_id": "t3_1goruym"
    },
    {
        "comment_id": "lv68mzl",
        "subreddit": "books",
        "body": "Dows 11/22/63 count as political? I mean it's about preventing Kennedy from being assassinated so maybe.",
        "time": "2024-11-03 13:15:37 UTC",
        "score": 1,
        "link_id": "t3_1gigkn0",
        "parent_id": "t3_1gigkn0"
    },
    {
        "comment_id": "lu0jqgr",
        "subreddit": "books",
        "body": "I buy discworld books in physical form since footnotes are such a big part if the reading experience.",
        "time": "2024-10-27 14:46:29 UTC",
        "score": 4,
        "link_id": "t3_1gd786y",
        "parent_id": "t1_lu0a66i"
    },
    {
        "comment_id": "lu0j2m9",
        "subreddit": "books",
        "body": "Yes. Especially if it's winter time. I like being able to read while I walk to the store and what not but with sunset so early that'd harder with a physical book.",
        "time": "2024-10-27 14:42:45 UTC",
        "score": 1,
        "link_id": "t3_1gd786y",
        "parent_id": "t3_1gd786y"
    },
    {
        "comment_id": "lu0it85",
        "subreddit": "books",
        "body": "They are absolutely able to do that. You don't even need a publisher. Just write it and sell it on your website.",
        "time": "2024-10-27 14:41:16 UTC",
        "score": 4,
        "link_id": "t3_1gd786y",
        "parent_id": "t1_lu01et5"
    },
    {
        "comment_id": "ltd6wku",
        "subreddit": "books",
        "body": "No. At best I'm interested in the story and not what someone's got to say about it and at worst they're often written in such a way as to explain themes in the story and as such often have spoilers. \n\n\"When X happened in the story it was an alegory to this battle from WW2 when A, B, C happened\". Wow thanks I now know that something will happen that will have A, B, C adjacent things.",
        "time": "2024-10-23 16:38:42 UTC",
        "score": 2,
        "link_id": "t3_1g94udv",
        "parent_id": "t3_1g94udv"
    },
    {
        "comment_id": "lt2j3ec",
        "subreddit": "books",
        "body": "It's great but almost done for the year. Iirc it takes place between march and November.",
        "time": "2024-10-21 21:05:21 UTC",
        "score": 3,
        "link_id": "t3_1g8z5sc",
        "parent_id": "t1_lt2iqa0"
    },
    {
        "comment_id": "lt29l02",
        "subreddit": "books",
        "body": "Maybe dracula? It's written as journal entries so you could read 1 or 2 in the morning.",
        "time": "2024-10-21 20:19:30 UTC",
        "score": 8,
        "link_id": "t3_1g8z5sc",
        "parent_id": "t3_1g8z5sc"
    },
    {
        "comment_id": "lsor5fh",
        "subreddit": "books",
        "body": "I'd say it's like low-mid fantasy. It's based on like an alternative version of earth but no different species (elves, dwarves etc) and it's still very clearly just our earth.",
        "time": "2024-10-19 14:11:05 UTC",
        "score": 25,
        "link_id": "t3_1g771ul",
        "parent_id": "t3_1g771ul"
    },
    {
        "comment_id": "ls0wats",
        "subreddit": "books",
        "body": "Go to the discworld subreddit and it's fairly common for people to refuse to read shepherd's crown for thst reason.  Not only is it Terry's last book before he passed but one of his most iconic characters also passes in the book.",
        "time": "2024-10-15 11:49:38 UTC",
        "score": 1,
        "link_id": "t3_1g1t55q",
        "parent_id": "t1_lrwld0u"
    },
    {
        "comment_id": "ls0vwqf",
        "subreddit": "books",
        "body": "I honestly don't get how rothfuss gets so much leeway. He claimed before the first book even came out that thr series was already written and ready to publish and then the shit he pulled with that charity chapter that people have been waiting years for.",
        "time": "2024-10-15 11:46:32 UTC",
        "score": 1,
        "link_id": "t3_1g1t55q",
        "parent_id": "t1_lrizbux"
    },
    {
        "comment_id": "ls0vpr8",
        "subreddit": "books",
        "body": "John gwynne comes to mind. He was releasing his bloodsworn sage books a year apart but between the 2nd and 3rd his daughter passed. Sucked having to wait an extra year but completely understandable, and I hope he got to take the time he needed.",
        "time": "2024-10-15 11:44:58 UTC",
        "score": 1,
        "link_id": "t3_1g1t55q",
        "parent_id": "t3_1g1t55q"
    },
    {
        "comment_id": "lrw6qwi",
        "subreddit": "books",
        "body": "Not so much to advance rank but red rising is guilty of this. They take the best of the best in this military school thing and then on the first night they split them into groups of 2 and say only one can leave the room and if they can't bring themselves to kill the other both dies.",
        "time": "2024-10-14 16:03:37 UTC",
        "score": 2,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrvcvx8"
    },
    {
        "comment_id": "lrw5tyy",
        "subreddit": "books",
        "body": ">Honorable mention: Just putting your characters through as much misery as you can think of and then passing that off as good drama writing.\n\nI mean sometimes it is. Pick up the realm of the elderlings books and they're like this. Hobb drags her characters through the mud but it's spectacular drama and she's an incredible author.",
        "time": "2024-10-14 15:58:45 UTC",
        "score": 3,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lru838t"
    },
    {
        "comment_id": "lrw5b0i",
        "subreddit": "books",
        "body": "That's not true. Maybe for poorly written ones but plenty have this and still manage twists well. Then there's ones like in the first red rising trilogy where the main character just pulls out cheap shit that's not even hinted at and it sounds like kids on a park playing when one is like \"uh, I use my invincibility shield\".\n\nEven worse in the third book where the character straight up lies to the audience.  We see inside their head and they're like oh shit everything is wrong and now my friend is dead and then the next scene they're like psych it wad all planned and he's not actually dead.",
        "time": "2024-10-14 15:55:57 UTC",
        "score": 3,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lruk3cd"
    },
    {
        "comment_id": "lrw4nsi",
        "subreddit": "books",
        "body": "Hardly the case that every narrator is unreliable.  The trops is when they lie and what not to make themselves sound better.",
        "time": "2024-10-14 15:52:34 UTC",
        "score": 1,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lruye40"
    },
    {
        "comment_id": "lrw46sz",
        "subreddit": "books",
        "body": "What about when they go through it in the book? Robin hobb comes to mind. Her characters don't start with a lost of tragedies they've faced but she treats her characters like garbage in her books and just drags them through the mud.",
        "time": "2024-10-14 15:50:07 UTC",
        "score": 3,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtxl09"
    },
    {
        "comment_id": "lrw38vt",
        "subreddit": "books",
        "body": "Red rising had this. Not super trivial but not like the main character had a choice.",
        "time": "2024-10-14 15:45:11 UTC",
        "score": 2,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtq6r6"
    },
    {
        "comment_id": "lrw20n7",
        "subreddit": "books",
        "body": "The worst part of the wheel of time is one of the main characters being pregnant naf just taking baths for dozens of pages at a time. And then doing stupid stuff that is extra dangerous because the character that can predict the future said she'll have healthy twins. She's all \"oh nothing bad can happen because X said the babies will be born nice and healthy\". Till the end when she's captured and the bad guy is going to cut the babies out and she finally realizes that the babies being born healthy doesn't mean anything about her.",
        "time": "2024-10-14 15:38:41 UTC",
        "score": 6,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrttd1a"
    },
    {
        "comment_id": "lrw0zrv",
        "subreddit": "books",
        "body": "Manic pixie dream girl.",
        "time": "2024-10-14 15:33:10 UTC",
        "score": 4,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrts20r"
    },
    {
        "comment_id": "lrw0qag",
        "subreddit": "books",
        "body": "Do they have a really awkward train of sex when they're like 12?",
        "time": "2024-10-14 15:31:45 UTC",
        "score": 1,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrto7nz"
    },
    {
        "comment_id": "lrw0baj",
        "subreddit": "books",
        "body": "I feel like you'd need a bigger series to do this well where they're actually enemies. Think like dresden files where characters go from actual enemies to reluctantly working together to lovers over the course of 10-15 books.",
        "time": "2024-10-14 15:29:32 UTC",
        "score": 2,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtm9lv"
    },
    {
        "comment_id": "lromkbv",
        "subreddit": "books",
        "body": "Exactly what I was thinking of when I read it. 60+ page prolongs are normal with the longest being 100 pages.",
        "time": "2024-10-13 06:22:20 UTC",
        "score": 8,
        "link_id": "t3_1g2i5n7",
        "parent_id": "t1_lroe79j"
    },
    {
        "comment_id": "lqjwacm",
        "subreddit": "books",
        "body": "Depends on what I'm currently reading.  I'm 26 books into discworld right now so when I finished book 25 yesterday I just popped open book 26 and started.",
        "time": "2024-10-06 01:39:41 UTC",
        "score": 2,
        "link_id": "t3_1fwixm1",
        "parent_id": "t3_1fwixm1"
    },
    {
        "comment_id": "lqj79id",
        "subreddit": "books",
        "body": "Dog ear.",
        "time": "2024-10-05 23:02:15 UTC",
        "score": 1,
        "link_id": "t3_1fwlqbf",
        "parent_id": "t3_1fwlqbf"
    },
    {
        "comment_id": "lpweuq6",
        "subreddit": "books",
        "body": "Eh, I'd worry the story is very shallow if that short. Guess it depends on book length. That long for a <80k word novella sure but a full length 500-800 page novel that's a bit soon. When we start getting into bigger fantasy works 1000-1400 pages if it's coming out in 6-9 months there's bound to be many many things that are just convoluted.",
        "time": "2024-10-02 00:16:54 UTC",
        "score": 3,
        "link_id": "t3_1fu2djc",
        "parent_id": "t1_lpwa4t8"
    },
    {
        "comment_id": "lpwejpd",
        "subreddit": "books",
        "body": "As long as it takes. Brandon sanderson's last stormlight archive book came out in December 2020 and the next is this December and I'm anxious for it.",
        "time": "2024-10-02 00:14:58 UTC",
        "score": 1,
        "link_id": "t3_1fu2djc",
        "parent_id": "t3_1fu2djc"
    },
    {
        "comment_id": "lopjtei",
        "subreddit": "books",
        "body": "Not everyone.  Joe Abercrombie has no problem writing hey this guy is just a piece of shit because he's a piece of shit. Even his main characters are often just pieces of shit for the sake of being pieces of shit. \n\nWhen they do have backstories its not justification it's just a thing that happened.  Glokta tortures people and forces false confessions before locking them up for life or killing them. He's a piece of shit. He's got a backstory where he was a war hero and then was tortured so he's in constant pain and had no teeth because they were all pulled out etc but it's never written as justification for him being a piece of shit.",
        "time": "2024-09-24 16:05:20 UTC",
        "score": 3,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lood3dq"
    },
    {
        "comment_id": "lopih26",
        "subreddit": "books",
        "body": "That's absolutely feminist.  Women can do anything a man can. Including being power hungry and willing to kill to get it.\n\nA woman killing a man to take power is not any less egalitarian than a man killing a man to take power.",
        "time": "2024-09-24 15:58:16 UTC",
        "score": 40,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_lophgep"
    },
    {
        "comment_id": "looavqx",
        "subreddit": "books",
        "body": "House of the dragon has. Can't say for the other.",
        "time": "2024-09-24 11:36:44 UTC",
        "score": 7,
        "link_id": "t3_1fo9993",
        "parent_id": "t1_loo4roe"
    },
    {
        "comment_id": "lnc0324",
        "subreddit": "books",
        "body": "For what it's worth I have a friend from Mexico whose very common nickname will get you banned in most subs. And I know that because I accidentally used it in a typo and got a 3 day reddit wide ban.",
        "time": "2024-09-15 23:55:52 UTC",
        "score": 11,
        "link_id": "t3_1fhmc9z",
        "parent_id": "t1_lnbevb8"
    },
    {
        "comment_id": "lmrincs",
        "subreddit": "books",
        "body": "I always buy with intention. But going to waste money buying books I'm probably going to dnf. I've got a big enough tbr that I don't worry about running out of ideas for what to read next.  Also I find it silly to go just browse randomly around looking for things to spend money on so I don't do it.\n\nI did buy one last year based on an interesting premise and cover (starter villain) and it was crap so that just sort of reenforced what I normally do.",
        "time": "2024-09-12 13:40:21 UTC",
        "score": 1,
        "link_id": "t3_1ff19a4",
        "parent_id": "t3_1ff19a4"
    },
    {
        "comment_id": "lm7mvat",
        "subreddit": "books",
        "body": "I heard that was around the newer ones. People speculate that's why there was no more yearly releases. Something about her getting X% of any book he wrote in the 4 years after the divorce so he just didn't write any.",
        "time": "2024-09-09 01:31:18 UTC",
        "score": 9,
        "link_id": "t3_1fcalom",
        "parent_id": "t1_lm6zr44"
    },
    {
        "comment_id": "llulgkd",
        "subreddit": "books",
        "body": "She was not destroyed at the end of season 2. She just said she was happier before becoming queen.  She's destroyed by it in the books when she spends the rest of her life basically in a catatonic state.",
        "time": "2024-09-06 20:12:26 UTC",
        "score": 0,
        "link_id": "t3_1f9g92k",
        "parent_id": "t1_llnzhk7"
    },
    {
        "comment_id": "llul3v2",
        "subreddit": "books",
        "body": "Like ned stark?",
        "time": "2024-09-06 20:10:34 UTC",
        "score": 2,
        "link_id": "t3_1f9g92k",
        "parent_id": "t1_llnz1fl"
    },
    {
        "comment_id": "lluhsfo",
        "subreddit": "books",
        "body": "I've read a few of these romantasy ones and they have mostly just been garbage.  Good characters? Nowhere close to the character work we get with people like Abercrombie or even pratchett. Go read the first law books and get back to me on well written characters. \n\nHe'll go pick up the Tiffany aching discworld books and you'll see you can have better characters in kids books.\n\nI'm currently reading a children's book about rabbits that's get character work on the same level as many if these romantasy books. Go pick up watership down.",
        "time": "2024-09-06 19:52:52 UTC",
        "score": 1,
        "link_id": "t3_1f9g92k",
        "parent_id": "t1_lloyeya"
    },
    {
        "comment_id": "llufca2",
        "subreddit": "books",
        "body": "Maybe but I doubt the show will ever be complete so who knows. Latest news is they said they aren't greenlighting season 4 until after season 3 airs and it has to do significantly better than season 2. Also something about a possible 3-3.5 years between seasons.",
        "time": "2024-09-06 19:39:47 UTC",
        "score": 1,
        "link_id": "t3_1f9g92k",
        "parent_id": "t1_llodd4d"
    },
    {
        "comment_id": "lln9fby",
        "subreddit": "books",
        "body": "It's good but I would maybe skip it as it's unfinished and unlikely to ever be finished. If you want a big one that's also a cultural phenomenon pick up stormlight archives or something.  It's another fantasy epic that's not finished but the final book comes out in December. \n\n\nFor any pedantic stormlight fans shut up I know about the extra 5 books in the world that are planned but this current story is done with book 5 later this year.\n\n\nThat being said those names are also not super modern they just sound it. Have you seen cgp Grey's video on the name tiffany and how it seems modern but is over 1000 years old?",
        "time": "2024-09-05 15:53:41 UTC",
        "score": 1,
        "link_id": "t3_1f9ne07",
        "parent_id": "t3_1f9ne07"
    },
    {
        "comment_id": "lll0u6t",
        "subreddit": "books",
        "body": "Kyle in the liveship trader series. Every time he shows up I'm just like please someone kill this guy.",
        "time": "2024-09-05 04:57:07 UTC",
        "score": 1,
        "link_id": "t3_1f67yo5",
        "parent_id": "t3_1f67yo5"
    },
    {
        "comment_id": "ljwq2uf",
        "subreddit": "books",
        "body": "As long as you still check it out to not mess up their metrics maybe",
        "time": "2024-08-25 20:11:51 UTC",
        "score": 12,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljw1b46"
    },
    {
        "comment_id": "ljw0lg1",
        "subreddit": "books",
        "body": "I mean if you're pirating something you've already bought then they are being paid for their work still.",
        "time": "2024-08-25 17:49:21 UTC",
        "score": 38,
        "link_id": "t3_1f0whdx",
        "parent_id": "t1_ljvds67"
    },
    {
        "comment_id": "lj64f8t",
        "subreddit": "books",
        "body": "Probably another prequel or whatever they call a book thst takes place between two other ones now.",
        "time": "2024-08-21 06:17:07 UTC",
        "score": 1,
        "link_id": "t3_1ex466k",
        "parent_id": "t1_lj3on8z"
    },
    {
        "comment_id": "lj642pb",
        "subreddit": "books",
        "body": "Rothfuss claimed his were already written and ready to go in 2008 so very similar.",
        "time": "2024-08-21 06:13:35 UTC",
        "score": 1,
        "link_id": "t3_1ex466k",
        "parent_id": "t1_lj3t2t4"
    },
    {
        "comment_id": "lhy2khj",
        "subreddit": "books",
        "body": "Not a fan. I find the writing usually way below the level of the authors who originally wrote the works and in the lore rich books I read they tend to disregard a lot of lore and character motivations. That's not to say it's always bad to write in another author's world. Brandon sanderson finished the wheel of time without destroying lore and with minimal(I know this is contested) character changes but he also is a much better author than most fan fic authors I've heard of and he delves way into book outlining and took years for each one. \n\nA lot of the ones I've seen tend to sort of flanderize the characters or the world. Take a well crafted grim dark world with amazing characters like the first law and write some sophomore level story that focuses only on the violence and comes across like it was written for 15 year old boys. Take something like discworld and try to male cheeky fantasy and instead the jokes come across as corny and forced because they aren't as good at satire as Terry pratchett.",
        "time": "2024-08-13 18:00:48 UTC",
        "score": 2,
        "link_id": "t3_1eraloh",
        "parent_id": "t3_1eraloh"
    },
    {
        "comment_id": "lg5824a",
        "subreddit": "books",
        "body": "The narrator is a huge part of it. Unfortunately for some reason I just sort of bounce off female narrators aside from Kate redding for example. It's not like I like all male narrators it's just that they have a higher likelihood of hooking me. Dunno if it's the narrator or maybe the type of book they're more likely to have a female vs male narrator for but I think it's probably the narrator since some of my favorite physical books don't hook me in audiobook format (liveship traders for example where the books are fucking amazing but the narrator is like nails on a chalkboard and I zone out after 2 min.)",
        "time": "2024-08-02 14:25:17 UTC",
        "score": 2,
        "link_id": "t3_1ei4bti",
        "parent_id": "t3_1ei4bti"
    },
    {
        "comment_id": "lg57db1",
        "subreddit": "books",
        "body": "Games that don't really require you to focus on more than 1 thing and no dialog. Doing some repetitive task like farming or fishing in stardew Valley. Or just puzzle games. The wife churns through nonogram puzzles while she listens to ebooks or podcasts.",
        "time": "2024-08-02 14:21:26 UTC",
        "score": 2,
        "link_id": "t3_1ei4bti",
        "parent_id": "t1_lg4rv7v"
    },
    {
        "comment_id": "lfw67k8",
        "subreddit": "books",
        "body": "Not to spoil anything but she's a bit more important than that and drives a lot of the latter books.",
        "time": "2024-07-31 23:19:25 UTC",
        "score": 1,
        "link_id": "t3_1eefe63",
        "parent_id": "t1_lff042d"
    },
    {
        "comment_id": "lfgvrwe",
        "subreddit": "books",
        "body": "I read the first 3 as a kid before my mom went off the religious deep end and I wad not allowed to read then anymore and I've only ever seen the first movie. After having a coworker recommend them a few times I started reading them at 32 and they were a pretty fun read.",
        "time": "2024-07-29 10:44:12 UTC",
        "score": 1,
        "link_id": "t3_1eeqr58",
        "parent_id": "t3_1eeqr58"
    },
    {
        "comment_id": "lek7mof",
        "subreddit": "books",
        "body": "Sure but that doesn't really dispute what you quoted. \nIf 30 years ago there were 30 male reading role models and 30 female reading role models and now there's 2 male ones and 10 female ones then both statements are accurate.",
        "time": "2024-07-23 15:55:25 UTC",
        "score": 6,
        "link_id": "t3_1eaa17q",
        "parent_id": "t1_lek1ht7"
    },
    {
        "comment_id": "lek78yb",
        "subreddit": "books",
        "body": "That before hustle culture and what not. Now if you ask what a man should read you're likely to get non-fiction dude bro suggestions.",
        "time": "2024-07-23 15:53:24 UTC",
        "score": 1,
        "link_id": "t3_1eaa17q",
        "parent_id": "t1_lek2exh"
    },
    {
        "comment_id": "lek675k",
        "subreddit": "books",
        "body": "I mean it's definitely been a stereotype for a long time. Most people (at least americans) don't really read and it's sort of assumed that women read more and that when guys read they're supposed to read non-fiction.",
        "time": "2024-07-23 15:47:53 UTC",
        "score": 17,
        "link_id": "t3_1eaa17q",
        "parent_id": "t1_lejy7jx"
    }
]