[
    {
        "comment_id": "lrxhdej",
        "subreddit": "books",
        "body": "A professor of mine once shared a quote with my class that you never own a book until you've annotated it  (I forget who said it originally).  He described truly reading a book regardless of the subject as a conversation between the writer and the reader - sometimes you have to talk back in order to understand what the writer is saying to you.",
        "time": "2024-10-14 20:07:36 UTC",
        "score": 6,
        "link_id": "t3_1g3oirc",
        "parent_id": "t3_1g3oirc"
    },
    {
        "comment_id": "lpvg3xx",
        "subreddit": "books",
        "body": "Read with her.  If she likes arts and crafts, maybe there's something you could do related to the books to engage her imagination.",
        "time": "2024-10-01 20:53:31 UTC",
        "score": 66,
        "link_id": "t3_1ftyccj",
        "parent_id": "t3_1ftyccj"
    },
    {
        "comment_id": "lovzk18",
        "subreddit": "books",
        "body": "I think I picked up my first Stephen King book around 11 or 12.... really got into it in 7th grade when my shop teacher read Eyes of the Dragon.   I think the important thing to note is that not all of his books are bone-chilling horror - some are dark fantasy.  I was definitely into the latter before I started reading his more classic horror stuff.\n\nMy mom was definitely aware of Stephen King.  She was basically of the opinion that if I was reading that was good enough - as long as it wasn't some porn-in-prose romance novels or anything radically political.",
        "time": "2024-09-25 17:39:48 UTC",
        "score": 1,
        "link_id": "t3_1fozps4",
        "parent_id": "t3_1fozps4"
    },
    {
        "comment_id": "lkdg28h",
        "subreddit": "books",
        "body": "E.M. Forster's The Machine Stops.\n\nA little more on the bleak side but Forster envisioned a world in which humanity spent untold hours detached from one another in tiny apartments reaching out through screens to experience their lives.\n\nIt was written in 1909 and it's chilling some of the similarities it has to modern society.",
        "time": "2024-08-28 17:29:00 UTC",
        "score": 3,
        "link_id": "t3_1f2z42j",
        "parent_id": "t3_1f2z42j"
    },
    {
        "comment_id": "li5dylf",
        "subreddit": "books",
        "body": "Slaughterhouse is a great read.  I'd also recommend some of his short works (personally recommend [Big Trip Up Yonder](https://www.gutenberg.org/files/30240/30240-h/30240-h.htm) which is available on Project Guttenberg)",
        "time": "2024-08-14 22:37:07 UTC",
        "score": 1,
        "link_id": "t3_1es9uvr",
        "parent_id": "t3_1es9uvr"
    },
    {
        "comment_id": "lh0tnww",
        "subreddit": "books",
        "body": "Interview was objectively my least favorite of the chronicles,  apart from maybe blackwood farm.  Lestat has much more energy and flair and the next few books keep that energy rolling.",
        "time": "2024-08-07 23:23:14 UTC",
        "score": 2,
        "link_id": "t3_1ely9j7",
        "parent_id": "t3_1ely9j7"
    },
    {
        "comment_id": "lh0qh9t",
        "subreddit": "books",
        "body": "Nice! You're in for a wild ride, friend.\nPolka will never die!",
        "time": "2024-08-07 23:04:27 UTC",
        "score": 1,
        "link_id": "t3_1emmb0o",
        "parent_id": "t1_lh0me40"
    },
    {
        "comment_id": "lh0ga7z",
        "subreddit": "books",
        "body": "Wizard and Glass by Stephen King  \nThe Martian by Andy Weir  \nDead Beat by Jim Butcher  \nMemnoch the Devil by Anne Rice  \nJurassic Park by Michael Crichton  \nThe Eyes of the Dragon by Stephen King  \nSpeaker for the Dead by Orson Scott Card  \nA Princess of Mars by Edgar Rice Burroughs  \nWe Are Legion; We Are Bob by Dennis E Taylor  \nPale Blue Dot by Carl Sagan",
        "time": "2024-08-07 22:05:32 UTC",
        "score": 1,
        "link_id": "t3_1emmb0o",
        "parent_id": "t3_1emmb0o"
    }
]