[
    {
        "comment_id": "lxj7mby",
        "subreddit": "books",
        "body": "Amazon hasn’t had a book for sale from my saved for later list in almost a year maybe more. \n\nI give all my friends my account so they can earn points for me and get discounts when they have them. I use the points in November December to buy books as gifts.",
        "time": "2024-11-17 02:32:18 UTC",
        "score": 2,
        "link_id": "t3_1gsz0rc",
        "parent_id": "t1_lxie5qp"
    },
    {
        "comment_id": "lx1t56q",
        "subreddit": "books",
        "body": "They also want to ban books that makes kids question authority or think for themselves. Or question anything for that matter. \n\nAnd if we’re being honest they want to defund the department of education or get rid of if they can. They don’t want kids to know how to read at all so the only information they get is from their politically aligned news sources.",
        "time": "2024-11-14 06:31:44 UTC",
        "score": 29,
        "link_id": "t3_1gqsr02",
        "parent_id": "t3_1gqsr02"
    },
    {
        "comment_id": "lvrsyd0",
        "subreddit": "books",
        "body": "I don’t remember AR having levels when I was young. I just read anything I thought was interesting and my teacher would give me a prize for doing one of the tests. \n\nForcing kids to stay in levels would just hinder them from actually expanding or testing their reading skills. Instead they should be encouraged to read what interests them and encouraged to take the at tests to see how well they remember the contents of the book.",
        "time": "2024-11-06 19:59:42 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvobupt"
    },
    {
        "comment_id": "lvlpnjb",
        "subreddit": "books",
        "body": "I see this in my nephews. \n\nI frequently try to encourage them to read and I do not pressure them to do so. I gift them all sorts of books and I always tell them it’s okay if they don’t like them but if they do happen to like any books I have gotten them I frequently tell them I will buy more if they tell me which ones they like. \n\nI usually get them the first book to different series so they can have variety and maybe find a series they really love. I don’t think they’ve ever finished a single book I’ve ever given them or even opened them at all. I hide money in the pages of the books I give them and whenever I go visit I check their bookshelf and I open books I’ve given them only to find all the money still right where I left it every time. \n\nI always check to make sure the books are age appropriate before I buy them and I always encourage them to at least try them. They never do and recently they told me reading sucks and reading was boring or stupid but when I asked why they thought that they didn’t have an answer for me it’s like they were repeating something they had heard from someone else or maybe YouTube.\n\nI’ve gotten them; Ralph S Mouse, Magic Treehouse regular and graphic novels, Redwall, Guardians of Gahoole, Warrior cats regular and the graphic novel, dogman, dairy of a wimpy kid, wings of fire regular and the graphic novel, Fablehaven, Tunnels, The Buccaneers, Artemis fowl regular and graphic novel, percy Jackson regular and graphic novel, the Indian and the cupboard, various kids science and history books, Wolves of the beyond, Gregor the overlander, Narnia box set, and more. All of them sit gathering dust on a shelf in the corner of their room.\n\nThey would rather play on their iPads and watch YouTube shorts. I cannot even get them to watch a full length movie because they don’t have the attention span to watch more than a few minutes of it without asking me when it’s going to end and they can have their iPads back. They get bored of listening to audiobooks on car rides and they want their iPads instead. They have a Nintendo switch and they don’t use it because “it gets boring too fast.” \n\nI will no longer be buying them any books because I know they won’t read them. I even saw the wild robot book set and I nearly got it for them but I remembered they haven’t touched a single book I’ve ever given them and it would be a waste of my money buying them books. And I keep asking what they want for Christmas and they don’t know so if they don’t figure something out soon they’ll just be a single rc car each and clothes.",
        "time": "2024-11-05 22:37:06 UTC",
        "score": 4,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t3_1gk1bxm"
    },
    {
        "comment_id": "lvk8o4m",
        "subreddit": "books",
        "body": "Graphic novels are a good start. They have graphic novels for percy Jackson, Artemis fowl, magic treehouse, wings of fire, and even Warriors now.",
        "time": "2024-11-05 18:18:06 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvjwwaz"
    },
    {
        "comment_id": "lvk83e6",
        "subreddit": "books",
        "body": "My school teacher gave us candies or little toys like food shaped erasers or scented pencils every time we took one of those AR tests.",
        "time": "2024-11-05 18:15:20 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvj9kaa"
    },
    {
        "comment_id": "lvk7c6z",
        "subreddit": "books",
        "body": "Funny you mention bridge to terabithia I was looking at amazons holiday deals and it had the bridge to terabithia and where the red fern grows on sale for holiday gifts. Giving the gift of trauma to kids this year.",
        "time": "2024-11-05 18:11:40 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvibxfl"
    },
    {
        "comment_id": "lvk6vfy",
        "subreddit": "books",
        "body": "From what I’ve been seeing is less and less teens making fan fiction or reading fan fiction as well. It’s extremely obvious by looking at comments and not seeing any poorly written/obviously written by a teenager fanfiction.",
        "time": "2024-11-05 18:09:25 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvi149c"
    },
    {
        "comment_id": "lvk5u6k",
        "subreddit": "books",
        "body": "I think Harry Potter was made before JK started huffing glue or whatever it is she’s on. Harry Potter is a great series and beloved by many and don’t let the author ruin the story for your kids who dont know the author is a nutcase.",
        "time": "2024-11-05 18:04:25 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvjryf4"
    },
    {
        "comment_id": "lvk51ue",
        "subreddit": "books",
        "body": "When I was in school in the US they would take your books if you read for your own entertainment. They wanted kids to focus on what their teachers no matter what. Even if I finished my work or finished a test and picked up a book to not bother anyone else it would be taken from me and I was forced to just sit there. Apparently reading a book is disruptive and disrespectful to others as I was told.",
        "time": "2024-11-05 18:00:37 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvjhanr"
    },
    {
        "comment_id": "lvk4ek0",
        "subreddit": "books",
        "body": "Is that where you take the tests on books you read? My teacher in school would give you a candy or something for each time you finished one and did a good job.",
        "time": "2024-11-05 17:57:33 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvjem33"
    },
    {
        "comment_id": "lvk2stq",
        "subreddit": "books",
        "body": "I’ve bought my nephews the first book to almost every series I’ve ever read and even some I haven’t just hoping to find a single book that might seem interesting enough they will read it. They haven’t touched a single one. \n\nHarry Potter, Redwall, Gregor the overlander, magic treehouse, warrior cats, wings of fire, guardians of gahoole, wolves of the beyond, Ralph S mouse, the Indian in the cupboard, Percy Jackson, fable haven, series of unfortunate events, Artemis fowl, Tunnels, the buccaneers, seekers, captain underpants, dogman, science activity books, history books, dinosaur books, the hobbit, dairy of a wimpy kid, Narnia, and more. \n\nI saw the wild robot books as a set at Costco and I nearly got if for them for Christmas and then I thought “they will never read it, why should I waste money trying.” And I walked away deciding I’m not getting them any books until they ask me for one.",
        "time": "2024-11-05 17:49:54 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvhs3hi"
    },
    {
        "comment_id": "lvk0q6i",
        "subreddit": "books",
        "body": "Buy him some adult fantasy books for Christmas.",
        "time": "2024-11-05 17:39:56 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvif8b3"
    },
    {
        "comment_id": "lvk04a8",
        "subreddit": "books",
        "body": "It may be a factor to many kids but I buy my nephews books all the time and I hide money in them. Every time I go to their house their bookshelf is untouched and if I flip through the pages of each book I find the money is still there. \n\nThis is the first Christmas I won’t be giving them a book. It’s obvious they will never read them.",
        "time": "2024-11-05 17:36:59 UTC",
        "score": 4,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvi0vw7"
    },
    {
        "comment_id": "lv2zi0l",
        "subreddit": "books",
        "body": "Hopefully at least a few of them actually end up in the hands of someone who really wanted them. \n\nI see videos constantly of people taking books from little free libraries and scanning the barcodes and taking them to resell and the caption will be some stupid thing like “support the hustle” or “reselling is a great way to make extra cash” and they brag about driving to higher income areas and taking all the books because they’re better quality and higher income areas always have books they can take.\n\nThen in more religious areas I see people making videos where they go to little free libraries and take any book they don’t approve of and destroy them because they “don’t follow the word of god” or “it’s witchcraft/hearsay/satanism” or “makes children stray from god” or “children should only be reading the Bible” Then they put a bunch of religious excerpts and Bible verses if not literal bibles in there instead.",
        "time": "2024-11-02 21:38:52 UTC",
        "score": 1,
        "link_id": "t3_1ggb40u",
        "parent_id": "t1_luphpa1"
    },
    {
        "comment_id": "lgza7wu",
        "subreddit": "books",
        "body": "I believe the first hunger games film to be an excellent adaptation of the source material. It followed the books extremely closely and for that I believe it was successful and a great adaptation. \n\nIt is very hard to find good film adaptations based on books and most film studios don’t want to risk making a film that won’t draw in massive unrealistic audiences like they want so when they do pick up a book to make a film adaption of it usually gets changed at the studios behest or the director chooses to make their own changes. Usually if the studio wants a more ‘marketable’ film they change the story to ‘appeal to broader audiences’ which often means they’ve drastically edited the themes or whatever else to be more ‘appealing’ or more people which often ruins these films. Then there’s when a director or writer makes changes and wants to make the film their own in a way and they decide to rewrite things to either make their own story or redo things that result in a film that feels more like a fanfiction of the source material.",
        "time": "2024-08-07 18:27:54 UTC",
        "score": 2,
        "link_id": "t3_1elzle0",
        "parent_id": "t3_1elzle0"
    },
    {
        "comment_id": "lgz891e",
        "subreddit": "books",
        "body": "Pendragon was great I regret giving away book 1 to a friend’s younger brother. \n\nI believe I read Pendragon, Relic Master, and Gregor the overlander series all around the same time.",
        "time": "2024-08-07 18:17:55 UTC",
        "score": 1,
        "link_id": "t3_1elzm8n",
        "parent_id": "t3_1elzm8n"
    },
    {
        "comment_id": "lgz7ln8",
        "subreddit": "books",
        "body": "So… what I’m seeing is these books will be thrown away? Easy pickings if you want to get them out of the trash. \n\nBut I understand many of these books not being available for middle or elementary school children who very likely wouldn’t be interested in them anyways.\n\nBut does this mean kids can’t bring in books they own from home? I mean if a school is held liable by the state for kids bringing books from home I would assume all school districts in Utah will discourage kids and teens from bringing books to school and actively discourage reading?",
        "time": "2024-08-07 18:14:37 UTC",
        "score": 0,
        "link_id": "t3_1eme6bt",
        "parent_id": "t3_1eme6bt"
    },
    {
        "comment_id": "lcqeegu",
        "subreddit": "books",
        "body": "I could list off types books I’ve seen banned in different places. \n\nLGBT+ mentions or reps - banned \n\nPoc main characters - banned\n\nPoc authors - banned\n\nNot Christian, catholic, or Mormon approved - banned\n\nThought provoking books with possible themes on real world topics - banned\n\nFantasy or fiction with possible themes or symbolism that can be compared to real world issues - banned\n\nNonfiction historical books that can affect someone’s judgment on real world events - banned\n\n\nCommon reasons to see books restricted is usually politically motivated, racially motivated, sexism, religiously motivated, or other forms of discrimination or hate. It’s not rocket science.",
        "time": "2024-07-11 20:47:21 UTC",
        "score": 13,
        "link_id": "t3_1e0nddm",
        "parent_id": "t3_1e0nddm"
    },
    {
        "comment_id": "l1e7csv",
        "subreddit": "books",
        "body": "I never read twilight and was still in school when the movies started and it was a huge ordeal. Seeing the whole werewolf vampire thing and the craze for vampires back then has led me to never touching a book either vampires or werewolves. All this because of all the twilight craze stuff I saw back then. I never did read twilight or watch the films and I never will.\n\nAlso I had a phase for strong female characters as a teen and nowadays if someone recommends a book and goes out of their way to say it has “strong female characters” I can’t bring myself to read it. I’m sorry but I had a whole phase of specificity reading female led books that I just can’t look at books advertised or recommended for it. I don’t even know why I feel that way but I see strong female characters or strong female lead then I don’t want anything to do with it.",
        "time": "2024-04-26 19:05:57 UTC",
        "score": 2,
        "link_id": "t3_1cdhwov",
        "parent_id": "t3_1cdhwov"
    },
    {
        "comment_id": "kx1zhem",
        "subreddit": "books",
        "body": "I don’t think its legal most places as there’s are strict rules and regulations on the treatment of human remains regardless of the requests of the person who may be donating or be the owner of said remains.\n\nYou may put it in your will that you want to be turned into a book but legally it depends on local laws and ordinances. Most places it’s will likely be a no under misuse of a corpse or even be under hazardous waste. \n\nI’m still angry I wasn’t allowed to keep my wisdom teeth.",
        "time": "2024-03-29 02:33:22 UTC",
        "score": 10,
        "link_id": "t3_1bpu8qf",
        "parent_id": "t1_kwzjb68"
    },
    {
        "comment_id": "kwvobv6",
        "subreddit": "books",
        "body": "You’re telling me… my nephews have the attention spans of flies and I buy them the first book to different series and tell them if they like it to tell me and I’ll buy them another from the series. \n\nIn 4 years they have never asked for another book and I just keep thinking maybe I’m picking the wrong books and that something else might catch their interest. I get the same reaction to asking them what kind of toys they want but they just have no interest in like anything at all.",
        "time": "2024-03-27 23:49:25 UTC",
        "score": 1,
        "link_id": "t3_1bpflvo",
        "parent_id": "t1_kwvkw9c"
    }
]