[
    {
        "comment_id": "lszho3d",
        "subreddit": "books",
        "body": "Started and finished this past week: \nGhost Season by Fatin Abbas\n\nCities Without Palms by Tarek Eltayeb\n\nThirteen Months of Sunrise by Rania Mamoun \n\nStarted: \nModern Sudanese Poetry, An Anthology \n\nStarted and DNF: \nThunderhead by Miranda Darling",
        "time": "2024-10-21 10:40:07 UTC",
        "score": 2,
        "link_id": "t3_1g8m07x",
        "parent_id": "t3_1g8m07x"
    },
    {
        "comment_id": "lruooi3",
        "subreddit": "books",
        "body": "I can’t read YA. Even when I was a YA I couldn’t read YA.",
        "time": "2024-10-14 09:40:01 UTC",
        "score": 5,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtmusk"
    },
    {
        "comment_id": "loc8eo2",
        "subreddit": "books",
        "body": "\n... I KNOW, I UNDERSTAND, I shouldn’t have done it. I, Alfa Ndiaye, son of the old, old man, I understand, I shouldn’t have. God’s truth, now I know. My thoughts belong to me alone, I can think what I want. But I won’t tell.   - At Night All Blood is Black",
        "time": "2024-09-22 09:43:57 UTC",
        "score": 1,
        "link_id": "t3_1flt2h6",
        "parent_id": "t3_1flt2h6"
    },
    {
        "comment_id": "loc87cq",
        "subreddit": "books",
        "body": "At Night All Blood is Black",
        "time": "2024-09-22 09:41:34 UTC",
        "score": 1,
        "link_id": "t3_1flt2h6",
        "parent_id": "t3_1flt2h6"
    },
    {
        "comment_id": "lob33i2",
        "subreddit": "books",
        "body": "Oh god I read a couple pages and couldn’t go on. Probably one of the worst books ever written",
        "time": "2024-09-22 02:51:29 UTC",
        "score": 1,
        "link_id": "t3_1flpj1z",
        "parent_id": "t1_lo4t1ew"
    },
    {
        "comment_id": "lj2h480",
        "subreddit": "books",
        "body": "I’m 28F and much rather read “oldies” (late 1800s to mid late 1900s) at least when it comes to American literature. So I don’t think it’s the content you guys focus on! Lots of people out there are like me. What platforms do you guys advertise your book club on? \n\nI joined a book club just yours (met virtually) during Covid. I randomly stumbled on them via Instagram. It was so funny because it was a tight knit group of girls from northern UK and then me, some random chick from NYC who never met these girls ever before. They had a rly cool brand identity and displayed their current & past reads on their instagram so just from the profile I knew I was interested. You can have an account and grow organically by commenting on author’s posts about their books. Leave reviews of books on your page, tag the author, maybe they’d repost (happened to me and I fan girled so hard). This way you gain more reach and ppl hear about you! \n\nFunny enough, Dua Lipa (that famous pop singer of today) , has an incredible book club! I never gave her one thought nor did I listen to her music and care for her. Didn’t even know she had a book club! But I heard about this book club on “book tok” (TikTok accounts for book worms) and joined it, loved it, and later found out it was Dua Lipa’s lol! Ofc since it’s a celebrity book club, there’s no actual meetings but they send emails 2x a month with content related to the book of the month as well as additional interesting articles. So that’s another format to consider \n\nBasically I’m thinking that, if you haven’t already, you need to modernize the book club by using social media and technology more to your advantage! You can also utilize traditional methods and do word of mouth.",
        "time": "2024-08-20 16:59:41 UTC",
        "score": 2,
        "link_id": "t3_1ex0g4x",
        "parent_id": "t3_1ex0g4x"
    }
]