[
    {
        "comment_id": "lx2i2hs",
        "subreddit": "books",
        "body": "Sometimes with authors like Jones, you just have to let those odd sentences sit with you. You might find as you read on that it clicks into place, or you get a feel for why it’s there, even if it never makes literal sense. It’s like a puzzle piece that doesn’t fully fit but still completes the picture.",
        "time": "2024-11-14 11:01:21 UTC",
        "score": 5,
        "link_id": "t3_1gr0fc2",
        "parent_id": "t3_1gr0fc2"
    },
    {
        "comment_id": "lx2hu6b",
        "subreddit": "books",
        "body": "At the end of the day, reading is about broadening your mind, whether it’s fiction or nonfiction. People who make it into a competition are really just limiting themselves.",
        "time": "2024-11-14 10:59:02 UTC",
        "score": 3,
        "link_id": "t3_1gr0sbn",
        "parent_id": "t3_1gr0sbn"
    },
    {
        "comment_id": "lx2hinb",
        "subreddit": "books",
        "body": "Norwegian Wood by Haruki Murakami has this bit about wanting to find a beautiful place to cry. It’s both sad and comforting, a reminder that sometimes we need our pain to feel meaningful, like it deserves a special place too.",
        "time": "2024-11-14 10:55:46 UTC",
        "score": 2,
        "link_id": "t3_1gqz41o",
        "parent_id": "t3_1gqz41o"
    },
    {
        "comment_id": "lwx23j5",
        "subreddit": "books",
        "body": "Cloud Atlas by David Mitchell technically has a movie adaptation, but I still think it’s better left as a book. The complex structure with multiple stories across time periods and genres works brilliantly on the page, but on screen, it felt jumbled and confusing. I think it’s a case where the story makes more sense in its written form.",
        "time": "2024-11-13 14:05:57 UTC",
        "score": 4,
        "link_id": "t3_1gq86b9",
        "parent_id": "t3_1gq86b9"
    },
    {
        "comment_id": "lwx1nya",
        "subreddit": "books",
        "body": "Agustina Bazterrica’s *Tender is the Flesh* is a wild and disturbing read. She’s a lesser-known Argentinian author, but her take on dystopia is brutal and unforgettable. The story imagines a world where animals are wiped out, and humans turn to cannibalism as a form of industry—it’s dark but really well done and makes you think hard about society.",
        "time": "2024-11-13 14:03:16 UTC",
        "score": 4,
        "link_id": "t3_1gqc12w",
        "parent_id": "t3_1gqc12w"
    }
]