[
    {
        "comment_id": "lzbmxpz",
        "subreddit": "books",
        "body": "There’s actually a whole domain of geopolitical thought that takes this as a kind of credo: [realism in international relations](https://en.m.wikipedia.org/wiki/Realism_(international_relations)). You can go back all the way to Thucydides in Ancient Greece; jump ahead to Machiavelli, Hobbes, Rousseau, and Clausewitz; and in the 20th and 21st century Kenneth Waltz, Reinhold Niebuhr, Hans Morgenthau, and more recently John Mearsheimer. Not to say that they all align with each other, but just that they all take a similar stance towards politics (usually geopolitics) that frames actions in terms of competition between self-interested agents in an anarchist system.",
        "time": "2024-11-27 23:20:08 UTC",
        "score": 50,
        "link_id": "t3_1h1drj1",
        "parent_id": "t1_lzbl0fu"
    },
    {
        "comment_id": "lzav5hb",
        "subreddit": "books",
        "body": "I’ve always understood the work as more of a descriptivist, rather than a prescriptivist, account of power politics. That, although Machiavelli did endorse the kinds of strategies he describes in the book, his endorsement seemed secondary (at least when I read it years ago) to his overall purpose: showing that this is how things works, regardless of one’s feelings about it. In other words, I thought of it as being like if Newton published his treatises on calculus and physics, and included commentary interspersed throughout praising the fact that force is equal to mass times acceleration.",
        "time": "2024-11-27 20:47:03 UTC",
        "score": 238,
        "link_id": "t3_1h1drj1",
        "parent_id": "t3_1h1drj1"
    },
    {
        "comment_id": "lumnnzj",
        "subreddit": "books",
        "body": "DFW didn’t commit suicide because of fame. He stopped using an antidepressant after an allergic reaction, went into a major depression, went back on the medication and tried other treatments to no avail, and then killed himself.",
        "time": "2024-10-31 01:49:36 UTC",
        "score": 1,
        "link_id": "t3_1gg0dmp",
        "parent_id": "t1_lum211g"
    },
    {
        "comment_id": "kwl1j3q",
        "subreddit": "books",
        "body": "I get through a lot of light reading via Audible and Libby, and more difficult stuff in print. Just from my own experience, I’d definitely recommend this strategy, and would urge anyone not to give up on audiobooks if they’ve had a hard time paying attention to more literary stuff.",
        "time": "2024-03-26 02:09:43 UTC",
        "score": 25,
        "link_id": "t3_1bnv0bm",
        "parent_id": "t3_1bnv0bm"
    },
    {
        "comment_id": "krzrhqz",
        "subreddit": "books",
        "body": "I feel I need to do so for difficult non-fiction or philosophy — and sometimes poetry — but definitely not for narrative fiction. I’ve done so in the past, specifically when I first got back into reading a few years ago with Virginia Woolf, whose prose was impenetrable to me at the time, but after years of reading difficult fiction I’ve come to better appreciate getting absorbed at the expense of whatever additional understanding might be gained by writing my thoughts down. Which isn’t to say that I’m never self-conscious when I read, or that I never try to discern metatextual meanings or consider what’s going on at a more abstract level. But, that that kind of thinking is in and of itself absorbing, and that writing those thoughts down is kind of repetitive — and therefore unabsorbing — insofar as you’re partly repeating what’s already occurred in your head.",
        "time": "2024-02-24 23:48:14 UTC",
        "score": 1,
        "link_id": "t3_1az6pib",
        "parent_id": "t3_1az6pib"
    },
    {
        "comment_id": "kpwmni1",
        "subreddit": "books",
        "body": "Idk, maybe Infinite Jest, which seems to have gotten less hate recently as there’s been a counter-wave against those folks who hold it up as some kind of icon of white male misogyny. But, that attitude is still widespread online.",
        "time": "2024-02-11 09:15:36 UTC",
        "score": 8,
        "link_id": "t3_1ao2m8d",
        "parent_id": "t3_1ao2m8d"
    },
    {
        "comment_id": "kawdlac",
        "subreddit": "books",
        "body": "A volume of Plato’s complete works published by Hatchett. It’s not that Plato is especially difficult to understand, sentence by sentence (though he definitely can be — eg Sophist, Parmenides, and parts of Timaeus). It’s that he is so discursive it can be hard to connect all the different points he raises. Plus, he also wrote *a lot*, and some of his dialogues are just really dry (eg Cratylus and Laws).",
        "time": "2023-11-26 22:56:41 UTC",
        "score": 1,
        "link_id": "t3_184jjxu",
        "parent_id": "t3_184jjxu"
    },
    {
        "comment_id": "kaa51ys",
        "subreddit": "books",
        "body": "From what I’ve gleaned from Nabokov interviews and the one book I read by him, Lolita, as lyrical a writer he is there’s also something cold and insular about his writing, like he’s afraid of his work being taken to mean anything outside itself, if that makes any sense. It’s almost like he’s a mathematician, or a fabulist whose only interest is creating aesthetically pleasing worlds without any relation to ours. It’s my theory at least for why he wrote Lolita from such a warped perspective as the narrator’s, to distance the audience from accepting any point made by the narrator as true. Not that literature could ever be totally insular, since it’s always communicating something, but Nabokov seemed to warp that communication as much as possible, without adopting any of the conspicuous tactics of his postmodernist peers. I’m willing to read more books by him as well as secondary literature and see how this theory holds, but if it or something more refined than it bears out, I’ll feel my aloofness towards him is justified",
        "time": "2023-11-22 09:45:04 UTC",
        "score": 1,
        "link_id": "t3_180rdbx",
        "parent_id": "t3_180rdbx"
    },
    {
        "comment_id": "k6rum5p",
        "subreddit": "books",
        "body": "Well I wouldn’t call him anonymous. As far as I know, that name’s not a pseudonym and there’s been some information about him leaked to the public, like his work at Boeing and his education at Cornell. Plus, he’s cameoed on The Simpsons and did a voice over narration for  a trailer to Inherent Vice.",
        "time": "2023-10-28 03:16:18 UTC",
        "score": 23,
        "link_id": "t3_17i2uub",
        "parent_id": "t1_k6rpyrf"
    },
    {
        "comment_id": "k5n8gr0",
        "subreddit": "books",
        "body": "Well sure, but those are just some of the major sources I could recall, and even than having a working knowledge of all that is pretty difficult. Just to give you a sense of his prose, I’m copying this from the first paragraph of the Proteus chapter, which is basically a recollection of Aristotle’s theory of color applied to a beachside vista. \n\nIneluctable modality of the visible: at least that if no more, thought through my eyes. Signatures of all things I am here to read, seaspawn and seawrack, the nearing tide, that rusty boot. Snotgreen, bluesilver, rust: coloured signs. Limits of the diaphane. But he adds: in bodies. Then he was aware of them bodies before of them coloured. How? By knocking his sconce against them, sure. Go easy. Bald he was and a millionaire, maestro di color che sanno. Limit of the diaphane in. Why in? Diaphane, adiaphane. If you can put your five fingers through it it is a gate, if not a door. Shut your eyes and see.",
        "time": "2023-10-20 03:54:12 UTC",
        "score": 1,
        "link_id": "t3_17brtes",
        "parent_id": "t1_k5n7715"
    },
    {
        "comment_id": "k5mud37",
        "subreddit": "books",
        "body": "So the Odyssey is mostly just used as a way to thematize and stylize each chapter, but is far and away not the only reason the book is difficult. In fact, noticing how each chapter parallels the Odyssey is probably the easiest part in reading any chapter. What’s difficult about the book is how Joyce is referencing about 30 different things in any line, from the Bible to old Irish myths, political episodes in 19th century Ireland, eastern philosophy, medical knowledge, etc.; how he stylizes his prose after whatever major theme he’s tackling (for example, there’s one chapter where he reconstructs the history of the English language through his prose, as in the chapter starts out in a gibberish style emulating Latin grammar, then to an old English style, then to a Middle English style, and so on); how he abruptly switches POVs; how much of the book is written in a stream of consciousness style, which is pretty difficult to understand; and how you have to keep track of hundreds of characters and events which get brought up sometimes quite obscurely, and sometimes before you’ve even first been introduced to them. The Scylla and Charybdis chapter, for example, is centered around the notion of duality, and is also a heady intellectual debate about Hamlet. Pretty much every line is a reference to a Shakespeare play, as the main character builds up the argument that “Hamlet’s grandson is his own father,” and is chock full of obscure references to schisms between Christian mysticism and modern science, Plato and Aristotle, William Blake and less emotive poets, etc. The whole point of the chapter (though like any chapter in the book, this is just the main point I found, even though there are plenty more) is about Stephen, the main character, struggling to find a middle path between a description of the world — as dictated by science and reason — as a cold, dead, determined place, and another — as pronounced by religion and unreason — where it is wondrous, sublime, and holy. The former is difficult emotionally and spiritually for Stephen, yet the latter does harm to his credulousness. Anyway, this was all just to demonstrate how very very dense the book is, and how that density disrupts the surface text so as to make it completely obscure at multiple points without secondary guides",
        "time": "2023-10-20 02:06:25 UTC",
        "score": 27,
        "link_id": "t3_17brtes",
        "parent_id": "t1_k5mkq5f"
    },
    {
        "comment_id": "k5mafn7",
        "subreddit": "books",
        "body": "So I’m reading the book right now, and that advertisement seems false for large sections of the book. I wouldn’t know how to get through Proteus, Scylla and Charybdis, Sirens, The Cyclops, and Oxen of the Sun (which is where I’m at right now) without consulting online guides and The New Bloomsday book by Harry Blamires. It’s not just that I’d miss out on meta textual allusions, hidden synchronicities, and all that like; I’d find the surface text itself impenetrable.",
        "time": "2023-10-19 23:47:32 UTC",
        "score": 35,
        "link_id": "t3_17brtes",
        "parent_id": "t1_k5lg7f9"
    },
    {
        "comment_id": "k5kwrxy",
        "subreddit": "books",
        "body": "I guess it’s not really a song, but there’s a section in Gravity’s Rainbow where a bunch of army engineers start singing limericks about having sex with various rocket parts, and whenever I see or hear a limerick I get reminded of that scene.",
        "time": "2023-10-19 18:31:47 UTC",
        "score": 2,
        "link_id": "t3_17bo7hv",
        "parent_id": "t3_17bo7hv"
    },
    {
        "comment_id": "k566efo",
        "subreddit": "books",
        "body": "The movie’s a actually based on a novella by Joseph Conrad: Heart of Darkness. It’s set in the Belgian Congo instead of in Vietnam, but it basically shares the same structure, villain, and protagonist as Apocalypse Now.",
        "time": "2023-10-16 21:18:37 UTC",
        "score": 3,
        "link_id": "t3_1797dw7",
        "parent_id": "t1_k55rlhv"
    },
    {
        "comment_id": "k46evy9",
        "subreddit": "books",
        "body": "I was going to mention the same genre, but with Blood Meridian instead",
        "time": "2023-10-09 20:07:24 UTC",
        "score": 4,
        "link_id": "t3_173x2zc",
        "parent_id": "t1_k45q8jz"
    },
    {
        "comment_id": "k2k0c07",
        "subreddit": "books",
        "body": "I’m reading Ulysses right now as part of a book club, and am finding it extremely difficult as well. If you want to continue trying, I’d recommend picking up James Joyce's Ulysses: Critical Essays, edited by Clive Hart and David Hayman. The book contains 18 essays on all 18 chapters of Ulysses. For every chapter I read in Ulysses, I then read the corresponding essay afterwards, to help me process what I’ve just read. I’d also recommend [this resource](https://en.m.wikibooks.org/wiki/Annotations_to_James_Joyce%27s_Ulysses), [this resource](http://m.joyceproject.com), and Ulysses Annotated: Revised and Expanded Edition, which unpacks pretty much every sentence in Ulysses, for the more tricky passages in the book. Good luck",
        "time": "2023-09-28 09:48:14 UTC",
        "score": 1,
        "link_id": "t3_16tx7fw",
        "parent_id": "t3_16tx7fw"
    },
    {
        "comment_id": "k1haamh",
        "subreddit": "books",
        "body": "I had a lot of trouble reading philosophy as a beginner, initially trying and failing to work my way through the complete works of Plato: who is challenging not merely for a beginner, nor for his style which is actually quite easygoing withstanding some obscure passages in his densest dialogues — but because so many of his dialogues are digressive, and points raised paragraphs ago are looped back to without much context. I raised my difficulties to a friend deeply embroiled in philosophy, and she suggested I not worry too much about actively trying to remember what I’m reading as I’m reading, but instead paying attention to whether I’m understanding what’s currently being described. If confused, she said, I should jump back to try and clarify things for myself. If not, I can keep going.",
        "time": "2023-09-20 21:54:55 UTC",
        "score": 3,
        "link_id": "t3_16nlxbf",
        "parent_id": "t3_16nlxbf"
    },
    {
        "comment_id": "jubaru6",
        "subreddit": "books",
        "body": "I pretty much annotate really dense books, most of the time just to help me figure out what’s going on. For example, I’ve been reading some Plato recently, and underlining— even without commenting on what I’m underlining — helps me keep track of his arguments as I go through the text.",
        "time": "2023-08-01 07:20:15 UTC",
        "score": 3,
        "link_id": "t3_15f2efk",
        "parent_id": "t3_15f2efk"
    },
    {
        "comment_id": "jryz839",
        "subreddit": "books",
        "body": "Harold Bloom has exhaustively long list you can find [here](http://sonic.net/~rteeter/grtbloom.html).",
        "time": "2023-07-14 19:01:53 UTC",
        "score": 1,
        "link_id": "t3_14zihgx",
        "parent_id": "t3_14zihgx"
    },
    {
        "comment_id": "jr6fi5l",
        "subreddit": "books",
        "body": "Honestly, I feel the exact same way about Kojima.",
        "time": "2023-07-08 17:58:18 UTC",
        "score": 0,
        "link_id": "t3_14u81sr",
        "parent_id": "t1_jr6bl2y"
    },
    {
        "comment_id": "jqsl1o3",
        "subreddit": "books",
        "body": "I haven’t read the book myself, although I’ve seen the movie, but a friend of mine interpreted Chigurh as representing the neoliberal order of capitalism set in motion by the Reagan administration. This would explain why the story is set in 1980, the bag of money Chigurh and Llewelyn fight over, and the arbitrary acts of violence Chigurgh commits (represented by the coin toss). This interpretation also makes sense of the end of the story, when Chigurh is questioned by Carla about the arbitrariness of his decision-making, asserting that the entropic deterioration of the society around him isn’t really random, but is willed by him. In other words, the laissez faire capitalist model spearheaded by the Reagan administration isn’t a random force of nature, but is intentionally wielded by the powerful at the cost of the disadvantaged. [This article explains this interpretation more in depth.](https://canadiandimension.com/articles/view/no-country-for-old-men-and-40-years-of-reagans-america)",
        "time": "2023-07-05 19:14:23 UTC",
        "score": 45,
        "link_id": "t3_14r3cbh",
        "parent_id": "t1_jqqikc5"
    },
    {
        "comment_id": "jqalizc",
        "subreddit": "books",
        "body": "A lot of philosophy books, since I just don’t have the temperament for reading non-fiction and long-form argumentation, as much as I’ve tried. The authors in this realm which seem most difficult to read (and thus I’m most unlikely to read) are Hume, Kant, Spinoza, Leibniz, Hegel, Heidegger, and Wittgenstein. As for more modern philosophers, Foucault and Deleuze seem the most intriguing, but also seem super difficult. I’ve also kind of trapped myself into believing I should go through philosophy chronologically, and between me and some of the more intriguing philosophy books is a 2000+ book of the complete works of Plato, within which I’ve been stuck at Parmenides for about a year. Hopefully one day though I’ll build up the tenacity to just drive straight through it. Poetry is also difficult for me to get into, even though I can ruminate on some poems for months. I just don’t know how to pick up a collection, and read one after the other without taking the time to really ruminate on each poem for what seems like an adequate amount of time, to actually figure out what’s being conveyed and how it’s being conveyed. And if I do take that approach, I’ll be stuck in whatever collection I’ve picked up for years.",
        "time": "2023-07-01 19:18:06 UTC",
        "score": 17,
        "link_id": "t3_14o0ltb",
        "parent_id": "t3_14o0ltb"
    },
    {
        "comment_id": "jnco9k7",
        "subreddit": "books",
        "body": "I recently finished David Foster Wallace’s essay collection A Supposedly Fun Thing I’ll Never Do Again, and in the title essay how honestly he relates his petty hatred towards the ship’s captain, his own bumbling behavior in a lot of high-brow events, and his scathing descriptions of the people around him had me laughing harder than anything else I’ve read this year.",
        "time": "2023-06-08 03:51:43 UTC",
        "score": 2,
        "link_id": "t3_143td53",
        "parent_id": "t3_143td53"
    },
    {
        "comment_id": "jmkyvt9",
        "subreddit": "books",
        "body": "Infinite Jest captures the rampant loneliness and addiction (to technology, drugs, politics, and sport) characteristic of mid-90s America, but even more pronounced in ours.",
        "time": "2023-06-02 06:29:26 UTC",
        "score": 9,
        "link_id": "t3_13y45i2",
        "parent_id": "t3_13y45i2"
    }
]