[
    {
        "comment_id": "lxnuiin",
        "subreddit": "books",
        "body": "I don't know if that's why we love villains; I think that's why we hate some heroes. \n\nI think that the reason we like some characters is not related to which side they are on but to the resemblance we find in them to us. I reckon that we like characters who are flawed and make mistakes or who sometimes act selfishly.",
        "time": "2024-11-17 22:21:17 UTC",
        "score": 2,
        "link_id": "t3_1gp6yoa",
        "parent_id": "t3_1gp6yoa"
    },
    {
        "comment_id": "lxnrhhv",
        "subreddit": "books",
        "body": "I understand your point, but sometimes, what you consider \"boring\" is part of the atmosphere as well. Eco, for example, mentioned how the first 100 pages of The Name of the Rose describe the characters' way of life, monks in the thirteenth century, using not only the words to set the scene but also the cadence of writing. He also uses this part to filter out readers who are not willing to read the book how they should.",
        "time": "2024-11-17 22:04:32 UTC",
        "score": 2,
        "link_id": "t3_1gpkdyk",
        "parent_id": "t1_lwx01oi"
    },
    {
        "comment_id": "lxnq4mg",
        "subreddit": "books",
        "body": "So many things are wrong with that point of view; it is hard to cover them all.\n\nFiction has always helped people to understand that their crisis, sources of happiness, and despair are universal. The guilt of Raskolnikov in Crime and Punishment or the search for meaning in Siddartha are just some examples of how authors have made it possible to put in words what the rest of us feel and cannot explain.\n\nWe are not only storytellers but also story listeners. We learn faster if facts are described as stories. To prove a point or explain a theory, we have always turned to fiction, not only to entertain but also to explain. \n\nIt's a snobby and sad statement to say that reading fiction wastes time. Consider the act of reading a waste of time sounds like something out of a dystopian world, but this guy will never understand this because he probably thinks that 1984 or Fahrenheit 451 are childish stories that would never teach him anything.",
        "time": "2024-11-17 21:57:01 UTC",
        "score": 1,
        "link_id": "t3_1gr0sbn",
        "parent_id": "t3_1gr0sbn"
    },
    {
        "comment_id": "lxnh276",
        "subreddit": "books",
        "body": "Maybe it was too deep and out of context for this post, but after reading Siddartha, I completely changed my perspective around doctrines and started believing that it was fine to create one that suited your soul.",
        "time": "2024-11-17 21:07:30 UTC",
        "score": 1,
        "link_id": "t3_1gsq5si",
        "parent_id": "t3_1gsq5si"
    }
]