[
    {
        "comment_id": "lyr8nu9",
        "subreddit": "books",
        "body": "I finished all 568 painful pages of Jonathan Franzen's The Corrections, partially because I am stubborn and partially because I needed a National Book Award winner to fulfill a reading challenge requirement.  Could I have lied about finishing it for the reading challenge?  Sure.  But now I have fully formed opinions on why I hate it so much!",
        "time": "2024-11-24 16:04:35 UTC",
        "score": 2,
        "link_id": "t3_1gyp1w3",
        "parent_id": "t3_1gyp1w3"
    },
    {
        "comment_id": "ly9uxik",
        "subreddit": "books",
        "body": "I agree with you!  I enjoyed it well enough and I'm glad that I read it, but overall I felt that it was a bit rambling and the biblical allegory was less of an allegory and more of a bludgeoning.  It wasn't the life altering experience that I expected it to be from the opinions so often shared here.\n\nNow A Tale of Two Cities, on the other hand....",
        "time": "2024-11-21 17:18:59 UTC",
        "score": 3,
        "link_id": "t3_1gw3iea",
        "parent_id": "t1_ly8kera"
    },
    {
        "comment_id": "ly31vyz",
        "subreddit": "books",
        "body": "I never read that one, but I did read Running with Scissors by Augusten Burroughs and found myself wondering if that, too, was largely fabricated.  The whole thing just seemed so unbelievable.",
        "time": "2024-11-20 11:40:16 UTC",
        "score": 15,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxzsdog"
    },
    {
        "comment_id": "ltj46gd",
        "subreddit": "books",
        "body": "Yes, this is my answer as well!  The first one that came to mind is a book that I grabbed once before getting onto a plane that featured a woman moving to a small town to take a position as a librarian.  She spends the book trying to get the town to give a damn about the library while simultaneously finding love along the way.  I think I could exist in that universe.",
        "time": "2024-10-24 15:56:14 UTC",
        "score": 2,
        "link_id": "t3_1gahwst",
        "parent_id": "t1_ltefx7i"
    },
    {
        "comment_id": "ltixhtd",
        "subreddit": "books",
        "body": "Classics, non-classics, graphic novels... whether or not I'm emotionally invested in the characters has to do with how they're written and the plot that's involved and not the type of book that it is.  One classic that absolutely got me, though, was A Tale of Two Cities.  Holy crap, I could barely breathe the last few chapters and I was devastated by the (predictable but no less heartbreaking) ending.\n\nI've heard it said before that classics are like a snapshot in time of a completely different period in history; this might be why you struggle to become emotional over the characters, if they're too detached from your reality that you don't feel that you relate to them.  Perhaps giving classics some context with regards to when they were written may help?  Although I'm not sure it's necessary to be emotionally attached to characters to enjoy a novel.",
        "time": "2024-10-24 15:22:59 UTC",
        "score": 2,
        "link_id": "t3_1gatq44",
        "parent_id": "t3_1gatq44"
    },
    {
        "comment_id": "ltcyczp",
        "subreddit": "books",
        "body": "Don't get me wrong, Robinson Crusoe has some real \"written by a white guy in the early 1700s\" moments, but the self deprecating humor took me by surprise!  At one point Crusoe is fashioning pots to use for food preparation and he says that he had made \"three very good, I will not say handsome, pipkins.\"  The \"I will not say handsome\" just cracked me up!   There are little jabs like that all the way through the book.\n\nPride and Prejudice was also WAY less stuffy than I was expecting!  It was so witty!  I really enjoyed it.",
        "time": "2024-10-23 15:55:16 UTC",
        "score": 10,
        "link_id": "t3_1ga4hun",
        "parent_id": "t3_1ga4hun"
    },
    {
        "comment_id": "ltclqop",
        "subreddit": "books",
        "body": "Our library system has a damn impressive collection.  I might be bad data because I don't watch anything too out of the ordinary anymore but my cinephile friend is super into old, obscure, artsy titles and always has a literal stack of library DVDs at his house of things I've never heard of.  So do they have **everything**?  Okay, no, you got me there.  But there's not been anything I've tried to find that they haven't had.",
        "time": "2024-10-23 14:50:22 UTC",
        "score": 2,
        "link_id": "t3_1g9oe7o",
        "parent_id": "t1_lt89bh5"
    },
    {
        "comment_id": "lt7okys",
        "subreddit": "books",
        "body": "I eventually cancelled my Netflix DVD delivery (you know, back when that was a popular thing) because I realized that everything they had could be found at the library!  DVDs and CDs are big on my rotation list, and our location also offers garden tools and has a seed library.  They also host so many programs and classes; tonight I'm actually going to a presentation about haunted places of New York State!  I'm always baffled by people who don't use the library.",
        "time": "2024-10-22 18:29:55 UTC",
        "score": 26,
        "link_id": "t3_1g9oe7o",
        "parent_id": "t1_lt7jpf7"
    },
    {
        "comment_id": "lr6eni3",
        "subreddit": "books",
        "body": "It was in 2000.  The series luckily isn't 15 shots to the stomach anymore; it's a long regimen but really not bad.  Back then it was administered across five days, days 1, 4, 7, 14 and 21 (I think they have since dropped the day 21 dose).  On day 1 you received one dose of rabies vaccine and immunoglobulin based on your weight (I received four shots total that day; immunoglobulin was probably 1 shot for every ~50 pounds of body weight if I had to guess).  Days 4, 7, 14 and 21 were just a single dose of rabies vaccine in the arm.  I don't remember the shots being especially painful; I think Covid is worse.\n\nLucky for me, day 4 coincided with the day that I got my wisdom teeth out so any vaccine pain that I had on that day was taken out by the pain meds I got for surgery recovery.  That was a really rough week for me!\n\nETA: Massive silver lining is that I no longer have the faintest ounce of anxiety over getting shots.  Four shots in a day will do that to a person.",
        "time": "2024-10-10 00:17:11 UTC",
        "score": 21,
        "link_id": "t3_1fzvwmb",
        "parent_id": "t1_lr6drc2"
    },
    {
        "comment_id": "lr5o8i5",
        "subreddit": "books",
        "body": "Truthfully, I didn't realize it as a surly teenager but I never really had a choice.  The Erie County Department of Health would not have taken no for an answer.",
        "time": "2024-10-09 21:35:48 UTC",
        "score": 31,
        "link_id": "t3_1fzvwmb",
        "parent_id": "t1_lr51tnn"
    },
    {
        "comment_id": "lr4ejtl",
        "subreddit": "books",
        "body": "This is kind of a long story but bear with me.\n\nWhen I was a senior in high school, our family's dog slipped out the door, was running through the woods behind our house, and got attacked by a wild animal.  My mother and I tended to him when he got back to the house with his wounds.  We took him to the vet the next day, who confirmed that our dog had been attacked by a coyote.  He urged us to call our county's Department of Health to see if we needed to get rabies shots (since we could have come into contact with infected coyote saliva when we were cleaning up our dog).  I remember telling my mother no way in FUCK was I going to get rabies shots.  I'd heard about 15 shots to the stomach and all that shit and I was like \"NO WAY.\"  Ahhhh, young, dumb and not realizing my own mortality.\n\nANYWAY, this whole thing was coincident with me reading Their Eyes Were Watching God in English class.  I vividly remember my teacher making us read aloud the passage that describes, in excruciating detail, death by rabies.  I shit you not, we had literally JUST finished reading the passage and I had this huge knot in my stomach like \"oh fuck I need those shots\" and the phone in the classroom rang.  It was my mom; keep in mind, this was one of the only times in my recollection that a parent was put through to a classroom, this was not something that happened with any regularity, and the timing was really exceptional.  I basically took the phone and she was like \"Listen, we are getting rabies shots and I'm picking you up early so that we can go to the hospital to start them.\"  Needless to say I gave zero pushback.",
        "time": "2024-10-09 17:31:24 UTC",
        "score": 167,
        "link_id": "t3_1fzvwmb",
        "parent_id": "t3_1fzvwmb"
    },
    {
        "comment_id": "lqmkkjt",
        "subreddit": "books",
        "body": "I remember completely falling into Kathy's orbit when we first met her.  Like, I knew she was evil and that I was supposed to hate her but I was like \"I totally get peoples' attraction to this woman.\"",
        "time": "2024-10-06 15:14:57 UTC",
        "score": 2,
        "link_id": "t3_1fx5kkx",
        "parent_id": "t1_lqk5z06"
    },
    {
        "comment_id": "lqd9ud6",
        "subreddit": "books",
        "body": "I actually thought that Practical Demonkeeping and The Lust Lizard of Melancholy Cove were both tons of fun.  I've been wanting to reread Practical Demonkeeping especially.",
        "time": "2024-10-04 21:53:06 UTC",
        "score": 1,
        "link_id": "t3_1fw5qtg",
        "parent_id": "t1_lqcvunj"
    },
    {
        "comment_id": "lqcnx8t",
        "subreddit": "books",
        "body": "Garden of Eden by Ernest Hemingway and everyone FUCKING HATED IT!  I didn't even, like, actually suggest it, it was more of a \"I might sit out the next one, I've been wanting to reread Garden of Eden\" and, to my surprise, everyone decided to make that our next read.  None of my suggestions were ever taken after that, although I will say that that book was the one that had the most spirited discussion of any we ever read.",
        "time": "2024-10-04 19:48:38 UTC",
        "score": 11,
        "link_id": "t3_1fw5qtg",
        "parent_id": "t3_1fw5qtg"
    },
    {
        "comment_id": "lq0egsn",
        "subreddit": "books",
        "body": "My guess is that OP's library hasn't banned the book, but included it in an event that acknowledged books that are banned in some places.  One of the libraries in our county library system is currently running an event to encourage patrons to read banned books, so this is likely something similar.",
        "time": "2024-10-02 17:55:17 UTC",
        "score": 5,
        "link_id": "t3_1fru861",
        "parent_id": "t1_lpleejs"
    },
    {
        "comment_id": "lq0b4wn",
        "subreddit": "books",
        "body": "I absolutely loved this book!  I thought that it was a really creative plot, and I tend to enjoy stories that explore alternate timelines.  I wasn't really sure where the last part was going until it happened; I liked that, at least for me, it wasn't super predictable.  I had a lot of fun with this book and have recommended it to others!",
        "time": "2024-10-02 17:37:50 UTC",
        "score": 6,
        "link_id": "t3_1ftqewo",
        "parent_id": "t3_1ftqewo"
    },
    {
        "comment_id": "llu913r",
        "subreddit": "books",
        "body": "Oh my god, if I rage this hard over The Corrections, I think based on your description I would spontaneously combust over Freedom!  I should definitely steer clear.  I don't think I can handle 500 more pages of Franzen drivel.",
        "time": "2024-09-06 19:05:39 UTC",
        "score": 3,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_lltvde7"
    },
    {
        "comment_id": "lltmq5b",
        "subreddit": "books",
        "body": "Is Freedom as bad as The Corrections?  I went through nearly this entire list and did not see ONE mention of The Corrections and I'm not sure how.  Page after page of unlikable characters with no redeeming qualities, nothing fucking goddamn happens over 550 pages of Franzen jerking off to his mad cap storylines (Al's talking poop hallucinations threw me over the edge, but the descriptions of the semen stains on Chip's couch from all the times he'd fucked it while pretending it was a student half his age had me pretty damn close).  Then the end of the book is like boop boop Al's in a home now and everyone is happy, but they're not characters who deserve to be happy as they're all insufferable fuckwads.  I had NO empathy for any of them, not even the character suffering from dementia.  Certainly not his shallow, vapid wife.  I couldn't figure out why he made Gary's wife and kids so fucking horrific, and I didn't understand the context for Denise's chapter at all.  And then Chip goes to Lithuania for.... reasons?  And it all seems so far out of left field and was completely inconsequential to the \"story\" (story in quotes because there wasn't one), just another mad cap thing for Franzen to run away with and wring out another 80 pages. \n\nI guess that Chip eventually has a character redemption, but too little, too fucking late.  National book award winner?  How?\n\nMy honorable mentions for other books with absolutely no likeable characters are Love in the Time of Cholera by Gabriel Garcia Marquez (footnote on that one, NO 16 year old would ever lust after a man in his mid 70s, time to put away that fantasy Marquez) and Mostly Dead Things by Kristen Arnett.\n\nSorry, I didn't expect this to turn into a novel.  Just the mere mention of Franzen's name apparently gets me going.",
        "time": "2024-09-06 17:06:28 UTC",
        "score": 4,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llr1xj8"
    },
    {
        "comment_id": "lltj38z",
        "subreddit": "books",
        "body": "This is one of the few books I've DNFd.  I couldn't handle the condescending tone and when I realized that he had all this bluster over living so close to town it was like.... NOPE.",
        "time": "2024-09-06 16:47:12 UTC",
        "score": 3,
        "link_id": "t3_1fa6cze",
        "parent_id": "t1_llqzkeb"
    },
    {
        "comment_id": "llgkvai",
        "subreddit": "books",
        "body": "I was recently chatting with a friend's husband (who is a currently unemployed Silicon Valley tech bro) who just kept trying to shove AI down our throats the whole time we were hanging out.  \"You're not using AI in the lab?  You're wasting so much time by not.\"  He kept playing AI generated music that he made for his kids, talked about how it needs to be integrated into this aspect of life and that one!  I finally asked him if he thought that AI was part of the reason that he can't find a job.  \"Oh definitely, it can do my job better than I can, in a fraction of the time.\"\n\n???  I don't understand why you'd be pushing so hard for something that is actively making your life worse.  It isn't like we have a universal basic income that we get if AI makes us unemployable.  I just can't figure out why he is so hellbent on removing the human from everything.  I don't want that.  I don't want AI generated novels, or music, or anything.\n\nSorry for my morning rant!",
        "time": "2024-09-04 13:00:34 UTC",
        "score": 18,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llfu3y1"
    },
    {
        "comment_id": "ljycl7i",
        "subreddit": "books",
        "body": "That book was SUCH a good read, and absolute page turner.  But my god, my palms were sweating for the author the whole time.  Like, I knew she made it out of North Korea without issue because she wrote that book, but when she would talk about things like hiding files on her computer about her experiences there I would get a huge knot in the pit of my stomach.",
        "time": "2024-08-26 02:25:17 UTC",
        "score": 69,
        "link_id": "t3_1f153pd",
        "parent_id": "t1_ljxb8l0"
    },
    {
        "comment_id": "ljkfa8l",
        "subreddit": "books",
        "body": "I find myself having absolutely ridiculous book pairings.  For example, I just finished Robinson Crusoe with r/ClassicBookClub, and now I'm reading a fluffy awful Nantucket romance novel by Nancy Thayer.  I realized early on that they're both books about people on an island.  One is about a dude trying to survive on his own and the other is about a woman trying to survive a completely idyllic summer but she's getting in her own way by creating drama where there isn't any.",
        "time": "2024-08-23 16:18:01 UTC",
        "score": 1,
        "link_id": "t3_1exdqif",
        "parent_id": "t3_1exdqif"
    },
    {
        "comment_id": "ljkej58",
        "subreddit": "books",
        "body": "I always forget about Christopher Moore.  I've loved both Practical Demonkeeping and The Lust Lizard of Melancholy Cove, I should add A Dirty Job to my list (which, as it turns out, Blood Meridian is already on!).",
        "time": "2024-08-23 16:14:02 UTC",
        "score": 2,
        "link_id": "t3_1exdqif",
        "parent_id": "t1_lj6aqs0"
    },
    {
        "comment_id": "ldbbudm",
        "subreddit": "books",
        "body": "Finished: **The Corrections, by Jonathan Frazen**\n\nI really wasn't a fan of this book.  From reading previous posts on this sub, it sounds like it's fairly divisive.  I definitely fall onto the side of not liking it.  I found the characters unlikable, and the plotline flaccid.  There were so many times that I was like \"Why exactly am I reading this again?\"\n\nStarted:  **Robinson Crusoe, by Daniel Defoe**\n\nHappy to join the folks at r/ClassicBookClub for this one!",
        "time": "2024-07-15 16:47:19 UTC",
        "score": 5,
        "link_id": "t3_1e3qzzw",
        "parent_id": "t3_1e3qzzw"
    },
    {
        "comment_id": "lcnl414",
        "subreddit": "books",
        "body": "I'm not sure if you've read Running with Scissors by Augusten Burroughs, but I highly suspect that \"memoir\" is also heavily fictional.  When the kids busted a huge hole in the ceiling to make a skylight I was like \"yeah, that didn't happen.\"  And if I remember correctly, neither of the parents cared that much which made me think \"yeah, that REALLY didn't happen.\"",
        "time": "2024-07-11 10:40:06 UTC",
        "score": 6,
        "link_id": "t3_1e0bk49",
        "parent_id": "t1_lcngghh"
    },
    {
        "comment_id": "kzlkrdx",
        "subreddit": "books",
        "body": "I found one that had this book by Caroline B Cooney that I LOVED as a 12 year old!  Considered snatching it up for a reread but then decided to let a tweenager discover the magic instead.",
        "time": "2024-04-14 22:37:03 UTC",
        "score": 3,
        "link_id": "t3_1c40co3",
        "parent_id": "t1_kzkx002"
    },
    {
        "comment_id": "kzl380a",
        "subreddit": "books",
        "body": "Finished:\n\n**Parable of the Talents, by Octavia Butler**\n\nI am glad that I read this, but I much preferred Parable of the Sower.  Talents ended up being what I was afraid Sower would be, with much much more emphasis on the teachings and preachings of Earthseed and not nearly enough action (for lack of a better word) to balance it out.\n\nStarted:\n\n**The Husbands, by Holly Gramazio**\n\n**A Tale of Two Cities, by Charles Dickens**\n\nI normally do not read two books at once, but my name came up on the library's waitlist for the former and I have seven days to finish it since it's a new release.  The latter I'm reading as part of r/ClassicsBookClub and don't want to fall behind while I work on The Husbands.",
        "time": "2024-04-14 20:46:50 UTC",
        "score": 2,
        "link_id": "t3_1byu1k3",
        "parent_id": "t3_1byu1k3"
    },
    {
        "comment_id": "kz7xagx",
        "subreddit": "books",
        "body": "Sorry, I'm responding to this late as this isn't my main account so I haven't logged in in a bit.  I really love reading classics, but only have one person to discuss them with (a friend of mine who is a high school English teacher).  I am just seeing the East of Eden wrap up post right now so I'm planning to see what others thought!  \n\nI see that A Tale of Two Cities is the next book that was chosen.  I am not a big Dickens fan so I might wait until the next one to jump on, but I'm really excited about that subreddit.\n\nETA: Hmmmm maybe I should just read A Tale of Two Cities with you all.",
        "time": "2024-04-12 11:48:13 UTC",
        "score": 1,
        "link_id": "t3_1bn9vd9",
        "parent_id": "t1_kwjm6t5"
    },
    {
        "comment_id": "kz7wmqm",
        "subreddit": "books",
        "body": "I've liked the two Cormac McCarthy books that I've read, but I find his lack of use of quotation marks to be pretentious and at times hard to follow.  I also got very distracted by his need to make up compoundwords.  I'm notsure if there was a tax on hittingthespacebar but it just felt reallyunnecessary.",
        "time": "2024-04-12 11:42:50 UTC",
        "score": 5,
        "link_id": "t3_1c1wwqz",
        "parent_id": "t3_1c1wwqz"
    },
    {
        "comment_id": "kz7vj8u",
        "subreddit": "books",
        "body": "Yes, I feel the same!  More specifically, I hate when a word is used multiple times over several chapters in rapid succession, only to never be used again.  I know that calling out Fifty Shades of Grey is like taking candy from a baby, but I remember three chapters in a row that used the word \"palatial\" only to never be used again.  It was almost like she saw an SAT study guide and was like \"oh, that's a good one!\"  But then immediately forgot the word when she was done writing for the day.",
        "time": "2024-04-12 11:33:44 UTC",
        "score": 6,
        "link_id": "t3_1c1wwqz",
        "parent_id": "t1_kz6cehj"
    },
    {
        "comment_id": "kwi8ne5",
        "subreddit": "books",
        "body": "How did I knot know that r/ClassicsBookClub was a thing??  When I read East of Eden last year, I'd have loved a group to discuss it with!  I subbed to keep an eye on what they read next.  :)",
        "time": "2024-03-25 16:28:40 UTC",
        "score": 2,
        "link_id": "t3_1bn9vd9",
        "parent_id": "t1_kwgys8f"
    },
    {
        "comment_id": "kv4of8e",
        "subreddit": "books",
        "body": "I'm so glad to hear you're enjoying it!  Apparently it's part of a two book series; the second is called Parable of the Talents.  I'm planning to pick it up when I'm done with Parable of the Sower!",
        "time": "2024-03-16 12:20:53 UTC",
        "score": 1,
        "link_id": "t3_1bbzlxn",
        "parent_id": "t1_kv1eabk"
    },
    {
        "comment_id": "kuv4b86",
        "subreddit": "books",
        "body": "Finished: **Just the Nicest Couple, by Mary Kubica.**\n\nStarted: **Parable of the Sower, by Octavia Butler.**\n\nJust the Nicest Couple wasn't my cup of tea.  There were too many situations where any type of reasonable communication would've changed the entire trajectory.  The ridiculous conclusions that the characters would jump to were infuriating.\n\nParable of the Sower is blowing me away so far!  I'm absolutely loving it.  Seems like a lot of people here are currently in season of dystopia, so Parable falls right in line!  I think part of what makes it so interesting to me (and a little terrifying) is that it doesn't seem all that far fetched for where we are right now in society.",
        "time": "2024-03-14 17:29:06 UTC",
        "score": 3,
        "link_id": "t3_1bbzlxn",
        "parent_id": "t3_1bbzlxn"
    },
    {
        "comment_id": "kuv0wzg",
        "subreddit": "books",
        "body": "I just started reading Parable of the Sower last night.  I'm not a fast reader but managed to plow through 70 pages last night.  It's future dystopia at its finest, and I highly recommend it.",
        "time": "2024-03-14 17:10:34 UTC",
        "score": 1,
        "link_id": "t3_1b687j4",
        "parent_id": "t1_ktvy6dq"
    },
    {
        "comment_id": "kuv0qf7",
        "subreddit": "books",
        "body": "I'm planning to reread 1984 sometime soon.  I only became aware last year, from my 10 year old niece, that The Giver is now the first of a four book series.  I reread The Giver, then finished the series and I really enjoyed them.  Lots of loose ends get tied up.  Highly recommend.",
        "time": "2024-03-14 17:09:35 UTC",
        "score": 2,
        "link_id": "t3_1b687j4",
        "parent_id": "t1_ktx8r1b"
    },
    {
        "comment_id": "ku2ab7a",
        "subreddit": "books",
        "body": "Love in the Time of Cholera.  Insufferable characters, and a love affair between a teenager and a seventy-something that is clearly Garcia Marquez working through his stress about getting older.",
        "time": "2024-03-09 12:41:51 UTC",
        "score": 16,
        "link_id": "t3_1bae4sd",
        "parent_id": "t3_1bae4sd"
    },
    {
        "comment_id": "khx495r",
        "subreddit": "books",
        "body": "Not technically difficult, but I was really expecting The Road to be a harder go emotionally than it was for me.  The only scene that really was like \"what the fuuuuuu....\" was the part with the basement.  The baby part didn't hit me nearly the same way because I saw it coming from a mile away (which I'm assuming everyone does).  But yeah, I thought I would find it waaaaay heavier than I did.",
        "time": "2024-01-15 03:55:43 UTC",
        "score": 3,
        "link_id": "t3_196u85k",
        "parent_id": "t3_196u85k"
    },
    {
        "comment_id": "kfuor3a",
        "subreddit": "books",
        "body": "Have you read her book Animal Vegetable Miracle?  If not, I think you'd really like it based on what you're saying here.",
        "time": "2024-01-01 17:05:48 UTC",
        "score": 21,
        "link_id": "t3_18vuw2v",
        "parent_id": "t1_kfuipsw"
    },
    {
        "comment_id": "kdrdq3l",
        "subreddit": "books",
        "body": "If you're talking about the library shelf, it was quite the opposite.  I actually maxxed out on the amount of renewals you can have on an item, so it was off the shelf for as long as a book is allowed to be!  I finished it just under the gun.",
        "time": "2023-12-17 15:18:17 UTC",
        "score": 1,
        "link_id": "t3_18hyimg",
        "parent_id": "t1_kdcqp5v"
    },
    {
        "comment_id": "kdb5641",
        "subreddit": "books",
        "body": "I believe it was just yesterday that there was a post asking which books would be better if they were shorter and I purposely didn't post my answer (East of Eden) for fear of getting skewered.  I enjoyed it and I'm glad that I read it, but felt that certain plotlines really didn't add that much to the story overall, and just made the book that much more inaccessible to anybody that's intimidated by its size.",
        "time": "2023-12-14 11:45:09 UTC",
        "score": 4,
        "link_id": "t3_18hyimg",
        "parent_id": "t1_kdab9hp"
    },
    {
        "comment_id": "kc3ftzs",
        "subreddit": "books",
        "body": "I forgot about our county library system when I was in college.  I didn't have spare time to read for fun, and any library materials that I needed I got from my university library.\n\nAfter graduating college and getting my first real job, my parents invited me to join them at our local library branch to get my taxes done for free.  While I was waiting for my appointment, I was perusing the library and I was like \"HOW DID I FORGET THIS PLACE EXISTED??\"  Not just books, but DVDs and CDs!  In fact, the library's DVD service was what led to me canceling the DVD portion of my Netflix account; especially around the holidays, I would sit on a Netflix waitlist for certain movies ad infinitum, whereas the library would have the same movie available for me within a few days.  I purchase very little media these days; most of it I get from the library.  I'm there generally once every week or two at minimum.",
        "time": "2023-12-05 14:11:33 UTC",
        "score": 1,
        "link_id": "t3_18ange1",
        "parent_id": "t1_kbzcrqy"
    },
    {
        "comment_id": "k8nxkkr",
        "subreddit": "books",
        "body": "Initially I was going to say it was a toss up between the first and only Colleen Hoover book I've ever read (It Ends With Us) and Spring at Saddle Run, which is a ridiculous romance novel that I found in a Little Library and was like \"oh this looks awful!\" But then I looked over at the books I've read this year and somehow, Elin Hilderbrand's Nantucket Nights was even worse than either of those two!  I'd never read anything by this author before, and the reactions of the characters were so over the top ridiculous.\n\nI cannot lie, I love me some literary trash.  ;)",
        "time": "2023-11-10 16:35:21 UTC",
        "score": 1,
        "link_id": "t3_17rwqc5",
        "parent_id": "t3_17rwqc5"
    },
    {
        "comment_id": "k54jr01",
        "subreddit": "books",
        "body": "I never used to read classics and now I absolutely hanker after them! They're not all I read (I love mixing it up), but they're an essential part of my reading list.",
        "time": "2023-10-16 15:25:34 UTC",
        "score": 1,
        "link_id": "t3_178lxr7",
        "parent_id": "t1_k50oqgm"
    },
    {
        "comment_id": "k54j2iq",
        "subreddit": "books",
        "body": "I'm roughly 100 pages into East of Eden.  Hard same.",
        "time": "2023-10-16 15:21:23 UTC",
        "score": 1,
        "link_id": "t3_1792fq1",
        "parent_id": "t1_k53vmjt"
    },
    {
        "comment_id": "k4p4k2g",
        "subreddit": "books",
        "body": "I remember messaging my friend, who is an English teacher with whom I frequently discuss literature, and I was like \"I'm actually really enjoying The Road so far, it's not nearly as gory as I was fearing.\"  \n\nLiterally twenty minutes later I read that passage and sent him another message rescinding what I'd said (except for the fact that I was enjoying it, I never rescinded that).  I'll never be able to unsee that imagery in my mind.",
        "time": "2023-10-13 12:31:20 UTC",
        "score": 2,
        "link_id": "t3_176g3jd",
        "parent_id": "t1_k4moita"
    },
    {
        "comment_id": "k4p491d",
        "subreddit": "books",
        "body": "I absolutely LOVE his short story Quitters, Inc.  It's from his Night Shift collection.  I read it when I was young and absolutely every twist and turn blew my mind and horrified me.",
        "time": "2023-10-13 12:28:51 UTC",
        "score": 2,
        "link_id": "t3_176g3jd",
        "parent_id": "t1_k4ma33w"
    },
    {
        "comment_id": "jyivj0g",
        "subreddit": "books",
        "body": "I sometimes enjoy reading \"popular\" books because I like having an informed opinion on them.  My sister very accurately described Colleen Hoover books as \"the junk food of reading.\"  I read It Ends With Us, and while it wasn't good, it also wasn't the worst I've read (that notable distinction goes to the Fifty Shades of Grey trilogy, which set a new bar for me as far as bad writing goes).  The names were terrible, the plotline predictable, but I was entertained enough.  Would I recommend it?  No, but I also just like that people are reading, even if it's Colleen Hoover.",
        "time": "2023-08-31 14:25:33 UTC",
        "score": 4,
        "link_id": "t3_1660muz",
        "parent_id": "t1_jyhrxnc"
    },
    {
        "comment_id": "jy95m78",
        "subreddit": "books",
        "body": "I once suggested The Garden of Eden to my bookclub and was surprised when they picked it.  I was the only one familiar with it and...uh...let's just say that novel sparked our most active literary conversation, but not for good reasons.  Everyone else hated it!",
        "time": "2023-08-29 17:02:48 UTC",
        "score": 2,
        "link_id": "t3_164kjfi",
        "parent_id": "t1_jy8ro9s"
    },
    {
        "comment_id": "jy32656",
        "subreddit": "books",
        "body": "My most recent reread of Catcher in the Rye fucking destroyed me, probably because we all have a Holden Caulfield in our life and I so desperately hoped that my real life Holden Caulfield was doing well (spoiler alert: I ran into him unexpectedly this past spring and he seems to be doing great, which put my heart at ease).\n\nSome non-classic options:  The Sight of You by Holly Miller.  This one left me in an emotional haze for about a week after I finished it.  \n\nThe Age of Miracles by Karen Thompson Walker.  I picked up this one while browsing at the library one day (I'd never heard of it prior) and I thought it was phenomenal.  It's so sad; the ending tries to embue hope but ultimately the whole thing feels doomed.",
        "time": "2023-08-28 13:03:29 UTC",
        "score": 2,
        "link_id": "t3_163aptd",
        "parent_id": "t3_163aptd"
    },
    {
        "comment_id": "jy30zd2",
        "subreddit": "books",
        "body": "One of the hills on which I will die is that NO ONE should read this book to their children.  Even as an adult I have a basket of stuffed animals in the guest room that I can't get rid of because of the Velveteen Rabbit.",
        "time": "2023-08-28 12:53:50 UTC",
        "score": 51,
        "link_id": "t3_163aptd",
        "parent_id": "t1_jy1uxb4"
    },
    {
        "comment_id": "jx4mo0e",
        "subreddit": "books",
        "body": "I read The Great Gatsby for the first time when I was in my early 20s, and am rereading it right now!  I HATED it when I was younger; I found it to be an insufferable slog.  I was also reading it for all the wrong reasons; I was dating a hipster and wanted to look smart by reading classics, but chose one that was short because I hated reading classics.  \n\nAs it turns out, I love reading classics, and I LOVE rereading books from high school and college.  I totally understand why we're given these books when we're younger; that's when we're in a structured environment to be given such texts to read, and this environment simply doesn't exist once you're out of a schooling situation (the exception is book clubs, but those are voluntary, whereas high school English class is not).  But the fact that so few people revisit them in adulthood is so upsetting to me!  Because you are 1000% correct, they're SO much better when you approach them with life experience.  I always reference The Sun Also Rises; I hated it when I was in high school (I couldn't relate to the characters at all).  I loved it when I reread it just out of college (I could absolutely relate to the drinking culture, although I still didn't understand why Brett was such a fucking tease).  I loved it the most when I reread it a few years ago, in my late 30s (and understood for the first time that all of Brett's flirtation was to distract herself from the fact that she couldn't be with the man she truly loved).  I have had a similar arc with The Catcher in the Rye; each time I've reread it, my interpretation of Holden Caulfield has completely changed.\n\nI frequently find myself getting to the end of a classic and having a burning desire to chat about it in an English class-style format.  It's ironic that I used to find it such a drudgery to sit in class and discuss Great Expectations but now I yearn for it!  Thankfully I have a good friend who is an English teacher who is always happy to lend an ear.",
        "time": "2023-08-21 13:22:31 UTC",
        "score": 1,
        "link_id": "t3_15wcv72",
        "parent_id": "t3_15wcv72"
    },
    {
        "comment_id": "jur141e",
        "subreddit": "books",
        "body": "True story: there are Choose Your Own Adventure style books written for a more mature audience.  I have one called Night of 1000 Boyfriends.  Admittedly it wasn't as smutty as it could've gone, but it is a fun twist on an old classic.",
        "time": "2023-08-04 12:07:07 UTC",
        "score": 16,
        "link_id": "t3_15hsh8w",
        "parent_id": "t1_juqcxlz"
    },
    {
        "comment_id": "jtp7ee8",
        "subreddit": "books",
        "body": "I absolutely love reading classics.  It's really nice to be able to discuss a something so widely read, and to have opinions on it.",
        "time": "2023-07-27 18:47:10 UTC",
        "score": 5,
        "link_id": "t3_15ay1pl",
        "parent_id": "t1_jtnlzq4"
    },
    {
        "comment_id": "jtlqbf7",
        "subreddit": "books",
        "body": "Not OP but I personally found it insufferably boring.  It's a fairly short book if I remember correctly but it felt so much longer.  That said, I read it when I was in my early 20s so I'm likely due for a reread.",
        "time": "2023-07-27 01:06:04 UTC",
        "score": 9,
        "link_id": "t3_15abl2k",
        "parent_id": "t1_jtl9frb"
    },
    {
        "comment_id": "jqdvh46",
        "subreddit": "books",
        "body": "I really liked The Road, I found All the Pretty Horses to be pretty forgettable.  I do find his failure to use quotation marks to be pretentious, and I get very distracted every time he makes hisown compoundwords.  It's almost like he needs to fit his entire story in a predetermined number of pages so he's trying to shave off a space here and there.",
        "time": "2023-07-02 14:32:46 UTC",
        "score": 1,
        "link_id": "t3_144jv1h",
        "parent_id": "t1_jng0xck"
    },
    {
        "comment_id": "jp7s60w",
        "subreddit": "books",
        "body": "I just finished my first book by Elin Hilderbrand, Nantucket Nights.  It's so funny to read your post because I was a stone's throw from the end and it seemed like there were SO MANY ends to tie up and I had no idea how everything would be resolved in twenty pages.  There were so many things (like the murder allegations against the main character) that were like..... oh hey, six weeks later everyone has just forgotten that this was a thing and life has moved on.  Overall it was a perfect vacation read but I do agree with you, the ending felt rushed, like the author herself wasn't sure how to tie things up so it was like \"well, Kayla will go on a six week vacation and everything will blow over.\"",
        "time": "2023-06-23 12:39:53 UTC",
        "score": 8,
        "link_id": "t3_117tj66",
        "parent_id": "t3_117tj66"
    },
    {
        "comment_id": "jolv44x",
        "subreddit": "books",
        "body": "If you read books, you're a reader.  I'm just heartened whenever people read for fun, no matter what it is, and I'll just as happily (and critically) chat about the classics as I will Nancy Thayer's An Island Christmas.",
        "time": "2023-06-18 17:33:31 UTC",
        "score": 2,
        "link_id": "t3_14bquwd",
        "parent_id": "t3_14bquwd"
    },
    {
        "comment_id": "joluli6",
        "subreddit": "books",
        "body": "My sister likened Colleen Hoover (or, as the women of my Buy Nothing group call her, \"CoHo\") to the reading equivalent of junk food.  I've never read anything by her, but I do believe in a reading diet founded in moderation.  I recently finished Cormac McCarthy's The Road and, after putting it off for many years, reread Great Expectations over the winter.  I'll go through periods of nothing but non fiction. But man am I excited for the Elin Hilderbrand romance novel that I just picked up from the library and, as much as I say that I like to hate read Nancy Thayer, the fact remains that I've read not one, not two, but three of her books.  Amish-themed romance?  Christian romance?  Count me in.  \n\nAt the end of the day, I just like that people are reading.  I will defend picking up a poorly written bodice ripper any day of the week.",
        "time": "2023-06-18 17:29:34 UTC",
        "score": 1,
        "link_id": "t3_14bquwd",
        "parent_id": "t1_joifae8"
    },
    {
        "comment_id": "jm774cb",
        "subreddit": "books",
        "body": "I lost my love of reading when I was working on my Masters in biology so I can relate!  Now I work as a lab technician so I don't have to read a ton of journal articles and I'm back to enjoying books in my downtime.  It's wonderful!",
        "time": "2023-05-30 13:29:56 UTC",
        "score": 12,
        "link_id": "t3_13vndpp",
        "parent_id": "t1_jm6vghc"
    },
    {
        "comment_id": "jfnam47",
        "subreddit": "books",
        "body": "I never in a million years have thought about doing this, but I love the idea of leaving little notes in library books like this.  \"Remind me again why we decided to read Charles Dickens....\"",
        "time": "2023-04-10 01:58:51 UTC",
        "score": 5,
        "link_id": "t3_12gokei",
        "parent_id": "t1_jflual6"
    },
    {
        "comment_id": "jfna7th",
        "subreddit": "books",
        "body": "Tucked into a book called \"The Parenthood Decision,\" I found a piece of paper with a detailed, time stamped list of the bodily functions of an obviously sick child (i.e. \"7:30  am, vomit.  8:15 am, vomit.  9:30 am, diarrhea\" etc).  It ultimately had no bearing on my decision to remain childfree, but I sometimes wonder if whoever had owned that book before me (and made the opposite decision) included that token as a cautionary tale.  If I remember correctly I left the note in there when I gifted it to someone on r/fencesitter, not to try to sway them in any way, more just that it cosmically feels like it belongs with the book now.",
        "time": "2023-04-10 01:55:39 UTC",
        "score": 1,
        "link_id": "t3_12gokei",
        "parent_id": "t3_12gokei"
    },
    {
        "comment_id": "jetr57d",
        "subreddit": "books",
        "body": "I found the whole thing to be pretty insufferable, if I'm being honest.  I think that I'd have felt differently if I'd read this book when I was in my early 20s, but I got around to it when I was in my 30s and just couldn't vibe with the characters.  Dean is super weird and cringey.",
        "time": "2023-04-03 19:43:36 UTC",
        "score": 6,
        "link_id": "t3_12ani28",
        "parent_id": "t3_12ani28"
    },
    {
        "comment_id": "jaslhkh",
        "subreddit": "books",
        "body": "A few years ago I read a series of historical fiction Westerns that I unexpectedly really loved.  When I finished the third one I was in a total funk because I'd enjoyed them so much and I knew that there were no more to read.  I wanted to know what happened to the characters because the books ended fairly ambiguously with regards to what would happen next.  The world was their oyster!  It took me a day or two to shake the funk.  I actually sent the author an email telling him how much I'd enjoyed the series and he responded!  He seemed delighted that I'd reached out to him.",
        "time": "2023-03-03 19:36:15 UTC",
        "score": 3,
        "link_id": "t3_11gw33u",
        "parent_id": "t3_11gw33u"
    },
    {
        "comment_id": "j0ucbft",
        "subreddit": "books",
        "body": "I'm fully allowing myself to bail on it if things get too bad.  And I'm doing a palate cleanser before I start (I'm getting one of those holiday romance novels from the library, like Hallmark in book form).",
        "time": "2022-12-19 14:11:19 UTC",
        "score": 3,
        "link_id": "t3_zp9xpi",
        "parent_id": "t1_j0ua6wz"
    },
    {
        "comment_id": "j0u8juc",
        "subreddit": "books",
        "body": "It seems as though I was a shade too old for Animorphs when it was released, but you have me intrigued.  I also cannot tell you how much I love consuming older media for the first time and being like \"I need to talk about this.\"  I started watching Dawson's Creek over the summer and my husband would laugh when I'd be like \"I need to discuss this with my sister.\"",
        "time": "2022-12-19 13:39:11 UTC",
        "score": 2,
        "link_id": "t3_zp9xpi",
        "parent_id": "t3_zp9xpi"
    },
    {
        "comment_id": "j0u7vc5",
        "subreddit": "books",
        "body": "Me too!  This was going to be the winter that I finally reread what I regard as the worst book I ever had to read in school, Great Expectations.  But I could be swayed to put it off for another year....",
        "time": "2022-12-19 13:33:11 UTC",
        "score": 10,
        "link_id": "t3_zp9xpi",
        "parent_id": "t1_j0t0u88"
    },
    {
        "comment_id": "iycj79u",
        "subreddit": "books",
        "body": "No, he has the delusion that a 16 year old girl would be sexually attracted to a man sixty years her senior.  Seriously, Love in the Time of Cholera was just.... bleh.",
        "time": "2022-11-30 11:34:59 UTC",
        "score": 1,
        "link_id": "t3_z7xw3i",
        "parent_id": "t1_iy9vbtf"
    },
    {
        "comment_id": "ix5nf85",
        "subreddit": "books",
        "body": "I haven't seen the movie (or any of them, actually) but I just finished the book about ten minutes ago.  That last paragraph is a gut punch.  While I can understand that the movie ending (at least from what I'm gathering from descriptions in comments above) was more dramatic, I think that the whole point of the ending in the book is that it was an incredibly benign and futile death after years of the toil of warfare.",
        "time": "2022-11-20 22:54:11 UTC",
        "score": 2,
        "link_id": "t3_yubz7f",
        "parent_id": "t1_iw9prfv"
    },
    {
        "comment_id": "io2eqfd",
        "subreddit": "books",
        "body": "I really should read this book.  I've only seen the movie.  However, I always find it so curious that people look up to Chris McCandless as some sort of simple living counterculture hero.  Like.... did these people actually get to the end of the story?",
        "time": "2022-09-12 01:05:30 UTC",
        "score": 1,
        "link_id": "t3_whbxt8",
        "parent_id": "t1_ij5yooi"
    },
    {
        "comment_id": "ih6fdz2",
        "subreddit": "books",
        "body": "Yup, that's exactly where I fell on them as well.  It's like hate watching, except it's hate reading.  The writing was terrible; the juvenile and cringey descriptions of her inner goddess, the way the author would fixate on one SAT word and pound it into the ground before moving onto the next (for example, I remember \"palatial\" being used multiple times over a few chapters and then never again), the timeline oh god the timeline.  I especially enjoyed when Christian went AWOL for ten hours and his family freaked out and called the fucking cops or the FBI or some shit.  Wanna know what it's called when I'm out of communication for ten hours?  Work.  It's called fucking work, and it happens five days a week.\n\nI'm currently hate reading a romance novel by Nancy Thayer and now I'm thinking I should do a writeup here when I'm done, just for all us train wreck readers out there.",
        "time": "2022-07-22 11:57:57 UTC",
        "score": 14,
        "link_id": "t3_w4s04w",
        "parent_id": "t1_ih5jhkh"
    },
    {
        "comment_id": "i92n11p",
        "subreddit": "books",
        "body": "\"TELL HIM TO GRAB THE BULL BY THE BALLS.\"",
        "time": "2022-05-18 13:48:15 UTC",
        "score": 18,
        "link_id": "t3_us0y0c",
        "parent_id": "t1_i91fhag"
    },
    {
        "comment_id": "i92lu9y",
        "subreddit": "books",
        "body": "This book is my absolute classic \"read this again when you're older\" book.  I have no idea what your age is, but I read this for the first time when I was 17.  I felt exactly the way you're describing.  I read it again just after I'd graduated from college and it resonated with me a lot more, especially since I was unemployed at the time and drinking a lot.  I reread it again just last year at the age of 38 and was able to understand the characters SO much better.  Life experience really helped with this one, at least in my experience.",
        "time": "2022-05-18 13:39:01 UTC",
        "score": 2,
        "link_id": "t3_us0y0c",
        "parent_id": "t3_us0y0c"
    },
    {
        "comment_id": "i7xb7dy",
        "subreddit": "books",
        "body": "I read all of them, due to morbid curiosity.  For me the worst part was her childish descriptions of her \"inner goddess\" and the unrealistic timeline on which the story was set (for example, in one scene one of the main characters is out of communication with his girlfriend and family for, like, 10 hours.  They respond by contacting the police and putting out a search team.  Meanwhile I'm over here like, wanna know what I call it when I don't hear from my husband for 10 hours?  A busy workday).  The writing didn't work for me, but I still enjoyed it entirely, albeit in a different way than people who came at it from a more serious angle.\n\nBut hey, I totally get the need to read trash!   Variety is the spice of life!",
        "time": "2022-05-09 14:44:42 UTC",
        "score": 54,
        "link_id": "t3_ulo5ij",
        "parent_id": "t1_i7x7a15"
    },
    {
        "comment_id": "i5i0pia",
        "subreddit": "books",
        "body": "I just finished reading The Outsiders for the first time at the age of 39.  But if I'd have read this when I was in middle school I'd have had a crush on Ponyboy for sure.",
        "time": "2022-04-20 16:36:56 UTC",
        "score": 5,
        "link_id": "t3_u7tg23",
        "parent_id": "t1_i5hngxq"
    },
    {
        "comment_id": "i4kadnd",
        "subreddit": "books",
        "body": "I probably should as well.  Might be a hot take, but I hate the Velveteen Rabbit as it has caused my inability to get rid of my favorite stuffed animals from when I was young.  I don't want them to end up crying in a field somewhere.",
        "time": "2022-04-13 13:33:53 UTC",
        "score": 6,
        "link_id": "t3_u23d3m",
        "parent_id": "t1_i4hnt3q"
    },
    {
        "comment_id": "i36elpb",
        "subreddit": "books",
        "body": "I love The Sun Also Rises, and desperately want to visit the Basque region of Spain.  So I'd do that.  I did read a Western when I was out in Utah, so that felt fairly fitting.  :)",
        "time": "2022-04-03 02:46:09 UTC",
        "score": 6,
        "link_id": "t3_tuy915",
        "parent_id": "t3_tuy915"
    },
    {
        "comment_id": "i307xtl",
        "subreddit": "books",
        "body": "I've never seen either adaptation of P&P, but for some reason I had this idea in my head that Jane Austen novels were stuffy and boring.  I picked it up at the library on a whim last summer and was delighted by how fun and cheeky it was!",
        "time": "2022-04-01 17:08:37 UTC",
        "score": 5,
        "link_id": "t3_tskmsa",
        "parent_id": "t1_i2ruc8t"
    },
    {
        "comment_id": "i1tvv21",
        "subreddit": "books",
        "body": "Oh my god, Florentino Ariza's affair with a 16 year old when he was in this 70s?  And she was seemingly turned on by the very things that most people find off putting about aging (most notably, the old person smell)?  Nope.  Nada.  This book took me forever to get through and I found nothing redeeming about any of the characters.",
        "time": "2022-03-23 18:42:34 UTC",
        "score": 13,
        "link_id": "t3_tktn2q",
        "parent_id": "t1_i1sp23f"
    },
    {
        "comment_id": "i1ebbnw",
        "subreddit": "books",
        "body": "I recently started a book called Our Country Friends.  It was published in November 2021, set in March 2020 with the pandemic as a backdrop.  I realized about ten pages in that I wasn't mentally ready to go back to the anxiety of that time.  Shelved it and am not planning to go back.\n\nAbout fifteen years ago I attempted Crime and Punishment.  I made it until the part where the main character was tweaking out in the police station and on the fourth solid page of said tweaking out I realized that Dostoevsky is just too verbose for me.  I don't know what it says about me as a reader, but if two hundred words will suffice, why use a thousand?",
        "time": "2022-03-20 12:43:53 UTC",
        "score": 1,
        "link_id": "t3_thjnb8",
        "parent_id": "t3_thjnb8"
    },
    {
        "comment_id": "i0x5sra",
        "subreddit": "books",
        "body": "The Sun Also Rises.  The first time that I read it was in high school; I didn't understand all of these drunken idiots with no jobs, and hated Brett for absolutely fucking teasing men.  The second time that I read it was just after graduating college, when I was a drunken idiot with no job, not realizing that I was teasing men, and I loved it!  The third time that I read it was when I was 38, and I still loved it.  I understood the characters' complexities better, especially Brett.  All of a sudden it was like, oh, these dalliances are her trying to cope with the fact that she loves Jake but doesn't see a future with him due to his impotence.  I picked up on a lot of subtleties in the writing that I absolutely didn't during my younger reads.",
        "time": "2022-03-16 19:10:49 UTC",
        "score": 116,
        "link_id": "t3_tfjfoe",
        "parent_id": "t3_tfjfoe"
    },
    {
        "comment_id": "i0x4s0r",
        "subreddit": "books",
        "body": "I have read this book three times, and each time that I read it my feelings about Holden were completely different; unsurprisingly, they mirrored how I was feeling at that point about a real life Holden Caulfield that I had in my life.  My most recent reread was in the summer of 2020 and this book fucking broke my heart.  I just wanted someone, anyone, to help out this kid that so desperately needs it.",
        "time": "2022-03-16 19:04:02 UTC",
        "score": 109,
        "link_id": "t3_tfjfoe",
        "parent_id": "t1_i0wg07u"
    },
    {
        "comment_id": "i09dynu",
        "subreddit": "books",
        "body": "I actually didn't give it another shot!  This is very unlike me, I can count on one hand the number of books that I've started but haven't finished.  Instead I picked up another book on my \"to read\" list, One Day in December by Josie Silver.  I'm very much enjoying it, so I'm happy with my decision.  :)\n\nETA: one thing that weighed heavily into my decision to not restart it is that I only had it on loan from the library for seven days as it is new with a long wait list.  I knew that I wouldn't be able to finish it before it had to be returned!  If I had it for the usual 21 days, I might have been more compelled.",
        "time": "2022-03-11 16:58:05 UTC",
        "score": 1,
        "link_id": "t3_t54g0y",
        "parent_id": "t1_i07cncp"
    },
    {
        "comment_id": "hy9dnbz",
        "subreddit": "books",
        "body": "I knowingly decided to read some Christian Inspirational Romance earlier this year (out of morbid curiosity).  I actually read not one but two; the first was \"A Common Life\" by Jan Karon which is about an Episcopal priest getting married.  The second was \"Courting Cate\" by Leslie Gould, which is The Taming of the Shrew but with Amish characters.  They were both terrible, but the Amish romance actually at least hinted at their characters having a sex drive and overall had less religious over- and undertones, whereas the Episcopal romance was two sixty year olds being \"scandalous\" with heavy hand holding and often quoting scripture.  I had expected the opposite.",
        "time": "2022-02-24 16:43:23 UTC",
        "score": 2,
        "link_id": "t3_szqnue",
        "parent_id": "t1_hy5m538"
    },
    {
        "comment_id": "hwed9mg",
        "subreddit": "books",
        "body": "Oh my gosh, I am nearly 40 years old and JUST reread Hatchet last month!  I'll admit that I didn't remember Paulsen's narration being so repetitive, but I understood why my 12 year old self enjoyed it.  I also liked that I was able to identify chokecherries just by the character's description of them.",
        "time": "2022-02-10 18:22:40 UTC",
        "score": 2,
        "link_id": "t3_sow3v8",
        "parent_id": "t1_hwbxkj1"
    },
    {
        "comment_id": "hweaf6n",
        "subreddit": "books",
        "body": "I found Baz Luhrmann's adaptation of The Great Gatsby to be so much better than the book, even with Carey Mulligan playing the part of Daisy (I personally find Carey Mulligan to have no personality, and Daisy is a character with a lot of personality so it seemed like a mismatch to me).  I don't know how F. Scott Fitzgerald took a book about lavish parties and turned it into a ~150 page slog but... he did it!  I will say that it's been about 15 years since I've read it and I'm wondering if it would be better now that I have more life experience under my belt.",
        "time": "2022-02-10 18:04:57 UTC",
        "score": 1,
        "link_id": "t3_sow3v8",
        "parent_id": "t1_hwc0mb4"
    },
    {
        "comment_id": "hqfigm5",
        "subreddit": "books",
        "body": "I've also been thinking about rereading Hatchet!  I remember enjoying it so much as a kid and I wonder if it would hold up.  \n\nIn fact, you've inspired me.  I'm headed to the library today and I think I'm going to pick it up while I'm there!  I have about two weeks before my book club selects our next read and this will be one I can finish in the meantime.  :)",
        "time": "2021-12-29 17:11:38 UTC",
        "score": 5,
        "link_id": "t3_rqvp9m",
        "parent_id": "t1_hqfhc3n"
    },
    {
        "comment_id": "hg1en42",
        "subreddit": "books",
        "body": "I emailed Jeff Guinn when I finished his Western series (Glorious, Buffalo Trail and Silver City) to tell him how much I loved them.  He was so appreciative!  We're Facebook friends now.",
        "time": "2021-10-09 23:13:39 UTC",
        "score": 2,
        "link_id": "t3_q4pr6l",
        "parent_id": "t3_q4pr6l"
    },
    {
        "comment_id": "h4hf8t5",
        "subreddit": "books",
        "body": "I also got a chuckle out of your review of Naked Lunch.  I almost always do my best to power through to the end of books, but Naked Lunch was absolutely one that I put down after about 50 pages (another was Crime and Punishment, which was WAY too verbose for me, and Walden, which was WAY too pretentious).\n\nThe Indifferent Stars Above was a good one!  I thought it was well written.  Educated is on my \"to read\" list, which seems to be getting longer and longer...",
        "time": "2021-07-08 15:35:30 UTC",
        "score": 2,
        "link_id": "t3_ofu01f",
        "parent_id": "t1_h4fdwbc"
    },
    {
        "comment_id": "h3p0fqf",
        "subreddit": "books",
        "body": "I read Running with Scissors shortly after A Million Little Pieces was outed as fiction.  It immediately made me suspect that Augusten Burroughs pulled the same move because it was just way too over the top.  The part where he demolished a hole in the kitchen ceiling to make a skylight?  It was like a post out of r/thathappened.",
        "time": "2021-07-01 15:50:38 UTC",
        "score": 1,
        "link_id": "t3_ob318o",
        "parent_id": "t1_h3m8s4b"
    },
    {
        "comment_id": "h1zcl9c",
        "subreddit": "books",
        "body": "I just started reading Miss Benson's Beetle by Rachel Joyce and our heroine is a nearly 50-year-old unmarried woman embarking on overseas adventure!",
        "time": "2021-06-16 16:00:56 UTC",
        "score": 1,
        "link_id": "t3_o12l28",
        "parent_id": "t1_h1yhx99"
    },
    {
        "comment_id": "h1zc86o",
        "subreddit": "books",
        "body": "I'll throw my hat in the ring and mention Love in the Time of Cholera, where 70-something Florentino Ariza manages to bewitch a girl in her teens.  Although, maybe this passage can be considered fantasy after all because I interpreted it as Gabriel Garcia Marquez's fantasy that his own aging body would retain sexual appeal to much younger women.  Eye roll.",
        "time": "2021-06-16 15:58:19 UTC",
        "score": 59,
        "link_id": "t3_o12l28",
        "parent_id": "t1_h1ymi8e"
    },
    {
        "comment_id": "h1ef83i",
        "subreddit": "books",
        "body": "I completely agree with you!  It's so cheeky that it doesn't feel in line with what I assume were very stuffy times (although, having not experienced it for myself, maybe it wasn't so stuffy after all!).  I felt the same way about Ernest Hemingway's Garden of Eden.  That was a book where I was like..... whoa, this kind of stuff happened back then?!  In fact, just mentioning it here reminded me that it might warrant a reread!  It's been probably 15 years since I read it.",
        "time": "2021-06-11 13:25:10 UTC",
        "score": 1,
        "link_id": "t3_nwqnkb",
        "parent_id": "t1_h1d8c0r"
    },
    {
        "comment_id": "h1eey85",
        "subreddit": "books",
        "body": "I don't have any Austen on the docket currently, but I would certainly be open to reading more.  I will add Persuasion to my reading list!  I also am planning to watch the miniseries you mentioned; the cousin mentioned in my post highly recommended it and I'm excited to watch it.  :)",
        "time": "2021-06-11 13:22:54 UTC",
        "score": 2,
        "link_id": "t3_nwqnkb",
        "parent_id": "t1_h1cwhfo"
    },
    {
        "comment_id": "h1ees58",
        "subreddit": "books",
        "body": "Classics also take me a long time.  The Grapes of Wrath was good, but for me it was like slogging through molasses.  But P&P just feels so fresh!",
        "time": "2021-06-11 13:21:28 UTC",
        "score": 2,
        "link_id": "t3_nwqnkb",
        "parent_id": "t1_h1cukqk"
    },
    {
        "comment_id": "h1b0lqz",
        "subreddit": "books",
        "body": "Five actually!",
        "time": "2021-06-10 17:45:37 UTC",
        "score": 1,
        "link_id": "t3_nwqnkb",
        "parent_id": "t1_h1ayhsr"
    },
    {
        "comment_id": "h1af2h3",
        "subreddit": "books",
        "body": "I don't understand the brag because it usually takes me about a month to finish a single book.  :/",
        "time": "2021-06-10 15:19:25 UTC",
        "score": 8,
        "link_id": "t3_nwga7p",
        "parent_id": "t1_h19xcdt"
    },
    {
        "comment_id": "glhbleh",
        "subreddit": "books",
        "body": "This is exactly how I am as well!  I understand that people are flawed, and I like when literary characters have flaws because no one is one dimensional.  But at the same time, if a character has zero redeeming qualities, and zero ambition to change that, then I find it really hard to care about their journey.",
        "time": "2021-01-31 14:14:14 UTC",
        "score": 8,
        "link_id": "t3_l97b88",
        "parent_id": "t1_glgnny9"
    },
    {
        "comment_id": "ginhv86",
        "subreddit": "books",
        "body": "Old favorites is the way to go.  :)  When the library closed down, I had no choice but to read things that I had on hand.  It's amazing how much books change with age and perspective!  I know others have said it, but please don't pressure yourself with a reading goal, and definitely not right now!  And lastly, you're not alone.  I have been struggling to finish Love in the Time of Cholera.  I got it before the library shut down again (in mid November) and I *still* haven't finished it!",
        "time": "2021-01-09 13:10:58 UTC",
        "score": 2,
        "link_id": "t3_kt994l",
        "parent_id": "t1_gilq778"
    },
    {
        "comment_id": "fv0nlc1",
        "subreddit": "books",
        "body": "I've felt for a long time that fish feel more than we think.  One time I was at a friend's house and realized that their aquarium was gone from the living room.  I asked what happened and was told that all of the fish had died but one, so they just put the aquarium in the basement and were waiting for him to kick the bucket, too.  I took him home and put him in my tank.  He was a bit standoffish for the first few days, but then he blossomed and started \"socializing\" with the others.  He and the other largest fish would often chase each other around and then spend time resting side by side.  He ended up being the final survivor in my aquarium as well, so he got shuffled yet again to a new home.  Same thing: spent time to himself the first couple of days, then blossomed once he acclimated to the crew.  He was a very social fish!\n\nI might have to add this book to my library queue!",
        "time": "2020-06-16 15:08:58 UTC",
        "score": 81,
        "link_id": "t3_ha2025",
        "parent_id": "t3_ha2025"
    },
    {
        "comment_id": "fsyl7s4",
        "subreddit": "books",
        "body": "I'm so glad to hear that.  :)  Thank you for the reassurance, and congrats on your sobriety.",
        "time": "2020-06-05 10:51:19 UTC",
        "score": 2,
        "link_id": "t3_gwww58",
        "parent_id": "t1_fsxqfkz"
    },
    {
        "comment_id": "fsyl5we",
        "subreddit": "books",
        "body": "You know, I read that one when I was in my mid 20s and it didn't resonate as well with me.  I can't remember if I still have it or if I've donated it.  I'll check!",
        "time": "2020-06-05 10:50:34 UTC",
        "score": 1,
        "link_id": "t3_gwww58",
        "parent_id": "t1_fsxw2ey"
    },
    {
        "comment_id": "fqpi5yf",
        "subreddit": "books",
        "body": "I've done spring-chilled beer after a long hike.  Glorious.  :)\n\nI found gems in the banter.  Like when Jake and Brett were trying to chat with Pedro Romero and drunken Mike just kept yelling \"JAKE.  TELL HIM THE BULL HAS NO BALLS.\"  I've been out with that guy.  Heck, I've *been* that guy.  Or when Brett says that she feels like a complete bitch for her actions and Jake simply responds with a telling \"Well.\"  Such a great response.  Something so small that I likely glossed over before.  I found so much of the conversation to be completely realistic; in my experience this is no small feat, be it in literature, or movies, or stage production.  So often conversation feels stilted, but not in The Sun Also Rises.\n\nNice to get a high school English teacher's perspective on it.  I questioned the methodology, but see where you are coming from.  I can only hope that many others decide to revisit it as they mature!",
        "time": "2020-05-15 12:49:53 UTC",
        "score": 7,
        "link_id": "t3_gk15ep",
        "parent_id": "t1_fqpew9q"
    },
    {
        "comment_id": "fqpb0au",
        "subreddit": "books",
        "body": "I think that's what made Quitters Inc probably my favorite thing by Stephen King that I've ever read.  There's something so simplistic and sinister about it.  I am going to add Night Shift to my library queue; I haven't read these stories since college, and it's time for a revisit.  :)  Thanks for the memory jog!",
        "time": "2020-05-15 11:13:16 UTC",
        "score": 1,
        "link_id": "t3_gjnypw",
        "parent_id": "t1_fqo1j9e"
    },
    {
        "comment_id": "fqpalnm",
        "subreddit": "books",
        "body": "Before Sun, I reread my favorite book from when I was 12 years old (Rifles for Watie by Harold Keith) and was absolutely shocked that, aside from a few minor things that didn't age well, the book held up for me.  I wonder for how many of my old favorites this would be true!\n\nOn a similar topic, I have found that my movie viewership has diverged MAJORLY since I was younger.  I used to enjoy weird for the sake of being weird.  No longer!  I need a straightforward plot, and nothing too needlessly complicated.",
        "time": "2020-05-15 11:07:00 UTC",
        "score": 2,
        "link_id": "t3_gk15ep",
        "parent_id": "t1_fqp9azy"
    },
    {
        "comment_id": "fqp9ypa",
        "subreddit": "books",
        "body": "I'll be the first to admit that I like reading books that are fairly superficial.  I tend to get bogged down by lots of deep metaphor, and my brain doesn't pick up on it well, so even if it's there I usually won't see it.  I think that's why this book works so well for me, because for me it's the 1920s equivalent of a breezy beach read.  But depending on what you usually read, The Sun Also Rises just might not be your thing!",
        "time": "2020-05-15 10:57:03 UTC",
        "score": 5,
        "link_id": "t3_gk15ep",
        "parent_id": "t1_fqox2ca"
    },
    {
        "comment_id": "fqoa6q6",
        "subreddit": "books",
        "body": "As others have said, definitely revisit this in the future.  I first read it in high school, when I was 17.  Hated it.  Saw absolutely no point.  Reread it just after finishing college; understood feeling lost about the future a bit better and liked the book a lot.  Just finished my third read of it today, at the age of 37.  My favorite read through so far.  I think that life experience made me appreciate it so much more.  Why we were made to read it at the age of 17 baffles me.",
        "time": "2020-05-15 02:46:13 UTC",
        "score": 3,
        "link_id": "t3_fapgc6",
        "parent_id": "t3_fapgc6"
    },
    {
        "comment_id": "cuwse0y",
        "subreddit": "books",
        "body": "Black Hole was the one that hooked me.  ",
        "time": "2015-09-10 14:59:03 UTC",
        "score": 3,
        "link_id": "t3_3kcmud",
        "parent_id": "t3_3kcmud"
    }
]