[
    {
        "comment_id": "lzw91kr",
        "subreddit": "books",
        "body": "\"The Hobbit is misogynistic\" was a key takeaway message of the lecture, expressly written in the powerpoint, and that's what stayed with my son. If there was nuance and additional info about women at the time Tolkien was writing and why he chose not to include them, it was lost.",
        "time": "2024-12-01 17:10:39 UTC",
        "score": 3,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzw1ya8"
    },
    {
        "comment_id": "lzw1s51",
        "subreddit": "books",
        "body": "🤷‍♀️",
        "time": "2024-12-01 16:32:07 UTC",
        "score": 2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzw1pvo"
    },
    {
        "comment_id": "lzw1hhs",
        "subreddit": "books",
        "body": "As they should.",
        "time": "2024-12-01 16:30:31 UTC",
        "score": 0,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzw1cvo"
    },
    {
        "comment_id": "lzw17oi",
        "subreddit": "books",
        "body": "That is what there is to it. I am not being deceitful about anything and I find it weird that you would resort to personal character attacks when you should know better.\n\nThere might have been some nuance or thickness in the lecture, but the key takeaway message was clear. The Hobbit is misogynistic.",
        "time": "2024-12-01 16:29:01 UTC",
        "score": 1,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzw0qis"
    },
    {
        "comment_id": "lzvzo39",
        "subreddit": "books",
        "body": "No actually ppl are. That’s why I had to clarify I’m not a lit student.",
        "time": "2024-12-01 16:20:35 UTC",
        "score": -2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzvf4tc"
    },
    {
        "comment_id": "lzvzhxa",
        "subreddit": "books",
        "body": "But I’m not engaging in academic debate? If I was, obviously I would go about it differently.\n\nI’m sharing a ridiculous opinion about a classic book in Reddit. Those are inherently different activities.",
        "time": "2024-12-01 16:19:39 UTC",
        "score": -3,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzvhzk7"
    },
    {
        "comment_id": "lzvz42o",
        "subreddit": "books",
        "body": "It wasn’t a literature course, it was Pop Culture.\n\nAnd “The Hobbit is misogynistic” was expressed in black and white in the lecture PowerPoint. Hopefully the prof put some nuance to it, but that was the key message.",
        "time": "2024-12-01 16:17:33 UTC",
        "score": 3,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzvplwo"
    },
    {
        "comment_id": "lzv84sw",
        "subreddit": "books",
        "body": "But that is literally what it is about!! How else could it showcase diversity?",
        "time": "2024-12-01 13:27:35 UTC",
        "score": 2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv6x9f"
    },
    {
        "comment_id": "lzv65po",
        "subreddit": "books",
        "body": "I am upset because my son was taught a nonsense idea about a work that I love and hold very dear. \n\nthe fact that the Hobbit doesn't have female characters is not important, and absolutely does not make it misogynistic, beyond the vague statement that \"it belongs to its time\".",
        "time": "2024-12-01 13:12:14 UTC",
        "score": -1,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv5q9p"
    },
    {
        "comment_id": "lzv5kgn",
        "subreddit": "books",
        "body": "No, rather, creatures from different species working effectively together. \n\nAre you critiquing the Hobbit because it happens to be about a fantasy world inhabited by dwarves, hobbits and elves?",
        "time": "2024-12-01 13:07:29 UTC",
        "score": -4,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv3i77"
    },
    {
        "comment_id": "lzv4veg",
        "subreddit": "books",
        "body": "So in order to escape the dreaded label of narrow-mindedness, every idea has to be considered as equally valid or worthy of consideration? We can't have just plain stupid ideas (like this one?)",
        "time": "2024-12-01 13:01:47 UTC",
        "score": -3,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv3x8b"
    },
    {
        "comment_id": "lzv4q58",
        "subreddit": "books",
        "body": "I saw the powerpoint for the lecture. It says expressly \"The Hobbit is misogynistic\" Of course I don't know what nuanced or thoughtful teaching was offered around that, but the net result for my son is that he think the prof thinks The Hobbit is misogynistic.",
        "time": "2024-12-01 13:00:34 UTC",
        "score": -3,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv4gus"
    },
    {
        "comment_id": "lzv3xkb",
        "subreddit": "books",
        "body": "Oh for sure, talk about the culture, and the overall misogyny which permeated the culture and still does. It's a factor, and huge factor, and no doubt impacted Tolkien and every other member of society. \n\nbut that is not what my son was taught. I saw the prof's powerpoint- it expressly said \"The Hobbit is misogynistic\".",
        "time": "2024-12-01 12:53:47 UTC",
        "score": -2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv1hv5"
    },
    {
        "comment_id": "lzv3oiw",
        "subreddit": "books",
        "body": "No, for me, it is personal. And just because it is personal, doesn't mean that it is not rational, or my reaction isn't valid.\n\n*The Hobbit* is absolutely not dismissive of women's capabilities. Show me one line, one passage, one implication where it is dismissing women's capabilities (and no, saying \"but it doesn't talk about women's capabilities doesn't count). I'll wait.",
        "time": "2024-12-01 12:51:37 UTC",
        "score": -21,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv1l6t"
    },
    {
        "comment_id": "lzv3f6i",
        "subreddit": "books",
        "body": "But why are you commenting about a work you haven't even read??",
        "time": "2024-12-01 12:49:24 UTC",
        "score": -5,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv1gj4"
    },
    {
        "comment_id": "lzv3cu8",
        "subreddit": "books",
        "body": "Just because a perspective is different doesn't mean that it is valid or worth putting out. I never said the prof should have said The Hobbit is charming and left it at that- I am all about exploring different theories and ideas. \n\nThis one idea though happened to be an incompetent, poorly-expressed, and invalid idea, and deserving of ridicule and contempt. Sometimes ideas just are like that, you know?",
        "time": "2024-12-01 12:48:48 UTC",
        "score": -37,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0uut"
    },
    {
        "comment_id": "lzv2vww",
        "subreddit": "books",
        "body": "Are we not supposed to criticise or have emotional reactions against what we hear, just because a prof said it? Are we supposed to bow our heads in respectful silence? that's not what I was taught, in academia, no less.",
        "time": "2024-12-01 12:44:35 UTC",
        "score": -13,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv2a6r"
    },
    {
        "comment_id": "lzv2j0e",
        "subreddit": "books",
        "body": "Right??? That's exactly how I felt!",
        "time": "2024-12-01 12:41:22 UTC",
        "score": -1,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv2giz"
    },
    {
        "comment_id": "lzv26n8",
        "subreddit": "books",
        "body": "I'm not studying literature. I encountered a stupid idea, and I am foaming at the mouth about that. \n\nSometimes academia seems to be about spouting nonsense, which is what happened in this case, and I am pointing it out.",
        "time": "2024-12-01 12:38:14 UTC",
        "score": -17,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv107o"
    },
    {
        "comment_id": "lzv1ydz",
        "subreddit": "books",
        "body": "Oh he knows about it. And women had been writing incredible stories and novels for far longer than 1930. There have always been genius women writers writing fantastic female characters, and a few men too, they didn't need Tolkien pity-writing them into a story which essentially describes a boys' trip.   \n\nAnd *The Hobbit* is plenty diverse. Just not the kind of diversity that suits modern sensibilities. Have you read it?",
        "time": "2024-12-01 12:36:06 UTC",
        "score": 0,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0qbu"
    },
    {
        "comment_id": "lzv1m0z",
        "subreddit": "books",
        "body": "You could totally cast a dark-skinned Bilbo and it would work just fine. But the original story is what it is.",
        "time": "2024-12-01 12:32:56 UTC",
        "score": 2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0n0p"
    },
    {
        "comment_id": "lzv1g5w",
        "subreddit": "books",
        "body": "This was exactly my reaction.",
        "time": "2024-12-01 12:31:24 UTC",
        "score": 2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0ljl"
    },
    {
        "comment_id": "lzv1f5w",
        "subreddit": "books",
        "body": "Belladonna Took. Not gonna lie, I would have liked to meet her. I hope that doesn't make me misandrist!",
        "time": "2024-12-01 12:31:09 UTC",
        "score": -10,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0ggs"
    },
    {
        "comment_id": "lzv1bqb",
        "subreddit": "books",
        "body": "This is what annoys me. In real life, boys and girls do things separately all the time. Girls' nights out, boys' fishing trip etc. \n\nBut writing about similar social activities is not \"frowned upon\"?",
        "time": "2024-12-01 12:30:16 UTC",
        "score": 0,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0lc7"
    },
    {
        "comment_id": "lzv15e3",
        "subreddit": "books",
        "body": "You are very welcome, and I hope you learned something, such as anybody can have an opinion about misogyny and may express it, regardless of their gender.",
        "time": "2024-12-01 12:28:39 UTC",
        "score": -2,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0g99"
    },
    {
        "comment_id": "lzv0zrr",
        "subreddit": "books",
        "body": "I TOTALLY AM. THAT WAS THE POINT OF THIS POST.",
        "time": "2024-12-01 12:27:10 UTC",
        "score": -30,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv05sj"
    },
    {
        "comment_id": "lzv0xe2",
        "subreddit": "books",
        "body": "It does say something, for sure. But it doesn't say misogynistic.",
        "time": "2024-12-01 12:26:33 UTC",
        "score": -58,
        "link_id": "t3_1h420vj",
        "parent_id": "t1_lzv0hz9"
    },
    {
        "comment_id": "lstskvk",
        "subreddit": "books",
        "body": "This was a very popular story I wrote in the first year of the pandemic: \n\n[Lisa : r/shortscarystories (reddit.com)](https://www.reddit.com/r/shortscarystories/comments/16v7rh8/lisa/)",
        "time": "2024-10-20 11:36:33 UTC",
        "score": 1,
        "link_id": "t3_1g778ef",
        "parent_id": "t1_lsochca"
    },
    {
        "comment_id": "lsofbq4",
        "subreddit": "books",
        "body": "That’s the problem there- you felt the COVID plot was “shoehorned” in. It didn’t feel natural or authentic. \n\nI’ll find a link to one of my most popular COVID stories-you’ll see what I mean.",
        "time": "2024-10-19 12:50:27 UTC",
        "score": 3,
        "link_id": "t3_1g778ef",
        "parent_id": "t1_lsochca"
    },
    {
        "comment_id": "lsoa37n",
        "subreddit": "books",
        "body": "I wrote several stories, mostly while COVID was still raging at its peak, and some of them proved to be my most popular stories, while others just flopped.\n\nI don't think it's COVID, I think it has to do with the quality of the story. I haven't read or heard of the books you mention, but it might be that they were just not that well-written.",
        "time": "2024-10-19 12:10:20 UTC",
        "score": 2,
        "link_id": "t3_1g778ef",
        "parent_id": "t3_1g778ef"
    },
    {
        "comment_id": "lktrrrm",
        "subreddit": "books",
        "body": "Really? Ugh. Not sure what to do with that. Bleurgh.",
        "time": "2024-08-31 13:05:53 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lktrmfd"
    },
    {
        "comment_id": "lkhcfb3",
        "subreddit": "books",
        "body": "That is such a good point! And it seems clear that in that day and age, ppl simply didn’t care about their Jewish audience.",
        "time": "2024-08-29 10:42:30 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lkco8mi"
    },
    {
        "comment_id": "lkfdlva",
        "subreddit": "books",
        "body": "But for the average reader, such as myself and presumably many other redditors, it simply doesn’t matter if Sayers, the author, is holding anti-Semitic beliefs or not. I don’t care. She’s dead. \nWhat matters is that we are reading a story in which, as you said yourself, an anti-Semitic rant, delivered with some force and great clarity, is used as a key plot point. As another reader pointed out, the anti-Semitism is “baked into the writing”. \n\nThe story does not present a critical or reflective   stance on these hateful tropes (unlike, for example, Twain), in fact, it uses them in a very unproblematic way to forward the plot- they are part of the book’s “universe”. \n\nAnd no, the repeated statement well that was just common those days, and that was just how everyone spoke isn’t an excuse, because no, it simply wasn’t true that every single person in the 1920s was an anti-Semitic bigot.\n\nLook, I’m not saying the book should be banned or rewritten or censored, or that Sayers should be “cancelled”, whatever that would look like. I’m just saying, oh look, here’s another British god with feet of clay.",
        "time": "2024-08-29 00:36:40 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lkczbm6"
    },
    {
        "comment_id": "lke1n0f",
        "subreddit": "books",
        "body": "I just want to clarify, I never said we should \"reject\" these older books (or any books) because of their hateful beliefs. I think they should be out there. I don't want them removed, changed, burned, hidden or anything similar. \n\nI do think they should be discussed, acknowledged, even enjoyed- just not have the author(s) put on some pedestal (which Eng Lit clearly is- I mean just look at this thread).",
        "time": "2024-08-28 19:22:22 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8bqv5"
    },
    {
        "comment_id": "lke0ypv",
        "subreddit": "books",
        "body": "Exactly my thoughts - what I've been trying to express. She should have known better than merely echoing, uncritically, the hateful beliefs of the time, no matter how common.",
        "time": "2024-08-28 19:18:20 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9fevo"
    },
    {
        "comment_id": "lkdzu49",
        "subreddit": "books",
        "body": "Absolutely no pretence. Books should be presented without censorship. \n\nBut as for the explanation, the book, the text, the song, whatever, should be able to to stand on its own merit, without a university-trained specialist tagging along to explain what the author REALLY means. Especially since we're talking about a fairly simple piece of genre fiction, it's not Heidegger's Being and Time!  \n\nThe author is fully capable of using context, exposition, explanation, characterization, to make the ideological world of their book clear to their readership. In this case, it seems the consensus is that this book is, in fact, pretty anti-Semitic, because of its constant and forefronted use of anti-Semitic tropes by characters who are otherwise \"nice\" characters.",
        "time": "2024-08-28 19:11:31 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lkdkgf5"
    },
    {
        "comment_id": "lkbtrzt",
        "subreddit": "books",
        "body": "I didn't say they are the same. But there's a pretty huge overlap.",
        "time": "2024-08-28 12:09:16 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lkbknl1"
    },
    {
        "comment_id": "lkbhruu",
        "subreddit": "books",
        "body": "It's the degree, the manner of execution and the context that counts. For example, I understand that the consensus on how Twain uses the n-word in Huckleberry Finn is indeed that he is portraying how ppl of the time talk, and is critical of it, and he (Twain) is NOT being racist. I remember reading Huckleberry Finn, and I was appalled at lots of things happening in the book, but Twain being racist was not one of them. That's just an example. \n\n  With regards to Whose Body?, the general consensus seems to be that Sayers is not simply portraying \"how ppl were back then\", she is actively, as someone else said, portraying Jewish ppl as the Other, in a pretty crude, glaringly anti-Semitic way.  It's a lot, in this book. There are plenty of books from that era (and others) where hateful beliefs and expression of bigotry are not given forefront and centre position- even on this thread there are plenty of examples, and as folk said, it is at the end of the day up to each individual to determine what their boundaries are, what media they choose to consume, what makes them uncomfortable. I love love love the Narnia books, and they've had a huge impact on me, even though I'm an atheist, and I feel like all of my life I've been mourning the casual racism CS Lewis tosses about, especially in The Horse and His Boy, generally acknowledged to be the best. But, for me at least, the beauty and strength of the books eclipse that, and during a particularly stressful time, I found myself rereading Prince Caspian as comfort. I've repeatedly heard that \"Birth of a Nation\" is a masterpiece- if you ignore its sympathy for the Ku Klux Klan- and I won't watch it. I watched and read Gone with the Wind as a young adult, and even then I could pick up on the problematic racism (and sexism- not a fan of marital rape)- but I can understand its appeal and endurance. Whose Body? is not a particularly good story anyway- it's definitely not as good as some of other Sayers books- but I wouldn't have it censored or anything. \n\nFinally, I did misread your line about the lecture and Somerville- my apologies for that, I was typing at midnight, after a long day at work and Reddit(!).",
        "time": "2024-08-28 10:32:30 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lkb0tno"
    },
    {
        "comment_id": "lka4igz",
        "subreddit": "books",
        "body": "I understand you have done scholarly research on Sayers, and I have not, but it seems to me, if an author needs someone with a masters degree coming along explaining that they’re not REALLY anti-Semitic, and anyway everyone was back then, and they’re not as bad as the others were, then perhaps the lady doth protest too much? \n\nI mean, nobody seems to be doubting that this book is presenting some pretty bog-standard anti-Semitic tropes, and since Death of the Author, it doesn’t really matter whether and what Sayers thought personally. She wrote a book and put it out there, chock full of anti-Semitic tropes. That’s a thing she did. The thing is what matters, not dead Dorothy Sayers who went to a lecture.",
        "time": "2024-08-28 02:36:54 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8a8n3"
    },
    {
        "comment_id": "lka357c",
        "subreddit": "books",
        "body": "I mentioned elsewhere- Anglo-American culture as promoted by media industries like Hollywood are HUGE.",
        "time": "2024-08-28 02:27:49 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9vnlx"
    },
    {
        "comment_id": "lka2k1u",
        "subreddit": "books",
        "body": "Well, I do want to initiate and participate in a frank and open discussion about anti-Semitism both specifically in that book and in broader British literature of the time, and I succeeded in that. I do believe there is inherent value in such an activity since “through dialogue we learn”, and every bit of text and exchange has a certain amount of social significance and value attached. I think it is important to have these discussions, since until very recently, at least in my experience, British writing and culture is very much valourized and lauded. I did history in a British high school back in the nineties (called them A-levels then, no idea what it’s called now) and the emphasis was wholly on the amazing role of Britain in WWII- nothing about British imperialism or atrocities or anti-Semitism. Britain carefully nurtures and promotes this image of itself as a nice quirky polite people (as opposed to Other, not-so-nice people). The needle is shifting only recently, as more awareness is gained about the devastation wrought by the British empire. \n\nOpen discussions such as this about the unsavoury parts of British society and history are necessary- I don’t think they are “just” about shaking your fist in the air. Also it’s ok to vent about readings that make you upset or cringe.\n\nI have to add, I’m not as virtuous as all that anyway 🙃 the main reason I probably won’t finish the book is that it’s not particularly good. If it was an amazing story (eg like an AC or a better Sayer) I probably would have finished it. Death of the Author. \n\nAnd I completely agree with your point about education being a resource for the elite to maintain the status quo- although I think perhaps the Victorians were starting to dabble in more “progressive” ideas about education, iirc.",
        "time": "2024-08-28 02:23:54 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9wc4t"
    },
    {
        "comment_id": "lk9ztr1",
        "subreddit": "books",
        "body": "There’s a comment up thread by someone who claims they have a masters thesis in Sayers, stating precisely that this is /not/ anti-Semitic.",
        "time": "2024-08-28 02:06:04 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk7xian"
    },
    {
        "comment_id": "lk9m6mk",
        "subreddit": "books",
        "body": "I suppose that’s why I’m having a bit of an existential crisis on this thread about education and talent- I’m the person who would defend humanities and art because “they make us better people”, who believes in the value of a good critical education, who believes people who are privileged have a duty to be good role models. Yes there are highly-educated douchebags and assholes, and I hold them more accountable and responsible for the harm they do in espousing harmful and hateful behaviour. \n\nIt’s true that we all have gaps and unexamined biases, as I do, and I have been called out on it too, (here on Reddit as well as in meatspace) but that means that we have a duty to do better, to learn. It doesn’t mean throwing up my hands in the air and saying oh well, pobody’s nerfect I guess, and Sayers was fine I suppose.",
        "time": "2024-08-28 00:41:09 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9iap0"
    },
    {
        "comment_id": "lk9g53d",
        "subreddit": "books",
        "body": " 🤢",
        "time": "2024-08-28 00:04:45 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9fkng"
    },
    {
        "comment_id": "lk9g2q9",
        "subreddit": "books",
        "body": "Fwiw, I don’t think she had the same biases as the dowager. But I do think she leaned very comfortably into the anti-Semitism of her time, and as you say, had a lot of unexamined biases, which as a woman of high talent and education, I find disappointing and shocking.",
        "time": "2024-08-28 00:04:21 UTC",
        "score": -1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9fd72"
    },
    {
        "comment_id": "lk9fmjz",
        "subreddit": "books",
        "body": "Yes and my point is it’s upsetting to see a woman as educated and talented as Sayers clearly was, to repeat and comfortabley lean into the widespread common anti- Semitism of the time.",
        "time": "2024-08-28 00:01:35 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8iiv6"
    },
    {
        "comment_id": "lk9fbc0",
        "subreddit": "books",
        "body": "This is important context, and one which gets completely lost in subsequent media images of French and British as glorious anti-Nazi freedom-fighters.",
        "time": "2024-08-27 23:59:39 UTC",
        "score": 7,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk9ay5f"
    },
    {
        "comment_id": "lk9f3dg",
        "subreddit": "books",
        "body": "I don’t think it’s bad-hearted, per se, but I do find it a tad too comfortable and casual for my liking.\n. I’m not sure I really buy the interpretation that she is steering her readers towards open-mindedness, it feels to me she is merely expressing the common sentiments of her time without any critical reflection or awareness.",
        "time": "2024-08-27 23:58:18 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk98vmh"
    },
    {
        "comment_id": "lk9ejak",
        "subreddit": "books",
        "body": "I totally agree! I’m glad I got the uncensored version, and I like how you put “jolt of revulsion”, yes indeed!",
        "time": "2024-08-27 23:54:56 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk947m1"
    },
    {
        "comment_id": "lk9ed17",
        "subreddit": "books",
        "body": "Because, as others point out, they became the good guys of WWII, the Nazi-fighters, and a whole media machinery is devoted to showing the whole world how awesome and cool and funny and quirky and loveable the British are.",
        "time": "2024-08-27 23:53:52 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk93lag"
    },
    {
        "comment_id": "lk9e2zn",
        "subreddit": "books",
        "body": "Yes. Politically uneducated and conservative seems to describe her quite well.",
        "time": "2024-08-27 23:52:07 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk92udb"
    },
    {
        "comment_id": "lk9dwsj",
        "subreddit": "books",
        "body": "This is so true. A place like, say Iran, historically never had pogroms like Europe did.",
        "time": "2024-08-27 23:51:04 UTC",
        "score": -2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk92k46"
    },
    {
        "comment_id": "lk8u1la",
        "subreddit": "books",
        "body": "Noooo! I used to love Father Brown!!",
        "time": "2024-08-27 21:56:30 UTC",
        "score": 1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8t0x2"
    },
    {
        "comment_id": "lk8t4cb",
        "subreddit": "books",
        "body": "This is true, and as I said up thread, I'm really glad the edition I bought had the original words (along with the disclaimer publisher's note in the front)",
        "time": "2024-08-27 21:51:25 UTC",
        "score": 5,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8iq0v"
    },
    {
        "comment_id": "lk8rzpe",
        "subreddit": "books",
        "body": "Valid!",
        "time": "2024-08-27 21:45:15 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk8mh3e"
    },
    {
        "comment_id": "lk834io",
        "subreddit": "books",
        "body": "Yes. I knew abstractly that anti-Semitism was rife in the UK, I was just surprised I guess seeing it in black and white where I wasn’t expecting it.",
        "time": "2024-08-27 19:31:20 UTC",
        "score": 4,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk80jaw"
    },
    {
        "comment_id": "lk82viy",
        "subreddit": "books",
        "body": "There’s a very common (mis) perception of the British as very polite, nice, conflict avoidant ppl. Added to the British being one of the good guys of WWII, I would say there’s a fairly effective propaganda re the British image as wholesome, good, nice. A lot of ppl don’t care or don’t know about British imperialism, and it’s only very recently that there seems to be more widespread acknowledgement of it. \n\nFor example, I wasn’t taught anything about British imperialism when I did my a-level in history in the 90s, the main focus was WWII and how amazing the British were. And that’s not an isolated experience.",
        "time": "2024-08-27 19:30:03 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk7yilc"
    },
    {
        "comment_id": "lk7f1sv",
        "subreddit": "books",
        "body": "Quite clearly, what you say is correct!",
        "time": "2024-08-27 17:26:14 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk76xz8"
    },
    {
        "comment_id": "lk7eukn",
        "subreddit": "books",
        "body": "I agree, I don't think books should be changed to appease modern sensibilities, and for all my cringe/outrage, I'm glad the publishers didn't change the text of \"Whose Body?\"",
        "time": "2024-08-27 17:25:12 UTC",
        "score": 12,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk75vjh"
    },
    {
        "comment_id": "lk7elta",
        "subreddit": "books",
        "body": "fair enough.",
        "time": "2024-08-27 17:23:55 UTC",
        "score": 3,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk771n2"
    },
    {
        "comment_id": "lk7ehe4",
        "subreddit": "books",
        "body": "Almost as if he is in a conflict between the received culture and common norms of the time, and what he knows is true!",
        "time": "2024-08-27 17:23:17 UTC",
        "score": 5,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk7ace6"
    },
    {
        "comment_id": "lk7ebwi",
        "subreddit": "books",
        "body": "Yes. And my point was, albeit not clearly expressed, that Britain has been lauded as a country of politeness, of freedom, of civilization for long, (despite the atrocities it committed), and shit like this show what a blatant lie all that propaganda was.",
        "time": "2024-08-27 17:22:29 UTC",
        "score": -2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk79las"
    },
    {
        "comment_id": "lk7dxl4",
        "subreddit": "books",
        "body": "I guess. We have improved. Despite the British elite, not because of them.",
        "time": "2024-08-27 17:20:26 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk786pm"
    },
    {
        "comment_id": "lk7doqn",
        "subreddit": "books",
        "body": "Yeah, the mom. Sorry I'm not quite au fait in the niceties of addressing British aristocracy. \n\nNot every single person in the 1920s in Britain was anti-Semitic, right? Despite it being a \"common sentiment\". I find it upsetting that a woman as highly-educated, as talented, and as influential as Sayers clearly was, to lean into and use what were obviously anti-Semitic tropes so comfortably.",
        "time": "2024-08-27 17:19:09 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk7cwnq"
    },
    {
        "comment_id": "lk76b1s",
        "subreddit": "books",
        "body": "I never liked Hemmingway- except his short story \"The Short Happy Life of Francis Macomber\" which somehow \"got\" me.",
        "time": "2024-08-27 16:40:25 UTC",
        "score": 3,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk72cuq"
    },
    {
        "comment_id": "lk766t3",
        "subreddit": "books",
        "body": "I absolutely don't think we should give older people a pass for hateful beliefs and behaviour, to do so would be denying them agency and the capacity to learn and grown as humans. \n\nAnd as I said above, I don't care that these were 'common views\" at the time! Ppls like Sayers, Christie- someone mentioned Wittgenstein- they were exceptional people- brilliant minds, well-educated, influencers, well-known and admired even before their deaths, who subscribed thoughtlessly to these hateful beliefs . If anybody ever had a duty NOT to simply parrot and hold \"common beliefs\", it would be people like them.",
        "time": "2024-08-27 16:39:48 UTC",
        "score": 0,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk7499a"
    },
    {
        "comment_id": "lk75kot",
        "subreddit": "books",
        "body": "This is so true. the famous British politeness is more of a sarcasm, than anything else.",
        "time": "2024-08-27 16:36:34 UTC",
        "score": -5,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk740bq"
    },
    {
        "comment_id": "lk75bro",
        "subreddit": "books",
        "body": "So I guess the question becomes- then how do we combat these hateful beliefs? If the best and brightest people in society- people who's words are eagerly read and admired decades after their passing, can fall prey, then what hope is there for the rest of us? How can we rise above? If the grand practitioners of the grand theoretical disciplines such as philosophy and literature are fucking useless at recognizing and combatting racism or anti-Semitism, then what even is their point??!",
        "time": "2024-08-27 16:35:14 UTC",
        "score": -1,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk74ek2"
    },
    {
        "comment_id": "lk71mt5",
        "subreddit": "books",
        "body": "Exactly this- it is the execution that matters. Bigotry is different from \"portrayal\", and it shows. \n\nAnother famous example I guess would be Mark Twain and his use of the n-word in Huckleberry Finn. To my mind, and I understand the consensus is that he was showing how ppl talked while condemning slavery, and there is no doubt that he is NOT a racist bigot.",
        "time": "2024-08-27 16:15:32 UTC",
        "score": 4,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk70h43"
    },
    {
        "comment_id": "lk70vhv",
        "subreddit": "books",
        "body": "Yes, I mean I got that the Jewishness of Levy was a key point in the plot (although I never thought about the penis, tbh), and it's not even that Judaism is obviously a big plot point, it's just /how/ Lady Whimsey, clearly a \"nice\" character, talks about them which is the huge turn-off.",
        "time": "2024-08-27 16:11:33 UTC",
        "score": 5,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk703rt"
    },
    {
        "comment_id": "lk70579",
        "subreddit": "books",
        "body": "Wow. As late as that.",
        "time": "2024-08-27 16:07:38 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6x0uw"
    },
    {
        "comment_id": "lk6zz3i",
        "subreddit": "books",
        "body": "It's true. But it's also sad- and when you think, these were some of the best, most well-educated, most admired pp of their time. They weren't \"common people\" spewing hateful beliefs, they were the elite, and they can't use the \"well it was common belief\" excuse. They had the privilege, and the ability, to know better. \n\nThey just didn't. I think that is what is sad and horrifying.",
        "time": "2024-08-27 16:06:43 UTC",
        "score": 7,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6x4bx"
    },
    {
        "comment_id": "lk6zeod",
        "subreddit": "books",
        "body": "It's fair that it was common at the time. But as I said in an earlier comment: \"I don't care that these were 'common views\" at the time! These were exceptional people- brilliant minds, well-educated, influencers, well-known and admired even before their deaths, who subscribed thoughtlessly to these hateful beliefs . If anybody ever had a duty NOT to simply parrot and hold \"common beliefs\", it would be writers such as Agatha Christie and Dorothy Sayers.",
        "time": "2024-08-27 16:03:41 UTC",
        "score": -19,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6vqep"
    },
    {
        "comment_id": "lk6z3jh",
        "subreddit": "books",
        "body": "Fair enough. We shouldn't.",
        "time": "2024-08-27 16:02:01 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6x12t"
    },
    {
        "comment_id": "lk6z082",
        "subreddit": "books",
        "body": "That's true- I think an ongoing theme of her books is a satirization and critique of British xenophobia- by how her characters reacted to Poirot. \n\nExcept for Jewish and Black ppl. :/",
        "time": "2024-08-27 16:01:31 UTC",
        "score": 72,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6xzzx"
    },
    {
        "comment_id": "lk6yq97",
        "subreddit": "books",
        "body": "But in fairness to your sons- there's a huge conceptual difference between an actor who's pretending to be someone else, and an author who is actually creating the characters and is responsible for their words and actions. I think authors and creators should be held to different standards.",
        "time": "2024-08-27 16:00:04 UTC",
        "score": 2,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6wtab"
    },
    {
        "comment_id": "lk6w50q",
        "subreddit": "books",
        "body": "Yes- it's just the British are held up as such a peak example of niceness, of civilization, of politeness, of Nazi-fighters, their culture has become so widespread thanks to Anglo-American global influence, that you expect better of them!",
        "time": "2024-08-27 15:46:18 UTC",
        "score": -62,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6vlgj"
    },
    {
        "comment_id": "lk6vnbf",
        "subreddit": "books",
        "body": "Just so unnecessary and vile. \n\nAnd I don't care that these were 'common views\" at the time! These were exceptional people- brilliant minds, well-educated, influencers, well-known and admired even before their deaths, who subscribed thoughtlessly to these hateful beliefs . If anybody ever had a duty NOT to simply parrot and hold \"common beliefs\", it would be writers such as Agatha Christie and Dorothy Sayers.",
        "time": "2024-08-27 15:43:42 UTC",
        "score": -17,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6uxgk"
    },
    {
        "comment_id": "lk6u2gx",
        "subreddit": "books",
        "body": "Exactly- she wasn't saying anything which wasn't, as the publishers said, widely accepted as normal.",
        "time": "2024-08-27 15:35:15 UTC",
        "score": 3,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6t1t1"
    },
    {
        "comment_id": "lk6tvwm",
        "subreddit": "books",
        "body": "Oh my god. So awful. There was an insidious line of anti-Semitic throughout the AC books, yes. Somewhere where she's describing \"one of the men who run the world\" blech.",
        "time": "2024-08-27 15:34:17 UTC",
        "score": 137,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6t9ia"
    },
    {
        "comment_id": "lk6tfwf",
        "subreddit": "books",
        "body": "I didn't recall anything so flat-out awful in Murder Must Advertise and the other couple of books of hers I read years ago, so I wasn't sure if I had just become \"woker\" with the passing years, and it was there I just missed it.",
        "time": "2024-08-27 15:31:56 UTC",
        "score": 17,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6sl3g"
    },
    {
        "comment_id": "lk6sapz",
        "subreddit": "books",
        "body": "It is baked in, isn't it? I am very much \"Death of the Author\" and I am mildly invested in the plot but not sure how many more anti-Semitic, anti-poor sentiments I need to take. \n\nIt's upsetting when you think a woman of such great education and talent as her would hold such crude, stupid views- it really makes you realise the power of these hateful beliefs.",
        "time": "2024-08-27 15:25:52 UTC",
        "score": 7,
        "link_id": "t3_1f2jha2",
        "parent_id": "t1_lk6r0xk"
    },
    {
        "comment_id": "lie97af",
        "subreddit": "books",
        "body": "My sister and I just had a huge fight over this book (yes we are insufferable when together). She loves it, teaches it in class, thinks it is beautifully-written blah blah blah, and I think it is just a pathetic attempt for the US academic industry to lay some claim to having an Eng Lit \"canon\" or whatever.",
        "time": "2024-08-16 12:27:37 UTC",
        "score": -4,
        "link_id": "t3_1etlwtt",
        "parent_id": "t1_lie17uk"
    },
    {
        "comment_id": "lhf9xw3",
        "subreddit": "books",
        "body": "Yes. And also, talent sometimes lands regardless of the container.",
        "time": "2024-08-10 11:53:21 UTC",
        "score": 2,
        "link_id": "t3_1eo90xq",
        "parent_id": "t1_lhdfpk5"
    },
    {
        "comment_id": "lhdf7fe",
        "subreddit": "books",
        "body": "I might have to (re)read Lucky Jim, because I actually can’t remember anything about it.\n\nThank you for confirming my suspicion about Mr Amis, and also your very kind words 🙏",
        "time": "2024-08-10 01:34:42 UTC",
        "score": 2,
        "link_id": "t3_1eo90xq",
        "parent_id": "t1_lhc8w68"
    },
    {
        "comment_id": "lhdf0gm",
        "subreddit": "books",
        "body": "I know Lucky Jim is his famous work, and I know I’ve read it, I just can’t remember much about it! Book memory is funny like that. The Anti-Death League just hit me different, I guess.",
        "time": "2024-08-10 01:33:23 UTC",
        "score": 2,
        "link_id": "t3_1eo90xq",
        "parent_id": "t1_lhcp41e"
    },
    {
        "comment_id": "lhderat",
        "subreddit": "books",
        "body": "Thank you for your comment.",
        "time": "2024-08-10 01:31:38 UTC",
        "score": 1,
        "link_id": "t3_1eo90xq",
        "parent_id": "t1_lhd92sk"
    },
    {
        "comment_id": "lhdenkk",
        "subreddit": "books",
        "body": "It’s amazing how people can be so right and also so wrong!",
        "time": "2024-08-10 01:30:56 UTC",
        "score": 2,
        "link_id": "t3_1eo90xq",
        "parent_id": "t1_lhbvzc8"
    },
    {
        "comment_id": "lgrxda1",
        "subreddit": "books",
        "body": "Oh I agree 100% the main actor should be an Irish man- just I am finding it VERY hard to imagine someone who looks like Cillian Murphy in that role. \n\nThe dad from Derry Girls would be good choice. Not even the granda!\n\nCome to think of it Derry Girls didn't cast any internationally famous actors, and yet received a lot of (well-deserved) acclaim. Honestly if something is well-written, well-produced, and well-acted, it will find its audience.",
        "time": "2024-08-06 14:20:14 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lgrqdqe"
    },
    {
        "comment_id": "lghuj5o",
        "subreddit": "books",
        "body": "I will check it out!\n\nIt’s almost “not fair” that they would cast Cillian Murphy as the main character. It should be someone far more ordinary and “humble” looking, iyswim.",
        "time": "2024-08-04 19:17:36 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lghs2vi"
    },
    {
        "comment_id": "lfyqk4y",
        "subreddit": "books",
        "body": "\"Nobody's perfect\" is the kind of saying used for when somebody can't cook very well, or doesn't like outdoors. \n\nNot for rapists and war profiteers.\n\nRegarding standards of the time: war profiteering is a heinous if legal activity which harms your own soldiers. That's why Rhett was shunned and looked down upon by his own class and society. Not because he was feisty or sassy or married Scarlett. But because he was an immoral person who got rich(er) by engaging in activities which damaged their own side, and everyone knew that. That is what war profiteering does. Examples are plenty: British aristocrats selling crappy boots falling apart to their own government, for their own soldiers, etc, in WW1. It's not talked about as much, because who wants to hear that these outstanding elite members of society were scumbag profiteers and racketeers? No-one. Does no good for the morale.   \n\nSame goes for rape. The fact that they didn't have laws against it and it was perfectly legal doesn't say much when we're talking about a society where chattel slavery was also perfectly legal. As a society we always kinda sorta knew rape was awful (it's talked about in ancient classical texts- women kill themselves because of being raped, then and now), it just took us a reallllllly looooong time to make laws about it. And even now that we have, it seems like Certain People still haven't got the message. \n\nAnother modern televised depiction of marital rape is in Breaking Bad. The reception for that, and the way the woman is treated by the audience, is depressing. Feels like the more things change, the more they stay the same.",
        "time": "2024-08-01 12:17:27 UTC",
        "score": 0,
        "link_id": "t3_1efigr3",
        "parent_id": "t1_lfnruzu"
    },
    {
        "comment_id": "lfn90rj",
        "subreddit": "books",
        "body": "Rhett Butler committed marital rape against Scarlett. Am I just imagining that? Also- wasn't he a war profiteer? I can't remember the details- it's been years. But the overpowering Scarlett scene is pretty famous (probably for the wrong reasons <sigh>). \n\nThe men you start your list with: They're not great men. Good for them for falling in love with beautiful woman, yes it must be very hard to resist a woman depicted as Elizabeth Bennet, Scarlett or Catherine were, and they had the wealth to realise their love- but they're not amazing characters (perhaps a (weak-ish) argument can be made for Darcy). They're arrogant, demanding, entitled, wealthy through unfair, immoral if not illegal means (I'm only guessing that about Heathcliff, but it's a safe guess, and yes, inherited aristocratic wealth is unfair and there's a good argument for considering it immoral), cold, rude, and have no hesitation pulling rank for their needs and interests.\n\nIn fact, the more I think about it, they're awful men and I am thankful there are none like that in my immediate social circle.",
        "time": "2024-07-30 13:25:34 UTC",
        "score": 3,
        "link_id": "t3_1efigr3",
        "parent_id": "t1_lflivbi"
    },
    {
        "comment_id": "lef8aam",
        "subreddit": "books",
        "body": "I read it on my recent vacation. \n\nIt was a good vacation read. It was definitely overwritten (but then I've become used to tiny short scary stories), and plotting especially towards the end was just bonkers, but the characterization was adorable, and having elderly sleuths is a fun nursing home setting is \"cool\". I've volunteered in elderly care homes, and of course they're nothing like that- even the \"nice\" ones. \n\nReading the comment that they were bidding 7 figures for this had me roll my eyes.",
        "time": "2024-07-22 18:46:37 UTC",
        "score": 11,
        "link_id": "t3_1e9kbnu",
        "parent_id": "t3_1e9kbnu"
    },
    {
        "comment_id": "lee5llz",
        "subreddit": "books",
        "body": "Keep reading. The book comes to some rather interesting conclusions about work, the necessity of working, and being \"financially intouchable\".",
        "time": "2024-07-22 15:21:32 UTC",
        "score": 22,
        "link_id": "t3_1e9f4fr",
        "parent_id": "t3_1e9f4fr"
    },
    {
        "comment_id": "ldtc4yu",
        "subreddit": "books",
        "body": "I’m teasing.",
        "time": "2024-07-18 18:59:44 UTC",
        "score": 5,
        "link_id": "t3_1e6hhhh",
        "parent_id": "t1_ldtc1va"
    },
    {
        "comment_id": "ldtakb5",
        "subreddit": "books",
        "body": "I remember being surprised that Rebecca had the particular issue she had. I was not expecting that. But I read it a million years ago- before the Age of Internet so of course we were not as clued up and smart as you young uns!",
        "time": "2024-07-18 18:51:17 UTC",
        "score": 14,
        "link_id": "t3_1e6hhhh",
        "parent_id": "t3_1e6hhhh"
    },
    {
        "comment_id": "ldrjyrt",
        "subreddit": "books",
        "body": "Depending on how well they're done, I love it. \n\nI remember as a child reading the Narnia series, and wishing so much I could just read about daily life in Narnia- just the Talking Animals and other beings hanging out doing their thing. The kids were such an annoying intrusion with all their saviour bullshit, running around me me me with Aslan waving magic swords and crying or whatever. Honestly Aslan and the four kids are actually the worst part of Narnia. \n\nI just realised even back then I was tediously against colonization LOL \n\nAnd Jane Austen- how beautifully and nay, thrillingly she does boring old daily life. Just regular things happening in the English countryside.",
        "time": "2024-07-18 12:57:44 UTC",
        "score": 18,
        "link_id": "t3_1e6a1b2",
        "parent_id": "t3_1e6a1b2"
    },
    {
        "comment_id": "ldflsm0",
        "subreddit": "books",
        "body": "I think it's entirely possible to make fun of what you know very well and love - in fact that is what makes the satire successful. \n\nI like those books too, but they're a bit cartoonish. Brideshead Revisited is somehow more special to me, and it's the one I know almost by heart.",
        "time": "2024-07-16 11:07:35 UTC",
        "score": 2,
        "link_id": "t3_1e3vg9n",
        "parent_id": "t1_ldf84va"
    },
    {
        "comment_id": "ldbvn8y",
        "subreddit": "books",
        "body": "Oh I definitely understand that Waugh believed in it, and as far as one can tell with these things, believed in it genuinely and sincerely.\n\nJust luckily for us, his belief system didn’t contaminate, and indeed strengthened the beauty of his novel.",
        "time": "2024-07-15 18:33:05 UTC",
        "score": 3,
        "link_id": "t3_1e3vg9n",
        "parent_id": "t1_ldbq62t"
    },
    {
        "comment_id": "ldbnf28",
        "subreddit": "books",
        "body": "Ugh. I suppose you have a point. Bleurgh.",
        "time": "2024-07-15 17:49:11 UTC",
        "score": 1,
        "link_id": "t3_1e3vg9n",
        "parent_id": "t1_ldbgg34"
    },
    {
        "comment_id": "ldayk7n",
        "subreddit": "books",
        "body": "\"**Brideshead Revisited by Evelyn Waugh**. Evelyn Waugh was a right-wing catholic, this book is very much an argument for right-wing Catholicism, and yet despite being neither, I adore it. \"\n\nI adore it too! It's definitely one of my formative books. \n\nI knew about Evelyn Waugh being a right-wing Catholic, but I put that down to him being an upper-class twat and how Catholicism at that time became kind of like Buddhism and yoga is now- an avenue for discontent, ennui-afflicted white upper-middle-class ppl to channel \"spirituality\" or something. I certainly didn't read Brideshead Revisited as Catholic right-wing propaganda. If anything, it showed how horribly loathsome, self-indulgent, and desiccated the old Catholic aristocracy was. I mean, if it was meant to argue for right-wing Catholicism, it failed terribly, with me at least :)\n\nPoor Sebastian :(",
        "time": "2024-07-15 15:35:19 UTC",
        "score": 10,
        "link_id": "t3_1e3vg9n",
        "parent_id": "t3_1e3vg9n"
    },
    {
        "comment_id": "ld1pcp1",
        "subreddit": "books",
        "body": "Thank you!!!",
        "time": "2024-07-13 21:27:25 UTC",
        "score": 2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1n4kz"
    },
    {
        "comment_id": "ld1p9sb",
        "subreddit": "books",
        "body": "That’s not what I (the OP) said.\n\nThe media and publishing industry creates and markets these false personas of authors, painters, whatever, with a strong cult of personality. That is what is profitable.\n\nThen time will reveal they are shit people, and subsequently there is a shitshow, with fans feeling betrayed and distressed. \n\nIf we didn’t have this constructed cult of personality, which was never necessary to create art in the first place, then it wouldn’t matter so much what they said or did.",
        "time": "2024-07-13 21:26:55 UTC",
        "score": 0,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1mskm"
    },
    {
        "comment_id": "ld1mpem",
        "subreddit": "books",
        "body": "But the very fact that these industry events were happening- that he was placed in an elevated position to interact with the starry eyed fans - that he was put in this situation of power and authority that he really didn’t deserve- that is all the industry profit-mongering.",
        "time": "2024-07-13 21:10:36 UTC",
        "score": 2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1ih2i"
    },
    {
        "comment_id": "ld1m8y5",
        "subreddit": "books",
        "body": "Well, good thing you don’t have be around me then! Look on the bright side!",
        "time": "2024-07-13 21:07:45 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1kjce"
    },
    {
        "comment_id": "ld1m38a",
        "subreddit": "books",
        "body": "Ok?",
        "time": "2024-07-13 21:06:46 UTC",
        "score": -2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1lkhs"
    },
    {
        "comment_id": "ld1m0li",
        "subreddit": "books",
        "body": "No the industry didn’t create the controversy.\n\nBut the person JK Rowling had been treated like a goddess, that everything that came out of her mouth was treated with far more significance and reverence that it actually warranted. She -and other celebrity writers- was set up as some kind of authority- because that is profitable. It’s part of the industry.",
        "time": "2024-07-13 21:06:19 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1l96h"
    },
    {
        "comment_id": "ld1k8y1",
        "subreddit": "books",
        "body": "Because I’m saying something you know is true but goes against what you’ve been taught?",
        "time": "2024-07-13 20:55:24 UTC",
        "score": -1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld1jy11"
    },
    {
        "comment_id": "ld1irbr",
        "subreddit": "books",
        "body": "But it’s the industry which carefully constructs the persona of the author as woke, who produces social pressure, who is the liaison between the fans and the person creating art.",
        "time": "2024-07-13 20:46:14 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld11tvr"
    },
    {
        "comment_id": "ld11mha",
        "subreddit": "books",
        "body": "No you just feel the need to make bitter, dismissive remarks on those who do. Very nice.",
        "time": "2024-07-13 19:00:45 UTC",
        "score": -2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0zll6"
    },
    {
        "comment_id": "ld0ya5i",
        "subreddit": "books",
        "body": "I agree with you. But I am seeing the comments which highlight the consumerist nature of the industry are being downvoted.",
        "time": "2024-07-13 18:40:34 UTC",
        "score": -1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczdm9h"
    },
    {
        "comment_id": "ld0xyq2",
        "subreddit": "books",
        "body": "My point is that as individuals we are collectively socially conditioned to NOT separate the art from the artist, because it’s profitable that way.",
        "time": "2024-07-13 18:38:39 UTC",
        "score": 0,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczg87z"
    },
    {
        "comment_id": "ld0xs2h",
        "subreddit": "books",
        "body": "But the point that is being made that his fame is not separate from his terribleness.",
        "time": "2024-07-13 18:37:32 UTC",
        "score": 0,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczhd1n"
    },
    {
        "comment_id": "ld0xk3h",
        "subreddit": "books",
        "body": "Why don’t you post your thoughts and get validation, instead of pissing on people who do?",
        "time": "2024-07-13 18:36:11 UTC",
        "score": -2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczjtbg"
    },
    {
        "comment_id": "ld0vsco",
        "subreddit": "books",
        "body": "I believe in genius (certainly nobody ever accused Munro or Rowling of being a genius), but the desire for profit and marketability has killed off any real appreciation for it.",
        "time": "2024-07-13 18:25:25 UTC",
        "score": 2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0v0se"
    },
    {
        "comment_id": "ld0viwh",
        "subreddit": "books",
        "body": "😀maybe and music is a great example of how people of low talent and great marketability shoot to the stratosphere, even more so than writing and painting!",
        "time": "2024-07-13 18:23:48 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0v9x0"
    },
    {
        "comment_id": "ld0tbx7",
        "subreddit": "books",
        "body": "\" Don’t you think part of the reason Picasso and Shakespeare are so popular is due to their genius and exceptional quality of work?\"\n\nYes- *part* of the reason. Very talented men indeed- geniuses even (oh that overrated word!)\n\nAnd other parts were other things.",
        "time": "2024-07-13 18:10:26 UTC",
        "score": 0,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0st2u"
    },
    {
        "comment_id": "ld0s8eh",
        "subreddit": "books",
        "body": "Eh. Some artist or other (it's not like there's a shortage of goodevengreatart) caught the eye of their niece or nephew or great-Aunt Polly's best friend when she was back from Italy and thus a connection was formed.\n\nThe vagaries of fame and the completely fortuitous way most people shoot to fame is well known.",
        "time": "2024-07-13 18:03:45 UTC",
        "score": -1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0lzjv"
    },
    {
        "comment_id": "ld0rqjt",
        "subreddit": "books",
        "body": "Well yeah. That was the whole point of the choice.",
        "time": "2024-07-13 18:00:43 UTC",
        "score": 3,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0pji2"
    },
    {
        "comment_id": "ld0rmgm",
        "subreddit": "books",
        "body": "I'm not serious- I'm writing on Reddit! I'm not writing a Serious Academic Paper, or an Op-Ed. (I've done both those things and it's really not that much fun). I'm an Unserious Writer. And I am engaging with as many people here as I need or want to.",
        "time": "2024-07-13 18:00:03 UTC",
        "score": -3,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0q817"
    },
    {
        "comment_id": "ld0hdd5",
        "subreddit": "books",
        "body": "\"No, people really love to idolize and tend to follow \"the person\" more than the art.\"\n\nExcatly this- this is what I'm trying to get at. And this is not a human \"natural\" trait- its a feature of capitalist profit-seeking industry that we -collectively-  have been  socially conditioned to do. \n\nWe have created art for millenia without any compulsion to \"know\" anything about the artist. The obsession with the individual identity and \"fandom\" is profitable, and it is constructed by industries which profit from it.",
        "time": "2024-07-13 16:58:28 UTC",
        "score": 3,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczy5sl"
    },
    {
        "comment_id": "ld0g93c",
        "subreddit": "books",
        "body": "But you seem to be quite enjoying it in this instance?  \n\nAnd since when is posting on TWO subs considered \"spamming\"? \n\nAnd here another thought: did you know you don't have to read posts which are annoying? Imagine that! You're absolutely free not to read them, not to verbalize how annoying they are, not to engage with their annoying author! Imagine that! Isn't that a freeing thought? Embrace liberation!",
        "time": "2024-07-13 16:51:43 UTC",
        "score": -1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld0cnzz"
    },
    {
        "comment_id": "ld0azk1",
        "subreddit": "books",
        "body": "It’s not 100% economic conspiracy and I know you know what theory I am basing my views on. \n\nPicasso was undoubtedly a talented painter. However his global claim to fame is due to American/capitalist structures.\n\nShakespeare was a great playwright. His global influence and prestige is due to the British colonialism and nation-building. \n\nBoth those statements are true.",
        "time": "2024-07-13 16:20:11 UTC",
        "score": -3,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld01eon"
    },
    {
        "comment_id": "ld0ahqq",
        "subreddit": "books",
        "body": "It’s fine. I got my word out. Which was the whole point. I don’t care if it’s popular or not, the important thing is that it was read. Literally thousand of people read my views. And?\n\nWhat is your point? What are you trying to say to me? That I shouldn’t post on Reddit? That I shouldn’t have an opinion about Alice Munro? That I should only express upvoted opinions?",
        "time": "2024-07-13 16:17:10 UTC",
        "score": 4,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_ld02vbm"
    },
    {
        "comment_id": "lczznl5",
        "subreddit": "books",
        "body": "Sure. This is how Reddit works. I don’t have a problem with that. Do you?",
        "time": "2024-07-13 15:11:41 UTC",
        "score": -4,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczz7rr"
    },
    {
        "comment_id": "lczz8sk",
        "subreddit": "books",
        "body": "Yes. I agree with what you said.",
        "time": "2024-07-13 15:09:08 UTC",
        "score": 2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczy768"
    },
    {
        "comment_id": "lczy8yv",
        "subreddit": "books",
        "body": "Well I am. I am going to write an angry rant, aka my opinion, and copy and paste it on as many relevant subs as will allow me. Deal with it.",
        "time": "2024-07-13 15:02:58 UTC",
        "score": -10,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczxf81"
    },
    {
        "comment_id": "lczwhgo",
        "subreddit": "books",
        "body": "I’m sorry I don’t understand the point you’re making.\n\nI’m saying that industries have created this cult of celebrity worship and fandom because it’s profitable. We need to stop engaging with celebrity worship of artists. That’s my point.",
        "time": "2024-07-13 14:51:55 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczuqw7"
    },
    {
        "comment_id": "lczt7jn",
        "subreddit": "books",
        "body": "That’s what I’m saying. I’m not dismissing their art, simply their individual selves.",
        "time": "2024-07-13 14:31:02 UTC",
        "score": -9,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczk5gc"
    },
    {
        "comment_id": "lczt3ct",
        "subreddit": "books",
        "body": "Why don’t you share your thoughts? Why you mad bro?\n\nYeah I have thoughts and I wanna share them. Why is that pissing you off? Look to yourself.",
        "time": "2024-07-13 14:30:17 UTC",
        "score": -9,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczkjh3"
    },
    {
        "comment_id": "lczsrge",
        "subreddit": "books",
        "body": "That’s the point!",
        "time": "2024-07-13 14:28:08 UTC",
        "score": -2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczl9oj"
    },
    {
        "comment_id": "lczrtdb",
        "subreddit": "books",
        "body": "No, but it doesn’t make it better either!",
        "time": "2024-07-13 14:21:56 UTC",
        "score": -3,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczlhf8"
    },
    {
        "comment_id": "lczkm8w",
        "subreddit": "books",
        "body": "I agree with all you wrote here- the fickle nature of fame, the trends, the public construction of an “author”.",
        "time": "2024-07-13 13:32:38 UTC",
        "score": 1,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczh8c7"
    },
    {
        "comment_id": "lczk8m8",
        "subreddit": "books",
        "body": "I’m looking, can you make any recommendations?",
        "time": "2024-07-13 13:29:55 UTC",
        "score": -15,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczfvj6"
    },
    {
        "comment_id": "lczk79l",
        "subreddit": "books",
        "body": "I love the art “Cheat with Ace of Hearts”, and apparently the artist was a trash person (literally). I can’t remember his name tho’.\n\nI love Jane Austen’s works but I have no illusions about her as the bastion of the middle class morality. \n\nI love Guns n Roses music and I understand they’re a bunch of assholes too 😎",
        "time": "2024-07-13 13:29:39 UTC",
        "score": -15,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczfoh3"
    },
    {
        "comment_id": "lczig5i",
        "subreddit": "books",
        "body": "Racist undertones, overtones, and everything in between are part and parcel of English Literature.",
        "time": "2024-07-13 13:16:43 UTC",
        "score": -10,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczgkix"
    },
    {
        "comment_id": "lczibe0",
        "subreddit": "books",
        "body": "Yes. It’s not back pedalling, their stories are fine, but the cult of celebrity worship is terrible.",
        "time": "2024-07-13 13:15:44 UTC",
        "score": -19,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczfmva"
    },
    {
        "comment_id": "lczi5lb",
        "subreddit": "books",
        "body": "I certainly don’t think they’re terrible- but we all know that they’re very, very profitable!",
        "time": "2024-07-13 13:14:31 UTC",
        "score": -13,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczetsr"
    },
    {
        "comment_id": "lczi1yh",
        "subreddit": "books",
        "body": "🙏",
        "time": "2024-07-13 13:13:47 UTC",
        "score": -2,
        "link_id": "t3_1e292dc",
        "parent_id": "t1_lczcoae"
    },
    {
        "comment_id": "lbmb47v",
        "subreddit": "books",
        "body": "Ahhh this exchange is still knocking around in my head.\n\nWhat if someone calls out to you? Would you not say “yes”?\n\n-Hey AnnyWeather!\n\n-Yes? \n\nDo Irish ppl never/rarely use yes/no? This might be slightly breaking my brain!!",
        "time": "2024-07-04 16:46:26 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbeu1i2"
    },
    {
        "comment_id": "lbh7kg0",
        "subreddit": "books",
        "body": "I think it would be fun to read the dialogue out loud! \nBut I wasn’t reading alone, there were people milling around in my vicinity and I would feel too self-conscious to inflict my poorly-enunciated Irish on them 😀",
        "time": "2024-07-03 18:05:25 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbfp8sw"
    },
    {
        "comment_id": "lbdvqp5",
        "subreddit": "books",
        "body": "That’s cute!\n\nI love how accents are sharper / thicker on pre-school-aged children too.",
        "time": "2024-07-03 02:36:06 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbdu3f5"
    },
    {
        "comment_id": "lbdvlbt",
        "subreddit": "books",
        "body": "Definitely some Irish characters and at least one set in Ireland but it’s been 20 years and I can’t remember off the top of my head. \n\nBut I get what you mean, she’s probably not classified as “Irish Literature” like James Joyce etc.",
        "time": "2024-07-03 02:35:04 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbdmngx"
    },
    {
        "comment_id": "lbcywzq",
        "subreddit": "books",
        "body": "I totally see where you’re coming from.\n\nBut for me, reading through my North American (USA) media-tinted lenses, it was hard to read the wife as anything much other than the literary Irish iteration of the tired trope of the nagging bitch wife (see: Skyler White, Claire Dunphy for some popular examples), while the evil nuns were just, well, evil nuns, from whom the Good Guy needed to save the poor sinning victim (who even had his mom’s name??! I mean, come on!)",
        "time": "2024-07-02 22:58:56 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbcaom3"
    },
    {
        "comment_id": "lbcy7dc",
        "subreddit": "books",
        "body": "I only read when I’m on vacation although I’m aspiring to change that, so I’ll bear this in mind.",
        "time": "2024-07-02 22:54:28 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbcevtr"
    },
    {
        "comment_id": "lbcy479",
        "subreddit": "books",
        "body": "Interesting tip!",
        "time": "2024-07-02 22:53:55 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbcqw7f"
    },
    {
        "comment_id": "lbcjrlg",
        "subreddit": "books",
        "body": "Certainly it didn’t lack gritty realism!",
        "time": "2024-07-02 21:27:59 UTC",
        "score": 0,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbcia1i"
    },
    {
        "comment_id": "lbcjg26",
        "subreddit": "books",
        "body": "I know, that’s why I used quotation marks.\n\nThere’s nothing really shameful about it. There’s no Book Police. It just feels like it.",
        "time": "2024-07-02 21:26:08 UTC",
        "score": 0,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc8kui"
    },
    {
        "comment_id": "lbca6vl",
        "subreddit": "books",
        "body": "Ha! I just responded to your earlier comment going a bit more in depth about my “white man saviour” comment.\n\nI think the fact that he would bring more trouble and hassle both to the girl and to his family emphasizes his “saviour”-ish ness. To his local community, he would be an interfering, annoying busy body. To the enlightened contemporary reader, he was doing the right thing. Very Jesus-y.",
        "time": "2024-07-02 20:35:46 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc50qw"
    },
    {
        "comment_id": "lbc9kl7",
        "subreddit": "books",
        "body": "It was a purely awesome show!",
        "time": "2024-07-02 20:32:26 UTC",
        "score": 3,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc2jz6"
    },
    {
        "comment_id": "lbc9eoh",
        "subreddit": "books",
        "body": "Ok now I’m sold. I’ll check it out.",
        "time": "2024-07-02 20:31:33 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc13ri"
    },
    {
        "comment_id": "lbc90xd",
        "subreddit": "books",
        "body": "I can’t remember where I learned about the word vernacular. I’m trying to think I was ever taught any books that use it in school- but I can’t remember off the top of my head",
        "time": "2024-07-02 20:29:29 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc5wlz"
    },
    {
        "comment_id": "lbc8j9o",
        "subreddit": "books",
        "body": "That would be my mine critique of the story- the morality was too heavy-handed, unsubtle, un-nuanced, and it was basically a pretty hard dose of “white man saviour”. \n\nIt was interesting that the only character given depth and integrity was the main male character, while the female characters came off as evil at worst, unsympathetic, witchy and exotic at best. \n\n\nRe how the Magdalene Laundries etc were reflected beyond Ireland, I can speak to my experience that there was some coverage where I live in Canada, with some parallels being drawn with residential schools for Indigenous people- there definitely needs to be a moment of reckoning.",
        "time": "2024-07-02 20:26:52 UTC",
        "score": 3,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc30nu"
    },
    {
        "comment_id": "lbc1eb9",
        "subreddit": "books",
        "body": "I would love to do that too, ngl. Six weeks lolling around Italy and France, sponsored by ancestral inherited wealth? Yes please!",
        "time": "2024-07-02 19:48:49 UTC",
        "score": 9,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbjmgj"
    },
    {
        "comment_id": "lbc0zzo",
        "subreddit": "books",
        "body": "Ha! I love Derry Girls, amazing show! \n\nBut I missed that line. I’ll check it out.",
        "time": "2024-07-02 19:46:42 UTC",
        "score": 3,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc0icl"
    },
    {
        "comment_id": "lbc0vjd",
        "subreddit": "books",
        "body": "No sorry, my question wasn’t clear.\n\nI mean, is her target audience beyond Ireland, so to speak, is she aiming for a much broader anglophone audience (I am writing this from north Canada, which is where I found the book lying in my host’s house)?\n\nOr us she writing for the Irish, telling them the story of themselves, you know?",
        "time": "2024-07-02 19:46:01 UTC",
        "score": 3,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc04y2"
    },
    {
        "comment_id": "lbc0g28",
        "subreddit": "books",
        "body": "I knew there had to be a polysyllabic word for it!😆\n\nBut I thought vernacular would just mean “language of the people”, not specifically writing in that style, if you see what I mean.",
        "time": "2024-07-02 19:43:45 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbc03jh"
    },
    {
        "comment_id": "lbc07ck",
        "subreddit": "books",
        "body": "But it’s so short and such an “easy”, painless read, it’s hardly worth the internal “shame” of dnf, if you see what I mean.\n\nIt was a bit white-man-savioury, I can see that.",
        "time": "2024-07-02 19:42:26 UTC",
        "score": 0,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbd901"
    },
    {
        "comment_id": "lbbzunx",
        "subreddit": "books",
        "body": "?",
        "time": "2024-07-02 19:40:32 UTC",
        "score": 2,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbpqqu"
    },
    {
        "comment_id": "lbbzto4",
        "subreddit": "books",
        "body": "Oh yes, I was wondering the same- that is, whether it was an intentional stylistic choice of the author- for verisimilitude or something like that.\n\nWas she writing for a primarily English-speaking audience, I wonder.",
        "time": "2024-07-02 19:40:23 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbnjo1"
    },
    {
        "comment_id": "lbbzdry",
        "subreddit": "books",
        "body": "Oh wow so curious what the audiobook sounds like and whether it’s close to the voice in my head 😀😎 I might have to look it up.",
        "time": "2024-07-02 19:37:57 UTC",
        "score": 4,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbtk6n"
    },
    {
        "comment_id": "lbbhxja",
        "subreddit": "books",
        "body": "I will keep this in mind. A wee reading tour of Ireland sounds grand! (Sorry not sorry)",
        "time": "2024-07-02 18:03:46 UTC",
        "score": 5,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbc88f"
    },
    {
        "comment_id": "lbbhs0f",
        "subreddit": "books",
        "body": "That’s true! I meant non-Irish accented English.",
        "time": "2024-07-02 18:02:56 UTC",
        "score": 11,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbbbfvk"
    },
    {
        "comment_id": "lbb95kj",
        "subreddit": "books",
        "body": "Thanks! \nBut surely urban Irish ppl speak like this too? To a certain degrees?\nI guess accent are “sharper” and more pronounced in rural and remote areas, while city folk acquire a sort of bland “sameness”, but I hope people in Dublin don’t speak just like people in Toronto etc!",
        "time": "2024-07-02 17:16:56 UTC",
        "score": 5,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbb8oop"
    },
    {
        "comment_id": "lbb7ez6",
        "subreddit": "books",
        "body": "Eh. I just googled. I think I’m kinda out of my sci-fi phase, but sure if I see it lying around somewhere I might give it a try (which is incidentally how I read this book).",
        "time": "2024-07-02 17:07:33 UTC",
        "score": 1,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbb6e6p"
    },
    {
        "comment_id": "lbb732w",
        "subreddit": "books",
        "body": "I think I do “hear” them, at least sporadically, but this is the first time that I became very self aware and conscious about it.\n\nI wonder if that was partly the author’s intention, to creat a jarring language effect like that.",
        "time": "2024-07-02 17:05:46 UTC",
        "score": 3,
        "link_id": "t3_1dtqd3w",
        "parent_id": "t1_lbb5ze4"
    }
]