[
    {
        "comment_id": "lucdzt5",
        "subreddit": "books",
        "body": "Along with checking for dyslexia, get his eyes checked and be sure that they also check for convergence issues.   Vision therapy can be very helpful for those that need it.",
        "time": "2024-10-29 13:14:47 UTC",
        "score": 1,
        "link_id": "t3_1gecyaq",
        "parent_id": "t3_1gecyaq"
    },
    {
        "comment_id": "k7d3avz",
        "subreddit": "books",
        "body": "During Covid all I could get were Young Adult.   A lot of them are okay, some a great, some are pretty bad.   I am now teaching 7/8 grade language arts, and when I have students do book reports, I make note of the ones that sound good and put them on my reading list.",
        "time": "2023-11-01 13:38:19 UTC",
        "score": 1,
        "link_id": "t3_17kj7t5",
        "parent_id": "t3_17kj7t5"
    },
    {
        "comment_id": "jv93yln",
        "subreddit": "books",
        "body": "1. Borrow books from the library\n2. Borrow ebooks and audio books from the library\n3. Library annual sale\n4. Yard sales\n5. New and Used Book Store",
        "time": "2023-08-08 03:15:56 UTC",
        "score": 1,
        "link_id": "t3_15kly9o",
        "parent_id": "t3_15kly9o"
    },
    {
        "comment_id": "jraf14v",
        "subreddit": "books",
        "body": "I will be far down the list, but hopefully you will see this.  I suggest that you listen to the book as an audio book.  Together.    Do it will doing chores, preparing meals, etc.   \n\nHonestly, I would have been pissed if that book was required for my son and they didn't have a young adult version.    That sounds way too mature for kids that are that age.  I would have a talk with the school about maybe finding something else for next year.",
        "time": "2023-07-09 15:54:45 UTC",
        "score": 1,
        "link_id": "t3_14ucrz4",
        "parent_id": "t3_14ucrz4"
    },
    {
        "comment_id": "ihggphw",
        "subreddit": "books",
        "body": "Kill the Farm Boy.   Kind of silly book, but the narrator for the audio book is absolutely THE best!",
        "time": "2022-07-24 15:17:28 UTC",
        "score": 2,
        "link_id": "t3_w6xpcu",
        "parent_id": "t3_w6xpcu"
    },
    {
        "comment_id": "if1flwd",
        "subreddit": "books",
        "body": "The Keep of Time.  A Scholastic book about a tower in England. The kids go inside 3 times and travel to different times. First real time travel book.\n\nIt probably wasn't that great writing, as it hasn't been rereleased the last time I looked, but it was one of the first chapter books I read.",
        "time": "2022-07-06 05:16:18 UTC",
        "score": 1,
        "link_id": "t3_vs5i7w",
        "parent_id": "t3_vs5i7w"
    },
    {
        "comment_id": "if1fag3",
        "subreddit": "books",
        "body": "Better as an adult, seeing how he grows and finds himself.  All that went over my 11 year old head.",
        "time": "2022-07-06 05:12:45 UTC",
        "score": 10,
        "link_id": "t3_vs5i7w",
        "parent_id": "t1_iezj422"
    },
    {
        "comment_id": "icggrb9",
        "subreddit": "books",
        "body": "Why is this a problem?   I love books.  My husband loves books.   My kids love books.   We have a room that is a library.   Yes, we use the library.  We also get each other books for birthdays (support our few local stores,) and buy them at yard sales.   \n\nA friend gave us a trailer load of books that a friend moving to assisted care needed to get rid of.   This was the early 1990s, and the person had subscribed to one of those science fiction \"book of the month\" clubs.   A lot of great books in that collection, and no, we have not read them all, but we have read most, and yes, we still go to the library and even get e-books and audio books.",
        "time": "2022-06-15 14:12:30 UTC",
        "score": 1,
        "link_id": "t3_vcpwwa",
        "parent_id": "t3_vcpwwa"
    },
    {
        "comment_id": "i4wlkej",
        "subreddit": "books",
        "body": "I started with the Tiffany books, then Going Postal.   Basically whatever I could get as an audio book.",
        "time": "2022-04-16 01:27:09 UTC",
        "score": 1,
        "link_id": "t3_u4md99",
        "parent_id": "t3_u4md99"
    },
    {
        "comment_id": "i35qsz0",
        "subreddit": "books",
        "body": "Asimov's Guide to the Bible is pretty interesting.   Looks at it from a history perspective.",
        "time": "2022-04-02 22:29:41 UTC",
        "score": 1,
        "link_id": "t3_turge7",
        "parent_id": "t3_turge7"
    },
    {
        "comment_id": "hxs6ooh",
        "subreddit": "books",
        "body": "Read what you enjoy.  Don't read something because you \"have to.\". Try audiobooks.   Listening while you drive, take the bus, etc., may help.",
        "time": "2022-02-21 02:23:46 UTC",
        "score": -1,
        "link_id": "t3_sxh9vl",
        "parent_id": "t3_sxh9vl"
    },
    {
        "comment_id": "hxs6czf",
        "subreddit": "books",
        "body": "Audiobooks.",
        "time": "2022-02-21 02:21:09 UTC",
        "score": 1,
        "link_id": "t3_sxhaom",
        "parent_id": "t3_sxhaom"
    },
    {
        "comment_id": "hxg8inq",
        "subreddit": "books",
        "body": "It will be what you make of it.   Do you watch YouTube?   Do you watch things you can learn from?  Entertainment only?  Or some combination?   \n\nBill Gates probably reads a lot of educational, some entertainment, less self help, though it could be argued he needs to read more. Point is, read different things.  Try audiobooks too.",
        "time": "2022-02-18 14:43:41 UTC",
        "score": 2,
        "link_id": "t3_svj59s",
        "parent_id": "t3_svj59s"
    },
    {
        "comment_id": "hwvolxz",
        "subreddit": "books",
        "body": "I used Kindle to read Moby Dick.  It was pretty good\n   I mostly do audiobooks, with Libby now.",
        "time": "2022-02-14 06:15:51 UTC",
        "score": 1,
        "link_id": "t3_ss35lm",
        "parent_id": "t1_hwvohex"
    },
    {
        "comment_id": "hwvoak3",
        "subreddit": "books",
        "body": "Ebooks can have the option to tell you meanings of words that you highlight.   Audiobooks may be helpful as well.\n\nIn college, I bought the books, then highlighted and wrote questions. That can be helpful for those technical works.   I usually sold them back after...it is a bonus to have the extra notes, though they don't give full price.",
        "time": "2022-02-14 06:12:14 UTC",
        "score": 3,
        "link_id": "t3_ss35lm",
        "parent_id": "t3_ss35lm"
    }
]