[
    {
        "comment_id": "lyhpsyj",
        "subreddit": "books",
        "body": "Happy birthday!\n\nWhat a clever and cool thing to do. I might start doing this myself!",
        "time": "2024-11-22 22:51:02 UTC",
        "score": 7,
        "link_id": "t3_1gxicg3",
        "parent_id": "t3_1gxicg3"
    },
    {
        "comment_id": "lx3t08g",
        "subreddit": "books",
        "body": "On the opposite end, I think it’s so silly that the main characters in Dune have such oddly normal names. Like the rest of the world is built up, has specific sci fi/fantasy names for the setting. But Paul? Jessica? Takes me out a little",
        "time": "2024-11-14 16:12:12 UTC",
        "score": 1,
        "link_id": "t3_1gom7rk",
        "parent_id": "t1_lwkg43f"
    },
    {
        "comment_id": "lwarelh",
        "subreddit": "books",
        "body": "Hey that’s the age I was diagnosed as well! Aren’t brains WILD??? Lol\n\nSo happy we were able to find the right diagnosis and get help.",
        "time": "2024-11-09 19:56:23 UTC",
        "score": 2,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lwaqw56"
    },
    {
        "comment_id": "lwap0he",
        "subreddit": "books",
        "body": "It was really hard to crack the habit, I almost didn’t believe it was possible for me. Before it got really bad I just passed it off as me being an analytical person lol\n\nIt’s so interesting seeing how many others do it too! I truly thought I was the only one for so long.",
        "time": "2024-11-09 19:43:24 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lwab320"
    },
    {
        "comment_id": "lwaom3b",
        "subreddit": "books",
        "body": "OOO adding it to my good reads now, thanks for the rec! It’s great to hear to du Maurier’s other novels are great as well.",
        "time": "2024-11-09 19:41:16 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw6t5o3"
    },
    {
        "comment_id": "lw59ctu",
        "subreddit": "books",
        "body": "Right? That was my guess too that it was the publisher trying to sell more copies.\n\nDefinitely agree on it being a gothic novel!",
        "time": "2024-11-08 21:12:39 UTC",
        "score": 0,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw58wy5"
    },
    {
        "comment_id": "lw575mb",
        "subreddit": "books",
        "body": "I disagree, I think it’s more aligned with *Wuthering Heights* and *Jane Eyre* which are both gothic novels. The gothic era was inspired by romanticism, but since my copy was from the 90s I think it’s fair to say it was miscategorized by the publisher to sell more copies than to say it truly fits in romanticism.",
        "time": "2024-11-08 21:01:30 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw50r7e"
    },
    {
        "comment_id": "lw3tnpd",
        "subreddit": "books",
        "body": "Very good point!\n\nIt totally was super jarring - I had to remind myself a few times that I didn’t accidentally miss her name in the book, we are never given it. Great work in showing how little agency she really has in this book.",
        "time": "2024-11-08 16:56:48 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3swok"
    },
    {
        "comment_id": "lw3pr7r",
        "subreddit": "books",
        "body": "Same 🥲\n\nFrank seems like such a decent person who makes an effort to be her friend.",
        "time": "2024-11-08 16:38:10 UTC",
        "score": 3,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3oggu"
    },
    {
        "comment_id": "lw3nwdc",
        "subreddit": "books",
        "body": "I haven’t watched the Netflix adaption but was friends have said that they didn’t enjoy it versus the Hitchcock adaptation.\n\nGive the book a shot! I will warn you, it took me a while to get into it. The narrator tends to ramble (an effect because of her anxiety) so it can be tough to start seeing things move. But it’s so worth it and picks up really quickly!",
        "time": "2024-11-08 16:29:13 UTC",
        "score": 2,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3nb2g"
    },
    {
        "comment_id": "lw3mrye",
        "subreddit": "books",
        "body": "I loved The Birds! I need to add the book to my good reads. This is my first du Maurier book and I’ve so enjoyed it.\n\nI planned to watch the Hitchcock adaption tonight, this gets me more excited to watch it!",
        "time": "2024-11-08 16:23:47 UTC",
        "score": 3,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3m5zf"
    },
    {
        "comment_id": "lw3l96v",
        "subreddit": "books",
        "body": "Oooo yeah that makes total sense! She views everything as a being a story, even getting caught up in creating stories about her own life. Of course everything is colored pink in her eyes as a grand romance then. She sees Rebecca’s death as just a part of the plot in their love story, completely ignoring the danger. \n\nThanks for adding - I really like this interpretation.",
        "time": "2024-11-08 16:16:23 UTC",
        "score": 3,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3hfpy"
    },
    {
        "comment_id": "lw3hpih",
        "subreddit": "books",
        "body": "Yes yes yes\n\nTotally a thriller, def weird and gross it’s sold as a romance",
        "time": "2024-11-08 15:59:03 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw3h6w5"
    },
    {
        "comment_id": "lw3h8jl",
        "subreddit": "books",
        "body": "Thank you for sharing, I had no idea! What a power couple! I also picked up on the vibe that Rebecca and Beatrice had some lesbian/bi undertones.\n\nThat’s really interesting about her being reclusive. Another favorite author of mine is Shirley Jackson, who was also known to be reclusive, agoraphobic even. I also see the narrators in We Have Always Lived in the Castle along with The Haunting of Hill House as being well built characters who displayed the inner mechanics of mental illness so well.\n\nWe’re drawn to books we can relate to, so it would make sense why I’m drawn to both of these authors! Lol",
        "time": "2024-11-08 15:56:47 UTC",
        "score": 3,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw2i9ho"
    },
    {
        "comment_id": "lw3fu5d",
        "subreddit": "books",
        "body": "Same same same!\n\nI couldn’t stop the rehearsing, even after I was in CBT therapy and trying so hard. You’re so right - part of it for me is the fear of your every action being questioned too. My husband can tell how bad I’m doing mentally by how much my fake scenarios/convos spill out into real verbalizing rather than just staying in my head. It’s like I go into my own little world, in parallel to the narrator.\n\nI learned about maladaptive daydreaming and OCD. It turned out that a lot of my actions came from ruminating on ‘what if’ scenarios that I’ve been constantly on edge for. I’ve been doing ERP with my OCD specialist. It’s only been a few months but oh my god - it’s cut waaaay down on the rehearsing! And I catch myself doing it to instead of getting into spiraling. \n\nTotally not diagnosing you or the narrator with OCD! It’s just really refreshing to be able to talk openly with fellow anxious people. And to also take comfort that we’re not alone!",
        "time": "2024-11-08 15:49:57 UTC",
        "score": 4,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw2fezx"
    },
    {
        "comment_id": "lw3de2o",
        "subreddit": "books",
        "body": "Oooo yes you worded it perfectly! Du Maurier does such a great job of showing you what anxiety can look like. Even down to being too scared to interact with the staff. \n\nAt first with Mrs. Danvers it seems like she’s just misinterpreting all the interactions to be negative. Mostly because she interprets every interaction with anyone as someone hating her. And she has to win over because she assumes everything is somehow her fault :(\n\nEven when we see that Danvers try to convince the narrator to >!COMMIT SUICIDE!< the narrator still doesn’t tell Maxim because she’s scared of people being mad at her. Oof that was gut wrenching.",
        "time": "2024-11-08 15:37:55 UTC",
        "score": 1,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw26woz"
    },
    {
        "comment_id": "lw1tc3q",
        "subreddit": "books",
        "body": "Great point! It also definitely highlights why I love hearing the analysis of other people to see other perspectives.\n\nWith classics I really enjoy learning about the era and background of both the writer and lit setting. It’s so easy to forget that the core feelings haven’t changed. Romeo and Juliet might be hard to parse through without context of 16th to 17th century England. But teenagers having huge feelings and making rash choices still rings true! Being able to hear varied interpretations makes me so happy - I get to build that world in my head even more!",
        "time": "2024-11-08 08:47:11 UTC",
        "score": 6,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw1qibt"
    },
    {
        "comment_id": "lw1s784",
        "subreddit": "books",
        "body": "I too was shocked by the reception to Maxim’s admission! There were so many times where I was like “YOU ARE KIDDING ME HE IS TERRIBLE” \n\nAlso how easily he laid it all out, as if the only option he had was to kill Rebecca. Truly a victim complex with zero remorse for killing her, only fear of getting caught.",
        "time": "2024-11-08 08:34:46 UTC",
        "score": 18,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw1q3um"
    },
    {
        "comment_id": "lw1lgah",
        "subreddit": "books",
        "body": "Totally fair!\n\nI think to me the ending reads as the narrator having grown up a little, but still hasn’t really absorbed what has happened. Rebecca seemed like she was awful to be married to, but there isn’t any reflection from the narrator on the fact that her husband killed someone. Definitely reads as the narrator still being in a heightened state of shock, scared for her husband, and isn’t able to process the gravity of it.\n\nAfter Maxim tells the narrator that he killed Rebecca he does seem to have removed the invisible wall between them. From Rebecca’s boat being discovered to when they return to Manderley from London is a relatively short time for so much to happen. Outside of physical intimacy and helping the narrator get comfortable in the car, we don’t really see any change of character. Both of those things benefit Maxim, but he doesn’t show any selflessness towards his wife. Again - short timeline, everyone is in shock, racing around. But it doesn’t give me hope of things actually improving. \n\nIt’s interesting because we do see genuine kindness towards the narrator from Frank Crawley. There is definitely a parallel between how Maxim (upper class, husband) treats the narrator versus how Frank (lower class, employee turned friend) treats her.",
        "time": "2024-11-08 07:25:18 UTC",
        "score": 15,
        "link_id": "t3_1gmcl9u",
        "parent_id": "t1_lw1j7jl"
    },
    {
        "comment_id": "lugp6cs",
        "subreddit": "books",
        "body": "Agreed - it’s so hard to read because there’s so much truth behind how characters make decisions in it.",
        "time": "2024-10-30 02:58:25 UTC",
        "score": 1,
        "link_id": "t3_1g5x8sd",
        "parent_id": "t1_lug6str"
    },
    {
        "comment_id": "luczjue",
        "subreddit": "books",
        "body": "I was very lucky in the fact that my teacher gave us this interpretation. The idea that sometimes people who are mourning/grieving have emotional responses you wouldn’t expect. Especially high schoolers, who may not have the emotional intelligence yet to realize what’s going on. (I even saw it first hand. A classmate lost her mom to really brutal cancer. The classmate also got really annoying, similarly to how a lot of people view Holden. She was just trying so hard to keep it together and didn’t know how to deal with it all.)\n\nMy teacher warned us about the love it or hate it culture around the book. \n\nShe also brought up the humor of the book as well.",
        "time": "2024-10-29 15:14:26 UTC",
        "score": 4,
        "link_id": "t3_1gdtebh",
        "parent_id": "t1_lu4szx2"
    },
    {
        "comment_id": "lua3spy",
        "subreddit": "books",
        "body": "Definitely Octavia Butler, Shirley Jackson, or Oscar Wilde!",
        "time": "2024-10-29 01:40:40 UTC",
        "score": 6,
        "link_id": "t3_1gei9yq",
        "parent_id": "t3_1gei9yq"
    },
    {
        "comment_id": "lsiyf8i",
        "subreddit": "books",
        "body": "Fair! It was definitely a shocking and sad turn :(",
        "time": "2024-10-18 13:47:44 UTC",
        "score": 2,
        "link_id": "t3_1g5x8sd",
        "parent_id": "t1_lshznqr"
    },
    {
        "comment_id": "lshhntw",
        "subreddit": "books",
        "body": "Same here. I felt like the plot was really obvious and the characters read more flat?\n\nTbf I did read it after Sharp Objects so I probably judged it more harshly. Gillian Flynn is so good at building out characters and weaving a plot that reflects the characters, rather than the other way around.",
        "time": "2024-10-18 05:42:38 UTC",
        "score": 15,
        "link_id": "t3_1g5x8sd",
        "parent_id": "t1_lsfu1ca"
    }
]