[
    {
        "comment_id": "ly9dj01",
        "subreddit": "books",
        "body": "I had an older woman get annoyed at me because I was reading and had my headphones in (mid volume, so as not to bother others), on public transit. \n\nShe said something about how everyone is too self absorbed now, and no one talks to others. And, as an adult, I should be leading by example. There were kids listening to music too. \n\nI told her I don’t like many people, and especially dislike nosy ones. Then I said something about a book and headphones are my (polite?) way of keeping to myself and not bothering complete strangers. This all started with her tapping me on the shoulder.\n\nI was called rude. I shrugged and went back to my music and books. \n\nI still don’t understand why this happened.",
        "time": "2024-11-21 15:03:33 UTC",
        "score": 2,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t3_1gw3qpe"
    },
    {
        "comment_id": "lr6mkr4",
        "subreddit": "books",
        "body": "Return of the Mummy.",
        "time": "2024-10-10 01:06:52 UTC",
        "score": 3,
        "link_id": "t3_1g05hwn",
        "parent_id": "t3_1g05hwn"
    },
    {
        "comment_id": "losoq2j",
        "subreddit": "books",
        "body": "I just finished reading this one too. I found it disappointing too. Interesting idea, poorly executed.",
        "time": "2024-09-25 02:42:06 UTC",
        "score": 5,
        "link_id": "t3_1fou3e1",
        "parent_id": "t3_1fou3e1"
    },
    {
        "comment_id": "k6vl6rs",
        "subreddit": "books",
        "body": "I was nine (Grade 3) when I got my hands on Jurassic Park. \n\nI took a long time to learn to read. In grade 3 I went from Mr. Muggs (picture books), to Jurassic Park, The Hobbit, The Belgariad, etc. My mom didn’t care what I read, so long as I was reading. My mom took reading very seriously, and was very happy to spend hours in the library with my brother and I. We went to the public library weekly, at times.\n\nI basically skipped an entire genre of books for intermediate ages, going from young kids books to adult.\n\nMy teacher thought it was her right to monitor what we were reading. She would walk us weekly to the public library, and then try to corral us into the kids area. I would always sneak off to the adult section, when her back was turned. \n\nEvery time my class went to the library, my mom was either taking us or we had already gone. So, I never took out books. This lead the teacher into trying to demand that she keep my library card. My mom gave her a firm no, and assured her that she was fully capable of keeping track of our reading and she was fully aware of what I was reading and my comprehension on it.\n\nBack to Jurassic Park. My teacher took it away from me, saying it was too scary and too advanced. I went crying to my mom to get the book back. My mom happily complied and told this teacher to never take anything away from me again, especially a book. \n\nMy mom hated this teacher. There were battles over me almost weekly. The teacher thought I should be special ed. My mom knew I was delayed, but very capable of catching up. I proved this is grades 4 onwards, when my grades went from D’s and C’s and into high B’s to A’s. Some kids just take longer. I, in the end, mostly taught myself. Once I learned how to read (also, mostly self taught), I was fine on my own.",
        "time": "2023-10-28 21:55:25 UTC",
        "score": 2,
        "link_id": "t3_17ifsxo",
        "parent_id": "t3_17ifsxo"
    },
    {
        "comment_id": "jvt20an",
        "subreddit": "books",
        "body": "I got 1/2 way through it, and couldn’t make myself read anymore. I just didn’t like it.",
        "time": "2023-08-12 00:12:36 UTC",
        "score": 3,
        "link_id": "t3_15oo9s9",
        "parent_id": "t1_jvsz9v6"
    },
    {
        "comment_id": "jpxj7a7",
        "subreddit": "books",
        "body": "It was everywhere. 🙁. I remember on the train into work, everyone had a copy. I thought I had entered the twilight zone and new rule was ‘what is bad is good, and good bad.’",
        "time": "2023-06-29 00:27:50 UTC",
        "score": 5,
        "link_id": "t3_14lks3e",
        "parent_id": "t1_jpxfdw6"
    },
    {
        "comment_id": "jpxaduy",
        "subreddit": "books",
        "body": "Fifty Shades of Grey.\n\nIt was just so badly written. I couldn’t handle the run on sentences, the lack of grammar, the basic language skills. I read one chapter, and never looked at it again.",
        "time": "2023-06-28 23:24:12 UTC",
        "score": 14,
        "link_id": "t3_14lks3e",
        "parent_id": "t3_14lks3e"
    },
    {
        "comment_id": "jk75g7n",
        "subreddit": "books",
        "body": "Yeah. I’ve read some terrible books, self published and professional too. I’ve given up on quite a few books because of poor grammar alone. \n\nIf the writing is too jarring, and I’m paying more attention to grammar, sentence structure, and syntax; than the story is no longer enjoyable for me. I give it a grace period, of 50-70 pages. If it hasn’t caught my attention at this point, then it’s on to the next TBR book. Even books with an interesting story, I’ve given up on if the grammar is not up to snuff.",
        "time": "2023-05-15 03:39:07 UTC",
        "score": 3,
        "link_id": "t3_13hpzeg",
        "parent_id": "t3_13hpzeg"
    },
    {
        "comment_id": "jdsy3oo",
        "subreddit": "books",
        "body": "Yes. Agreed. Slow burn creepy. I read it 3 years ago, and I still flash back to it,",
        "time": "2023-03-26 23:06:15 UTC",
        "score": 11,
        "link_id": "t3_122qvgc",
        "parent_id": "t1_jds3bm5"
    }
]