[
    {
        "comment_id": "ltkzcr7",
        "subreddit": "books",
        "body": "This is why the \"AI art is theft\" is such a self defeating argument.\n\nYou're arguing that AI technology should be tied to copyright, to some kind of training right, and all that does is allow the big corporations to monopolize it.",
        "time": "2024-10-24 21:31:56 UTC",
        "score": -16,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_ltjktid"
    },
    {
        "comment_id": "ltkypkw",
        "subreddit": "books",
        "body": "It's already been a thing.\n\nhttps://www.business-standard.com/world-news/ai-tools-fake-songs-and-10m-fraud-us-musician-indicted-for-royalty-scam-124090600274_1.html\n\nGuy doing it got arrested for fraud.",
        "time": "2024-10-24 21:28:31 UTC",
        "score": 1,
        "link_id": "t3_1gb7yis",
        "parent_id": "t1_ltkk57r"
    },
    {
        "comment_id": "llcewvt",
        "subreddit": "books",
        "body": "Don't they have some system toon hwere the librarian can be held liable?",
        "time": "2024-09-03 18:26:44 UTC",
        "score": 1,
        "link_id": "t3_1f8062w",
        "parent_id": "t1_llbwxqs"
    },
    {
        "comment_id": "lk8mk9v",
        "subreddit": "books",
        "body": ">In a new world run by Topos, Inc., the United States of America only exists as a fading memory. On the path to utopia, the pillars of culture—religion, art, history, and science—have been decimated. The past is dead, and Topos killed it.\n\n>Sixteen-year-old Ember remembers the day her parents were taken by Topos seven years ago. The only possession she has from them is a leather notebook containing the history of the world—contraband that could send her straight to Sleep Camp. When Ember is selected to serve on Topos’s task force to reduce underage extremism, she has one chance to start a new life, but it may cost her everything.\n\n>Seventeen-year-old Sky has run away to a town of savage Holdouts who refuse to live under the rule of Topos—and who might be able to tell him if his whole life has been a lie. As the Holdouts slowly but surely win Sky over, he must decide what “true” really means, and if the truth even matters in a world ruled by an absolute power.\n\n>As they carry their secrets, Ember and Sky become unintended accomplices to a secret society plotting to overthrow Topos. And when they find themselves on the wrong side of the most powerful corporation on earth, they have two options: beat them or join them.",
        "time": "2024-08-27 21:15:05 UTC",
        "score": 3,
        "link_id": "t3_1f1z9w5",
        "parent_id": "t1_lk2ve5r"
    }
]