[
    {
        "comment_id": "lxrh9o8",
        "subreddit": "books",
        "body": "Hate it. Total cop out. It retrospectively ruins the entire series and makes it un-re-readable.\n\n\nIn the middle of a series, as an AU, it can be fun. A \"what if\" plot.",
        "time": "2024-11-18 14:53:30 UTC",
        "score": 2,
        "link_id": "t3_1gtstm8",
        "parent_id": "t3_1gtstm8"
    },
    {
        "comment_id": "lvwv9t6",
        "subreddit": "books",
        "body": "I'm not sure. The more I read, the more it feels like like the MR label is fluid and subjective. The story you describe certainly sounds like it could fit into magical realism or possibly fabulism.\n\nMy hunch is that readers can interpret anything as symbolic/metaphoric/allegorical, so that can never be ruled out, as long as it's in *addition* to literal magic.\n\n  \nEdit to add: What was the name of the story/author? I'd like to read it.",
        "time": "2024-11-07 15:46:01 UTC",
        "score": 1,
        "link_id": "t3_1gioxz1",
        "parent_id": "t1_lvukfjw"
    },
    {
        "comment_id": "lv7w3lb",
        "subreddit": "books",
        "body": "This is also my understanding. I know a big influence in conversations around it was Chicano author/professor Luis Leal, and he made a big point of distinguishing works with fantastical elements by how they relate those to reality.\n\nFantasy creates an alternate reality, an escape from reality. Even in contemporary settings like Harry Potter and Dresden Files, it's not our world, it's \"a world like ours, but with magic!\"\n\nSurrealism, which is where I'd place Kafka, depicts regular reality with impossibly weird things added, *but* the impossible things are intrusions into our reality, not part of it. They jar readers & characters, essentially *breaking* reality as we know it. \"What if a guy woke and was a bug?\"\n\nIn Magical Realism, the setting is our reality, because it's realism, and the magical elements are a normal part of it. You can see this in A Very Old Man With Enormous Wings, or The Handsomest Drowned Man in the world. They're not symbols or metaphors or speculations, they're just a mundane part of the mystery that is life.\n\n  \nI think this is obviously a simplification, and there's lots of valid perspectives. And I think ideas have certainly evolved since Leal wrote in the late 60s. There's a great essay collection called \"Magical Realism: Theory, History, Community\" that deals with some (although IIRC it's from the 90s, so I'm sure there's newer writing since).",
        "time": "2024-11-03 18:33:52 UTC",
        "score": 26,
        "link_id": "t3_1gioxz1",
        "parent_id": "t1_lv6ti9z"
    },
    {
        "comment_id": "lunagm4",
        "subreddit": "books",
        "body": "Writing a lot more content than you actually use is a pretty typical process for fiction writing.\n\nMost writers don't just type the story like they're taking dictation from beyond. They have to try things to create the materials, and then hold the materials together to see which ones fit.",
        "time": "2024-10-31 04:13:50 UTC",
        "score": 11,
        "link_id": "t3_1gg0dmp",
        "parent_id": "t1_lum2q77"
    },
    {
        "comment_id": "ltxmmzt",
        "subreddit": "books",
        "body": "As a teenager, I genuinely loved Jane Austen, and considered Jane Eyre my favorite novel.\n\nAs an adult, I reread Jane Eyre and absolutely loathed it. Jane still held up as  heroine, but I really disliked the rest of the novel, and I despise Mr. Rochester with indescribable fervor.\n\nBut Jane Austen just gets better and better with rereads.\n\nI've only read Wuthering Heights once. I liked it a lot, but have no clue how it will hold up.",
        "time": "2024-10-27 00:08:58 UTC",
        "score": 4,
        "link_id": "t3_1gcxr25",
        "parent_id": "t3_1gcxr25"
    },
    {
        "comment_id": "lsacueu",
        "subreddit": "books",
        "body": "Books I want to re-read/consult often are the most accessible. Books I'm hanging onto out of nostalgia or for once-in-a-blue moon reading are the most stored away.",
        "time": "2024-10-17 00:11:08 UTC",
        "score": 1,
        "link_id": "t3_1g4yf39",
        "parent_id": "t3_1g4yf39"
    },
    {
        "comment_id": "lrv57ds",
        "subreddit": "books",
        "body": "I get most books from the library, so it really isn't a big deal if I gamble on it and don't love it. I try anything that seems interesting.\n\nThe only time I buy books is if I've already read & loved it, or can't get it at the library or don't want to wait.",
        "time": "2024-10-14 12:16:49 UTC",
        "score": 12,
        "link_id": "t3_1g3dlr4",
        "parent_id": "t3_1g3dlr4"
    },
    {
        "comment_id": "lr6b59n",
        "subreddit": "books",
        "body": "Facts. My grandma used to get a ton & then give them out as Christmas throw-ins. I did not read them & I seriously doubt anyone else did.",
        "time": "2024-10-09 23:55:06 UTC",
        "score": 17,
        "link_id": "t3_1g04ng6",
        "parent_id": "t1_lr69usx"
    },
    {
        "comment_id": "lr5bzmg",
        "subreddit": "books",
        "body": "I don't see how. He's not emotionally unavailable. He might seem reserved by 21st century standards, but that was considered proper at the time. His minor rudeness in the beginning exists so Elizabeth has cause to dislike and refuse him.\n\nThe real fantasy is that someone who's the whole package - intelligent, virtuous, handsome, and rich - will fall for an ordinary, relatable woman, because that will solve all her problems. But the refusal is also part of the fantasy. It protects her from having to be shallow or mercenary. Initially refusing him lets her be noble, and ruled by integrity. She gets to have her cake & eat it too.\n\nBut also... I would not charactererize the story as a conflicted courtship (they're not courting) or full of sexual tension (in the movies, sure, but the book?). And I would say a major point of the later revelations is establishing their compatibility.\n\n*Edit: I do agree that Darcy changes, but mostly in regards to his pride and how he sees his \"social inferiors.\" I don't think he was ever emotionally unavailable. What we know of his close relationship with his sister, his friendship with Bingley, and Wickham's comment that he can be agreeable among those he considers equal, really suggest that he was always emotionally open among those he was actually intimate with. He just didn't perform friendliness for casual acquaintances and strangers.*",
        "time": "2024-10-09 20:29:12 UTC",
        "score": 14,
        "link_id": "t3_1fzz7wt",
        "parent_id": "t3_1fzz7wt"
    },
    {
        "comment_id": "loty1lo",
        "subreddit": "books",
        "body": "I read Carrie around 11 or 12. Also when I started reading romance novels. My parents didn't have a problem with either. My mom gave & recommended some romance novels.\n\nYA wasn't nearly as big then as it is now. The teen options were closer to middle grade, and the biggest series were also horror-thriller (Fear Street, Christopher Pike, V.C. Andrews). Once you were literate enough to follow adult books reading-level-wise, it was normal to start reading them.",
        "time": "2024-09-25 10:03:45 UTC",
        "score": 5,
        "link_id": "t3_1fozps4",
        "parent_id": "t3_1fozps4"
    },
    {
        "comment_id": "looeika",
        "subreddit": "books",
        "body": "What retellings have you liked?\n\nI haven't read/ seen these, so I can't really comment on specifics. But big change is baked into the premise of retellings. If you just  you want the characters to just \"be\" what they are in the original, I would avoid them.\n\nReimagining a villain as a someone human and tragic shaped by and responding to circumstance doesn't sound uninteresting, but execution would matter.\n\nOn the opposite end, other retellings reimagine helpless heroines as more empowered. These can be appealing, but they do weaken the stakes of the story. Cinderella as a helpless teenager trapped in an abusive home and learning to defy her abuser feels much more powerful than Cinderella deciding to stay in a bad situation she could leave out of nostalgia and loyalty.",
        "time": "2024-09-24 12:04:15 UTC",
        "score": 8,
        "link_id": "t3_1fo9993",
        "parent_id": "t3_1fo9993"
    },
    {
        "comment_id": "lo6pl43",
        "subreddit": "books",
        "body": "That's not even an adult book, it's YA/ (which really shows how ridiculous her argument is).",
        "time": "2024-09-21 10:02:05 UTC",
        "score": 1,
        "link_id": "t3_1flz3xx",
        "parent_id": "t1_lo6ndd2"
    },
    {
        "comment_id": "ldn9442",
        "subreddit": "books",
        "body": "What a bizarre false dichotomy.\n\nPhysical and digital materials can both last or be damaged beyond salvage depending on the conditions.\n\nIn general, physical books will outlast physical electronics, but the digital accounts being accessed by the electronics are more resilient than the physical books. My parents' books have outlasted my first laptop, but if my home were to catch fire or be flooded, I'd lose most of my physical collection, while my digital library could be recovered by logging in on a new device. Given how new the technology is, there's no telling how long a digital collection can last this way, but the totally neglected kindle in your example is more analogous to a bookshelf than a book.\n\nBut you want to talk about more ideal scenarios:\n\nFor a book to last 1000 years, it generally needs to be sequestered in ideal conditions - ie dry, sanitary, dark - and not be handled (or read) much. 100 years is much more manageable, but still, even books that are only 50 years old are noticeably more fragile and brittle than other books, especially if they're actually being read by multiple generations.\n\nThis is why the main way to preserve a text is to copy it. Historically, this meant scholars physically rewriting it by hand (which is why the oldest copies of ancient texts are often dated thousands of years after their original composition). In modern times, this usually means printing more copies. The existence of digital copies - not just on specific brandname e-readers, but also in widely accessible formats (like project Gutenberg) - is a massive improvement that both safeguards and expedites this process.\n\nIf longevity is your priority, having a combination of both is obviously the best.",
        "time": "2024-07-17 18:01:05 UTC",
        "score": 13,
        "link_id": "t3_1e5k5cx",
        "parent_id": "t3_1e5k5cx"
    },
    {
        "comment_id": "lboaaby",
        "subreddit": "books",
        "body": "[ Removed by Reddit ]",
        "time": "2024-07-05 00:12:20 UTC",
        "score": 3,
        "link_id": "t3_1dv8esv",
        "parent_id": "t1_lblq6tt"
    },
    {
        "comment_id": "lbo9txt",
        "subreddit": "books",
        "body": "Mostly just hoping that if I die bloody, it's the end and not the beginning of a myriad where I'm pressed into postmortem service to a neo-feudal empire of corrupt necromancers.\n\nBut I'm surrounded by hot lesbians with swords and superpowers, so I've got that going for me.",
        "time": "2024-07-05 00:08:56 UTC",
        "score": 1,
        "link_id": "t3_1dv8esv",
        "parent_id": "t3_1dv8esv"
    },
    {
        "comment_id": "l4v84sr",
        "subreddit": "books",
        "body": "Not OP, but I think they're talking about when there's not supposed to be an unreliable narrator, and may not be any character narrating at all, but you still feel like the author is lying to you. Like, instead of being swept into the story, you feel like someone's trying to sell you something you don't buy.",
        "time": "2024-05-20 12:37:15 UTC",
        "score": 13,
        "link_id": "t3_1cw6ujc",
        "parent_id": "t1_l4u1rtc"
    },
    {
        "comment_id": "l3iqu1q",
        "subreddit": "books",
        "body": "I think it totally depends on the work. There's a lot of times when that's true for me, but there's others where I'm glad I didn't know anything because I got so much joy out of revelations because I spebt so much time not knowing things for sure. Spoilers would've ruined some things for me.",
        "time": "2024-05-11 02:03:57 UTC",
        "score": 6,
        "link_id": "t3_1cp2c4s",
        "parent_id": "t1_l3icrvi"
    },
    {
        "comment_id": "l1kjz9v",
        "subreddit": "books",
        "body": "Tyrion.\n\nHe's awkward, but not actually out of shape. (In the book, he does acrobatics when he first meets Jon). He managed to kill a mountain tribesman when they were attacked. Plus he's been in a couple battles and has a killer instinct strong enough to waste his girlfriend and dad.\n\nWhereas Johnny... well, he might kill a guy who nearly kills his friend, but he's pretty guileless. I bet even if he had a gun, Tyrion could sweet-talk him into handing it over.",
        "time": "2024-04-27 23:41:40 UTC",
        "score": 6,
        "link_id": "t3_1cej3q4",
        "parent_id": "t1_l1khhhh"
    },
    {
        "comment_id": "l1kh6hr",
        "subreddit": "books",
        "body": "Stay gold, Lannister.",
        "time": "2024-04-27 23:21:34 UTC",
        "score": 16,
        "link_id": "t3_1cej3q4",
        "parent_id": "t1_l1j1jbl"
    },
    {
        "comment_id": "kxu42ea",
        "subreddit": "books",
        "body": "Harrow the Ninth. Like all the series, it's great to re-read, but the tension and delight of that first time was so wonderful.",
        "time": "2024-04-03 11:09:43 UTC",
        "score": 1,
        "link_id": "t3_1bugdv0",
        "parent_id": "t3_1bugdv0"
    },
    {
        "comment_id": "kxq49cq",
        "subreddit": "books",
        "body": "A lot of people are talking about how sexual mores changed, but it's also about how literature has changed. The shift in focus from upper classes to ordinary people and from promoting ideal behavior to depicting realistic lives are also factors.",
        "time": "2024-04-02 17:17:47 UTC",
        "score": 2,
        "link_id": "t3_1btydvg",
        "parent_id": "t3_1btydvg"
    },
    {
        "comment_id": "kuu9h2x",
        "subreddit": "books",
        "body": "Unless you're trying to get points for a school/library sponsored reading program, the number of books doesn't really matter. You can keep track of individual books or series or pages or words or hours spent with the text. Or you can just not track anything at all.\n\nBut your sister is right. Your reasoning is bizarre. A book is a book. Sharing a setting doesn't magically make several books become one.\n\n>you count that as 10 books???\n\nReally? People counting each book as a book merits triple question marks to you?\n\nIf you want to count series instead of books, that's fine, but how are you this intensely baffled by the most straightforward way of counting? Would you also eat a whole pizza then count it as one slice?",
        "time": "2024-03-14 14:37:14 UTC",
        "score": 3,
        "link_id": "t3_1belpd1",
        "parent_id": "t3_1belpd1"
    },
    {
        "comment_id": "kbwcyih",
        "subreddit": "books",
        "body": "Can anyone recommend me a dictionary or collection of rare, obscure, archaic, or literary words? I've found many online by chance, but I'd rather have a physical book I can browse.\n\n(I already have Webster's dictionary & thesaurus, but it's insufficient -many cool words I've read lately just aren't in it.)",
        "time": "2023-12-04 01:53:46 UTC",
        "score": 2,
        "link_id": "t3_18895q3",
        "parent_id": "t3_18895q3"
    },
    {
        "comment_id": "j6y1gda",
        "subreddit": "books",
        "body": "I never thought of that, but it makes sense.  My grandparents had shelves of them because they liked the idea of being familiar with the classics, but didn't actually want to spend a lot of time reading things that were archaic or dull. So I always just assumed that's what they were for.",
        "time": "2023-02-02 18:22:04 UTC",
        "score": 3,
        "link_id": "t3_10rd79c",
        "parent_id": "t1_j6wqctt"
    },
    {
        "comment_id": "j6xzs0r",
        "subreddit": "books",
        "body": "I find keeping a book journal very helpful. I stopped doing this for a few years, but recently started again.  It's not just about having the notes (though rereading an old book journal is definitely a trip).  The physical act of writing it down seems to make my impressions of a book stick better.",
        "time": "2023-02-02 18:11:40 UTC",
        "score": 2,
        "link_id": "t3_10rlf2s",
        "parent_id": "t3_10rlf2s"
    },
    {
        "comment_id": "j63qzqg",
        "subreddit": "books",
        "body": "Yep, I still remember getting Ella Enchanted at one of those.",
        "time": "2023-01-27 14:37:39 UTC",
        "score": 26,
        "link_id": "t3_10mkj5i",
        "parent_id": "t3_10mkj5i"
    }
]