[
    {
        "comment_id": "lul0xz5",
        "subreddit": "books",
        "body": "I would start with early readers and leveled books. They can be found online or in any bookstore. \nI would start with really short ones and sit with him and have him read. I would create a reward chart with him so that if he reads, let’s say five really short books by the end of the week, he gets a reward (reward will depend on what you have the ability to provide/what he likes). \nAs he improves, I would make the books longer. Once the books are longer, he doesn’t have to finish them in one day but maybe read a page or two a day. \n\nGreat skills to work on are segmenting words, blending words and working on recognizing sight words without having to segment and then blend them (lots of videos on YouTube you can check out for each skill and how to prompt/grow it). \n\nI would recommend the school evaluate him for dyslexia as that could be one of the reasons why he is avoidant of reading independently.",
        "time": "2024-10-30 20:32:23 UTC",
        "score": 1,
        "link_id": "t3_1gecyaq",
        "parent_id": "t3_1gecyaq"
    },
    {
        "comment_id": "lmgj5ur",
        "subreddit": "books",
        "body": "I could not agree more!!! I felt like I missed something when I was done and felt completely disappointed. So I appreciate this review. \n\nI could have looked past the writing and characters if the plot twist was actually any good. But it was all around bad and honestly didn’t make sense. The last fourth of the book was so disconnected from the rest of the plot and events it was confusing and didn’t make sense.",
        "time": "2024-09-10 16:19:45 UTC",
        "score": 2,
        "link_id": "t3_1fdg1il",
        "parent_id": "t3_1fdg1il"
    },
    {
        "comment_id": "lbwrfs1",
        "subreddit": "books",
        "body": "Came to say exactly this. It’s not worth it to spend time reading a book I don’t enjoy.",
        "time": "2024-07-06 16:07:37 UTC",
        "score": 3,
        "link_id": "t3_1dwpthl",
        "parent_id": "t1_lbw5ome"
    },
    {
        "comment_id": "l8nwea6",
        "subreddit": "books",
        "body": "100% agree. I was reading the Maze Runner and loved the first book. I forced myself to read through the second book completely even though I hated it. But at the end of the second book, I complete dropped the series and sold the books even the first one which I did enjoy.",
        "time": "2024-06-15 00:45:59 UTC",
        "score": 13,
        "link_id": "t3_1dfslno",
        "parent_id": "t1_l8ldg8m"
    },
    {
        "comment_id": "l7iev69",
        "subreddit": "books",
        "body": "I completely agree. Enjoy the books that you are reading. Once you start wanting to finish all the books, reading feels like a chore rather than a hobby or something fun/relaxing. \n\nBut to add to that, I usually use skimming or other “reading faster” techniques on books that I am not really getting into but want to give a chance and see if they pick up later on. It’s helped me not waste time on books that turn out I won’t like.",
        "time": "2024-06-07 11:09:07 UTC",
        "score": 1,
        "link_id": "t3_1d8cv9a",
        "parent_id": "t1_l75hszt"
    },
    {
        "comment_id": "l6cb6g9",
        "subreddit": "books",
        "body": "I have a Random Picker app that I put all the book titles that I have and let the app choose. If. I can also make wheels for each genre. It helps if I genuinely cannot make a decision.",
        "time": "2024-05-30 16:03:05 UTC",
        "score": 2,
        "link_id": "t3_1d44mcn",
        "parent_id": "t3_1d44mcn"
    },
    {
        "comment_id": "l61186m",
        "subreddit": "books",
        "body": "Same. The books that I check out via Libby will probably be read first and faster than the ones I own. Funny enough I checked out a book yesterday and immediately read three chapters. The book I bought a month ago is still waiting on the shelf… 😅",
        "time": "2024-05-28 14:25:33 UTC",
        "score": 2,
        "link_id": "t3_1d1pu0j",
        "parent_id": "t3_1d1pu0j"
    },
    {
        "comment_id": "l25gb9y",
        "subreddit": "books",
        "body": "Same! It has to be quiet. Even just ambiance or any kind of background noise can be distracting.",
        "time": "2024-05-01 21:10:10 UTC",
        "score": 10,
        "link_id": "t3_1chho25",
        "parent_id": "t1_l22ht3r"
    },
    {
        "comment_id": "l20eqkc",
        "subreddit": "books",
        "body": "Undying the game was my first introduction to Clive Barker too 😄",
        "time": "2024-04-30 22:49:44 UTC",
        "score": 1,
        "link_id": "t3_1cgjrk1",
        "parent_id": "t1_l1wgqe8"
    },
    {
        "comment_id": "kyzk2jc",
        "subreddit": "books",
        "body": "It depends on my level of interest in the book. If I found the book fascinating and want to know more about the thought process (to potentially discover related topics or recommendations of books/movies) then I will read that section. It did also come with age for me as I became a more involved reader as I got older and would sit with a book after finishing it to think about the experience.",
        "time": "2024-04-10 22:00:13 UTC",
        "score": 2,
        "link_id": "t3_1c0ooz1",
        "parent_id": "t3_1c0ooz1"
    },
    {
        "comment_id": "kvc2j5n",
        "subreddit": "books",
        "body": "I don’t look at the author’s name about 85% of the time. I focus on the book’s content and if I find it interesting and worthwhile to read. \nI like the writing style of some authors and will look for their work but that is about it for looking at author’s names.",
        "time": "2024-03-17 21:00:03 UTC",
        "score": 2,
        "link_id": "t3_1bgp1jl",
        "parent_id": "t3_1bgp1jl"
    }
]