[
    {
        "comment_id": "ly4m2fk",
        "subreddit": "books",
        "body": "The problem with this take is there are countless stories about personal ambition without the political critique almost all of them are better than AS. \n\nAnd also her political criticism is garbage.",
        "time": "2024-11-20 17:19:32 UTC",
        "score": 1,
        "link_id": "t3_1gvory4",
        "parent_id": "t1_ly3nrxs"
    },
    {
        "comment_id": "lxl374l",
        "subreddit": "books",
        "body": "College and HS English teachers are literally the only people on earth that preach the value of MLA. Go to the other departments no one else uses it. History department uses Chicago most likely or APA. All the other departments probably use APA. \n\nMLA in text citations are not clear at indicating which source youre referencing. And the bibliography format is all over the place for the different types of sources.",
        "time": "2024-11-17 12:47:22 UTC",
        "score": 5,
        "link_id": "t3_1gsrmqc",
        "parent_id": "t1_lxj92lp"
    },
    {
        "comment_id": "lxhkbnj",
        "subreddit": "books",
        "body": "MLA can get fucked. Completely random and useless.",
        "time": "2024-11-16 20:37:09 UTC",
        "score": 7,
        "link_id": "t3_1gsrmqc",
        "parent_id": "t1_lxgrx1s"
    },
    {
        "comment_id": "lx92ttb",
        "subreddit": "books",
        "body": "> In simple terms, using the Bible and God to gain power over others. This occurred in Europe in the Middle Ages and even today there are quite a number of countries that still follow the ideologies of Christian nationalism. \n\nWhen I read this part and was like yeah. This is still happening I. The USA. Abortion Israel and Immigration being the main issues talked about in the last election speaks to it. \n\nStudies in California show that abortion rates go down when proper sex education is implemented in the schools. If they really cared about limiting abortions they would listen. But it’s not about unborn children it’s about women having sex in a manner the powers that be disapprove of.",
        "time": "2024-11-15 12:14:15 UTC",
        "score": 2,
        "link_id": "t3_1gr3l07",
        "parent_id": "t1_lx2vauq"
    },
    {
        "comment_id": "lwygq3n",
        "subreddit": "books",
        "body": "I’m a man in my 30s. And I know exactly 3 male peers that read regularly. I have all my conversations about books with like 6 women and 1 male. The other 2 men read primarily outside my preferred genres but I will talk to them Occasionally. \n\nMen that read are a rare thing. I do remember seeing my dad read very rarely. But he always had a book on his. Nightstand at least. And to be fair to him his job with IBM required he read technical software manuals for hours on end. So I understand why he didn’t read in his downtime that much when he was working. He reads much more now in retirement.",
        "time": "2024-11-13 18:33:43 UTC",
        "score": 2,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t1_lwupv85"
    },
    {
        "comment_id": "llpibii",
        "subreddit": "books",
        "body": "Well you know what George, the ball is in your fucking court. Write the stories you want us to know. \n\nI watched 5 episodes of the first HoD season and any interest I had (not much) evaporated. So I don’t care about what his particular grievance is. \n\nWesteros is you baby George. If you’re tired of seeing it dismantled by filmmakers then fucking write the stories yourself. WoW will print you money.",
        "time": "2024-09-05 23:07:14 UTC",
        "score": 3,
        "link_id": "t3_1f9g92k",
        "parent_id": "t3_1f9g92k"
    },
    {
        "comment_id": "ll4m9qx",
        "subreddit": "books",
        "body": "Fun Story about how this book impacted my life. \n\n12th grade honors English final exam was a party. The catch was everyone drew a name of a character from a hat and come to the party as that character. The hat contained characters from all books from all 4 years of curriculum at my school. \n\nI drew Jay Gatsby. \n\nSo I provided napkins. Soda. And sent invitations to the class. And then didn’t show up. It was dope.",
        "time": "2024-09-02 10:56:13 UTC",
        "score": 36,
        "link_id": "t3_1f6vzef",
        "parent_id": "t3_1f6vzef"
    },
    {
        "comment_id": "lk03l8c",
        "subreddit": "books",
        "body": "Edward Snowdens autobiography *Permanent Record* helped bring me to his side of the argument. \n\nBefore this point I was on the fence about whose side I was on though I slightly leaned toward the governments stance. But his book made me re think that. I still can see both sides to an extent. But I definitely feel like the government overplayed its hand and whistleblowers should not have to fear execution for holding the government accountable.",
        "time": "2024-08-26 12:21:59 UTC",
        "score": 2,
        "link_id": "t3_1f153pd",
        "parent_id": "t3_1f153pd"
    },
    {
        "comment_id": "libq1tw",
        "subreddit": "books",
        "body": "North Carolina plays a role in every Nick Sparks book I’ve read (maybe 5 of them). 4 of them were set there entirely and the last one was set in NC for about half of it (Safe Haven)",
        "time": "2024-08-15 23:51:48 UTC",
        "score": 3,
        "link_id": "t3_1esv3qj",
        "parent_id": "t3_1esv3qj"
    },
    {
        "comment_id": "li57725",
        "subreddit": "books",
        "body": "Title of your sex tape.",
        "time": "2024-08-14 21:57:58 UTC",
        "score": 3,
        "link_id": "t3_1erjzpw",
        "parent_id": "t1_li1rkks"
    },
    {
        "comment_id": "lfkxptd",
        "subreddit": "books",
        "body": "I wasn’t allowed to read them as a kid. I read them at 24-25 because my wife to be found it unacceptable that I had not consumed any HP material. \n\n\nI read the books and absolutely loved them. They totally lived up to the hype. \n\n\nThe movies fucking sucked in my opinion.",
        "time": "2024-07-30 01:16:29 UTC",
        "score": 1,
        "link_id": "t3_1eeqr58",
        "parent_id": "t3_1eeqr58"
    },
    {
        "comment_id": "lf8ckrc",
        "subreddit": "books",
        "body": "My cats are the bomb. \n\nMy wife is a cat lady.",
        "time": "2024-07-27 19:28:53 UTC",
        "score": 23,
        "link_id": "t3_1edlyq7",
        "parent_id": "t1_lf85r50"
    },
    {
        "comment_id": "lb532ge",
        "subreddit": "books",
        "body": "Requiring that of a teenager is solid evidence of blatant indoctrination",
        "time": "2024-07-01 15:40:32 UTC",
        "score": 1,
        "link_id": "t3_1ds18r0",
        "parent_id": "t1_lb1nvw8"
    },
    {
        "comment_id": "latqd9i",
        "subreddit": "books",
        "body": "Our local library is doing an “adult Bingo” card for summer reading. My wife and I are doing it. We’ll one of the spaces is “post a picture of you with your favorite book” \n\nWell this is the only form of social media I have. And even tho this thread doesn’t have pictures I’m counting it. \n\nMy favorite book and I recently listened to it is: \n\n**A Storm of Swords, by George RR Martin**\n\nEven tho the series is frustratingly unfinished, the series is still without doubt the best writing I’ve ever read. And this book (#3) in particular is the best so far. Followed closely by A Dance with Dragons.",
        "time": "2024-06-29 12:49:40 UTC",
        "score": 2,
        "link_id": "t3_1dchux6",
        "parent_id": "t3_1dchux6"
    },
    {
        "comment_id": "l8f6hto",
        "subreddit": "books",
        "body": "20,000 Leagues Under the Sea. Got me in to the ocean and I never looked back. \n\nRobinson Crusoe",
        "time": "2024-06-13 13:16:45 UTC",
        "score": 9,
        "link_id": "t3_1dew9tf",
        "parent_id": "t3_1dew9tf"
    },
    {
        "comment_id": "l89j8ss",
        "subreddit": "books",
        "body": "What. That’s…not at all what I said. The article says the book banners don’t want “their authority challenged” by this book about book bans. \n\nMy argument that those who fear their authority being challenged probably should have it challenged. \n\nThat’s a quite non-Trump take of this post and article. Are you a little jumpy?",
        "time": "2024-06-12 13:08:34 UTC",
        "score": 4,
        "link_id": "t3_1ddhatz",
        "parent_id": "t1_l89efhn"
    },
    {
        "comment_id": "l85pbk3",
        "subreddit": "books",
        "body": "Authority *should* be tested. Often. If it’s strong it will hold up. \n\nAny man who must say “I AM KING” is no true King.",
        "time": "2024-06-11 19:00:56 UTC",
        "score": 26,
        "link_id": "t3_1ddhatz",
        "parent_id": "t3_1ddhatz"
    },
    {
        "comment_id": "l71ies3",
        "subreddit": "books",
        "body": "Older veterany type men Clive Cussler may fall into this category\n\nA lot of Tom Clancy is pretty male targeted. \n\nAnd a lot of fantasy and sci fi is male targeted. There’s been a rise in female targeted books in this genre especially since about 2010 or so. But a ton of the genre I would consider dude prose.",
        "time": "2024-06-04 09:51:56 UTC",
        "score": 1,
        "link_id": "t3_1d7jotu",
        "parent_id": "t3_1d7jotu"
    },
    {
        "comment_id": "l6kafwz",
        "subreddit": "books",
        "body": "I didn’t like that she’s been trained as an assassin from birth but she is still not in control of her emotions to the extent to which I would expect someone with that background. I did not buy her assassin ness at all except for her physical prowess. She had no stoicism not poker face.",
        "time": "2024-06-01 01:31:07 UTC",
        "score": 8,
        "link_id": "t3_1d4zic4",
        "parent_id": "t3_1d4zic4"
    },
    {
        "comment_id": "l4v17pe",
        "subreddit": "books",
        "body": "New Jolene ain’t shit. Beyoncé knows",
        "time": "2024-05-20 11:38:24 UTC",
        "score": 6,
        "link_id": "t3_1cvrlmg",
        "parent_id": "t1_l4rgzt2"
    },
    {
        "comment_id": "l3q14f7",
        "subreddit": "books",
        "body": "That and people like reading different things. \n\nThis sub sometimes gets super elitist against book tok and some best sellers and that can be discouraging. You don’t read that often but you get a bug and You get a book that is widely recommended. You read it and love it then come here to try and discuss it because your irl friends don’t read only to find this sub absolutely trashes the book you liked. Then you’re like wait a minute this book is a bestseller! Before long you realize Reddit is just snobby sometimes.",
        "time": "2024-05-12 15:41:33 UTC",
        "score": 0,
        "link_id": "t3_1cpy4mv",
        "parent_id": "t1_l3nyzl9"
    },
    {
        "comment_id": "l3k7dmj",
        "subreddit": "books",
        "body": "Also there is kind of an unwritten statute of limitations for spoilers. Books is a bit different I will concede but Particularly popular classics. Like if you haven’t read it yet that’s on you. \n\nAlso many of the popular classics you were supposed to read in High School if you went to American high school.",
        "time": "2024-05-11 11:20:06 UTC",
        "score": 5,
        "link_id": "t3_1cp2c4s",
        "parent_id": "t1_l3i2zgh"
    },
    {
        "comment_id": "l1tvbz8",
        "subreddit": "books",
        "body": "I don’t think this is what you mean. But most of my high school curriculum. \n\nWhen I was about 25. I decided to re read a bunch of the HS curriculum to see if they were better. And I found that most of the books were really good, but then I was 14-18 I just couldn’t appreciate them. \n\nA couple of note are Tale of Two Cities and One Flew Over the Cuckoo’s Nest.",
        "time": "2024-04-29 19:14:57 UTC",
        "score": 1,
        "link_id": "t3_1cg3ztu",
        "parent_id": "t3_1cg3ztu"
    },
    {
        "comment_id": "l1i9yvr",
        "subreddit": "books",
        "body": "My wife who is not a fantasy reader makes fun of this exact thing too. \n\nWe decided it’s all just AI title generators she’ll ask how the book I’m reading is and she’ll go “how is the Blood of the Horn?”",
        "time": "2024-04-27 14:51:30 UTC",
        "score": 1,
        "link_id": "t3_1ce0si4",
        "parent_id": "t3_1ce0si4"
    },
    {
        "comment_id": "l1efab4",
        "subreddit": "books",
        "body": "AH: Arthur Hobbs",
        "time": "2024-04-26 19:51:52 UTC",
        "score": 2,
        "link_id": "t3_1cdhwov",
        "parent_id": "t1_l1cabq5"
    },
    {
        "comment_id": "l0xnuj7",
        "subreddit": "books",
        "body": "Not my cup of tea but I do like some of his. Clive Cussler seem to be very dude books especially for like military or hunter type folks.",
        "time": "2024-04-23 19:26:40 UTC",
        "score": 1,
        "link_id": "t3_1cb4qk9",
        "parent_id": "t3_1cb4qk9"
    },
    {
        "comment_id": "l0qjk4y",
        "subreddit": "books",
        "body": "Netflix originals are pretty bad. They just go for volume. They just pump out a bunch and hope a couple are hits.",
        "time": "2024-04-22 13:13:19 UTC",
        "score": 1,
        "link_id": "t3_1c9yjcr",
        "parent_id": "t1_l0q0rva"
    },
    {
        "comment_id": "kzwgte9",
        "subreddit": "books",
        "body": "Only one I’ll buy is How to throw a Garden Party by Jim Halpert",
        "time": "2024-04-16 22:36:12 UTC",
        "score": 1,
        "link_id": "t3_1c5gica",
        "parent_id": "t1_kzu6pn6"
    },
    {
        "comment_id": "kzf3i1m",
        "subreddit": "books",
        "body": "As an agnostic myself I cannot stand Richard Dawkins. He’s made a religion out of being non religious. He just comes off so condescending. \n\nAs a physics major I’ve read a lot about the heroes of science. Einstein Newton Darwin Bohr Curie. And you can get the same idea of how beautiful nature is without God but in a much more eloquent way.",
        "time": "2024-04-13 18:32:17 UTC",
        "score": 7,
        "link_id": "t3_1c2wztb",
        "parent_id": "t3_1c2wztb"
    },
    {
        "comment_id": "kz8trab",
        "subreddit": "books",
        "body": "I don’t like when fiction based on this reality has details that are way over played. Or the details are poorly researched. \n\nBest example of this is Kya in *Where the Crawdads Sing*. \n\nI have no problem believing that Kya became a fantastic sketch artist and an expert on the marshes. But I do have a hard time believing her formal PhD level expertise in the Latin and stuff. Would I want her to be my tour guide? 100% \n\nThe other issue I had with the book was her poor research of the area. I currently live in what I think is her planned area. I live on Roanoke Island. And based on her use of Greenville, it tracks that she intended the setting to be here or somewhere else on the outer banks. But Asheville as the city makes zero sense. Asheville is 7 hours away and is passed Raleigh. Which should have been the city setting.",
        "time": "2024-04-12 15:17:14 UTC",
        "score": 3,
        "link_id": "t3_1c1wwqz",
        "parent_id": "t3_1c1wwqz"
    },
    {
        "comment_id": "kxu5n4v",
        "subreddit": "books",
        "body": "Never underestimate changing just the periods to be bigger. \n\nIf your paper is long enough you can get some solid mileage.",
        "time": "2024-04-03 11:24:03 UTC",
        "score": 41,
        "link_id": "t3_1bu8e6j",
        "parent_id": "t1_kxrwykx"
    },
    {
        "comment_id": "kxawwj5",
        "subreddit": "books",
        "body": "I’m a fantasy and non fiction reader usually. So I tend to gravitate towards larger volumes. Like 500-2000 pages. But yes your point is valid. 1 per month should still be a fair average. Because i do still enjoy a shorter book sometimes.",
        "time": "2024-03-30 20:36:57 UTC",
        "score": 2,
        "link_id": "t3_1bnmey9",
        "parent_id": "t1_kwmk2pr"
    },
    {
        "comment_id": "kwkr2o5",
        "subreddit": "books",
        "body": "2000 since 2006 is clocking ~111 per year.  Or 1 every 2.5 days. Thats incredible. \n\nI shoot for 1-2 per month. But I’m a working age parent of 2 toddlers. Maybe in retirement I’ll shoot for 1 per week.",
        "time": "2024-03-26 01:03:04 UTC",
        "score": 88,
        "link_id": "t3_1bnmey9",
        "parent_id": "t1_kwjhaaa"
    },
    {
        "comment_id": "kigbzpb",
        "subreddit": "books",
        "body": "My issue with Celaena is her character does not match her backstory at all. \n\nAn assassin trained since childhood would be way more fucked up in several ways than I get in the story. And not scared of a ghost. I was expecting a female Batman. Like a Talia al ghoul type character. But instead it’s basically Katniss Everdeen with a different back story.",
        "time": "2024-01-18 16:28:17 UTC",
        "score": 2,
        "link_id": "t3_199p2lb",
        "parent_id": "t3_199p2lb"
    },
    {
        "comment_id": "khohs36",
        "subreddit": "books",
        "body": "Another vote for Magic tree house",
        "time": "2024-01-13 15:55:07 UTC",
        "score": 2,
        "link_id": "t3_193nk8o",
        "parent_id": "t1_khcje79"
    },
    {
        "comment_id": "kgnfi6e",
        "subreddit": "books",
        "body": "Haha my wife who is not a fantasy reader makes fun of my books and just calls any that I’m reading is “the blood of the horn”. \n\nWe just assume it’s some AI title generator making them all.",
        "time": "2024-01-06 23:04:24 UTC",
        "score": 24,
        "link_id": "t3_1903t4p",
        "parent_id": "t3_1903t4p"
    },
    {
        "comment_id": "kg5l386",
        "subreddit": "books",
        "body": "This is a punching bag in personal finance circles. Trash book. \n\nIf you want to get started with personal finance. I’d start with Psychology of Money. Or the Millionaire Nextdoor \n\nAnd then depending on your debt situation I’d start with Dave Ramsey Guide to Money (if you’re swimming in CC or other high interest debt) or Quit Like a Millionaire (if you have little or no debt (like house. One car type of thing).",
        "time": "2024-01-03 17:53:59 UTC",
        "score": 10,
        "link_id": "t3_18xiw27",
        "parent_id": "t1_kg4i25x"
    }
]