[
    {
        "comment_id": "lu8tzj9",
        "subreddit": "books",
        "body": "My son is 8 and what did is the Dog Man comic books. - the text isn’t too small and it’s genuinely hilarious. I think too much text can be intimidating. We did treasure hunts with short clues (one word and then build up to sentences) to get him into it. Fun games with reading involved - Cards Against Humanity do a family version now and at first we played that a lot.",
        "time": "2024-10-28 21:28:13 UTC",
        "score": 2,
        "link_id": "t3_1gecyaq",
        "parent_id": "t3_1gecyaq"
    },
    {
        "comment_id": "e9elqs3",
        "subreddit": "books",
        "body": "I also can't recommend The Nix enough. All the good bits of the Goldfinch but without the wired ending!",
        "time": "2018-11-10 05:17:59 UTC",
        "score": 1,
        "link_id": "t3_9uyaza",
        "parent_id": "t1_e9elp1e"
    },
    {
        "comment_id": "e9elp1e",
        "subreddit": "books",
        "body": "That's true. I think I just enjoyed the characters so much that I didn't mind! Have you read The Secret History? If you don't like the way The Goldfinch chugs along I wouldn't recommend The Little Friend!",
        "time": "2018-11-10 05:16:50 UTC",
        "score": 1,
        "link_id": "t3_9uyaza",
        "parent_id": "t1_e9cpnag"
    },
    {
        "comment_id": "e9cncll",
        "subreddit": "books",
        "body": "Hi book soulmate! Found your list and added the ones I haven't read to my \"to read\" list. ",
        "time": "2018-11-09 10:46:35 UTC",
        "score": 2,
        "link_id": "t3_9uyaza",
        "parent_id": "t1_e98cg00"
    },
    {
        "comment_id": "e9ckjuo",
        "subreddit": "books",
        "body": "Ha ha. Please don't let me put you off! They are very different books. I have to admit I wasn't a fan of the ending of the Goldfinch, but I was hooked the whole way through. ",
        "time": "2018-11-09 09:25:22 UTC",
        "score": 1,
        "link_id": "t3_9uyaza",
        "parent_id": "t1_e98n89s"
    },
    {
        "comment_id": "e98a6kw",
        "subreddit": "books",
        "body": "I started both 2666 and Infinite Best but gave up! Did you find d them hard-going at first or were you into them straight away?",
        "time": "2018-11-07 15:21:58 UTC",
        "score": 2,
        "link_id": "t3_9uyaza",
        "parent_id": "t1_e9850ye"
    },
    {
        "comment_id": "e989ni1",
        "subreddit": "books",
        "body": "Extremely hard to narrow down but in no particular order...\n\n1. The Nix, Nathan Hill\n2. The Poisonwood Bible, Barbara Kingsolver\n3. Bliss, Peter Carey\n4. Middlesex, Jeffery Eugenides\n5. We Need to Talk About Kevin, Lionel Shriver\n6. The Fingersmith, Sarah Waters\n7. The Goldfinch, Donna Tartt\n8. Ghostwritten, David Mitchell (I love almost everything by this author expect his most recent nonsense - don't bother with Slade House!)\n9. A Fraction of the Whole, Steve Toltz\n10. Freedom, Johnathan Franzen\n\nI'm always looking for recommendations from anyone with similar taste. ",
        "time": "2018-11-07 15:14:36 UTC",
        "score": 9,
        "link_id": "t3_9uyaza",
        "parent_id": "t3_9uyaza"
    }
]