[
    {
        "comment_id": "lxyrca4",
        "subreddit": "books",
        "body": "As an older Gen Z person, I would say even by the 2010s there was a certain stench of “English Teacher who thinks they’re cooler than they actually are” starting to surround the series. Frankly, I think Rowling’s comments just turbocharged/politicized (please don’t jump down my throat on that one) a backlash that was probably always going to happen.",
        "time": "2024-11-19 18:16:29 UTC",
        "score": 2,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxyghgt"
    },
    {
        "comment_id": "lv8hxzk",
        "subreddit": "books",
        "body": "Plus, I’d imagine that with *Apt Pupil* in particular it would be easier to market as part of a compilation than as a stand alone work given the subject matter.",
        "time": "2024-11-03 20:24:02 UTC",
        "score": 7,
        "link_id": "t3_1givvxy",
        "parent_id": "t1_lv8gyqh"
    },
    {
        "comment_id": "ltunb3y",
        "subreddit": "books",
        "body": "Found the Nazi!",
        "time": "2024-10-26 13:57:55 UTC",
        "score": 2,
        "link_id": "t3_1gck6u1",
        "parent_id": "t1_ltumzz3"
    },
    {
        "comment_id": "ltf1qh0",
        "subreddit": "books",
        "body": "People forget that Mark Twain was a “Humorist.” Most of his works have a lot of comedy in them. His memoir of his two week stint in the Confederate Army is a great example of this.",
        "time": "2024-10-23 22:20:56 UTC",
        "score": 3,
        "link_id": "t3_1ga4hun",
        "parent_id": "t3_1ga4hun"
    },
    {
        "comment_id": "lrg420c",
        "subreddit": "books",
        "body": "I’m just going to talk on point one here.\n\nPoverty was, and continues to be, endemic to the American south. Infrastructure in the south was poor in rural areas, and around the time the book takes place is when some states started to address the problem. \n\nI don’t really have the time to get into the whole mess that is the popular conception of the American Civil War, but let it suffice to say it is usually viewed on both sides of the Mason-Dixon Line as the climactic moment of American history",
        "time": "2024-10-11 18:03:19 UTC",
        "score": 11,
        "link_id": "t3_1g1el7m",
        "parent_id": "t3_1g1el7m"
    },
    {
        "comment_id": "lqdi2ht",
        "subreddit": "books",
        "body": "You can find reprints of his work, (especially the more popular ones, ie *Tales of the South Pacific*, *Hawaii*, and *Alaska*) in basically any reasonably sized bookstore right now.",
        "time": "2024-10-04 22:44:58 UTC",
        "score": 3,
        "link_id": "t3_1fvsl9h",
        "parent_id": "t1_lqaj8ps"
    },
    {
        "comment_id": "lqa6mo2",
        "subreddit": "books",
        "body": "I mean, people still know who he is, you go into a bookstore and they’ll probably have at least some of his books in stock. He’s just not as popular when he was alive and actively publishing.",
        "time": "2024-10-04 11:08:55 UTC",
        "score": 5,
        "link_id": "t3_1fvsl9h",
        "parent_id": "t3_1fvsl9h"
    },
    {
        "comment_id": "lhsolmr",
        "subreddit": "books",
        "body": "I would say about an author being scared of being defined by a work they aren’t necessarily proud of, but to each their own.",
        "time": "2024-08-12 19:46:00 UTC",
        "score": 2,
        "link_id": "t3_1eqlzs8",
        "parent_id": "t1_lhshpwe"
    },
    {
        "comment_id": "lg4o6mk",
        "subreddit": "books",
        "body": "I think the first time I noticed the King thing was in 11/22/63 when the radio host is the one guy from It.",
        "time": "2024-08-02 12:22:41 UTC",
        "score": 3,
        "link_id": "t3_1ei2aac",
        "parent_id": "t1_lg4kgjf"
    },
    {
        "comment_id": "lfqclz9",
        "subreddit": "books",
        "body": "Yeah, I’m going to be honest, nominating a book that’s a riff on what’s generally considered “One of the Great American Novels” is an odd choice for a British award.",
        "time": "2024-07-30 23:30:27 UTC",
        "score": 14,
        "link_id": "t3_1efwi2d",
        "parent_id": "t1_lfpesvw"
    },
    {
        "comment_id": "ld2po4j",
        "subreddit": "books",
        "body": "If you’re really worried about the Star Wars book thing, check a local second hand bookstore if you have one, because most of the ones I have I got from those on the cheap. Frankly, if you’re worried about overconsumption in general, hit up second hand book stores.",
        "time": "2024-07-14 01:32:35 UTC",
        "score": 2,
        "link_id": "t3_1e2pycv",
        "parent_id": "t3_1e2pycv"
    },
    {
        "comment_id": "l9ujeol",
        "subreddit": "books",
        "body": "Honestly, as someone who read basically his whole run, the fall of the USSR is when he seemed to have started losing the plot. Basically, the geopolitical situation shifted in a way that made it difficult for him to keep up.",
        "time": "2024-06-23 02:08:55 UTC",
        "score": 8,
        "link_id": "t3_1dm8v6f",
        "parent_id": "t1_l9uha59"
    },
    {
        "comment_id": "l9uiu2b",
        "subreddit": "books",
        "body": "To be fair, after HoO Riordan went back to doing chapter titles.",
        "time": "2024-06-23 02:04:30 UTC",
        "score": 17,
        "link_id": "t3_1dm8v6f",
        "parent_id": "t1_l9u48dc"
    },
    {
        "comment_id": "l7pad5d",
        "subreddit": "books",
        "body": "I’d say Shawshank Redemption, Green Mile, and the Body (Movie adaptation is Stand By Me), also have a good shot of sticking around.",
        "time": "2024-06-08 17:34:17 UTC",
        "score": 3,
        "link_id": "t3_1db4ead",
        "parent_id": "t1_l7om3mh"
    }
]