[
    {
        "comment_id": "lvlfaxw",
        "subreddit": "books",
        "body": "Mostly Dead Things. She was super whiny and i won't spoil the end, but she's irredeemable by then!",
        "time": "2024-11-05 21:45:07 UTC",
        "score": 2,
        "link_id": "t3_1gketck",
        "parent_id": "t3_1gketck"
    },
    {
        "comment_id": "l2bs3mu",
        "subreddit": "books",
        "body": "Wild by Cheryl Strayed has a similar, meditative vibe to it. It's about her going on the Pacific Crest Trail trying to survive and overcome past demons.",
        "time": "2024-05-03 00:20:46 UTC",
        "score": 2,
        "link_id": "t3_13fcvmy",
        "parent_id": "t1_k116gww"
    },
    {
        "comment_id": "l2brzx6",
        "subreddit": "books",
        "body": "I loved the book, but it was so, so depressing.",
        "time": "2024-05-03 00:20:02 UTC",
        "score": 1,
        "link_id": "t3_13fcvmy",
        "parent_id": "t1_kqzbfoo"
    },
    {
        "comment_id": "kityffc",
        "subreddit": "books",
        "body": "His weird sex stuff is in even more recent books from a year or two ago.... The coke wasn't the problem.",
        "time": "2024-01-21 02:27:52 UTC",
        "score": 0,
        "link_id": "t3_vy6jeu",
        "parent_id": "t1_ig0ocs0"
    },
    {
        "comment_id": "khh46dc",
        "subreddit": "books",
        "body": "Demon totally enabled her. It was rough to see her demise.",
        "time": "2024-01-12 04:50:54 UTC",
        "score": 20,
        "link_id": "t3_14ahz0x",
        "parent_id": "t1_jocm4n3"
    },
    {
        "comment_id": "k0lx68l",
        "subreddit": "books",
        "body": " What are you at now for this year?",
        "time": "2023-09-14 21:17:24 UTC",
        "score": 1,
        "link_id": "t3_14db259",
        "parent_id": "t1_joow0hw"
    },
    {
        "comment_id": "k06m7v1",
        "subreddit": "books",
        "body": "Why is a magician taxi driver hard to believe though? They're in Vegas where there are hundreds of shows. Vegas is the prime location for performers and entertainers. Many of the up-and-coming ones have a side job, ex: driving a taxi. If it was some random small city, it'd be hard to buy, but I think it's easily believable.",
        "time": "2023-09-11 23:38:09 UTC",
        "score": 1,
        "link_id": "t3_2j4qsh",
        "parent_id": "t1_cl8sdpp"
    },
    {
        "comment_id": "k06k0ph",
        "subreddit": "books",
        "body": "Maybe, but if you don't like it by that many pages then I doubt it. I was enraptured on each and every page and never felt that it got slow. I wish it was longer!",
        "time": "2023-09-11 23:23:06 UTC",
        "score": 1,
        "link_id": "t3_rl59gq",
        "parent_id": "t1_hpfekm2"
    },
    {
        "comment_id": "jxazzji",
        "subreddit": "books",
        "body": "The scenes with her therapist were funny. I can agree with that. The other parts just made me sad, especially with her viewpoints of Rava.",
        "time": "2023-08-22 18:25:00 UTC",
        "score": 1,
        "link_id": "t3_xba1a6",
        "parent_id": "t1_jwckw0e"
    },
    {
        "comment_id": "jx8ahe7",
        "subreddit": "books",
        "body": "I swear he pronounces the name as \"Lionus\" and it drives me crazy!",
        "time": "2023-08-22 04:05:48 UTC",
        "score": 2,
        "link_id": "t3_q571ko",
        "parent_id": "t1_hg43q26"
    },
    {
        "comment_id": "jx70our",
        "subreddit": "books",
        "body": "Haha, I can see that. Just look at the covers and think of your own story in your head. It'll be better :).",
        "time": "2023-08-21 22:22:45 UTC",
        "score": 2,
        "link_id": "t3_smhfck",
        "parent_id": "t1_jx70duv"
    },
    {
        "comment_id": "jx70k6s",
        "subreddit": "books",
        "body": "Completely agreed! The theme was SO obvious on every single page. I felt hit over the head by it to a point where I became annoyed by the characters themselves. Shut up Arthur! It's so predictable. I had to put it down because I'm sure I can guess what the second half of the book contained.",
        "time": "2023-08-21 22:21:50 UTC",
        "score": 5,
        "link_id": "t3_q571ko",
        "parent_id": "t1_hg461ni"
    },
    {
        "comment_id": "jx6zy97",
        "subreddit": "books",
        "body": "I'd suggest it. I got about halfway through and couldn't do it anymore. It just gets more on the nose as it goes on.",
        "time": "2023-08-21 22:17:42 UTC",
        "score": 2,
        "link_id": "t3_smhfck",
        "parent_id": "t1_jed3c9u"
    },
    {
        "comment_id": "jx6zp1j",
        "subreddit": "books",
        "body": "I can't imagine how a book could be 10x worse lmao. This one was sickeningly preachy, like directly telling me how to feel on every single page. It almost made me turn against the characters.",
        "time": "2023-08-21 22:15:57 UTC",
        "score": 4,
        "link_id": "t3_smhfck",
        "parent_id": "t1_hvx46f9"
    },
    {
        "comment_id": "jx6zhwv",
        "subreddit": "books",
        "body": "That's exactly where I stopped. It was SO preachy and on-the-nose. There were epically long monologues about accepting people and not judging a book by its cover. I think I got the theme in the first 10 pages, and then felt hit over the head by it ever since. I felt like a 5-year-old being read to so I had to put it down. I'm surprised by all the hype it's getting.",
        "time": "2023-08-21 22:14:36 UTC",
        "score": 8,
        "link_id": "t3_smhfck",
        "parent_id": "t1_hx5v5y0"
    },
    {
        "comment_id": "jwck3jq",
        "subreddit": "books",
        "body": "I'm genuinely curious what parts were hilarious?",
        "time": "2023-08-15 22:13:19 UTC",
        "score": 1,
        "link_id": "t3_xba1a6",
        "parent_id": "t1_j0diceh"
    },
    {
        "comment_id": "jwceoeo",
        "subreddit": "books",
        "body": "Agreed in a way. The emphasis was always on her looks because I think it was her own biggest focus and insecurity. I highly doubt she looked as good as she thought. I think she was a little delusional. \n\nIf you want a book where the protagonist isn't effortlessly beautiful, try Eleanor Oliphant is Completely Fine.",
        "time": "2023-08-15 21:38:37 UTC",
        "score": 11,
        "link_id": "t3_zop57f",
        "parent_id": "t1_j0rntr1"
    },
    {
        "comment_id": "jwceee2",
        "subreddit": "books",
        "body": "I appreciated her for being an intriguing, unique, and memorable character. But I never found myself rooting for her. Being around her (while reading) made me depressed. Her pessimism felt like a huge black hole sucking in all the light. I rooted for her to keep hiding until she was able to get real therapy and help herself in a real manner, but she's not someone I'd ever want to run into.",
        "time": "2023-08-15 21:36:52 UTC",
        "score": 2,
        "link_id": "t3_zop57f",
        "parent_id": "t1_j0rbzld"
    },
    {
        "comment_id": "jqxugdu",
        "subreddit": "books",
        "body": "I don't think she was the most popular by any means. Her boss did miss her because she's a great worker not because they're besties. The phone call between them was super awkward, as per Eleanor's usual. \n\nAnd everyone else in the office was simply being polite. The office seems close knit so they're being nice when she returns as they would to anyone else. It's not like they were inviting her out for drinks. Then she says her line about getting back to work, which firmly re-assigns the boundary that Eleanor is there to work and not be social. \n\nThere are multiple times when Eleanor doesn't fit into the new persona she's become either. Raymond mentions he doesn't like her smokey eye makeup, and she agrees. She complains about the shoes she's bought. She says she looks ridiculous multiple times. It seems like the makeover was simply a pitstop on the way to Eleanor figuring out who she truly is. It's not like the makeover changed her, and it's not like she's sticking with it anyways.",
        "time": "2023-07-06 20:56:19 UTC",
        "score": 11,
        "link_id": "t3_13daeo9",
        "parent_id": "t1_jjjiy02"
    }
]