[
    {
        "comment_id": "luuacxw",
        "subreddit": "books",
        "body": "That’s easy: I don’t know nor do I care about how many books I read every year. I read when I can, for the enjoyment and learning of it. Nor do I have any ‘sceptics’ that are hostile to me, because I never reveal my numbers to anyone. Why should anyone care? Reading -at least to me - is not a competition. Maybe you need to find a better suited subreddit for folks with that interest.",
        "time": "2024-11-01 11:31:21 UTC",
        "score": 8,
        "link_id": "t3_1gh2yz6",
        "parent_id": "t3_1gh2yz6"
    },
    {
        "comment_id": "lqa60l8",
        "subreddit": "books",
        "body": "Ah, James Michener. If you have any interest in historical fiction, you really should try him. Usually involves big, generational family history (complete with family trees!) during a specific place , from its beginning to the present. History lessons of a place through the people who went through it. Became famous for writing Tales of the South Pacific, which was turned into a famous musical & movie back in the 40s. He wrote over 40 books, mostly fiction but some non-fiction too. I’ve read a lot by him: my favorites are: Hawaii (my first and many claim as his best), Texas, Chesapeake, Caribbean and Poland. The Novel was interesting because it took you into the book publishing world circa 1991.\nI still have Centennial in my to-read pile.\nEdward Rutherfurd, James Clavell, Herman Wouk, Leon Uris & Ken Follett are writers similar to his writing style as well.",
        "time": "2024-10-04 11:03:23 UTC",
        "score": 14,
        "link_id": "t3_1fvsl9h",
        "parent_id": "t3_1fvsl9h"
    },
    {
        "comment_id": "lpza4kl",
        "subreddit": "books",
        "body": "Michener has been gone for a while now, but his books are thoroughly & extensively researched and include real events, many times maps are included, usually peppered with fictitious and real characters. In the introductions and addendums to his books, many times he cites what’s real, and what’s not. Sometimes even names of towns are fictitious but based on real towns. But if you check his output, he’s written more than 40 books (!), both fiction and non-fiction!!",
        "time": "2024-10-02 14:20:46 UTC",
        "score": 2,
        "link_id": "t3_1ftqs18",
        "parent_id": "t1_lpz6efi"
    },
    {
        "comment_id": "lpue1cd",
        "subreddit": "books",
        "body": "I found an amazing book on my local library’s 25 cent sale shelf years ago!!\n\nIt was Hawaii by James Michener. Literally a historical fiction account of the islands of Hawaii, from its inception to the present (at the time it was written, went up to 1970s).\n\nSuch a great engrossing book! Not only great characters but a history lesson at the same time. It was my first Michener, and still might be my favorite. I went on to read many more of his novels as well (Texas, Caribbean The Novel & Poland are other favorites) Highly recommend!\n\n1000 pages at 25 cents too!",
        "time": "2024-10-01 17:36:58 UTC",
        "score": 4,
        "link_id": "t3_1ftqs18",
        "parent_id": "t3_1ftqs18"
    },
    {
        "comment_id": "lpskoxx",
        "subreddit": "books",
        "body": "I love Mitchell, and honestly? His best that I’ve read so far is his first, Ghostwritten.\nWhat a mind bender of an ending!! I still think about it today. Was underwhelmed by Atlas; was surprised too because it’s known as one of his best. Black swan was good, Number9Dream is good fun as well. Still have Bone clocks, Thousand Suns & Utopia Avenue to get to. Happy exploring!",
        "time": "2024-10-01 10:56:20 UTC",
        "score": 1,
        "link_id": "t3_1ft8w5c",
        "parent_id": "t1_lpqur04"
    },
    {
        "comment_id": "lor40hj",
        "subreddit": "books",
        "body": "lol! Then it’s not just me huh? \nI can assure you Brown is not my surname!",
        "time": "2024-09-24 20:57:08 UTC",
        "score": 2,
        "link_id": "t3_1folvwn",
        "parent_id": "t1_loqxyhb"
    },
    {
        "comment_id": "loqvtmh",
        "subreddit": "books",
        "body": "1984 & Brave New World.\n\nI remember reading one of them in high school, but can’t remember which!!",
        "time": "2024-09-24 20:14:20 UTC",
        "score": 4,
        "link_id": "t3_1folvwn",
        "parent_id": "t3_1folvwn"
    },
    {
        "comment_id": "lnn3keh",
        "subreddit": "books",
        "body": "This really is so sad to see. Not surprised, however. \n\nYet, as a parent of just-graduated college students, I’ve made it a point to tell them that now that they don’t have assigned reading material anymore, they can read at their own pace. I don’t care what it is, just keep reading. Tech manuals, magazines, fiction or non-fiction. I know for me, I started to really enjoy reading more so after school was over.  Commuting to work, downtime on weekends, before going to sleep, etc. \nwe still enjoy going to the local b&N once every month, whether we buy stuff or not. \nI happen to love world classics, science fiction, history & meta-fiction, and hope that joy rubs off on them to always challenge yourself. Not just at new job in the real world, but your reading choices, too. \n\nThat’s the hope, at least. \n\n“Reading is to the mind what exercise is to the body” - Joseph Addison",
        "time": "2024-09-17 21:59:29 UTC",
        "score": 258,
        "link_id": "t3_1fjas77",
        "parent_id": "t3_1fjas77"
    },
    {
        "comment_id": "lmwq23w",
        "subreddit": "books",
        "body": "You simply have to make the time to read.\nIf it matters to you, you make the time.",
        "time": "2024-09-13 10:49:15 UTC",
        "score": 0,
        "link_id": "t3_1ffo5q1",
        "parent_id": "t3_1ffo5q1"
    },
    {
        "comment_id": "ldr3l9z",
        "subreddit": "books",
        "body": "I have to read Leaves again: read it when it first came out, thought it was a real head trip. But that was a long time ago, and the theories suggested here makes me wanna dip into it again, so thanks.\n\nThe other reason is I love both Infinite Jest and Gravity’s Rainbow may well be my favorite book. Jest was my first intro to meta-fiction: it’s definitely Pynchon-inspired for sure: never thought Leaves was cuz I read it before I got into Pynchon. So there’s that.\n\nI’ve mentioned this before but it needs to be repeated: don’t get turned off by the density of Pynchon’s work. There are plenty of tools available to help unlock him, if you’re into that: Pynchon wiki site which covers every novel, Pynchon in public podcast, which are very long and interesting and cover most of his stuff, as well as readers guides/companions to 4 out of 8 of his books. Reading Rainbow with GR companion simultaneously blew my mind - and it could do the same for you as well!",
        "time": "2024-07-18 10:46:46 UTC",
        "score": 2,
        "link_id": "t3_1e5y8mr",
        "parent_id": "t3_1e5y8mr"
    },
    {
        "comment_id": "l7e8qug",
        "subreddit": "books",
        "body": "Actually, this is great news for Barnes and Noble and independent bookstores!",
        "time": "2024-06-06 16:40:50 UTC",
        "score": 1,
        "link_id": "t3_1d9ixyz",
        "parent_id": "t3_1d9ixyz"
    },
    {
        "comment_id": "kjdkz5f",
        "subreddit": "books",
        "body": "Yeah, agree: just finished this last night. Not great, very depressing in some places. Very little glimmers of hope in characters. Somewhat funny but not DFW type of humor. Don’t get the hype of book or author. After this experience don’t think I’d move on to his new one. Frankly glad it was over - too many pages as well.",
        "time": "2024-01-24 17:27:27 UTC",
        "score": 1,
        "link_id": "t3_a6182d",
        "parent_id": "t3_a6182d"
    },
    {
        "comment_id": "kg6stdk",
        "subreddit": "books",
        "body": "1/2 hour to an hour, in my bed, right before I go to sleep. Almost every night like clockwork",
        "time": "2024-01-03 22:00:49 UTC",
        "score": 1,
        "link_id": "t3_18x7j6c",
        "parent_id": "t3_18x7j6c"
    },
    {
        "comment_id": "kfw77i8",
        "subreddit": "books",
        "body": "Started The Nix by Nathan Hill this week. Reviews said if you’re into DFW or Pynchon, then this is for you. Pretty good so far; his new book (Wellness, I believe?) was listed as one of best books of 2023. I started with his first novel instead since it’s in paperback (hate reading hardcovers, will wait for new one when it’s available as pb!)",
        "time": "2024-01-01 22:33:23 UTC",
        "score": 2,
        "link_id": "t3_18vuj6c",
        "parent_id": "t3_18vuj6c"
    },
    {
        "comment_id": "kbm1zwz",
        "subreddit": "books",
        "body": "I have a signed galley copy of David Foster Wallace’s Infinte Jest. Used to work for the company. I’ve seen signed copies on eBay for $500-1000!",
        "time": "2023-12-01 23:01:08 UTC",
        "score": 1,
        "link_id": "t3_1885kb7",
        "parent_id": "t3_1885kb7"
    },
    {
        "comment_id": "k8kolzh",
        "subreddit": "books",
        "body": "372",
        "time": "2023-11-09 23:42:30 UTC",
        "score": 1,
        "link_id": "t3_17q461j",
        "parent_id": "t3_17q461j"
    },
    {
        "comment_id": "k796w1y",
        "subreddit": "books",
        "body": "I’ve said this before and I’ll say it again:\nonce main character escapes the prison, it was all downhill from there. After prison break, COMC becomes very slow and not very interesting. I couldn’t finish it, as a matter of fact.\n\nVery overrated novel IMHO",
        "time": "2023-10-31 17:27:42 UTC",
        "score": 0,
        "link_id": "t3_17kkha8",
        "parent_id": "t3_17kkha8"
    },
    {
        "comment_id": "k4ylwwv",
        "subreddit": "books",
        "body": "I highly suggest reading it from first page to last, in chronological order.\n\nJust kidding!!!  Enjoy - it’s a cool book",
        "time": "2023-10-15 10:40:10 UTC",
        "score": 3,
        "link_id": "t3_178bjln",
        "parent_id": "t3_178bjln"
    },
    {
        "comment_id": "k1wlkj5",
        "subreddit": "books",
        "body": "I read partly to escape the technology love affair the world has with its phones!!",
        "time": "2023-09-23 21:02:55 UTC",
        "score": 1,
        "link_id": "t3_16qdmr4",
        "parent_id": "t3_16qdmr4"
    },
    {
        "comment_id": "jz01kbl",
        "subreddit": "books",
        "body": "Ghostwritten by David Mitchell.\n\nFantastic book IMO, and I read a handful of other books by him, including Cloud Atlas. None of them IMO were as good as his debut. Highly recommend!!",
        "time": "2023-09-03 20:48:52 UTC",
        "score": 1,
        "link_id": "t3_166bs4y",
        "parent_id": "t3_166bs4y"
    },
    {
        "comment_id": "jvme6yd",
        "subreddit": "books",
        "body": "Tried reading Salems Lot when I was 13 or so. \nScared the living crap outta me - couldn’t finish it!",
        "time": "2023-08-10 18:38:39 UTC",
        "score": 2,
        "link_id": "t3_15nigbq",
        "parent_id": "t3_15nigbq"
    },
    {
        "comment_id": "jsbopsf",
        "subreddit": "books",
        "body": "Finished Poland, James Michener\n\nStarted The Water Knife, Paolo Bacigalupi",
        "time": "2023-07-17 14:38:20 UTC",
        "score": 2,
        "link_id": "t3_151xkap",
        "parent_id": "t3_151xkap"
    },
    {
        "comment_id": "jr9fuwm",
        "subreddit": "books",
        "body": "I never understand when folks here ask how they can get into reading if they never have or lost it and want to get back into it. The answer is always the same: find the right book! If one doesn’t do it for you, find another one! There are literally millions to choose from!",
        "time": "2023-07-09 10:38:50 UTC",
        "score": 1,
        "link_id": "t3_14ut346",
        "parent_id": "t3_14ut346"
    },
    {
        "comment_id": "jr0ps2z",
        "subreddit": "books",
        "body": ".",
        "time": "2023-07-07 13:10:45 UTC",
        "score": 1,
        "link_id": "t3_14t236k",
        "parent_id": "t3_14t236k"
    },
    {
        "comment_id": "jqfsb1n",
        "subreddit": "books",
        "body": "In no particular order, off the top of my head\n\nGhostwritten, David Mitchell\nHawaii, my first from James Michener\nMan in the High Castle\nInfinite Jest, DFW\nPortrait of an Artist as a Young Man, JJ\nSnow Crash, Stephenson\nGravity’s Rainbow, Pynchon\nHuckleberry Finn\nEnders Game\nGuns Germs and Steel\nAgony & the Ecstasy",
        "time": "2023-07-02 22:57:08 UTC",
        "score": 3,
        "link_id": "t3_14p0fv1",
        "parent_id": "t3_14p0fv1"
    },
    {
        "comment_id": "jmqarza",
        "subreddit": "books",
        "body": "Slightly???",
        "time": "2023-06-03 11:36:37 UTC",
        "score": 1,
        "link_id": "t3_13ymdrh",
        "parent_id": "t3_13ymdrh"
    },
    {
        "comment_id": "ji6l3lw",
        "subreddit": "books",
        "body": "A world lit only by fire",
        "time": "2023-04-29 13:44:10 UTC",
        "score": 1,
        "link_id": "t3_132j0zp",
        "parent_id": "t3_132j0zp"
    },
    {
        "comment_id": "jbpta03",
        "subreddit": "books",
        "body": "Just because everything is going electronic doesn’t mean we all have to!",
        "time": "2023-03-10 20:02:48 UTC",
        "score": 11,
        "link_id": "t3_11nym19",
        "parent_id": "t3_11nym19"
    },
    {
        "comment_id": "ja5ac33",
        "subreddit": "books",
        "body": "Only read Mitchell’s first 4 books (Ghost, #9, Black Swan & Cloud) and Ghostwritten was by far my favorite as well! Cloud Atlas gets all the buzz, with the movie tie-in too (didn’t see it), but he really nailed with his first novel. About to start Bone Clocks too",
        "time": "2023-02-26 23:10:41 UTC",
        "score": 2,
        "link_id": "t3_11c7io3",
        "parent_id": "t3_11c7io3"
    },
    {
        "comment_id": "j9gc7yn",
        "subreddit": "books",
        "body": "If you have extreme patience, reading GR with Steven Weisenberger’s GR Companion is well worth it!\nHe actually makes this extremely dense novel with multiple subplots comprehensible and enjoyable!\nI did a slow read of both - page by page, chapter by chapter - and it really blew me away! Highly recommended.",
        "time": "2023-02-21 18:56:47 UTC",
        "score": 4,
        "link_id": "t3_1186nid",
        "parent_id": "t3_1186nid"
    },
    {
        "comment_id": "j23l4ip",
        "subreddit": "books",
        "body": "Very cool story! I used to be in publishing sales 20 years ago, when mom and pops were still holding their own against ‘the chains’ of B&N, Borders & Waldenbooks in the malls. It seems now the only chain in town survives by acting like an independent bookstore. So basically we’ve come full circle! Hysterical. The old quote ‘do what you love, the money will follow’ seems appropriate.\n\nI also like to believe that as the article mentioned, even in this highly technological society, nothing beats the overwhelming power of the written word on a physical page. Hope that urge never dies out.",
        "time": "2022-12-29 12:06:26 UTC",
        "score": 2,
        "link_id": "t3_zxo6r5",
        "parent_id": "t3_zxo6r5"
    },
    {
        "comment_id": "j1urc9j",
        "subreddit": "books",
        "body": "Gravity’s Rainbow.\n\nReally - where the hell do u begin explaining it?",
        "time": "2022-12-27 15:37:37 UTC",
        "score": 24,
        "link_id": "t3_zwfwnm",
        "parent_id": "t3_zwfwnm"
    }
]