[
    {
        "comment_id": "lt10ldt",
        "subreddit": "books",
        "body": "Oh yeh that's how we say it! Never knew it was different in the US!",
        "time": "2024-10-21 16:29:46 UTC",
        "score": 1,
        "link_id": "t3_1g72q8z",
        "parent_id": "t1_lsomw8z"
    },
    {
        "comment_id": "lp73ct8",
        "subreddit": "books",
        "body": "Oh haha this is great! I don't know the answer as mine was an audiobook!",
        "time": "2024-09-27 15:18:50 UTC",
        "score": 2,
        "link_id": "t3_1fqoqa3",
        "parent_id": "t3_1fqoqa3"
    },
    {
        "comment_id": "llcibwu",
        "subreddit": "books",
        "body": "Yes. When characters are upset or angry or wronged and they deliver their parting blow in a perfect monologue with a killer final line. Especially if the other character listens with no interruption and then sees the error of their ways. Perhaps I'm just jealous that I can't do this in real life haha",
        "time": "2024-09-03 18:45:00 UTC",
        "score": 1,
        "link_id": "t3_1f84x6p",
        "parent_id": "t3_1f84x6p"
    },
    {
        "comment_id": "li78m0a",
        "subreddit": "books",
        "body": "Yeh it was meant to make you eye roll in the context of the character (who I found quite funny too)",
        "time": "2024-08-15 06:30:22 UTC",
        "score": 8,
        "link_id": "t3_1esj9ue",
        "parent_id": "t1_li74at4"
    },
    {
        "comment_id": "lfm6g6i",
        "subreddit": "books",
        "body": "What a perfect comment! You make me want to reread it again",
        "time": "2024-07-30 07:27:12 UTC",
        "score": 43,
        "link_id": "t3_1efjwp5",
        "parent_id": "t1_lflts3r"
    },
    {
        "comment_id": "ksx2x9n",
        "subreddit": "books",
        "body": "While I'm reading in bed and my eyes are closing because I'm so tired, I imagine or dream the next words on the page. It's always slightly word salad-y and doesn't fit the context of the book though!",
        "time": "2024-03-01 22:20:15 UTC",
        "score": 3,
        "link_id": "t3_1b42lqx",
        "parent_id": "t3_1b42lqx"
    },
    {
        "comment_id": "krcwu2l",
        "subreddit": "books",
        "body": "My dad bought this book and I found it on the shelf when I was I think somewhere between 16 and 18. I'd never read anything like it before and it really stuck with me. Recently re read and had forgotten so many cool details,  I cam see why it was an award winner!",
        "time": "2024-02-20 22:05:12 UTC",
        "score": 2,
        "link_id": "t3_1avoazl",
        "parent_id": "t3_1avoazl"
    },
    {
        "comment_id": "ki5qfjf",
        "subreddit": "books",
        "body": "I'm someone who usually sets a 100 book target per year on goodreads. I got tired of the gamified feeling so I have set a target which I picked up from someone on here- one page a day! \nNow I'm reading every day rather than just audios. I of course don't stick to just one page as once I've picked up my kindle or book it's more like 25+. I can't believe the difference it has made. Of coirse its really achievable even if i have a busy day. Well worth trying!",
        "time": "2024-01-16 18:27:29 UTC",
        "score": 1,
        "link_id": "t3_1984v9s",
        "parent_id": "t3_1984v9s"
    },
    {
        "comment_id": "kd0i3t9",
        "subreddit": "books",
        "body": "I really liked it, but would recommend watching the bbc TV show to help with some of the slower parts!",
        "time": "2023-12-12 08:07:54 UTC",
        "score": 5,
        "link_id": "t3_18gcdeg",
        "parent_id": "t3_18gcdeg"
    },
    {
        "comment_id": "kbq3ea2",
        "subreddit": "books",
        "body": "Brilliant thank you. So many I haven't heard of! Think I've only read 4 on the list so will have to give the others a go!",
        "time": "2023-12-02 20:29:40 UTC",
        "score": 2,
        "link_id": "t3_1898xzz",
        "parent_id": "t3_1898xzz"
    },
    {
        "comment_id": "kacsrwj",
        "subreddit": "books",
        "body": "Kate Atkinson's Brody books. The narrator pronounces his sisters name Niamh as Nee-am not \"Neeve\". Couldn't believe it! Someone should really have caught that.",
        "time": "2023-11-22 21:31:31 UTC",
        "score": 33,
        "link_id": "t3_181j2tp",
        "parent_id": "t3_181j2tp"
    },
    {
        "comment_id": "k9p5c8a",
        "subreddit": "books",
        "body": "Exactly like you,  I wasn't blown away by this book, but was definitely thinking about the premise. I feel like this was just the beginning somehow and that it could really go somewhere!",
        "time": "2023-11-17 23:00:14 UTC",
        "score": 2,
        "link_id": "t3_17xedkt",
        "parent_id": "t1_k9ngwno"
    },
    {
        "comment_id": "jsux4f1",
        "subreddit": "books",
        "body": "Ahh yes this is my pet peeve! It makes me wonder if I speak much quicker than the characters because my conversations don't take the hours theirs do!",
        "time": "2023-07-21 12:34:10 UTC",
        "score": 8,
        "link_id": "t3_155i1os",
        "parent_id": "t1_jsuu34e"
    },
    {
        "comment_id": "j47c6sh",
        "subreddit": "books",
        "body": "Sounds like a very interesting/terrifying situation!!\nCan/did you have a lawyer during questioning? What was going through your mind while it was happening..did you assume you were screwed?!\nWriting a book must have been mind-boggling just to revisit everything that had happened to you!",
        "time": "2023-01-13 17:51:10 UTC",
        "score": 15,
        "link_id": "t3_10azs1e",
        "parent_id": "t3_10azs1e"
    },
    {
        "comment_id": "j3n00zw",
        "subreddit": "books",
        "body": "It's the same book as you chose! I learned so much across many different areas. One of the ones which impacted me was the description of animal farming throughout history, linking current animal farming to capitalism, and had a big hand in turning me vegetarian!",
        "time": "2023-01-09 18:20:14 UTC",
        "score": 4,
        "link_id": "t3_107f3ae",
        "parent_id": "t3_107f3ae"
    },
    {
        "comment_id": "j3e8tc5",
        "subreddit": "books",
        "body": "I've twice left mine under pillows at other people's houses",
        "time": "2023-01-07 23:09:10 UTC",
        "score": 2,
        "link_id": "t3_105vyfl",
        "parent_id": "t3_105vyfl"
    },
    {
        "comment_id": "j2i5wpj",
        "subreddit": "books",
        "body": "Wow this sounds such a cool idea. Sorry I can't help!",
        "time": "2023-01-01 14:35:27 UTC",
        "score": 3,
        "link_id": "t3_100kelz",
        "parent_id": "t3_100kelz"
    },
    {
        "comment_id": "j2dg8wo",
        "subreddit": "books",
        "body": "Im trying to imagine this scenario and i feel like you have done nothing wrong here. I would never ever think badly of someone who shared about their life to me in a group like this (unless it took over most of the session or it was like a bitter rant about someone they knew or something!). I would feel empathy for you and feel honoured you had shared your personal reflections on the book with the group. Rather this than someone boring haha",
        "time": "2022-12-31 12:55:54 UTC",
        "score": 1,
        "link_id": "t3_zzif3q",
        "parent_id": "t3_zzif3q"
    },
    {
        "comment_id": "j258r6f",
        "subreddit": "books",
        "body": "All of Sally Rooney's books 😑",
        "time": "2022-12-29 19:24:40 UTC",
        "score": 57,
        "link_id": "t3_zyd3t2",
        "parent_id": "t3_zyd3t2"
    },
    {
        "comment_id": "j103ga3",
        "subreddit": "books",
        "body": "Thanks so much for this. I used to get the LRB..don't think I knew there were versions for other locations! Appreciate the list :)",
        "time": "2022-12-20 18:17:41 UTC",
        "score": 6,
        "link_id": "t3_zqra1t",
        "parent_id": "t1_j102ph0"
    },
    {
        "comment_id": "j0zzap9",
        "subreddit": "books",
        "body": "Can you recommend anywhere I could find literary criticism? I don't mind a pay wall. I usually look at guardian books at the moment",
        "time": "2022-12-20 17:51:15 UTC",
        "score": 49,
        "link_id": "t3_zqra1t",
        "parent_id": "t1_j0zhddx"
    },
    {
        "comment_id": "j0zgcdq",
        "subreddit": "books",
        "body": "I don't know what my wpm is but I suppose I could check online. I do know I have always been a fast reader, I remember we had reading \"ages\" given at school and mine was always higher than my real age (at least 3 years). One thing that is worth adding is that due to my job I get 6 weeks off work in summer (and a further 6 weeks throught the year in 1 or 2 week blocks) and I often read for most of the afternoon..the number really goes up during the summer! So your calculations don't quite work. The hour a day is for a standard working day..I would have been more accurate if I'd known there would be calculations involved  🙃\nI must admit I am a bit confused by your comment about being \"charitable\" in your comment, the overall tone now sounds quite combative, do you mean it to be? Maybe you genuinely can't believe 100 books is possible or something?",
        "time": "2022-12-20 15:48:11 UTC",
        "score": 4,
        "link_id": "t3_zq9x8b",
        "parent_id": "t1_j0z75ho"
    },
    {
        "comment_id": "j0z1o5v",
        "subreddit": "books",
        "body": "What a lovely comment. I agree.",
        "time": "2022-12-20 13:59:49 UTC",
        "score": 1,
        "link_id": "t3_zq9x8b",
        "parent_id": "t1_j0xeayc"
    },
    {
        "comment_id": "j0yniiw",
        "subreddit": "books",
        "body": "I can't believe there are so many angry comments on here! Naively did not expect that from a book forum. OP I'm not sure but I think you have touched a nerve for some people. Put it down to pre Christmas stress!",
        "time": "2022-12-20 11:38:01 UTC",
        "score": 0,
        "link_id": "t3_zq9x8b",
        "parent_id": "t3_zq9x8b"
    },
    {
        "comment_id": "j0ynai2",
        "subreddit": "books",
        "body": "I honestly don't think this is the case for me. I just read instead of watching TV, I'm not speed reading or anything. I probably read for an hour a day I would think. I usually read a mix of literary fiction, some classics and no  fiction. I find it relaxing, almost like mindfulness sometimes!",
        "time": "2022-12-20 11:35:18 UTC",
        "score": 5,
        "link_id": "t3_zq9x8b",
        "parent_id": "t1_j0xlkuu"
    },
    {
        "comment_id": "j0yn1ux",
        "subreddit": "books",
        "body": "100 books a year is about 2 a week not 2 a day.",
        "time": "2022-12-20 11:32:12 UTC",
        "score": 26,
        "link_id": "t3_zq9x8b",
        "parent_id": "t1_j0xwsfo"
    },
    {
        "comment_id": "j0ymp7r",
        "subreddit": "books",
        "body": "I agree with you! Live and let live. I have a target for 100 books on goodreads. I am a fast reader but to be honest I waste so much time on the internet it could be 150. I do find there are some misunderstandings about having a target number of books to read. For me it's just a really good reminder to read instead of scrolling/vegetating on the sofa! I'm considering making my target 15 next year but reading only classics or so.ething like that. Switching it up a bit.",
        "time": "2022-12-20 11:27:41 UTC",
        "score": 2,
        "link_id": "t3_zq9x8b",
        "parent_id": "t3_zq9x8b"
    },
    {
        "comment_id": "izpotgw",
        "subreddit": "books",
        "body": "Don't get me wrong it's not my fave book and I definitely get why people don't like it! It just gets a lot more hate than many worse books. Interestingly I couldn't get in to John Le Carre. Not yet at least",
        "time": "2022-12-10 22:26:25 UTC",
        "score": 3,
        "link_id": "t3_zhtr8j",
        "parent_id": "t1_izpm62n"
    },
    {
        "comment_id": "izoid6m",
        "subreddit": "books",
        "body": "Interesting. Perhaps it's been a while since I've read them all!",
        "time": "2022-12-10 17:32:13 UTC",
        "score": 9,
        "link_id": "t3_zhtr8j",
        "parent_id": "t1_izoh1or"
    },
    {
        "comment_id": "izohfyt",
        "subreddit": "books",
        "body": "Great point!",
        "time": "2022-12-10 17:26:07 UTC",
        "score": 2,
        "link_id": "t3_zhtr8j",
        "parent_id": "t1_izoh9y3"
    },
    {
        "comment_id": "izo30y0",
        "subreddit": "books",
        "body": "This sounds lovely and actually I said it wouldn't change lives but it's obviously changed yours positively! :) great story!",
        "time": "2022-12-10 15:46:21 UTC",
        "score": 15,
        "link_id": "t3_zhtr8j",
        "parent_id": "t1_izo1pi1"
    },
    {
        "comment_id": "izo0c73",
        "subreddit": "books",
        "body": "Oh and the Da Vinci Code. I think it's snobbery to hate on it without reading it. It's not going to change the world but it's fun and fast paced.",
        "time": "2022-12-10 15:26:40 UTC",
        "score": 257,
        "link_id": "t3_zhtr8j",
        "parent_id": "t3_zhtr8j"
    },
    {
        "comment_id": "izo03uz",
        "subreddit": "books",
        "body": "Narnia! People get very over the top about how religious it is etc.. I always wonder if they have actually read any. Its a good children's series with a couple of excellent books and some symbolism, like a lot of books have. The whole thing about Susan growing up is always overblown based on one line about lipstick too",
        "time": "2022-12-10 15:24:50 UTC",
        "score": 145,
        "link_id": "t3_zhtr8j",
        "parent_id": "t3_zhtr8j"
    },
    {
        "comment_id": "iz0ndi1",
        "subreddit": "books",
        "body": "If you really have to read them, listen to them as audiobooks set to 2x speed",
        "time": "2022-12-05 16:34:21 UTC",
        "score": 5,
        "link_id": "t3_zdb79n",
        "parent_id": "t3_zdb79n"
    }
]