[
    {
        "comment_id": "lwn71su",
        "subreddit": "books",
        "body": "“Serum” thanks to the last book in the Divergent series 😵‍💫 it was on every page like twice, I swear",
        "time": "2024-11-11 21:14:02 UTC",
        "score": 1,
        "link_id": "t3_1gom7rk",
        "parent_id": "t3_1gom7rk"
    },
    {
        "comment_id": "lpfa96r",
        "subreddit": "books",
        "body": "I have LOVED The Great Alone, The Four Winds, The Nighingale, and The Women.\n\nI really liked The Winter Garden but I didn’t care much for the present day stuff. I was there for the fairy tale. \n\nI haven’t read Firefly Lane because I thought the show dragged on too much and didn’t have much going on, plot wise. I still liked it but didn’t feel compelled to read the book. Which main character died in the book? In the TV series it was >!Kate!<. Did they pull a My Sister’s Keeper with the ending?\n\nI read Night Road and hated it 😂\n\nShe is a must read for me now, because she’s found her niche with historical fiction. She writes great relationships and paints a scene really well. Sometimes too well with the outfit descriptions lol. I think why I liked Winter Garden was because the part I liked was basically >!historical fiction!<.",
        "time": "2024-09-29 00:53:39 UTC",
        "score": 2,
        "link_id": "t3_184vpxn",
        "parent_id": "t3_184vpxn"
    },
    {
        "comment_id": "lm60uxv",
        "subreddit": "books",
        "body": "My theory is that most really popular books are contemporary fiction, or romantasy, both of which I dislike already. So it’s not that only bad *books* get popular, it’s that genres I don’t like are popular. I really tend not to like many books set in the present day, unless they really stay away from cell phones and social media and all of that. I want to read a book and not necessarily know when exactly it’s taking place, unless it’s set around a specific time period on purpose, like WWII historical fiction. \n\nSometimes contemporary fiction/chick lit is fine because it is an easy read, but they are not always quick because they don’t pull me in.",
        "time": "2024-09-08 19:52:23 UTC",
        "score": 1,
        "link_id": "t3_1fbyr71",
        "parent_id": "t3_1fbyr71"
    },
    {
        "comment_id": "lkc0dez",
        "subreddit": "books",
        "body": "Or did Trump or any of his team (I say team because I don’t think Trump reads much) steal the slogan for the book, or from, as someone says below, Raegan?",
        "time": "2024-08-28 12:53:12 UTC",
        "score": 3,
        "link_id": "t3_1f2z42j",
        "parent_id": "t1_lkai2dp"
    },
    {
        "comment_id": "lk2iohz",
        "subreddit": "books",
        "body": "Very lame of her. Not mindful or cutesy OR demure!\n\nOther ideas:\n- These Books Are Made for Walkin’\n- A Walk and a Book\n- Book Walk Club\n- Book Club on the Go\n- Book Club on the Move\n- Mobile Book Club\n- Book Club with Shoes\n- Sneakers Book Club\n- Steps and Stories\n- On Track Book Club\n- ABC (Active Book Club)\n- Step Into Reading\n- Reading Race\n- Burn Calories Not Books\n- Books around the Block\n- Read around the Block\n- Turn the Corner Book Club",
        "time": "2024-08-26 20:29:36 UTC",
        "score": 7,
        "link_id": "t3_1f1oz62",
        "parent_id": "t3_1f1oz62"
    },
    {
        "comment_id": "lk2bd03",
        "subreddit": "books",
        "body": "Finished:\n\nBurn, by Peter Heller\n\n- great semi-apocalyptic vibes\n- felt very plausible for fiction, which made it extra scary and suspenseful. Couldn’t put it down. ",
        "time": "2024-08-26 19:50:59 UTC",
        "score": 4,
        "link_id": "t3_1f1kfjy",
        "parent_id": "t3_1f1kfjy"
    },
    {
        "comment_id": "lg7gc0z",
        "subreddit": "books",
        "body": "Counts for me! 😂",
        "time": "2024-08-02 21:36:03 UTC",
        "score": 5,
        "link_id": "t3_1ei8qzc",
        "parent_id": "t1_lg74p7k"
    },
    {
        "comment_id": "lg6yxub",
        "subreddit": "books",
        "body": "I get a laugh out of thinking of shows like Downton Abbey and what their life would be like if they had cell phones and could communicate instantaneously. They were just getting landlines toward the beginning",
        "time": "2024-08-02 19:59:58 UTC",
        "score": 2,
        "link_id": "t3_1ei8qzc",
        "parent_id": "t1_lg6xqvp"
    },
    {
        "comment_id": "lg6xcfy",
        "subreddit": "books",
        "body": "A big part of why I don’t dig a lot of contemporary fiction is the presence of technology. I don’t really want to read text messages between characters. I don’t want to envision someone scrolling through their phone. I do those things! They’re not exciting and don’t allow me to escape from real life. ",
        "time": "2024-08-02 19:51:23 UTC",
        "score": 0,
        "link_id": "t3_1ei8qzc",
        "parent_id": "t1_lg51vcy"
    },
    {
        "comment_id": "lg6wzd5",
        "subreddit": "books",
        "body": "I recently learned on the Office Ladies podcast, of all places, that a lot of utility providers are silently switching people’s copper landlines (aka Plain Old Telephone Service or POTS, which don’t need power) to use the broadband or fiber cables instead, I guess so they don’t have to maintain the copper lines anymore. Jenna Fischer (actress, co-host of podcast) said she called her provider and made them switch it back, because she wants it for emergencies. 911 can tell where you are calling from on a landline even if your power is out, but only if on a copper line. They are becoming a thing of the past. If anyone has a landline for emergencies, look into this!",
        "time": "2024-08-02 19:49:27 UTC",
        "score": 1,
        "link_id": "t3_1ei8qzc",
        "parent_id": "t3_1ei8qzc"
    },
    {
        "comment_id": "l694zif",
        "subreddit": "books",
        "body": "Ahh, Sand was a spinoff I guess. I read them all a long time ago. I can member remember the right order of the original trilogy either 😂",
        "time": "2024-05-30 00:03:38 UTC",
        "score": 1,
        "link_id": "t3_1d3fy7r",
        "parent_id": "t1_l67yty5"
    },
    {
        "comment_id": "l67cdvk",
        "subreddit": "books",
        "body": "Sand is part of the Silo series isn’t it?",
        "time": "2024-05-29 17:35:07 UTC",
        "score": 2,
        "link_id": "t3_1d3fy7r",
        "parent_id": "t3_1d3fy7r"
    },
    {
        "comment_id": "l5i0gxj",
        "subreddit": "books",
        "body": "Can we ask the same about biting one’s tongue or lips hard in fear or anxiety that they bleed? (I understand sometimes you accidentally bite them and draw blood, but I think if you are intentionally doing it then you would stop before it bled)",
        "time": "2024-05-24 17:34:48 UTC",
        "score": 2,
        "link_id": "t3_1czo6x1",
        "parent_id": "t3_1czo6x1"
    },
    {
        "comment_id": "l5i09x5",
        "subreddit": "books",
        "body": "I have ROFL before but not on a regular basis",
        "time": "2024-05-24 17:33:38 UTC",
        "score": 6,
        "link_id": "t3_1czo6x1",
        "parent_id": "t1_l5hmzqy"
    },
    {
        "comment_id": "l59rxty",
        "subreddit": "books",
        "body": "Andy Weir specializes in a subgenre of sci fi that I like to call accessible problem solving sci fi. Artemis, his second book, was not very good. But many people love The Martian and PHM for similar reasons. Not because Weir is great at character development, but pretty much all of the rest of it is broadly appealing. These are some of my favorite books. It’s okay not to like them. It doesn’t mean there is an issue with the book or the author just because you don’t like it. You just have different taste. ",
        "time": "2024-05-23 03:07:24 UTC",
        "score": 10,
        "link_id": "t3_1cy445k",
        "parent_id": "t3_1cy445k"
    },
    {
        "comment_id": "kywlpe7",
        "subreddit": "books",
        "body": "The characters aren’t always great or well developed, but the books are all still 5 stars for me because the rest is just SO GOOD!",
        "time": "2024-04-10 11:14:00 UTC",
        "score": 1,
        "link_id": "t3_1bzs1wz",
        "parent_id": "t3_1bzs1wz"
    },
    {
        "comment_id": "kwkzxpi",
        "subreddit": "books",
        "body": "Drives me crazy on shows/movies too. It’s a terrible trope. ",
        "time": "2024-03-26 01:59:17 UTC",
        "score": 6,
        "link_id": "t3_1bnmuyj",
        "parent_id": "t1_kwjtgdz"
    }
]