[
    {
        "comment_id": "lvnj1et",
        "subreddit": "books",
        "body": "Every Mark Lawrence MC every, especially Jorg.",
        "time": "2024-11-06 05:05:35 UTC",
        "score": 2,
        "link_id": "t3_1gketck",
        "parent_id": "t3_1gketck"
    },
    {
        "comment_id": "lu1bk38",
        "subreddit": "books",
        "body": "It's basically a bad CSW show in book form. A ✨diverse✨ group of cardboard cutout characters loosely stitched together with a generic plot without much consistency.",
        "time": "2024-10-27 17:14:12 UTC",
        "score": -3,
        "link_id": "t3_1gdfe7f",
        "parent_id": "t1_lu17rnp"
    },
    {
        "comment_id": "lseanxj",
        "subreddit": "books",
        "body": "The Bridge on the Drina by Ivo Andrić (who won the Nobel prize for it) is filled with memorable quotes like:\n\n\"Man is never content, he spends his whole life searching for happiness, he needs very little; but that little is the thing he always lacks.\"\n\nIt's not the perfect translation but captures the jist of it.",
        "time": "2024-10-17 17:44:50 UTC",
        "score": 3,
        "link_id": "t3_1g5wewz",
        "parent_id": "t3_1g5wewz"
    },
    {
        "comment_id": "lsbzymo",
        "subreddit": "books",
        "body": "I prefer to read books in the language they were written in.\n\nI recently found a translated copy of Gwyn's Shadow of the Gods and it was *horrible*. I fluently speak three languages but it was easier to read this book in English than my own language because the translation was just awful.\n\nSame with Tolkien's Lord of the Rings. Some of his writing relies heavily on being read in English like the \"No living man may hinder me!\" part. It was translated as \"no ONE can kill me\".",
        "time": "2024-10-17 08:10:59 UTC",
        "score": 1,
        "link_id": "t3_1g54whq",
        "parent_id": "t3_1g54whq"
    },
    {
        "comment_id": "lq99rlj",
        "subreddit": "books",
        "body": "I have read everything Sanderson wrote except Tress and White Sand. I didn't really like Red Rising. Both the first and second First Law trilogy were great but the standalones were not for me. I liked the first Locke Lamora book but I gave up half way through the second one. It was just too boring and the plot armour was insane.\n\nAs for the PowderMage, I enjoyed the setting and loved the idea of a revolution but the author just gave up on half the plots and gave us a hot mess. The second trilogy was also quite bad.",
        "time": "2024-10-04 05:09:38 UTC",
        "score": 2,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq7d110"
    },
    {
        "comment_id": "lq71sfe",
        "subreddit": "books",
        "body": "Fair points. Could you recommend a book you liked but without the academia setting? Something more PowderMage? Not a fan of the series, just the untapped potential",
        "time": "2024-10-03 20:33:46 UTC",
        "score": 1,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq717wy"
    },
    {
        "comment_id": "lq627zo",
        "subreddit": "books",
        "body": "I can't wait for the second book!",
        "time": "2024-10-03 17:27:03 UTC",
        "score": 3,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq5dgms"
    },
    {
        "comment_id": "lq5hxxm",
        "subreddit": "books",
        "body": "Definitely! It made sense that he was able to catch up to everyone as he DID have a similar background as everyone else unlike a certain *helldiver of Lykos* who is just the perfect human being lol",
        "time": "2024-10-03 15:34:16 UTC",
        "score": 5,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq5ha0g"
    },
    {
        "comment_id": "lq5hckz",
        "subreddit": "books",
        "body": "I totally get it. It's not for everyone, me first lol. I am usually not a fan of academia plots and as someone already mentioned here it is a carbon copy of Red Rising.",
        "time": "2024-10-03 15:31:22 UTC",
        "score": 1,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq4weg1"
    },
    {
        "comment_id": "lq4rfnl",
        "subreddit": "books",
        "body": "Tell my AI wrote this without telling me lol",
        "time": "2024-10-03 13:15:57 UTC",
        "score": 2,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq4ox8a"
    },
    {
        "comment_id": "lq3nxxd",
        "subreddit": "books",
        "body": "Well... You ARE right lmao. Yes, the book is basically Red Rising but without the Slingblade. That's where my big burly friend and small loyal friend came from and the fact that Emissa is basically a less capable Mustang didn't escape me either.\n\nI still enjoyed the book because it is well written and the worldbuilding is pretty good. As for the magic being a metaphor for class structure, it is kinda good? I actually liked it as a concept.",
        "time": "2024-10-03 06:54:58 UTC",
        "score": 6,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq3mjrt"
    },
    {
        "comment_id": "lq3laag",
        "subreddit": "books",
        "body": "Great summary. It *was* YAish and Vis IS a Mary Sue which was a bit of a bummer but it fits thematically because Vis' father is the oh so common great king with 0 flaws (yes, I do hate it lol) but the book itself was great. One thing I would have loved to see is Vis spending more time with Diago because their whole \"teaming up\" felt very unnatural but no book is perfect lol.",
        "time": "2024-10-03 06:24:57 UTC",
        "score": 4,
        "link_id": "t3_1fv0wmb",
        "parent_id": "t1_lq3kptq"
    },
    {
        "comment_id": "lnfroqp",
        "subreddit": "books",
        "body": "That sounds fun. Might be the winner lol",
        "time": "2024-09-16 17:18:25 UTC",
        "score": 1,
        "link_id": "t3_1fi9wlj",
        "parent_id": "t1_lnfqsjx"
    },
    {
        "comment_id": "lnfri84",
        "subreddit": "books",
        "body": "Oh God no. I forgot to mention that one as I DNFd it a few months back. It's beyond cheesy and honestly uncomfortable to read. Not to mention that the only interesting part I wanted to read about (the gods and their powers) were just glossed over.",
        "time": "2024-09-16 17:17:26 UTC",
        "score": -1,
        "link_id": "t3_1fi9wlj",
        "parent_id": "t1_lnfqo8b"
    },
    {
        "comment_id": "lnfpvah",
        "subreddit": "books",
        "body": "Thanks, I'm already writing a post for Book Suggestions and I had no idea about those subs.\n\nI was thinking I'd try here because I'm not a fan of Romantasy as they call it and I might get better recs here.",
        "time": "2024-09-16 17:08:40 UTC",
        "score": 1,
        "link_id": "t3_1fi9wlj",
        "parent_id": "t1_lnfp7l8"
    },
    {
        "comment_id": "lmvvfsz",
        "subreddit": "books",
        "body": "Murder on the Orient Express by Agatha Christie is a great one as well as Death on the Nile. (I am obviously an Agatha fan lol)",
        "time": "2024-09-13 05:13:19 UTC",
        "score": 2,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmvheh7"
    },
    {
        "comment_id": "lmt42nu",
        "subreddit": "books",
        "body": "Do you enjoy several hours of intentionally vague, failed attempts at deep psychology sprinkled with forced symbolism and a dash of flat characters that in no way, shape or form act as their professions should? Well you are in luck lol",
        "time": "2024-09-12 18:49:28 UTC",
        "score": 1,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmt2fqw"
    },
    {
        "comment_id": "lmhs1f9",
        "subreddit": "books",
        "body": "For me, the ending was so out of pocket ridiculous I couldn't have guessed it if I tried to. I entertained the dumb idea of framing the lover for the murder and living happily with Alicia once her name was cleared but this was... Just wow.",
        "time": "2024-09-10 20:15:29 UTC",
        "score": 1,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmhjfag"
    },
    {
        "comment_id": "lmhrhez",
        "subreddit": "books",
        "body": "Any ideas for a replacement book? Thriller/horror is the preferred genre but I am flexible.",
        "time": "2024-09-10 20:12:38 UTC",
        "score": 1,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmhjv0d"
    },
    {
        "comment_id": "lmfhl49",
        "subreddit": "books",
        "body": "I learned not to trust highly recommended books years ago. My trick is to look for long and detailed 1 star reviews as they are usually the more accurate.",
        "time": "2024-09-10 12:45:13 UTC",
        "score": 10,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmfh9l2"
    },
    {
        "comment_id": "lmfgg6s",
        "subreddit": "books",
        "body": "It is definitely a below average read and not nearly deserving of the hype it received. I feel like those booktubers and booktokers are to blame to be honest - they hear of a book, buy it and just spew some wague details pretending they've read it and say it was great. That's the only explanation I got.",
        "time": "2024-09-10 12:37:26 UTC",
        "score": 16,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmfer02"
    },
    {
        "comment_id": "lmffx6s",
        "subreddit": "books",
        "body": "Shutter Island is the gold standard and this was a very, *very* bad attempt at recreating it.",
        "time": "2024-09-10 12:33:46 UTC",
        "score": 2,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmfdh5t"
    },
    {
        "comment_id": "lmffpey",
        "subreddit": "books",
        "body": "Same but that's not a good thing lol.",
        "time": "2024-09-10 12:32:14 UTC",
        "score": -5,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmfdcg9"
    },
    {
        "comment_id": "ljv25ke",
        "subreddit": "books",
        "body": "Completely true. I imagined them all as white as I have never even seen a brown person with my own eyes. East Europe is all white.",
        "time": "2024-08-25 14:35:58 UTC",
        "score": 1,
        "link_id": "t3_1f0lm62",
        "parent_id": "t1_ljuyysm"
    },
    {
        "comment_id": "lju09mm",
        "subreddit": "books",
        "body": "Fully agree on DNFing ACATOR and the likes but the first half of These Silent Woods was great in my opinion. It's the second half that just shattered any hope for a good ending.",
        "time": "2024-08-25 09:17:10 UTC",
        "score": 1,
        "link_id": "t3_1f0ccui",
        "parent_id": "t3_1f0ccui"
    },
    {
        "comment_id": "lju04ir",
        "subreddit": "books",
        "body": "I strongly disagree with your flawed mortal assumptions, human.\n\n\nF̷͓̦̙̈́̽̍̋̔̅̿̈e̵͕͗̓́͆͗ê̸̱̰̆̀̿̍͂̐͐̀̾d̸̲̠̯̪̳͕̭̈̏͐͛̌̃̈́̄̔̎̈́̏ḯ̵̛̲̣̬̱̙̘͙̂̇͂̃̆̍̿̍̕ͅn̴̛̙̪̳̟̮̤̝̔̈́͆̀͠g̵̰̔͐̌ ̴͙̳̝̳̀̃͊̐͜͠ț̴̛̿͗̀̈̒̆͆̀̓̾̕͝ï̸̧̩̰̪̬̼̲̩̦̹̼̏̀͜ͅm̶̢̥̹̰̠͖̘͕̥͉̺̎̀̄̌̓̑e̴͇͓̝̲̞̻͎͑̇̊͋́͒̂͌̕͝ͅ",
        "time": "2024-08-25 09:15:31 UTC",
        "score": 3,
        "link_id": "t3_1f0ccui",
        "parent_id": "t1_ljqu3hw"
    },
    {
        "comment_id": "ljtztsu",
        "subreddit": "books",
        "body": "Read some Stormlight Archive. Its basically brown giants lol.",
        "time": "2024-08-25 09:12:02 UTC",
        "score": -17,
        "link_id": "t3_1f0lm62",
        "parent_id": "t1_ljtaoa2"
    },
    {
        "comment_id": "ljtzmpa",
        "subreddit": "books",
        "body": "I am a notorious note taker. I usually get a blank piece of paper, write down all the names as they are introduced and add notes and lines connecting the various characters. Having multiple colour pens works wonders. It may seem like a bit of a hassle but I enjoy piecing things together and writing down ideas for plot twists and reveals as I am a huge fan of mystery and political intrigue.",
        "time": "2024-08-25 09:09:44 UTC",
        "score": 12,
        "link_id": "t3_1f0rzuq",
        "parent_id": "t3_1f0rzuq"
    }
]