[
    {
        "comment_id": "lwxbc0e",
        "subreddit": "books",
        "body": "I'm so glad she was able to get her book published. I was a white girl living in american suburbia and that book still makes me cry remembering it. I'm taking this as my cue to buy a copy for my kids.",
        "time": "2024-11-13 15:00:34 UTC",
        "score": 1,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t1_lwutcs9"
    },
    {
        "comment_id": "l9np2rd",
        "subreddit": "books",
        "body": "My daughter is just getting to where we trust her to treat books with care. In theory, she is supposed to come to us with what she wants to borrow and we will bookend the reading with discussions. In practice she may end up blindly stumbling into some things she may not be ready for if she neglects to bring a borrowed book to our attention.\n\nHowever, I would never outright bar my kid from reading anything.",
        "time": "2024-06-21 19:11:02 UTC",
        "score": 1,
        "link_id": "t3_1dl5h9t",
        "parent_id": "t3_1dl5h9t"
    },
    {
        "comment_id": "l8mhiu9",
        "subreddit": "books",
        "body": "Dies The Fire by S.M. Stirling. Real interesting take on what if all tech and guns just didn't at the same time only for it to be a big lead up to the rebirth of King Arthur. It felt like an author shoehorning in an OC in fanfic.",
        "time": "2024-06-14 19:18:02 UTC",
        "score": 1,
        "link_id": "t3_1df075q",
        "parent_id": "t3_1df075q"
    },
    {
        "comment_id": "l4sipbm",
        "subreddit": "books",
        "body": "There is a book I read in high school where a guy pretty much does Gulliver's Travels but through various spots in time. The majority of the plot was all the women just throwing themselves at him, but what I found silly was that on the future everyone was kind of a bronzish gray with near identical facial features because mixing genetics is apparently like mixing paint.",
        "time": "2024-05-19 21:45:24 UTC",
        "score": 1,
        "link_id": "t3_1cum3js",
        "parent_id": "t3_1cum3js"
    },
    {
        "comment_id": "kuo0uz3",
        "subreddit": "books",
        "body": "I really liked the book. I just wanted to shake Harrow by the shoulders because asking questions and admitting ignorance seems to be outside of her wheelhouse.",
        "time": "2024-03-13 12:28:48 UTC",
        "score": 2,
        "link_id": "t3_1bczz95",
        "parent_id": "t1_kulkozw"
    },
    {
        "comment_id": "kulxx5u",
        "subreddit": "books",
        "body": "Heart of The Sea by Nora Roberts\n\nI like all three of The Gallaghers Trilogy, but I feel like this book has the best character interaction and most organic feeling romance of all of them. For the most part, it has need of the other two to be interesting either.",
        "time": "2024-03-13 00:56:30 UTC",
        "score": 1,
        "link_id": "t3_1bczz95",
        "parent_id": "t3_1bczz95"
    },
    {
        "comment_id": "ku0qyx0",
        "subreddit": "books",
        "body": "No that's This Book Is Full of Spiders. What The Hell Did I Just Read is the third.",
        "time": "2024-03-09 03:37:37 UTC",
        "score": 2,
        "link_id": "t3_1ba593r",
        "parent_id": "t1_ku0cv4v"
    },
    {
        "comment_id": "ku0qrm6",
        "subreddit": "books",
        "body": "I have read all four books and to be fair they are all kind of \"what the f*ck did I just read\" in just the best way possible. They are very much implied to be fighting the nightmares at the edge of our reality so coming out the other side barely coherent, but full of adrenaline and dread seems about right.",
        "time": "2024-03-09 03:36:09 UTC",
        "score": 2,
        "link_id": "t3_1ba593r",
        "parent_id": "t3_1ba593r"
    },
    {
        "comment_id": "ksrjmj0",
        "subreddit": "books",
        "body": "As a very much adult person, I still check up on YA. Not every book is a winner, but some are pretty fun.",
        "time": "2024-02-29 22:27:26 UTC",
        "score": 9,
        "link_id": "t3_1b38ejy",
        "parent_id": "t1_ksqjkkh"
    },
    {
        "comment_id": "ki6yhog",
        "subreddit": "books",
        "body": "Did you ever have COVID? The brain fog is a well-known long-term side effect.",
        "time": "2024-01-16 22:28:49 UTC",
        "score": 1,
        "link_id": "t3_198frbl",
        "parent_id": "t3_198frbl"
    },
    {
        "comment_id": "kbh2oye",
        "subreddit": "books",
        "body": "To this day, this will set me off in a rant. Some people have major nostalgia for the movie nowadays and just want to shove my well-worn copy of the book down their throats.",
        "time": "2023-11-30 23:32:17 UTC",
        "score": 5,
        "link_id": "t3_187ehud",
        "parent_id": "t1_kbdyo9q"
    },
    {
        "comment_id": "kbe6h7y",
        "subreddit": "books",
        "body": "The Confessions of Moll Flanders is about a woman in the 1800's who pulls herself out of poverty via her vagina. The movie maked me cry and is full of drama. The book reads like an accounting ledger.",
        "time": "2023-11-30 12:07:54 UTC",
        "score": 1,
        "link_id": "t3_18770n3",
        "parent_id": "t3_18770n3"
    },
    {
        "comment_id": "kbe5tnx",
        "subreddit": "books",
        "body": "The book is the movie but MORE and it is amazing in my opinion.",
        "time": "2023-11-30 12:01:04 UTC",
        "score": 3,
        "link_id": "t3_18770n3",
        "parent_id": "t1_kbcp8h3"
    },
    {
        "comment_id": "k7a4zzy",
        "subreddit": "books",
        "body": "Oh yea. I do read some adult fiction, but I think YA has some real interesting ideas. Honestly, not sure who the big hitters are per say. I just grab whatever looks neat. I really liked reading Rainbow Powell and Holly Black's stuff.",
        "time": "2023-10-31 20:58:03 UTC",
        "score": 1,
        "link_id": "t3_17kj7t5",
        "parent_id": "t3_17kj7t5"
    },
    {
        "comment_id": "k6b3aa1",
        "subreddit": "books",
        "body": "Murder Your Employer: The McMasters Guide to Homicide by Rupert Holmes. \n\nThe book had a fun premise and a fun setting, but I couldn't stand the 'nice guy' main character. It's set 1950's-ish so I'm not sure if the author was trying to make the guy's attitude either period accurate to other pulp novels of the timw or if it was more of a refelection of the author himself, but I just couldn't after halfway through.",
        "time": "2023-10-24 21:32:25 UTC",
        "score": 1,
        "link_id": "t3_17ezhsi",
        "parent_id": "t3_17ezhsi"
    },
    {
        "comment_id": "jr11g8h",
        "subreddit": "books",
        "body": "Red Flag: Books organized by color/look like they have never been read.\n\nI have known too many people who have ornamental libraries and they either do not actively read past what school required or never venture past what is the most loudly popular tome that year.\n\nGreen Flag: Organized chaos. Not hoarding per se, but an obvious outweighing of book love to immediette available space.",
        "time": "2023-07-07 14:36:19 UTC",
        "score": 4,
        "link_id": "t3_14s78kf",
        "parent_id": "t3_14s78kf"
    },
    {
        "comment_id": "jh5x9cw",
        "subreddit": "books",
        "body": "Better than the book for me is The Confessions of Moll Flanders. The movie made me cry and the book reads like an accounting ledger with personal notes scribbled in the margins.",
        "time": "2023-04-21 16:47:30 UTC",
        "score": 1,
        "link_id": "t3_12tykzl",
        "parent_id": "t3_12tykzl"
    },
    {
        "comment_id": "jh5wrm4",
        "subreddit": "books",
        "body": "I love the book, but nothing in that trailer made me think it kept the same feel of helpless fish out of water desperation the book had.",
        "time": "2023-04-21 16:44:18 UTC",
        "score": 1,
        "link_id": "t3_12tykzl",
        "parent_id": "t1_jh4un7h"
    },
    {
        "comment_id": "jh5v6no",
        "subreddit": "books",
        "body": "I think The Princess Bride managed the perfect compromise of keeping the spirit of the book and hitting all the key character arc moments without the miniseries runtime needed to truly chronicle everything in the book.",
        "time": "2023-04-21 16:33:58 UTC",
        "score": 3,
        "link_id": "t3_12tykzl",
        "parent_id": "t1_jh4zorr"
    },
    {
        "comment_id": "jd7yidh",
        "subreddit": "books",
        "body": "As a teenager in high school who was responsible for cooking and cleaning when I got home, not to mention homework, I read about 1-3 books a week.\n\n Now as an adult with a full-time job who is responsible for a house and a kid, I only manage one book in three weeks if I am really into it.",
        "time": "2023-03-22 14:17:30 UTC",
        "score": 1,
        "link_id": "t3_11ye5oj",
        "parent_id": "t3_11ye5oj"
    },
    {
        "comment_id": "iwc1yvs",
        "subreddit": "books",
        "body": "I am 35. They can pry the YA fiction out of my cold dead hands. A lot of my favorite books are YA and while I have and do read adult fiction, an interesting story is an interesting story.",
        "time": "2022-11-14 15:13:50 UTC",
        "score": 1,
        "link_id": "t3_yuijka",
        "parent_id": "t3_yuijka"
    },
    {
        "comment_id": "iuf6xzz",
        "subreddit": "books",
        "body": "Short Answer: yes\n\nLong Answer: There are those that do them well, those that do them terribly, and those that sacrifice the plot for the sex to happen.\n\nEven when done well, I'm not always in the mood for them. However, I'll take some well written smut over most visual porn any day.",
        "time": "2022-10-30 21:30:51 UTC",
        "score": 2,
        "link_id": "t3_yhks0d",
        "parent_id": "t3_yhks0d"
    },
    {
        "comment_id": "iud8t3r",
        "subreddit": "books",
        "body": "My mom realized when I was 14 that I would read her books and suddenly all of her romance novels disappeared. Joke's on her. I had been reading them since age 10 and pretty had them memorized. Petals On The River by Kathleen Woodwiss still has a nostalgic fondness in my heart.",
        "time": "2022-10-30 13:28:43 UTC",
        "score": 9,
        "link_id": "t3_ygvy8w",
        "parent_id": "t1_iubit1q"
    },
    {
        "comment_id": "isvxwz0",
        "subreddit": "books",
        "body": "It's not weird until you have Rule 34ed the snail question and even then *shrugs*\n\nLoved you on Cracked. Didn't know there was going to be a fourth book in the series but I'm totally getting it now.",
        "time": "2022-10-19 02:18:03 UTC",
        "score": 7,
        "link_id": "t3_y7ays8",
        "parent_id": "t1_isucxws"
    },
    {
        "comment_id": "iflvijm",
        "subreddit": "books",
        "body": "As someone who has a lot of older books, the dog earing can eventually lead to the dog ear bit falling off. Other than that I just consider anything that is still legible to be an ok book.",
        "time": "2022-07-10 15:44:20 UTC",
        "score": 1,
        "link_id": "t3_vvkyou",
        "parent_id": "t3_vvkyou"
    },
    {
        "comment_id": "i9lylg0",
        "subreddit": "books",
        "body": "As an American that has never been to the UK, I always have a pitcher of sweet tea in the fridge. I hear it is an abomination over the pond.",
        "time": "2022-05-22 21:21:17 UTC",
        "score": 1,
        "link_id": "t3_uvc3yh",
        "parent_id": "t1_i9kp2ir"
    },
    {
        "comment_id": "i9id3vl",
        "subreddit": "books",
        "body": "Okay I spent pretty much all of the second book yelling at Harrow to swallow her damn pride and ask some questions already, but I do feel like it really hit its stride halfway through and made me want give Harrow all the hugs she was deprived of in her childhood.\n\nThe third book's main character is hopefully more inquisitive at least.",
        "time": "2022-05-22 00:29:38 UTC",
        "score": 1,
        "link_id": "t3_oxy1c1",
        "parent_id": "t1_i9ibi6v"
    },
    {
        "comment_id": "i4thcjp",
        "subreddit": "books",
        "body": "The movie is good and so is the book by Neil Gaiman.",
        "time": "2022-04-15 11:14:26 UTC",
        "score": 1,
        "link_id": "t3_u3jkpl",
        "parent_id": "t1_i4rqwsn"
    },
    {
        "comment_id": "i4th93v",
        "subreddit": "books",
        "body": "Honestly, I'm sad Jane Austen's  works tend to be portrayed as a lot of dramatic windswept romances when they contain a lot of tongue in cheek sarcasm. Hell, Northanger Abbey is a parody so what about a rendition of that more along the lines of Airplane. I think the closest she gets to full seriousness is Persuasion and that's about two shy ex's kind of mumbling around the fact that they miss each other but think the other has thoroughly moved on.",
        "time": "2022-04-15 11:13:19 UTC",
        "score": 11,
        "link_id": "t3_u3jkpl",
        "parent_id": "t3_u3jkpl"
    },
    {
        "comment_id": "i468eu8",
        "subreddit": "books",
        "body": "As an adult that loves YA and children's books, there are absolutely amazing gems being written in these genres. That said, the bar for publishing companies seems comparable to others that create media for younger age groups. I have picked up many books with amazing premises only to be completely disappointed.",
        "time": "2022-04-10 15:22:28 UTC",
        "score": 1,
        "link_id": "t3_u059u1",
        "parent_id": "t1_i44iz8m"
    },
    {
        "comment_id": "i1cqlqr",
        "subreddit": "books",
        "body": "As someone who just read A Necklace of Kisses by Francesca Lia Block, this was pretty much my complaint about her timeskip of Weetzie Bat. I love her weird ass writing style but in that book the descriptions felt more like filler than setting the mood. Completely kept me from caring about what the characters were going through.",
        "time": "2022-03-20 01:41:00 UTC",
        "score": 1,
        "link_id": "t3_ti0aer",
        "parent_id": "t1_i1c4aqa"
    }
]