[
    {
        "comment_id": "luvwvol",
        "subreddit": "books",
        "body": "I choose classical or other instrumental music that goes along with the vibe/ setting of my book. It helps me concentrate, helps me enjoy the book, and I've discovered some cool music.",
        "time": "2024-11-01 17:13:33 UTC",
        "score": 1,
        "link_id": "t3_1ggjp4l",
        "parent_id": "t3_1ggjp4l"
    },
    {
        "comment_id": "kzlkmmj",
        "subreddit": "books",
        "body": "I keep faves and nonfiction I think I will reference later. All others I sell or donate. The faves I hold on to to give to a fellow reader if I think they will like it. Those are gifted to special people. I think it makes books sad to sit in a shelf and not get read. They want to explore the world and share their joy.",
        "time": "2024-04-14 22:36:11 UTC",
        "score": 2,
        "link_id": "t3_1c3zn0h",
        "parent_id": "t3_1c3zn0h"
    },
    {
        "comment_id": "kjz1ox6",
        "subreddit": "books",
        "body": "Do they really want to know why, or do they just want to feel superior? \n\nObvs, it's the latter. This question is motivated by a belief that they are smarter than everyone else while at the same time feeling insecure that they do not read. OP, don't get sucked in.",
        "time": "2024-01-28 17:12:10 UTC",
        "score": 1,
        "link_id": "t3_1ad507p",
        "parent_id": "t3_1ad507p"
    },
    {
        "comment_id": "kjo94xo",
        "subreddit": "books",
        "body": "The Kitchen House by Kathleen Grissom because of how she approached slavery.  A lot of \"some good slave owners\" and \"slavery was good for/ preferred by some slaves\" nonsense. Racist revisionist nonsense.",
        "time": "2024-01-26 16:08:51 UTC",
        "score": 2,
        "link_id": "t3_1ab9iy4",
        "parent_id": "t3_1ab9iy4"
    },
    {
        "comment_id": "kfrxb04",
        "subreddit": "books",
        "body": "I cut up paperboard from cereal boxes and other things that would otherwise go to trash or recycling. Then I can write on one side.",
        "time": "2024-01-01 00:59:05 UTC",
        "score": 2,
        "link_id": "t3_18v278e",
        "parent_id": "t1_kfo82d8"
    },
    {
        "comment_id": "h9p60qd",
        "subreddit": "books",
        "body": "I look at goodreads reviews to find folks who like things I like. Then I check out other books they've highly rated.",
        "time": "2021-08-20 19:17:27 UTC",
        "score": 3,
        "link_id": "t3_p83b8g",
        "parent_id": "t3_p83b8g"
    },
    {
        "comment_id": "gmo6q7a",
        "subreddit": "books",
        "body": "A Walk in the Woods is the worst book ever.",
        "time": "2021-02-09 06:14:52 UTC",
        "score": 1,
        "link_id": "t3_lfctle",
        "parent_id": "t3_lfctle"
    }
]