[
    {
        "comment_id": "lwuwjlw",
        "subreddit": "books",
        "body": "People talk about representation for marginalized groups but primary school education is overwhelmingly female dominated  so there is probably some detrimental effects on boys in school. ",
        "time": "2024-11-13 02:57:00 UTC",
        "score": 5,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t1_lwuofck"
    },
    {
        "comment_id": "lp9w8w6",
        "subreddit": "books",
        "body": "A lot of Eastern Europe was effectively a colony until ~1990.\n\nThe Soviets pretty tightly controlled even nominally independent Warsaw state countries to be reliant on the mother Russia",
        "time": "2024-09-28 01:05:36 UTC",
        "score": 5,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp9rvdz"
    },
    {
        "comment_id": "lp9w1ik",
        "subreddit": "books",
        "body": "Have you considered a lot of post colonial studies people work backwards from a conclusion rather than forward to find one?\n\nLike the idea Haiti for crippled enough by French reparations that it’s a failed state in 2024 but not crippled enough to stop it from being able to invade and occupy the Dominican Republic for 22 years is absurd on its face. \n\nAgain colonialism wasn’t good but the vast gaps in colonial outcomes 60-70 years post independence shows a lot can change.\n\nThe books from 1972 that OP read. And yes, in 1972 it was 10-15 years since independence. And pretty much all of Africa, Asia and the Caribbean was equally poor.\n\nThats very much not true anymore. Cause it’s been 50 years since publication ",
        "time": "2024-09-28 01:04:10 UTC",
        "score": 19,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp9o7ij"
    },
    {
        "comment_id": "lp94uw4",
        "subreddit": "books",
        "body": "Yup and that’s entirely because Spain and Portugal were basket case countries from 1925-1975 this fell behind Europe in that timeframe ",
        "time": "2024-09-27 22:03:27 UTC",
        "score": 3,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp7zi45"
    },
    {
        "comment_id": "lp9490w",
        "subreddit": "books",
        "body": "What flattens context is pretending the “global south” is just a result of its relationship with the global north and had no role in how it turned out at all. ",
        "time": "2024-09-27 21:59:39 UTC",
        "score": 21,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp801rm"
    },
    {
        "comment_id": "lp7z2ze",
        "subreddit": "books",
        "body": "“Little to do” is an overstatement but \n\nBut there has been enormous divergence from the way of things in the early 20th century. \n\nSingapore and Ireland are richer than the Uk for example so are some gulf states (or obvious reasons)\n\nRussia is poorer than most of its Eastern European Warsaw pact countries. Despite being in a system for 50-90 years designed to siphon wealth to Moscow.\n\nKorea and Taiwan are richer than Japan \n\nDrawing a straight line from a $2,000 PPP modern GDP and 1954 administration of the colonies is very much robbing those success stories like Botswana of their agency, like no they are not better off because “the Brit’s took it easy on them”",
        "time": "2024-09-27 18:08:50 UTC",
        "score": 28,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp7vgbi"
    },
    {
        "comment_id": "lp7svmf",
        "subreddit": "books",
        "body": "Yes in the 1950s China was extremely poor and war torn. It basically started from 0 post civil war.",
        "time": "2024-09-27 17:35:39 UTC",
        "score": 69,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp7qmyp"
    },
    {
        "comment_id": "lp7scgp",
        "subreddit": "books",
        "body": "Botswana being the 3rd richest country in Africa and Zimbabwe being the 44th have everything to do with post-independence decisions. They’re neighboring countries, both run by the British and one made Catastrophic mistake after catastrophic mistake.\n\nBotswana is ~8x richer cause they were better at administering a country. \n\nOn the flip side of Colonialism places like Portugal and  Spain  are much poorer than like Norway  despite one being basically a colony until 1910 and the other being a center of a major empire. (Korea is also wealthier than Portugal) Because for the most part things that happened before WWI have little impact on modern wealth levels. Since so much wealth has been produced post 1950.\n\nTurkey is poorer now than most of its European territories as well.\n\n64 years a is *long time* and African countries themselves have a role to play in their poverty. ",
        "time": "2024-09-27 17:32:51 UTC",
        "score": 84,
        "link_id": "t3_1fqrr62",
        "parent_id": "t1_lp7pktt"
    },
    {
        "comment_id": "lp7o753",
        "subreddit": "books",
        "body": "Quite frankly I find a lot of those theories unsatisfying because it does not explain the vast gap between Post colonial societies.\n\nIf it was just colonialism shouldn’t Vietnam and Chad be equally poor?\n\nSame thing with Haiti. Like apparently reparations sunk Haiti forever but the subsequent Haitian occupation of the DR didn’t doom the Dominican Republic to forever be impoverished.\n\nThe fact is in 1960 most of the world \n\nChina, Botswana, the DRC, Dominican Republic, India were all more or less in the same spot \n\nBut the fortunes of Botswana diverged greatly from Chad and Gabon from Nigeria. Let alone places like Malaysia whose GDP per capita is somewhat on par with Southeastern Europe despite being a colony into the mid 20th century and losing its most important city to a micro state \n\nHaiti was richer than the DR in 1960 now the DR is like 8x wealthier.\n\nA lot is to be said about the uselessness of the post colonial administration of a lot of Subsaharan Africa. Because say ",
        "time": "2024-09-27 17:10:47 UTC",
        "score": 214,
        "link_id": "t3_1fqrr62",
        "parent_id": "t3_1fqrr62"
    }
]