[
    {
        "comment_id": "lz7tf6h",
        "subreddit": "books",
        "body": "I threw away 'My Sweet Audrina' by V.C. Andrews because it creeped me out so much (I was supposed to donate it to a family friend, but decided to spare her eyes).  The combination of the vaguely incestuous storyline coupled with puberty made for a super uncomfortable read. The cover art was pretty though.",
        "time": "2024-11-27 09:04:24 UTC",
        "score": 1,
        "link_id": "t3_1h0rqpv",
        "parent_id": "t3_1h0rqpv"
    },
    {
        "comment_id": "ltb0bqy",
        "subreddit": "books",
        "body": "I was 14-15 when my brother gave me the book (he \"borrowed\" it from a friend who never asked for it back, I guess) and I remember the ending blew my mind too. I didn't know the narrator was allowed to lie or cheat or mislead- until then I had only been acquainted with \"faithful\" narrators. I definitely thought about it for a long time, partly because before the twist I had become almost fond of the narrator and was cheering him on on his quest to uncover his friend's murder :/",
        "time": "2024-10-23 07:01:49 UTC",
        "score": 2,
        "link_id": "t3_1g9bpn3",
        "parent_id": "t1_lt4vdy2"
    },
    {
        "comment_id": "ll0c8b8",
        "subreddit": "books",
        "body": "Lapvona would have been the perfect book for me but I just couldn't get into it. It had all the elements I liked, but the delivery fell flat. I couldn't even finish it past the halfway point.",
        "time": "2024-09-01 16:22:27 UTC",
        "score": 1,
        "link_id": "t3_1f67yo5",
        "parent_id": "t1_lkyy7d4"
    },
    {
        "comment_id": "lhjyqm5",
        "subreddit": "books",
        "body": "I think I remember this one, but it was a basement instead. Is it the one where she meets a girl who has a lot of pressed flowers?",
        "time": "2024-08-11 06:43:33 UTC",
        "score": 2,
        "link_id": "t3_1eotbrn",
        "parent_id": "t1_lhib45a"
    },
    {
        "comment_id": "kzqasqy",
        "subreddit": "books",
        "body": "'The Name of the Rose'. Everything about the book should have made me like it, and the cover art is gorgeous. However, I couldn't even get through half of it. Shame, the premise and the setting is so so intriguing to me.",
        "time": "2024-04-15 20:12:07 UTC",
        "score": 3,
        "link_id": "t3_1c4sdbm",
        "parent_id": "t3_1c4sdbm"
    },
    {
        "comment_id": "kwy91f4",
        "subreddit": "books",
        "body": "Perfume by Patric Süskind.",
        "time": "2024-03-28 13:25:52 UTC",
        "score": 1,
        "link_id": "t3_1bosrff",
        "parent_id": "t3_1bosrff"
    },
    {
        "comment_id": "kscee61",
        "subreddit": "books",
        "body": "I read 'holes' in my last year of Undergrad. I felt so lost (still do) but that book was so beautiful it really helped me with a lot of my emotions. I know I would have loved it as a kid, but of well. I loved the Kissing Kate Barlowe arc- it was so poignant and sad.",
        "time": "2024-02-27 07:10:14 UTC",
        "score": 6,
        "link_id": "t3_1b12n82",
        "parent_id": "t3_1b12n82"
    },
    {
        "comment_id": "k6ova6m",
        "subreddit": "books",
        "body": "There have been plenty of cases of female teachers r*ping their male students. \"Tampa\" by Alissa Nutting dwells into this scenario.",
        "time": "2023-10-27 15:09:26 UTC",
        "score": 3,
        "link_id": "t3_qcs440",
        "parent_id": "t1_hhkg8ed"
    },
    {
        "comment_id": "jff5rlz",
        "subreddit": "books",
        "body": "But that's also his perception of the events right? She's a child who had a future ahead of her, but because of the abuse she faced at Humbert's hands she ended up pregnant at 16, and later dies in childbirth. Her mother dies while she's away from home, and the man who has been posing as her \"guardian\" takes that opportunity to rape her repeatedly, while on the road with no stable safe space for her to go back. Just because Humbert feels like she's A-okay doesn't make it so, because he's an unreliable narrator who set out to justify his pedophilia and rape throughout the book. Of course he ruined her life, he just wouldn't accept it.",
        "time": "2023-04-08 07:46:27 UTC",
        "score": 18,
        "link_id": "t3_12f8t6x",
        "parent_id": "t1_jfez6pf"
    },
    {
        "comment_id": "ivkpyok",
        "subreddit": "books",
        "body": "I was in a complete funk today and this comment gave me a good hearty laugh. Thank you.",
        "time": "2022-11-08 18:01:53 UTC",
        "score": 3,
        "link_id": "t3_ypeelr",
        "parent_id": "t1_ivjt8kq"
    }
]