[
    {
        "comment_id": "luqdlen",
        "subreddit": "books",
        "body": "Haha. Yeah I have a 50 dollar a month book limit. So normally one new one used",
        "time": "2024-10-31 18:01:59 UTC",
        "score": 6,
        "link_id": "t3_1ggjp4l",
        "parent_id": "t1_luqdg5l"
    },
    {
        "comment_id": "luqcmf0",
        "subreddit": "books",
        "body": "I keep the receipts in the book!",
        "time": "2024-10-31 17:56:58 UTC",
        "score": 5,
        "link_id": "t3_1ggjp4l",
        "parent_id": "t1_luq7txu"
    },
    {
        "comment_id": "loy2xul",
        "subreddit": "books",
        "body": "Meh, I can’t argue that is what they are attempting to do. However, that still just feels like a meaningless task. I much prefer online learning for reading- can’t skip pages, after chapter summaries in your own words, professor can see how quickly you completed the book. Between major parts a lecture from the professor about what you’d read, how it connects, discussion in class on that. Etc: I know it’s not efficient.",
        "time": "2024-09-26 00:35:29 UTC",
        "score": 0,
        "link_id": "t3_1fphjnb",
        "parent_id": "t1_loy0nts"
    },
    {
        "comment_id": "loy09kf",
        "subreddit": "books",
        "body": "No. The outcome isn’t “learn and understand” the outcome is “use your tools, figure out how to pass this test” needs to be more. More immersive. I’ll never begrudge someone for using their tools to meet an outcome. We must be better, a test or an essay isn’t a great way to measure with the amount of information we have on the same books we’ve been reading for decades. \n\nYou can’t expect someone to read wuthering heights to pass a test and they actually read it. You’d have to be ineffective at using tools to do that. You can access literally millions of resources to pass most tests on it.\n\n\nTests as we’ve been doing it isn’t the way. There is immense value in reading it, and other books that we’ve been reading for decades. The rub is how do you make the best, quickest, solution for the student to be read the book.",
        "time": "2024-09-26 00:19:06 UTC",
        "score": -1,
        "link_id": "t3_1fphjnb",
        "parent_id": "t1_loxywbc"
    },
    {
        "comment_id": "loxvejo",
        "subreddit": "books",
        "body": "I think the outcome is more important than the process.",
        "time": "2024-09-25 23:49:12 UTC",
        "score": 1,
        "link_id": "t3_1fphjnb",
        "parent_id": "t1_loxt0tx"
    },
    {
        "comment_id": "loxrny5",
        "subreddit": "books",
        "body": "That’s stupid though. What value is that? I love to read but if the goal is just “spit these facts from the book because curriculum says it’s important for your education” if they can do that great.\n\nEven though I liked reading I hated assigned reading. Still hate it.\n\nSomething like “choose a book of your own about x or y then give a presentation” seems like it would provide more value than “what color tie did this character wear after his mom died”",
        "time": "2024-09-25 23:26:18 UTC",
        "score": 17,
        "link_id": "t3_1fphjnb",
        "parent_id": "t1_loxq588"
    },
    {
        "comment_id": "lksisp0",
        "subreddit": "books",
        "body": "Would be nice to have a do-over but no.",
        "time": "2024-08-31 05:38:47 UTC",
        "score": 3,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lksfv3i"
    },
    {
        "comment_id": "lksetsc",
        "subreddit": "books",
        "body": "And there are a ton detaching because they don’t align with the authors views.",
        "time": "2024-08-31 05:00:32 UTC",
        "score": 4,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lksc6sr"
    },
    {
        "comment_id": "lkse9mc",
        "subreddit": "books",
        "body": "Not at all.",
        "time": "2024-08-31 04:55:25 UTC",
        "score": -4,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lksboeh"
    },
    {
        "comment_id": "lksbczt",
        "subreddit": "books",
        "body": "Doesn’t excuse what it stands for now. Honestly I’m *real skittish* around people with prominent Harry Potter stuff. Sure separate the author blah blah blah, but knowing what I know now, as an adult, I put my Ayn Rand books in a box and they won’t ever see the light of day. I was a different person and didn’t understand a lot of things. Just like how my Harry Potter books are in storage and will never come out unless I decide to sell them or something.\n\nIt may be a hot take but I’d say it’s akin to having a tattoo that was co-opted by a hate group, maybe you got the tattoo for other reasons, but it now stands for the hate group.",
        "time": "2024-08-31 04:29:29 UTC",
        "score": -36,
        "link_id": "t3_1f5euyh",
        "parent_id": "t1_lksav7n"
    },
    {
        "comment_id": "lfdzfis",
        "subreddit": "books",
        "body": "I feel like that was the point. If it were a man she’d be put in cuffs from the word go. I think she’s desperately crying out for consequences, to validate that she’s doing fucked up stuff. I feel like the last 10 pages she’s basically *begging* someone to call her on her shit",
        "time": "2024-07-28 20:25:57 UTC",
        "score": 3,
        "link_id": "t3_1csh41a",
        "parent_id": "t1_l46d3bt"
    },
    {
        "comment_id": "ld8hpcj",
        "subreddit": "books",
        "body": "Just ignore it. It’s a book.",
        "time": "2024-07-15 02:47:27 UTC",
        "score": -3,
        "link_id": "t3_1e2xwte",
        "parent_id": "t3_1e2xwte"
    },
    {
        "comment_id": "kw4bci9",
        "subreddit": "books",
        "body": "Excellent!!",
        "time": "2024-03-22 22:57:19 UTC",
        "score": 0,
        "link_id": "t3_1bl9wgj",
        "parent_id": "t1_kw47tmf"
    },
    {
        "comment_id": "kw43oxi",
        "subreddit": "books",
        "body": "Go target shooting at least a couple times to become familiar with it",
        "time": "2024-03-22 22:10:07 UTC",
        "score": 0,
        "link_id": "t3_1bl9wgj",
        "parent_id": "t1_kw40e7q"
    },
    {
        "comment_id": "kq97qxs",
        "subreddit": "books",
        "body": "To build a fire is so hard to deal with!!",
        "time": "2024-02-13 17:00:19 UTC",
        "score": 1,
        "link_id": "t3_1ap6o85",
        "parent_id": "t1_kq49276"
    },
    {
        "comment_id": "kq97m0f",
        "subreddit": "books",
        "body": "They both die at the end of the",
        "time": "2024-02-13 16:59:31 UTC",
        "score": 1,
        "link_id": "t3_1ap6o85",
        "parent_id": "t3_1ap6o85"
    },
    {
        "comment_id": "kk7gll6",
        "subreddit": "books",
        "body": "Honestly, I’m a sucker for books with trains. But yeah, I kind wish it would have just been about that and the new steel and dropped the other stuff lol",
        "time": "2024-01-30 03:11:10 UTC",
        "score": 1,
        "link_id": "t3_1adls5x",
        "parent_id": "t1_kk7fgog"
    },
    {
        "comment_id": "kk61xw0",
        "subreddit": "books",
        "body": "I like trains..",
        "time": "2024-01-29 21:52:42 UTC",
        "score": 2,
        "link_id": "t3_1adls5x",
        "parent_id": "t3_1adls5x"
    },
    {
        "comment_id": "ki0etj7",
        "subreddit": "books",
        "body": "I can only foment so much outrage.",
        "time": "2024-01-15 19:43:17 UTC",
        "score": 0,
        "link_id": "t3_1976o66",
        "parent_id": "t1_ki01r9p"
    },
    {
        "comment_id": "khzjuaf",
        "subreddit": "books",
        "body": "This is incorrect…..people hella sit and read whole books / take pictures of cookbooks in book stores. Maybe it’s just a red state thing but I’ve seen them take the books into the coffee shop and read for 5 hours then put the damn book back on the shelf…",
        "time": "2024-01-15 16:53:30 UTC",
        "score": 1,
        "link_id": "t3_1976o66",
        "parent_id": "t1_khymajj"
    },
    {
        "comment_id": "khzjhhu",
        "subreddit": "books",
        "body": "I don’t agree these things are unethical, but fuck man. If someone is that hard up in the grand scheme of things it’s nothing. There are people with millions of dollars not paying taxes stealing from us. Companies that set employees up to never make a living wage and we are morally outraged about someone wearing a dress and returning it… I can’t see it",
        "time": "2024-01-15 16:51:31 UTC",
        "score": 8,
        "link_id": "t3_1976o66",
        "parent_id": "t1_khyh8nk"
    }
]