[
    {
        "comment_id": "lryyczr",
        "subreddit": "books",
        "body": "Oh god its already very scary at the point I'm at haha. And also, how sad a lot of it is, especially after>! the fallout of Danny and Ralphie Glicks deaths.!<",
        "time": "2024-10-15 01:18:31 UTC",
        "score": 3,
        "link_id": "t3_1g3c8ey",
        "parent_id": "t1_lrywkzd"
    },
    {
        "comment_id": "lrywc4u",
        "subreddit": "books",
        "body": "Finished:\n\n**Bookshops & Bonedust, by Travis Baldree**  \nFound the book pretty charming and quite lovely. But due to its predictable plot and boring subplots it left me feeling pretty meh about the whole novel. \n\nStarted: \n\n**Salems Lot, by Stephen King**  \nAt this point I am currently half through the book, and I am enjoying it immensely. The setup of the characters, setting and antagonist so far has been expertly done. Only gripe I have so far is some chapters are just taken over by Stephen King prose and they get so overbearing. But besides that its going really well and I'm just loving the pace of it.",
        "time": "2024-10-15 01:05:46 UTC",
        "score": 4,
        "link_id": "t3_1g3c8ey",
        "parent_id": "t3_1g3c8ey"
    },
    {
        "comment_id": "loyw780",
        "subreddit": "books",
        "body": "I finished and started a few books, so here it goes.\n\nFinished:\n\nDuring the first leg of the month, I finished **The Three-Body Problem**. Overall, I really loved the characters and the whole premise of the three-body theory game. However, I was left quite disappointed at the end, but that hasn’t turned me off from reading the next entry.\n\nI also finished **Dawnshard**, which is the prelude novella for Rhythm of War. It’s a much better novella in comparison to Edgedancer, with a lot more going on and more interesting ideas. However, like Edgedancer, it is fairly weak in the plot department. That said, the character development is really good here.\n\nStarted:\n\nRight after I finished Dawnshard, I jumped straight into **Rhythm of War**. I’m currently only a quarter of the way through, but I will say I am enjoying it a lot more than I did Oathbringer, which I found pretty dry for the majority of the book.\n\nThe last book I started reading was **Bookshops and Bonedust**. I picked this up because I’m part of a buddy read with someone else, and I had kept putting it off due to life getting in the way. I started it a few nights ago, and it has really taken me away. It’s such a cozy read, and the characters are really lovely. I can’t wait to dig into it after work and finish it.",
        "time": "2024-09-26 03:51:24 UTC",
        "score": 3,
        "link_id": "t3_1fngsns",
        "parent_id": "t3_1fngsns"
    },
    {
        "comment_id": "lglidfy",
        "subreddit": "books",
        "body": "Just started reading The Picture of Dorian Gray for a buddy read I’m doing with some friends.",
        "time": "2024-08-05 12:23:38 UTC",
        "score": 3,
        "link_id": "t3_1ekjygp",
        "parent_id": "t3_1ekjygp"
    }
]