[
    {
        "comment_id": "lwmo6r8",
        "subreddit": "books",
        "body": "Oh damn really? I didn't know this book existed. \n\nThe woman is a goddamn storytelling genius as far as I'm concerned. \n\nI'm out aged from the pop music cycle, but during the monotony of the lockdown I got into her double COVID albums and I was impressed. And that's as a wordsmith, a previous editor, a teacher of writing, etc. \n\nLiterally a couple years later I was spending 3k for a 4-day weekend in the  city for her concert and then went to another one in my home country lol.",
        "time": "2024-11-11 19:38:03 UTC",
        "score": 1,
        "link_id": "t3_1gobahd",
        "parent_id": "t3_1gobahd"
    },
    {
        "comment_id": "lwmno9p",
        "subreddit": "books",
        "body": "Hmm You specifically mention older readers, does that mean that you did not have a problem on this when you were younger? \n\nTo be honest I think I've always skipped spatial positioning. I have never found it to be a loss when I skipped it. I mean, it's very rare that understanding the plot is riding on understanding spatial awareness. And if the plot is sitting on that I think they tend to wail at it a lot. \n\nSo yeah I think all my life are pretty much skipped it.",
        "time": "2024-11-11 19:35:26 UTC",
        "score": 3,
        "link_id": "t3_1gp034e",
        "parent_id": "t3_1gp034e"
    },
    {
        "comment_id": "lwmn35t",
        "subreddit": "books",
        "body": "I tried so hard with parable of the sower but I was just bored. I guess my attention span might be getting lower as I'm older because in my past I could read it literally anything. \n\nI tried as hard as I could but there didn't seem to be a plot fast enough for me. \n\n I had to nope out around something about a big house with beautiful windows and a huge TV? And up to that point there didn't seem to be any kind of plot whatsoever. That was as far and as long as I could go.",
        "time": "2024-11-11 19:32:25 UTC",
        "score": 1,
        "link_id": "t3_1go8ntr",
        "parent_id": "t3_1go8ntr"
    }
]