[
    {
        "comment_id": "m02yeso",
        "subreddit": "books",
        "body": "The Other Significant Others by Rhaina Cohen. I enjoyed this exploration of the concept of non- romantic relationships having the ability to be just as powerful as romantic partnerships.",
        "time": "2024-12-02 19:27:41 UTC",
        "score": 1,
        "link_id": "t3_1h4sg6l",
        "parent_id": "t3_1h4sg6l"
    },
    {
        "comment_id": "lycdhy9",
        "subreddit": "books",
        "body": "I dunno about the kids being traumatized (except possibly her own kid who may have been embarrassed by their moms’ behavior) but I know my friend who had to pick up the slack was annoyed.",
        "time": "2024-11-22 01:22:00 UTC",
        "score": 2,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t1_lycb721"
    },
    {
        "comment_id": "ly7eaj6",
        "subreddit": "books",
        "body": "My friend was a parent volunteer on a field trip for one of their kids’ fourth grade class. It was a 1 1/2 hour bus ride to a museum where they broke into small groups each chaperoned by one of the adult volunteers. One of the moms brought along one of the “50 Shades” novels & spent the entire time of the field trip with her nose buried in it. The bus ride there/back AND the museum time— she plopped herself on a bench & never looked up. Her small group ended up tagging along with my friends’ group. She was entirely unselfconscious both of neglecting any attempt at helping and of openly reading soft core porn while chaperoning children.",
        "time": "2024-11-21 04:50:09 UTC",
        "score": 7,
        "link_id": "t3_1gw3qpe",
        "parent_id": "t3_1gw3qpe"
    },
    {
        "comment_id": "lwxvhbm",
        "subreddit": "books",
        "body": "I might be alone in this, but I avoid those “full cast” audio books. The written word (fiction or non fiction) has a different rhythm in my head than actual scripted drama, so hearing cast of different readers/actors perform a novel is just distracting to me.",
        "time": "2024-11-13 16:46:37 UTC",
        "score": 49,
        "link_id": "t3_1gqg5px",
        "parent_id": "t3_1gqg5px"
    },
    {
        "comment_id": "lru44wg",
        "subreddit": "books",
        "body": "You might check out “Hollow Kingdom” by Kira Jane Buxton.",
        "time": "2024-10-14 05:29:03 UTC",
        "score": 1,
        "link_id": "t3_1g36fky",
        "parent_id": "t1_lrtvv6x"
    },
    {
        "comment_id": "lqp4lyn",
        "subreddit": "books",
        "body": "Both Laura Ingalls Wilder & L. M. Montgomery saddened me with the casual classism & racism in their books I didn’t notice as a child.\n\nAnd the Peter character in “Heidi” does not age well— at the very least a control freak with anger issues. Heidi was always walking on eggshells to placate him.",
        "time": "2024-10-06 23:34:05 UTC",
        "score": 15,
        "link_id": "t3_1fxo060",
        "parent_id": "t3_1fxo060"
    },
    {
        "comment_id": "lpp9lx1",
        "subreddit": "books",
        "body": "In the realm of biography/autobiography/memoir I can recommend a classic called “The Curve of Time” by Muriel Wylie Blanchet. It’s about a woman, widowed in the 30’s, who packed her 5 kids into a boat & spent summers cruising the waters around British Columbia. It was an idyllic life— swimming & fishing & hiking but also inspiring that she embraced such an undertaking with a can do spirit, especially given the pressures against women at the time. A bit bittersweet for me as I grew up in the area and so much of that wilderness is forever changed.",
        "time": "2024-09-30 19:56:34 UTC",
        "score": 1,
        "link_id": "t3_1fsnypx",
        "parent_id": "t3_1fsnypx"
    },
    {
        "comment_id": "lpp7vbh",
        "subreddit": "books",
        "body": "Recently while rereading The Hobbit I got curious. Bout “seedy cake” (in the beginning there’s a reference to Bilbo having one put aside for his tea). So I googled it & found an (I think NY Times recipe?) for Bilbo’s seedy cake. And I can recommend it as an addition to your selection of cheeses!",
        "time": "2024-09-30 19:47:51 UTC",
        "score": 2,
        "link_id": "t3_1fsnypx",
        "parent_id": "t1_lpmpek8"
    },
    {
        "comment_id": "lpp6brp",
        "subreddit": "books",
        "body": "Did you know that Colleen McCollough lifted the plot from “The Blue Castle” and wrote a sort of feminist themed version of the story set in Australia? It’s called “The Ladies of Missalonghi” and it’s actually pretty enjoyable too!",
        "time": "2024-09-30 19:39:53 UTC",
        "score": 11,
        "link_id": "t3_1fsnypx",
        "parent_id": "t1_lpmu6wc"
    },
    {
        "comment_id": "lji7tlf",
        "subreddit": "books",
        "body": "Thanks, that gives me a way to frame it that is more tolerable. I went into watching the movie with almost zero knowledge of it except seeing the poster(a happy man dancing!) and having heard the soundtrack as a child. And I think it won some prestigious awards? It’s been years since I watched it but what I vaguely remember my impression was it was one of those “repressed British man goes to Greece & learns to let his hair down” plots, but then there was the poor woman who he pesters til she caves in to his advances with dire consequences (for her.) And it did shock me and piss me off because it seemed like for him it was just a vacation fling.",
        "time": "2024-08-23 06:18:01 UTC",
        "score": 6,
        "link_id": "t3_1ez3xip",
        "parent_id": "t1_lji6u1q"
    },
    {
        "comment_id": "ljhyckj",
        "subreddit": "books",
        "body": "Omg. I watched the movie & had the same reaction. It was touted as being full of “the joy of life” but it was horrific— the poor woman who was the… love interest? Is basically stalked & hounded & ultimately STONED TO DEATH with even the village priest turning his back and the men are just like “oh well.”",
        "time": "2024-08-23 04:48:21 UTC",
        "score": -5,
        "link_id": "t3_1ez3xip",
        "parent_id": "t3_1ez3xip"
    },
    {
        "comment_id": "lil6mde",
        "subreddit": "books",
        "body": "Aleutian Sparrow by Karen Hesse\nThis one is about an extremely little known part of WW2 history— the forced relocation of Aleutian people. I grew up in the SE Alaskan town where many of these people were sent (lived literally a few miles from where they were housed) and never knew about these events until I read this heartbreaking story. \n\nAuthor Hill Kirkpatrick (especially the “Bo” books— Bo at Ballard Creek & Bo at Iditarod Creek)\nThis author was born in Alaska and her love for the place and its people shines through. Interesting details about life in the early days along with fabulous characters that capture the quirky, rugged individualist nature of Alaskans.\n\nAuthor Dana Stabenow’s Kate Shugack series. Just good thriller/mysteries set in Alaska that do a good job of being fairly accurate about the life there.",
        "time": "2024-08-17 16:54:29 UTC",
        "score": 4,
        "link_id": "t3_1eueh5l",
        "parent_id": "t3_1eueh5l"
    },
    {
        "comment_id": "lh6grlm",
        "subreddit": "books",
        "body": "Years ago at a used book sale I bought a book called Sanna, Sorceress Apprentice by Roxanna Mathews. I’m pretty sure it was vanity published? But, it turned out to be quite an enjoyable read. With some effort I was able to find the succeeding books in the Sanna series. From time to time I look it up to with the thought of buying them as a gift for my friends’ daughter (they make a good feminine version of a Harry Potteressque story line of the training of a young person in a magic school). It’s touch & go finding copies on eBay. I don’t think they’re in print still so it’s all used copies. And sometimes the price goes really high! I think this would be an example of how even good books fizzle if they don’t get promoted. I wistfully wish/hope the author might pick up her pen again. I enjoyed the characters and would like to follow them more!",
        "time": "2024-08-08 21:49:58 UTC",
        "score": 10,
        "link_id": "t3_1enfwgk",
        "parent_id": "t3_1enfwgk"
    },
    {
        "comment_id": "lbpdght",
        "subreddit": "books",
        "body": "Back in the days when there were such things as phone books, I used to say if Georgette Heyer wrote a phone book, I’d read it (and probably live it!) She had an elegant, witty turn of phrase. I am not otherwise a romance reader, but the characters & dialogue in her stories transcend the genre.",
        "time": "2024-07-05 05:38:20 UTC",
        "score": 5,
        "link_id": "t3_1dvkjmy",
        "parent_id": "t3_1dvkjmy"
    },
    {
        "comment_id": "lb8wrcx",
        "subreddit": "books",
        "body": "The Vorkisigan Saga by Lois McMaster Bujold is a space opera that has both serious & quite humorous aspects.",
        "time": "2024-07-02 06:11:33 UTC",
        "score": 1,
        "link_id": "t3_1dqg0vm",
        "parent_id": "t1_latd1zy"
    },
    {
        "comment_id": "lb8w77w",
        "subreddit": "books",
        "body": "Recommended this already but Hollow Kingdom. Main character is a talking crow. Set in a post apocalyptic Seattle.",
        "time": "2024-07-02 06:05:43 UTC",
        "score": 2,
        "link_id": "t3_1dqg0vm",
        "parent_id": "t1_latnfjr"
    },
    {
        "comment_id": "lb8vp1k",
        "subreddit": "books",
        "body": "Hollow Kingdom by Kira Jane Buxton is unique in that it has a talking crow for a main character. Set in a post apocalyptic Seattle.",
        "time": "2024-07-02 06:00:29 UTC",
        "score": 3,
        "link_id": "t3_1dqg0vm",
        "parent_id": "t1_lb7gnjl"
    },
    {
        "comment_id": "l6ujgmh",
        "subreddit": "books",
        "body": "I have a Little Free Library. A few years ago my neighbors three houses down were moving & had a garage sale (I didn’t stop at it). Afterwards, they put all the unsold stuff out in the curb in “free” piles. I was walking past & noticed in their leftover-from-garage-sale free piles many many children’s books they had gotten from my LFL over the years they lived there. They could not be bothered to walk three houses down to return them. Happily, most people are not so lame. Having a Little Free library has definitely been an exercise in learning to let go with no attachments!",
        "time": "2024-06-03 01:16:54 UTC",
        "score": 5,
        "link_id": "t3_1d6c6ap",
        "parent_id": "t3_1d6c6ap"
    },
    {
        "comment_id": "l58m473",
        "subreddit": "books",
        "body": "The Wind in the Willows. I don’t love anthropomorphic animals in general. And Mr. Toad in particular.",
        "time": "2024-05-22 22:23:42 UTC",
        "score": 0,
        "link_id": "t3_1cy9x3p",
        "parent_id": "t3_1cy9x3p"
    },
    {
        "comment_id": "l54vqku",
        "subreddit": "books",
        "body": "I will just say that in the U.S. at least, there seems to be a reluctance in film to venture away from formulas that have a proven commercially successful track record. Probably at least in part because of how expensive they are to make. The publishing world labors under this somewhat, but there are so many more small publishers that there’s just far more chance that they will produce something truly fresh and unique.",
        "time": "2024-05-22 06:28:37 UTC",
        "score": 6,
        "link_id": "t3_1cxnppb",
        "parent_id": "t3_1cxnppb"
    },
    {
        "comment_id": "l3vfqqz",
        "subreddit": "books",
        "body": "Just finished “Very Bad Deaths” by Spider Robinson. Thumbs up! Suspenseful yet funny. It’s a quick read, but it introduced a truly unique character in a novel way. Plus, it’s set in the Pacific Northwest (where I live) so I enjoyed the familiar references.",
        "time": "2024-05-13 16:46:49 UTC",
        "score": 2,
        "link_id": "t3_1cqvjjz",
        "parent_id": "t3_1cqvjjz"
    },
    {
        "comment_id": "l2ws5xg",
        "subreddit": "books",
        "body": "Oh, also, I read an autobiography of Tony Hillerman years ago & I recall being overall impressed with him. He’s one of those humble men who downplay all that they accomplished.",
        "time": "2024-05-07 00:23:44 UTC",
        "score": 1,
        "link_id": "t3_1cly10u",
        "parent_id": "t3_1cly10u"
    },
    {
        "comment_id": "l2wrwkc",
        "subreddit": "books",
        "body": "I like autobiographies & learning about people so even though I don’t really listen to her music, I read Celine Dion’s autobiography & I must say, she comes across as a nice person.",
        "time": "2024-05-07 00:21:57 UTC",
        "score": 1,
        "link_id": "t3_1cly10u",
        "parent_id": "t3_1cly10u"
    },
    {
        "comment_id": "l1ta4rh",
        "subreddit": "books",
        "body": "I got “Midnight Cowboy” from the library & read it when I was 12. I wrote a book report on it. My language arts teacher took me aside & very gently had a conversation with me, the gist of which being I could stop reading a book if it was upsetting. It was the most genuine interaction I ever had with a teacher.",
        "time": "2024-04-29 17:14:52 UTC",
        "score": 399,
        "link_id": "t3_1cg3ztu",
        "parent_id": "t3_1cg3ztu"
    },
    {
        "comment_id": "l19cjly",
        "subreddit": "books",
        "body": "Some of Tamora Pierce’s book were done full cast, and I didn’t like it. I wanted/expected to but it just didn’t work for me. Partly because following all the different character voices was distracting. Partly because they produced it like it was a dramatic play. I prefer books (read aloud) to be books & drama is different from that. Just my opinion.",
        "time": "2024-04-25 21:40:06 UTC",
        "score": 2,
        "link_id": "t3_1cd1f13",
        "parent_id": "t1_l194bim"
    },
    {
        "comment_id": "l0y0ug2",
        "subreddit": "books",
        "body": "Many years ago I worked at a Waldenbooks. There were regular customers who bought romance novels; the publishers brought out new books in each line every month & the readers would come in on the day the books were delivered & literally stand over me tapping their feet with impatience as I opened the boxes! \nOne of the hard aspects of the job (for me) was the waste. We had to strip the covers & first 20 or so pages off the mass market paperbacks before throwing them away (to prevent dumpster divers from retrieving them.) often we stripped/threw away books as soon as we unpacked them because our store was on the smaller side & the corporation sent the same amount of books to all stores or something. They’d also do these random “rebranding” pushes where they’d change all the shelving & stuff in the store & just throw all the old stuff away. \nOne of the sadder experiences I had was the mall where my store was had one of those Christmas “giving trees” covered in tags that have the age/gender of a kid & people could take the tag & buy some Christmas gifts. So a young college aged woman came in, & she had chosen the tag for a 13 y/o boy. And she was so excited because although she was herself on a tight budget, she wanted to share her love a reading with a young person. She spent  long time thoughtfully picking a stack of books including classics like Tom Sawyer plus books she had loved herself. When Christmas had passed, I happened to be working the day a young kid came in seeking to return all the books for cash.💔 At least the gift giver never knew & it gave her a lot of joy imagining she was maybe starting someone on a path to love reading.",
        "time": "2024-04-23 20:37:48 UTC",
        "score": 6,
        "link_id": "t3_1cbdcfh",
        "parent_id": "t3_1cbdcfh"
    },
    {
        "comment_id": "kr1xtu4",
        "subreddit": "books",
        "body": "I’m probably alone here because it’s really popular, but “Wildwood” by Colin Meloy. I really wanted to like it, but I just can’t with the anthropomorphized animals that act just like people.",
        "time": "2024-02-18 22:24:33 UTC",
        "score": 1,
        "link_id": "t3_1au2dkv",
        "parent_id": "t3_1au2dkv"
    },
    {
        "comment_id": "kr1wi4k",
        "subreddit": "books",
        "body": "And the hair. My lord, the hair! I gave up early on once the plots got co-opted by the sex, but I recall every male character having like hair down to their ass and couldn’t help but picture it getting in the way during all those acrobatic, slippery orgies.",
        "time": "2024-02-18 22:16:20 UTC",
        "score": 20,
        "link_id": "t3_1au2dkv",
        "parent_id": "t1_kr1cmp2"
    },
    {
        "comment_id": "kq188wz",
        "subreddit": "books",
        "body": "I would LOVE to send fan mail to the authors that bring me joy with their writing. My problem is, electronic communication feels like sending something out into a void with no guarantee it will actually be seen by the intended recipient. Plus just typing something & hitting send doesn’t leave much scope for personal embellishments. I’m old school enough to love snail mail, yet these days I have no idea how one locates an actual mailing address for an author. Thoughts?",
        "time": "2024-02-12 03:32:10 UTC",
        "score": 2,
        "link_id": "t3_1ao53e3",
        "parent_id": "t3_1ao53e3"
    },
    {
        "comment_id": "kjfj3e1",
        "subreddit": "books",
        "body": "I’m not usually observant enough to spot an Easter egg in a movie, but I was so excited when I saw a copy of the Lorax in one of the school room scenes in the first “Avatar” movie.",
        "time": "2024-01-25 00:34:01 UTC",
        "score": 4,
        "link_id": "t3_19eqaqb",
        "parent_id": "t3_19eqaqb"
    },
    {
        "comment_id": "kiv5ttr",
        "subreddit": "books",
        "body": "You might look at the Jane Hissey books; one is called Little Bears’ Trousers. Beautifully illustrated though I don’t recall the stories lining up with what you’ve described.",
        "time": "2024-01-21 08:30:18 UTC",
        "score": 1,
        "link_id": "t3_19byne0",
        "parent_id": "t3_19byne0"
    },
    {
        "comment_id": "kict4gb",
        "subreddit": "books",
        "body": "Lately I just can’t with a character who drinks heavily/constantly. Like they’re facing some challenging problem, they haven’t slept in 24 hours, but when they get home instead of resting they drink half a bottle of rye. I guess it’s supposed to signal how gritty & complex they are? But it’s just boring. It would be really refreshing to have some characters with healthy work/life balances for a change.",
        "time": "2024-01-17 23:18:39 UTC",
        "score": 1,
        "link_id": "t3_1999kv2",
        "parent_id": "t3_1999kv2"
    },
    {
        "comment_id": "ki2x6j9",
        "subreddit": "books",
        "body": "This year I took a page from the Norwegians & started celebrating Jolabokaflod. It’s a Christmas Eve tradition of giving books as gifts & then spending the evening with hot drinks reading. I passed along several of my books that I had  enjoyed to friends & family.",
        "time": "2024-01-16 04:37:19 UTC",
        "score": 2,
        "link_id": "t3_197mgwb",
        "parent_id": "t3_197mgwb"
    },
    {
        "comment_id": "khu8qxp",
        "subreddit": "books",
        "body": "Arctic Sparrow; very short, simple book but it recounts how the U.S. forcibly displaced Aleutian islanders during WW2. I grew up in the town in SE Alaska where they had been relocated/interned & never knew that had happened.",
        "time": "2024-01-14 17:33:03 UTC",
        "score": 4,
        "link_id": "t3_196jz6j",
        "parent_id": "t3_196jz6j"
    },
    {
        "comment_id": "khhk6s7",
        "subreddit": "books",
        "body": "I have one and it’s been tons of fun. I went to a salvage store & bought an old cupboard, put a roof in it & mounted it in the fence in front of my home. Pretty basic! If you go to the LittleFreeLibrary.org website, I think they have pictures of libraries from all over the world— people have been amazingly creative in what they build. My hometown in Alaska has a steampunk one made from an old water tank (they gave a Facebook page, google steampunk little free library). I have seen them made out of repurposed fridges, ovens, newspaper stands, you name it. There are free plans on line if you google. Really the sky (& your imagination) is the limit!",
        "time": "2024-01-12 07:22:52 UTC",
        "score": 1,
        "link_id": "t3_193odca",
        "parent_id": "t3_193odca"
    },
    {
        "comment_id": "kg8pbe8",
        "subreddit": "books",
        "body": "The Irish R.M. By Somerville & Ross; it’s an old one, and maybe out of print. But the humor is timeless.",
        "time": "2024-01-04 05:33:46 UTC",
        "score": 1,
        "link_id": "t3_18y3c28",
        "parent_id": "t3_18y3c28"
    },
    {
        "comment_id": "kg7wfnw",
        "subreddit": "books",
        "body": "Hollow Kingdom by Kira Jane Buxton",
        "time": "2024-01-04 02:04:04 UTC",
        "score": 2,
        "link_id": "t3_18y135p",
        "parent_id": "t3_18y135p"
    },
    {
        "comment_id": "kc1977a",
        "subreddit": "books",
        "body": "Finished: \nHow to Know a Person by David Brooks\nThe author makes a case for the vital importance of creating more intimacy between people, and lays out a path for working towards that. I found the book hopeful & inspiring; I think I will read it again more slowly to get a deeper understanding.",
        "time": "2023-12-05 01:10:32 UTC",
        "score": 3,
        "link_id": "t3_18ahu9m",
        "parent_id": "t3_18ahu9m"
    },
    {
        "comment_id": "kbhyei1",
        "subreddit": "books",
        "body": "I love this book and only wish the author would churn out more!",
        "time": "2023-12-01 03:10:25 UTC",
        "score": 3,
        "link_id": "t3_1880igz",
        "parent_id": "t3_1880igz"
    },
    {
        "comment_id": "k9yxxh1",
        "subreddit": "books",
        "body": "That trope where someone looks at a portrait or photograph and is able to extrapolate accurately all sorts of details about the subjects life/personality. Maybe I’m stupid, but the best I can come up with when I look at a picture of someone I don’t know is “they look sorta nice” or “he looks grumpy”. But in novels they are always like finding an old picture and instantly realizing all sorts of behaviors & motivations that affect present day events. And don’t even get me started on books where they see something in a photo that somehow no one else has ever noticed. Ex: that Nicolas Sparks “Bridges of Madison County” where she looks at a photo of the guy in National Geographic magazine with a magnifying lens and sees he’s still wearing the necklace he got from his lover so she knows he never stopped loving her. Gag!",
        "time": "2023-11-20 02:41:08 UTC",
        "score": 5,
        "link_id": "t3_17yivfo",
        "parent_id": "t3_17yivfo"
    },
    {
        "comment_id": "k95k7vt",
        "subreddit": "books",
        "body": "What a great idea. I want this option for all fiction.",
        "time": "2023-11-14 01:48:45 UTC",
        "score": 8,
        "link_id": "t3_17uqmej",
        "parent_id": "t3_17uqmej"
    },
    {
        "comment_id": "k9001fj",
        "subreddit": "books",
        "body": "It’s been a looooong time since I read AnneMcCaffrey’s  “Dragon Riders of Pern”, but the main character Lessa spends 10+ years hiding from the raiders who took over her hone & killed her family by living in a kennel & not bathing. When she is rescued, there’s a scene where she has the first bath she’s permitted herself in all that time, and it’s deeply satisfying— as is the reaction of the people who see her after & don’t recognize her.",
        "time": "2023-11-13 00:03:13 UTC",
        "score": 8,
        "link_id": "t3_17tp4od",
        "parent_id": "t3_17tp4od"
    },
    {
        "comment_id": "k6w93b7",
        "subreddit": "books",
        "body": "Okay then; for a completely different setting see if you can find Dana Stabenows’ Kate Shugak series. They are set in my home state of Alaska; I think the reason Harpers’ books were so frightening to me was the descriptions of the heat. (esp. in “The Lost Man”)",
        "time": "2023-10-29 00:51:54 UTC",
        "score": 1,
        "link_id": "t3_17hk2y0",
        "parent_id": "t1_k6w4bv9"
    },
    {
        "comment_id": "k6slypp",
        "subreddit": "books",
        "body": "The Jealousy Man and Other Stories by Jo Nesbo; so dark!",
        "time": "2023-10-28 08:23:49 UTC",
        "score": 2,
        "link_id": "t3_17hk2y0",
        "parent_id": "t1_k6s7ej1"
    },
    {
        "comment_id": "k6slgm2",
        "subreddit": "books",
        "body": "Where do you live? I’m American & I’ve just been reading mysteries by Jane Harper. Her stories are all set in Australia so for me, in addition to great, suspenseful plots there’s the added interest of the setting & culture being (if you’ll excuse the pun) novel.",
        "time": "2023-10-28 08:16:48 UTC",
        "score": 2,
        "link_id": "t3_17hk2y0",
        "parent_id": "t1_k6rzfam"
    },
    {
        "comment_id": "k6r85o7",
        "subreddit": "books",
        "body": "I hope they never referenced Puyallup! I had a professor in college who had a doctorate in linguistics; his pronunciation of “Puyallup” was hysterical yet he argued with me when I (PNW born & bred) tried to correct him.",
        "time": "2023-10-28 00:18:57 UTC",
        "score": 5,
        "link_id": "t3_17hu6eg",
        "parent_id": "t1_k6q3c8p"
    },
    {
        "comment_id": "k6pxt55",
        "subreddit": "books",
        "body": "I’m currently listening to books by Jane Harper (highly recommend!) and it could just be the difference between how American English is pronounced vs. Australian, but the word “Skeletal” is said “skel -E-tal” (I think) instead of how I hear it in my mind: “skel-eh-tal”. Takes me aback!\nAlso recently revisited (in audio) books I loved as a child & was bemused when several names of people & places were pronounced WAY differently than I had been hearing them in my head all my life: the Prydain Chronicles by Lloyd Alexander was a big one. My internal pronounciation of pretty much all the names in those books was completely different from how the sound in the audio.",
        "time": "2023-10-27 19:05:08 UTC",
        "score": 5,
        "link_id": "t3_17hu6eg",
        "parent_id": "t3_17hu6eg"
    },
    {
        "comment_id": "k4ig7ch",
        "subreddit": "books",
        "body": "Not sure if this fits, but I hate hate hate when a book has no overview, only a series of reviews from other people/publications. “3 stars from the Boston Globe”; “a real page turner”; “I couldn’t put it down”. Does anyone decide to read a book based on a random sampling of reviews printed on the cover?",
        "time": "2023-10-12 02:57:06 UTC",
        "score": 519,
        "link_id": "t3_175w76l",
        "parent_id": "t3_175w76l"
    },
    {
        "comment_id": "k47ddhw",
        "subreddit": "books",
        "body": "Not to mention all that long hair…",
        "time": "2023-10-09 23:49:49 UTC",
        "score": 1,
        "link_id": "t3_173pz3j",
        "parent_id": "t1_k47b1sk"
    },
    {
        "comment_id": "jwm6bfe",
        "subreddit": "books",
        "body": "Where I live, we have Little Free Libraries all over town. I have asked my surrogate “kids” (I was their nanny til they grew up) to distribute my collection to the Little Libraries. I love thinking of them doing this for me, and of my books being someone’s lucky “find” in the future.",
        "time": "2023-08-17 19:02:40 UTC",
        "score": 4,
        "link_id": "t3_15tre6w",
        "parent_id": "t3_15tre6w"
    },
    {
        "comment_id": "jwiepom",
        "subreddit": "books",
        "body": "Every few years I reread “The Wheel on the School” by Meindert DeJong. It’s so uplifting, with laugh out loud funny parts. It’s about a little girl who starts to wonder why there are no storks nesting on her roof when her grandma tells her they used to. And about how one person with a passionate idea can move a whole community to action.",
        "time": "2023-08-17 00:36:46 UTC",
        "score": 1,
        "link_id": "t3_15so4gt",
        "parent_id": "t3_15so4gt"
    },
    {
        "comment_id": "jw83n0l",
        "subreddit": "books",
        "body": "I recently recommended a series I loved as a child to a friend & decided to revisit it by listening. It’s The Chronicles of Prydain by Lloyd Alexander. Come to find out, all these years I’ve been mispronouncing LOTS of the names & place names in my head! And, because they’ve lived that way in my imagination since reading them as a child, even now they still seem like the “right” pronunciations.",
        "time": "2023-08-15 01:22:43 UTC",
        "score": 5,
        "link_id": "t3_15rbyma",
        "parent_id": "t3_15rbyma"
    },
    {
        "comment_id": "ju9yz1p",
        "subreddit": "books",
        "body": "I grew up in a small town in SE Alaska. Well into adulthood I read a novel called “Aleutian Sparrow.” From it I learned that Native Alaskans had been forcibly relocated from their homes in the Aleutian Islands during WW 2 & forced into what was basically internment in a park on the outskirts of MY HOMETOWN. Many died due to being completely unaccustomed to the climate & food & the fact that they were treated like shit. After the end of the war they were not returned to their homes or compensated. I learned nothing if this from school or even local oral history. I spent a lot of time at the park where they had been kept & there wasn’t a trace they’d ever been there. Learning (from the book) about it made me sad. Realizing how completely it had been ignored outraged me.",
        "time": "2023-08-01 00:05:22 UTC",
        "score": 20,
        "link_id": "t3_15equxf",
        "parent_id": "t1_ju9gtat"
    },
    {
        "comment_id": "ju1ghyp",
        "subreddit": "books",
        "body": "I NEVER used to not finish a book; even if I hated it, I was compelled to finish. One of the surprising aspects of getting older for me has been that I’ve  \nBecome really comfortable with putting a book down if it isn’t fully engaging me. Perhaps I accumulated enough regret from all the past books that left me feeling like I’d wasted my time. Part of it is that daily life throws enough stress I don’t need to seek out more in my entertainment. Especially when it’s a book with unlikeable characters. Who wants to spend time with unpleasant people?",
        "time": "2023-07-30 05:40:08 UTC",
        "score": 2,
        "link_id": "t3_15d0x74",
        "parent_id": "t3_15d0x74"
    },
    {
        "comment_id": "jjagdis",
        "subreddit": "books",
        "body": "Georgette Heyer— her novels aren’t highbrow, but she could turn a phrase to make one laugh out loud!",
        "time": "2023-05-08 02:39:16 UTC",
        "score": 1,
        "link_id": "t3_13a9mau",
        "parent_id": "t3_13a9mau"
    },
    {
        "comment_id": "jgqjs7l",
        "subreddit": "books",
        "body": "Never finished it; by the time I returned stateside I’d forgotten the author & still had enough residual resentment about being left hanging I didn’t care to try & find it. Plus, there were enough convoluted plot lines I suspected it was going to turn out to be a lengthy series. I remember enough of it to still wonder from time to time how it all resolved. I don’t mind a series, but I prefer it to be a choice I go into with my eyes open rather than being sort of tricked into it.",
        "time": "2023-04-18 12:33:01 UTC",
        "score": 3,
        "link_id": "t3_12lfiio",
        "parent_id": "t1_jgaau0d"
    },
    {
        "comment_id": "jg6mnmf",
        "subreddit": "books",
        "body": "Years ago I was a Peace Corps volunteer. I had a very strict weight limit for what I could take & I knew it would be difficult/impossible to get books once I was in my service country. So I made a supreme effort to be extremely mindful of the books that made the cut to go along. The first novel I dived into to distract me from homesickness & privation had an extremely convoluted plot with lots of characters. As I got closer & closer to the end I started wondering how on earth the author was going to tie up all the many threads in the few chapters remaining; with a sickening suspicion I leafed to the end & discovered the dreaded phrase: “ To Be Continued”. It was the most frustrating moment, and it could have been averted if the cover had clearly indicated this was the start of a series.",
        "time": "2023-04-14 03:17:33 UTC",
        "score": 142,
        "link_id": "t3_12lfiio",
        "parent_id": "t3_12lfiio"
    },
    {
        "comment_id": "jfs4ws2",
        "subreddit": "books",
        "body": "Don’t know of a specific book, but the author Taylor Caldwell was huge back in like the 70s I think? All my older relatives’ shelves were packed with her books.",
        "time": "2023-04-11 02:45:44 UTC",
        "score": 5,
        "link_id": "t3_12i31vs",
        "parent_id": "t3_12i31vs"
    },
    {
        "comment_id": "jf09g8r",
        "subreddit": "books",
        "body": "I read John Denver’s autobiography. Went from being a fan to not so much. For a guy who sang so beautifully about peace & love, he was quite a jerk— especially to women. And such a whiner. Moaned on about the infidelity of his second wife but his own promiscuous behavior during his first marriage was somehow ok. I’ve come to see he was a product of his times, so I can give him some grace. I still think his voice was beautiful.",
        "time": "2023-04-05 03:14:21 UTC",
        "score": 5,
        "link_id": "t3_12bs6sk",
        "parent_id": "t3_12bs6sk"
    },
    {
        "comment_id": "je5h6rt",
        "subreddit": "books",
        "body": "Where I live so many people have Little Free Libraries set up. Check the LittleFreeLibrary.org site to see if there’s any near you. If you find a book in one that you don’t think you’ll read again, make sure to “throw it back” for someone else. Also, you might check out bookcrossing.com. Some members of that are willing to share books and I believe the site also has a listing of where people have set up bookcrossing release spots.",
        "time": "2023-03-29 15:36:52 UTC",
        "score": 10,
        "link_id": "t3_125r8cf",
        "parent_id": "t3_125r8cf"
    },
    {
        "comment_id": "jdblopf",
        "subreddit": "books",
        "body": "Ghosts I have been by Richard Peck?",
        "time": "2023-03-23 05:49:50 UTC",
        "score": 1,
        "link_id": "t3_11za3gw",
        "parent_id": "t3_11za3gw"
    },
    {
        "comment_id": "jcjcl0f",
        "subreddit": "books",
        "body": "Like many here I picked it up with high hopes. Found it to be very weak. Even the mythological aspects of it were poorly and shallowly researched & written. The characters were too stereotypical & improbable to even reach the level of dislike for me.",
        "time": "2023-03-17 06:47:58 UTC",
        "score": 2,
        "link_id": "t3_11t8fui",
        "parent_id": "t3_11t8fui"
    },
    {
        "comment_id": "jbpjm2g",
        "subreddit": "books",
        "body": "Loved this book. Recommending it to my Bookclub. One of the things I’ve been thinking about since reading it was about how algorithms push users down negative paths because it was found that negative feelings trigger people to stay online longer. I really wonder how different a place the world would be if algorithms had been designed to steer people in more positive directions instead.",
        "time": "2023-03-10 18:59:50 UTC",
        "score": 7,
        "link_id": "t3_11njg19",
        "parent_id": "t3_11njg19"
    },
    {
        "comment_id": "jbm8lrs",
        "subreddit": "books",
        "body": "Sadly, gotta agree. I didn’t hate it, but I was hoping for so much more. And I really wasn’t looking for a romance novel.",
        "time": "2023-03-10 01:18:05 UTC",
        "score": 12,
        "link_id": "t3_11n3hoz",
        "parent_id": "t3_11n3hoz"
    },
    {
        "comment_id": "jbhjvq0",
        "subreddit": "books",
        "body": "Not that I ever heard; but she published it nearly 100 years after L.M. Montgomery’s book so maybe copyright laws were expired?",
        "time": "2023-03-09 02:13:36 UTC",
        "score": 1,
        "link_id": "t3_11m9anl",
        "parent_id": "t3_11m9anl"
    },
    {
        "comment_id": "jbh992o",
        "subreddit": "books",
        "body": "Been in here before mentioning this: Colleen McCollough published a story (novelette?) called “The Ladies of Missalonghi” that is almost straight up “The Blue Castle” set in Australia.",
        "time": "2023-03-09 00:54:10 UTC",
        "score": 3,
        "link_id": "t3_11m9anl",
        "parent_id": "t3_11m9anl"
    },
    {
        "comment_id": "jakhs4z",
        "subreddit": "books",
        "body": "LittleFreeLibrary.org site allows you to enter your postal code to see a map showing any Little Free Libraries near you. Always fun to see what treasures you might discover (and you can pass on books you’re done with too)",
        "time": "2023-03-02 01:56:34 UTC",
        "score": 1,
        "link_id": "t3_11fft52",
        "parent_id": "t3_11fft52"
    },
    {
        "comment_id": "j9qxhqe",
        "subreddit": "books",
        "body": "If you ever feel the need to punish yourself, find a book by Barbara Cartland. She published about a million romance novels & in her day was immensely popular. But she signaled the fragile femininity of her female characters by lacing EVERY sentence they spoke with ellipses! Back when I enjoyed the occasional escape of a romance, I never made it through one of hers!",
        "time": "2023-02-23 22:45:14 UTC",
        "score": 1,
        "link_id": "t3_11a0x9m",
        "parent_id": "t3_11a0x9m"
    },
    {
        "comment_id": "j9506iz",
        "subreddit": "books",
        "body": "Or vice versa when the child character talks like no child of that age would ever talk. I’m reading one now that’s supposed to be excerpts from a teen age girls diary & it is SO profound & full of deep, philosophical reflections. Maybe I’m cynical, but not many average, suburban kids I have ever been around express themselves like that.",
        "time": "2023-02-19 07:41:49 UTC",
        "score": 4,
        "link_id": "t3_115kw3z",
        "parent_id": "t1_j94vwp4"
    },
    {
        "comment_id": "j2ftxf7",
        "subreddit": "books",
        "body": "I loved Flavia de Luce in “Sweetness at the Bottom of the Pie”.",
        "time": "2022-12-31 23:32:09 UTC",
        "score": 1,
        "link_id": "t3_100638l",
        "parent_id": "t3_100638l"
    },
    {
        "comment_id": "j27ok16",
        "subreddit": "books",
        "body": "I recently took a stab at reading the original “Pinocchio” novel. Felt like I knew it because, you know, the story seems to be referenced so often in kids books & movies. But oh, man. It’s dark. So dark.",
        "time": "2022-12-30 06:02:11 UTC",
        "score": 2,
        "link_id": "t3_zyo1a7",
        "parent_id": "t3_zyo1a7"
    },
    {
        "comment_id": "j2140ly",
        "subreddit": "books",
        "body": "What do you all think of “full cast” audio books? Personally, I don’t like them. I prefer one narrator/reader. Full cast is one of those things that seemed like a good idea, but in actuality it’s unpleasant/difficult to listen to.",
        "time": "2022-12-28 22:11:08 UTC",
        "score": 25,
        "link_id": "t3_zxjpu7",
        "parent_id": "t3_zxjpu7"
    },
    {
        "comment_id": "j1o4sho",
        "subreddit": "books",
        "body": "“the Ladies of Missalonghi” by Colleen McCollough borrows a lot of elements from “Blue Castle” & sets it in Australia. An enjoyable read if you’re able to find a copy.",
        "time": "2022-12-26 00:43:41 UTC",
        "score": 1,
        "link_id": "t3_zv98kq",
        "parent_id": "t3_zv98kq"
    },
    {
        "comment_id": "ixkgxwh",
        "subreddit": "books",
        "body": "Omg. I read this book for the first time just a year or so ago. Overall I enjoyed it, but there was one thing that hit a jarring note for me. I know partly due to reading it through the lens of modern sensibilities. But perhaps the rest of you can give me your feedback: that boy she becomes friends with ( I think he’s a goat herd?) seemed verging on mean & I recall feeling disturbed by the way she tip toed around his moods and in her cheerful way did & said things to appease/placate him. Am I hypersensitive or was there an undercurrent of violence in his attitudes? It’s been a while, so I can’t bring up anything specific. But it did color my overall enjoyment of the story. I wrote it off as reflective of the mores of the times. Did anyone else pick this up?",
        "time": "2022-11-24 02:51:34 UTC",
        "score": 0,
        "link_id": "t3_z2qxi1",
        "parent_id": "t3_z2qxi1"
    },
    {
        "comment_id": "ixdj2p5",
        "subreddit": "books",
        "body": "Colleen McCollough published a short novel called “The Ladies of Missalonghi”. I think it came out in the 1980’s? The plot is almost a straight ripoff of “The Blue Castle” but set in the Australian Outback. It was actually pretty good, I enjoyed it. But, it definitely whiffed of plagiarism. \nThat said, my favorite of Montgomery’s short stories was the one where the big family had the one brother who had stayed home on the farm & all the other siblings had gone out in the world & become successful. He overheard one of the relatives at a reunion saying he was a failure. But then all the successful siblings share stories of how he was responsible for their success. I loved that one.",
        "time": "2022-11-22 17:07:22 UTC",
        "score": 12,
        "link_id": "t3_z1xd5z",
        "parent_id": "t1_ixdavst"
    },
    {
        "comment_id": "iv2lul8",
        "subreddit": "books",
        "body": "Just recommended this series in an earlier thread: the Dr. Siri Paiboun mysteries by Collin Cotterill taught me so much about Laotian history & culture. I really knew very little about the region & would have continued in ignorance left to my own devices. But these books really captivated me!",
        "time": "2022-11-04 20:24:00 UTC",
        "score": 10,
        "link_id": "t3_ym8cbn",
        "parent_id": "t3_ym8cbn"
    },
    {
        "comment_id": "iukxtir",
        "subreddit": "books",
        "body": "I read it last year & was taken aback by how many of the issues he delved into (racism comes to mind) are still as powerfully impacting our country now. The other thing that made an impression was that pre-fab trailer homes were a new thing then, and the charming enthusiasm people welcomed them with.",
        "time": "2022-11-01 02:51:28 UTC",
        "score": 2,
        "link_id": "t3_yil466",
        "parent_id": "t3_yil466"
    },
    {
        "comment_id": "iuebfyx",
        "subreddit": "books",
        "body": "Omg, thank you for this question. I was all in my head wondering if I’m just getting prudish but I’m so done with detailed sex scenes co-opting plot & character development. More than one series I’ve quite liked have disappointed me by devolving into thin or non existent plots strung together by repetitive to the point of monotonous sex scenes. (I’m looking at you, Anita Blake Vampire Hunter series). Maybe publishers could find a market for offering two versions (with & without).",
        "time": "2022-10-30 18:02:25 UTC",
        "score": -2,
        "link_id": "t3_yhks0d",
        "parent_id": "t3_yhks0d"
    },
    {
        "comment_id": "iubedij",
        "subreddit": "books",
        "body": "I read Midnight Cowboy at 11 because I saw it at the library & liked the cover art. Not a happy book. But one good thing came of it: I wrote a book report on it & my language arts teacher took me aside & had a conversation with me (kindly) about being discerning when choosing what to read and that it was ok not to finish a book sometimes. One of the few one on one interactions with a teacher I can recall, and it made a lasting impression. Of course, it didn’t stop me from going through a sordid gothic romance/horror phase! During which time I was reading on the couch & my mom was on the way out the door with her friend & I asked her what a phallus was. 😜 in the context of the story, as I recall, a bunch of devil worshippers were riding one as part of their ritual. I’m sure mom & her friend got huge laughs out of that one!",
        "time": "2022-10-30 01:01:06 UTC",
        "score": 1,
        "link_id": "t3_ygvy8w",
        "parent_id": "t3_ygvy8w"
    },
    {
        "comment_id": "itsdn16",
        "subreddit": "books",
        "body": "Bartemeus Trilogy by Jonathan Stroud.",
        "time": "2022-10-25 23:14:45 UTC",
        "score": 1,
        "link_id": "t3_ydi35f",
        "parent_id": "t3_ydi35f"
    },
    {
        "comment_id": "iswj6tt",
        "subreddit": "books",
        "body": "Travels With Epicurus by Daniel Klein\nI liked this— musings on growing old. The author is American but has spent a good deal of time during his life in a small island village in Greece. So he wrote this while observing how age is experienced there as well as filtering it through his rereading of philosophers he studied in his youth. Thought provoking without bring too dense.",
        "time": "2022-10-19 05:34:27 UTC",
        "score": 1,
        "link_id": "t3_y66xm0",
        "parent_id": "t3_y66xm0"
    },
    {
        "comment_id": "ist5hpl",
        "subreddit": "books",
        "body": "I JUST finished a short story collection by Jo Nesbo (“The Jealousy Man & other stories”). It was dark but overall, really good.",
        "time": "2022-10-18 14:53:11 UTC",
        "score": 1,
        "link_id": "t3_y78qw8",
        "parent_id": "t3_y78qw8"
    },
    {
        "comment_id": "is2rym7",
        "subreddit": "books",
        "body": "My city abounds in Little Free Libraries (and if you go to littlefreelibrary.org you can enter your postal code to see a map of LFL’s in your area). I try to move books I know I will not read again out to find their way to someone else’s hands. However, I have quite a collection precisely because it’s hard for me to relinquish them! I too know that once I pass on, they will not have the same value to those I leave behind. So I have had a conversation with the young people I am close to, and asked them when/if I go if they will take all my books & spread them out to Little Free Libraries. For them & me it’s a meaningful way to celebrate my life.",
        "time": "2022-10-12 21:47:51 UTC",
        "score": 10,
        "link_id": "t3_y2g3d7",
        "parent_id": "t3_y2g3d7"
    },
    {
        "comment_id": "iqrd0m8",
        "subreddit": "books",
        "body": "You might enjoy the book “The Word Made Flesh: Literary Tattoos from Bookworms Worldwide” by Eva Talmadge & Justin Taylor. Lot of great photos.",
        "time": "2022-10-02 15:25:02 UTC",
        "score": 238,
        "link_id": "t3_xtmx28",
        "parent_id": "t3_xtmx28"
    },
    {
        "comment_id": "io4xrni",
        "subreddit": "books",
        "body": "Did you know there is currently a “Giving Tree” U.S. postal stamp?",
        "time": "2022-09-12 15:59:16 UTC",
        "score": 3,
        "link_id": "t3_xcfl6x",
        "parent_id": "t3_xcfl6x"
    },
    {
        "comment_id": "io4r65z",
        "subreddit": "books",
        "body": "When I was in 7th grade, I read the book “Midnight Cowboy”, which I had found in the kids’ section at the library. I think I chose it because I liked the title, and it was a paperback with cover artwork I liked. I ended up writing a book report on it, & my language arts teacher took me aside and kindly had a conversation with me about how it was important to be thoughtful & discerning about what I read, and how it was ok to stop reading something if it was upsetting. I think that was one of the most real interactions I ever had with a teacher, and I remember & appreciate it all these years later.",
        "time": "2022-09-12 15:15:09 UTC",
        "score": 13,
        "link_id": "t3_xcdddq",
        "parent_id": "t3_xcdddq"
    },
    {
        "comment_id": "inqsxm4",
        "subreddit": "books",
        "body": "I was a substitute teacher covering a Social Studies class that had been watching “All’s Quiet on the Western Front”. They’d watched the first half the day before, so I was there for the conclusion, over & over for four periods. By the end of the day I was practically catatonic. It’s been years & the final scene is still clear in my minds’ eye & causes tears to well up.",
        "time": "2022-09-09 16:26:24 UTC",
        "score": 25,
        "link_id": "t3_x9vlhi",
        "parent_id": "t3_x9vlhi"
    },
    {
        "comment_id": "im2p776",
        "subreddit": "books",
        "body": "Loved this series!!!!!",
        "time": "2022-08-28 01:19:19 UTC",
        "score": 5,
        "link_id": "t3_wz6j51",
        "parent_id": "t1_im1nonh"
    },
    {
        "comment_id": "ilenarz",
        "subreddit": "books",
        "body": "I picked up “The Coroner’s Lunch” at a library book sale. It got me hooked on the whole series by Colin Cotterill. The characters drew me in & the novels taught me about Laotian history & culture, something I knew pretty much nothing about previously.",
        "time": "2022-08-23 02:36:21 UTC",
        "score": 2,
        "link_id": "t3_wupirh",
        "parent_id": "t3_wupirh"
    },
    {
        "comment_id": "ijeofwq",
        "subreddit": "books",
        "body": "I SO feel you! The first books had plots, and the Anita character was interesting. But as the books went in…ugh! Aside from everything else, all the guys in those later books have like, hair down to their waists & I cannot help picturing it being a tangled up mess during all the orgies. Not really sexy at all. Plus it’s all so repetitive. Yawn.",
        "time": "2022-08-08 05:39:40 UTC",
        "score": 10,
        "link_id": "t3_wiy08t",
        "parent_id": "t1_ijel5ed"
    },
    {
        "comment_id": "iim2l5k",
        "subreddit": "books",
        "body": "Finished: The Goid, Good Pig by Sy Montgomery",
        "time": "2022-08-02 06:39:11 UTC",
        "score": 1,
        "link_id": "t3_wddjzr",
        "parent_id": "t3_wddjzr"
    },
    {
        "comment_id": "iiktats",
        "subreddit": "books",
        "body": "If a book has really touched me, I do have the impulse to let the author know. However, my favorite form of expressing gratitude is (still) snail mail. It just feels more directly personal, and I enjoy finding and using beautiful cards, stationary & stamps. The thing is, it can be difficult to find a mailing address for an author. Maybe I’m just poor at searching? If anyone out there has tips/suggestions for how to discover accurate addresses to send fan mail the old fashioned way, I’d love to know!",
        "time": "2022-08-02 00:02:50 UTC",
        "score": 1,
        "link_id": "t3_wdm12n",
        "parent_id": "t3_wdm12n"
    },
    {
        "comment_id": "iifjoyn",
        "subreddit": "books",
        "body": "I really enjoyed Julie E. Czerneda’s “Night’s Edge” series— she created a pastoral world where the magic is so subtle it takes a while to catch on. \nAnd I loved Lois McMaster Bujold’s World of the Five Gods for its detailed & unique religious system and how it plays out in different cultures. And her Barrayar series for how it expands on scientific possibilities and the philosophical ramifications of how new technologies may play out in future worlds.",
        "time": "2022-07-31 21:34:13 UTC",
        "score": 2,
        "link_id": "t3_wb9id0",
        "parent_id": "t3_wb9id0"
    },
    {
        "comment_id": "iifg8lw",
        "subreddit": "books",
        "body": "On the other hand, sometimes it’s sad to revisit beloved childhood stories and find in them things (as an adult)  that went over my head as a child. L. M. Montgomery’s “Anne of Green Gables” series was that way for me. I still enjoy it, but there are some themes & prejudices that tarnish the characters a bit.",
        "time": "2022-07-31 21:09:30 UTC",
        "score": 1,
        "link_id": "t3_wbv07d",
        "parent_id": "t3_wbv07d"
    },
    {
        "comment_id": "iiff2k1",
        "subreddit": "books",
        "body": "I put a Little Free Library in front of my house in memory of my mom, so a lot of my books go there. I enjoy stocking other LFL’s too (my city has an abundance of them!) on the littlefreelibrary.org website you can enter your zip code to see a map showing all the registered little libraries near you. \nI used to enjoy registering books at bookcrossing.com before I released them. It’s always fun when some one bothers to go on and register a comment for a book I’ve given away. And on bookcrossing, if you are so inclined, it’s possible to see if other bookcrossers are looking for a specific book and to share it with them if you like.",
        "time": "2022-07-31 21:01:13 UTC",
        "score": 1,
        "link_id": "t3_wcl3fr",
        "parent_id": "t3_wcl3fr"
    },
    {
        "comment_id": "iid2gac",
        "subreddit": "books",
        "body": "Pretty much all the characters in “Wind in the Willows”. This classic is so revered but all they do is let Toad be an asshole because he’s wealthy.",
        "time": "2022-07-31 09:15:11 UTC",
        "score": 1,
        "link_id": "t3_wc5s89",
        "parent_id": "t3_wc5s89"
    },
    {
        "comment_id": "ienx380",
        "subreddit": "books",
        "body": "Omg. Same. When I said I didn’t like it in my Bookclub, it was like I killed Santa.",
        "time": "2022-07-03 05:05:11 UTC",
        "score": 3,
        "link_id": "t3_vq0zcq",
        "parent_id": "t1_iemsk1o"
    }
]