[
    {
        "comment_id": "lx9t1kh",
        "subreddit": "books",
        "body": "You know an author doesn’t necessarily share the same worldview of a character they write.\n\nMaybe try to actually to engage with the art and think about why this was done intentionally for the story, instead of being like “oh this doesn’t align with my views, so therefore it must be bad”. \n\nIf you don’t want to do that, just read fan fiction. It’s free",
        "time": "2024-11-15 14:55:49 UTC",
        "score": 19,
        "link_id": "t3_1grxs15",
        "parent_id": "t1_lx9skkx"
    },
    {
        "comment_id": "lreuwzt",
        "subreddit": "books",
        "body": "If you’re not a big fan the lack of quotation marks, don’t read any Cormac McCarthy books lol \n\nIt is more a feature than a bug for me though when Cormac McCarthy does it. It feels like someone just telling you a story, no frills. When the prose is that damn good, you can whatever the hell you want.",
        "time": "2024-10-11 13:54:59 UTC",
        "score": 4,
        "link_id": "t3_1g1aa64",
        "parent_id": "t3_1g1aa64"
    },
    {
        "comment_id": "lppjun0",
        "subreddit": "books",
        "body": "If you’re talking about the Grant Morrison comics, Joe Abercrombie did it after since The Heroes was published in 2011. Did Grant Morrison do a similar concept in one of the issues? I haven’t read Invisibles yet.",
        "time": "2024-09-30 20:50:13 UTC",
        "score": 4,
        "link_id": "t3_1ft53dp",
        "parent_id": "t1_lppiak1"
    },
    {
        "comment_id": "lppi5va",
        "subreddit": "books",
        "body": "Yeah it’s a definite highlight in an already incredible fantasy war book. Your mile may vary with the rest of the series since he does follow the traditional POV change chapters-to-chapter. I personally love his POV chapters since each character is distinct from each other. The prose changes to match the character’s mindset and he’s great at characterization.",
        "time": "2024-09-30 20:41:22 UTC",
        "score": 10,
        "link_id": "t3_1ft53dp",
        "parent_id": "t1_lpph9cr"
    },
    {
        "comment_id": "lppg9ib",
        "subreddit": "books",
        "body": "Joe Abercrombie’s books have the best POV chapters. It helps that he writes incredibly colorful fantasy characters.\n\nMy favorite use of it was in his book, The Heroes. There’s a chapter called casualties in which we follow a soldier in a massive battle that is then killed and then we follow their killer’s POV. He repeats that method a few times in that single chapter and it brilliantly captures the dizzying nature of being in a battle.",
        "time": "2024-09-30 20:31:23 UTC",
        "score": 58,
        "link_id": "t3_1ft53dp",
        "parent_id": "t3_1ft53dp"
    },
    {
        "comment_id": "l8cjjmw",
        "subreddit": "books",
        "body": "Yeah he threw me off for a second when sections of dialogue were in Spanish without translation when I first read ATPH. But he provides enough context to understand and it’s immersive.\n\nNormal People is a quick read so I think you should be fine",
        "time": "2024-06-12 23:36:38 UTC",
        "score": 2,
        "link_id": "t3_1dekeic",
        "parent_id": "t1_l8ci6jv"
    },
    {
        "comment_id": "l8chmv6",
        "subreddit": "books",
        "body": "Try reading some Cormac McCarthy. He’s pretty damn evocative with the lack of quotations on top of it. I Love his work tho.\n\nI didn’t mind the absence of quotations marks at all. I get used to it after a while. Thought it was a solid book with a fantastic TV adaptation. Paul Mescal and Daisy-Edgar Jones are incredible in that show.\n\nI would power through if you are enjoying it. I especially loved the portrayal of loneliness and being unsure of yourself in high school & college and how both characters gravitates towards each other due to those circumstances.",
        "time": "2024-06-12 23:24:19 UTC",
        "score": 11,
        "link_id": "t3_1dekeic",
        "parent_id": "t3_1dekeic"
    }
]