[
    {
        "comment_id": "lsrjf6m",
        "subreddit": "books",
        "body": "Thanks for changing the tone of the conversation/clarifying. I forgot to mention that the US court system right now says [AI content cannot receive copyright protection](https://www.reuters.com/legal/ai-generated-art-cannot-receive-copyrights-us-court-says-2023-08-21/), so AI companies don't own the \"art\". That's the law right now. \n\nBut I'll leave you with this question about the AI unicorn case use, cancer. Even though we know some colors in food give cancer, companies are still allowed to sell them in the US (not in Europe). What do we need AI in medicine for if US society refuses to stop giving its people cancer? We could lower cancer rares for so many things already, we already know what causes it, prevention knowledge is already here, we don't need to wait for the future. \n\nInstead, the focus on treatment is because that would be profitable. Some company might create a pill or vaccine or whatever, hurray! (?) but... 99% of the population won't be able to buy it anyway as things stand right now. And that's a big if, whether we'd even get to such a medical threshold. And it's not impossible that humans couldn't find it without AI. \n\nBut yeah, I'm an anti-ai hype humanist so I can't put my faith on it for a  promise even if somehow healthcare resource distributions were somehow fixed.",
        "time": "2024-10-19 23:51:03 UTC",
        "score": 1,
        "link_id": "t3_1g7cx2t",
        "parent_id": "t1_lsrdcna"
    },
    {
        "comment_id": "lsrb2fr",
        "subreddit": "books",
        "body": "Art copyright is an extremely niche form of law and  some people do argue that you can't own the ideas and copyright should be deeply limited or even terminated. Of course artists own the objects they create (e.g. a physical canvas), but it's not like Pollock would or could sue anyone else doing paint splashes. So in that sense no, once you put it out there, art is free to inspire people and you can't own the future possibility of your technique or art being used by someone else. AI firms are trying to build private property on the commons. Machines should work for people, people should not work for machines. \n\nIt doesn't really sound like you want to have a good faith argument, since your answer to lots of points is \"so what\" and then you complain one point of view isn't self evident. If anything was self evident you wouldn't need it explaining it to you, so that's a even weirder dismissing tactic. \n\n\n This is basically how you're acting 🙉🙈  that's disingenuous and boring ✌️so I'm not even gonna bother explaining why throwing all of human endeavor under the bus for the promise of **maybe** curing cancer is \"worth it\".",
        "time": "2024-10-19 22:59:16 UTC",
        "score": 5,
        "link_id": "t3_1g7cx2t",
        "parent_id": "t1_lsr6bah"
    },
    {
        "comment_id": "lsr2eli",
        "subreddit": "books",
        "body": "Art is not created in a vacuum, no artist is an island, and so no artist can actually give permission because their artwork is inspired by people who do not consent, and cannot (dead artists). Besides, AI is derivative by definition. Generative AI is a marketing concept, it is predicting based on past data, at best it should be thought of as a form of remix but it cannot innovate the way humans make remix art because it doesn't think, can't be inspired, etc because it's fundamentally just a mathematical algorithm. Only humans think and create art as part of a social exchange.",
        "time": "2024-10-19 22:05:25 UTC",
        "score": 13,
        "link_id": "t3_1g7cx2t",
        "parent_id": "t1_lsqwi84"
    },
    {
        "comment_id": "letude7",
        "subreddit": "books",
        "body": "Microsoft and openai have said they don't respect authors of any kind, if it's on the open web it's free to scrape. So conflating the two issues actually makes the power imbalance greater because it equates individual access to corporate access, including one of the biggest and the emerging AI monopoly. Unfortunately this issue breaks down existing good/bad binaries of access, IMO.",
        "time": "2024-07-25 05:31:08 UTC",
        "score": 0,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_les3yge"
    },
    {
        "comment_id": "lernms3",
        "subreddit": "books",
        "body": "Open access doesn't negate or exclude the fact that those journals are published by giant corporations that hold monopoly power, trying to get money from openai and also giving *it* access to all the manuscripts. Open access is about whether they are subscription based or not to individual readers.",
        "time": "2024-07-24 20:42:21 UTC",
        "score": 62,
        "link_id": "t3_1eb53cc",
        "parent_id": "t1_leqtawa"
    },
    {
        "comment_id": "l7ucpbv",
        "subreddit": "books",
        "body": "Also infuriating that the author character who wrote an \"amazing\" (mid) plot is such an imperceptive person *even* when you take into account his true nature in the book. Unless the book's author is making a dig at the genre, the book is baffling. If she is, she needed to crank the snark up to make the critique clear.",
        "time": "2024-06-09 17:36:34 UTC",
        "score": 6,
        "link_id": "t3_1dbvwho",
        "parent_id": "t1_l7tw4r2"
    },
    {
        "comment_id": "l2paemu",
        "subreddit": "books",
        "body": "The publishing industry has been allowed to [concentrate](https://www.latimes.com/entertainment-arts/books/story/2021-01-29/authors-guild-urges-doj-to-stop-simon-schuster-penguin-random-house-merger) by regulators into a cartel for a long time. Good luck with the personal boycotting.",
        "time": "2024-05-05 16:00:03 UTC",
        "score": 27,
        "link_id": "t3_1ckd1m9",
        "parent_id": "t1_l2oxaf4"
    },
    {
        "comment_id": "kz0yqbr",
        "subreddit": "books",
        "body": "Sometime they're annoying to me too, other times my internal monologue ends up sounding like them for a week",
        "time": "2024-04-11 03:36:17 UTC",
        "score": 2,
        "link_id": "t3_1brjwu2",
        "parent_id": "t1_kxczl97"
    },
    {
        "comment_id": "kz0ybyw",
        "subreddit": "books",
        "body": "Made me hungry, be warned!",
        "time": "2024-04-11 03:33:09 UTC",
        "score": 2,
        "link_id": "t3_1c111x7",
        "parent_id": "t1_kz0glgj"
    },
    {
        "comment_id": "kz0gaic",
        "subreddit": "books",
        "body": "Not exactly what you asked for but related, and top picks:\n\nMark Kurlansky's Salt is more social science than hard science but salt is an important component of human civilization's development and he spawned a whole genre of big history through one item \n\nThe Professor and the Madman by Simon Winchester might be up your alley in terms of how we come to create knowledge. It's the story of a man's journey to know another man who was fiendish in cataloging many first uses of English words in writing when the Oxford English Dictionary was first being put together.\n\nFun science writing if you like cats: Abigail Tucker's The Lion in the Living room",
        "time": "2024-04-11 01:25:52 UTC",
        "score": 6,
        "link_id": "t3_1c111x7",
        "parent_id": "t3_1c111x7"
    },
    {
        "comment_id": "kxbw6pu",
        "subreddit": "books",
        "body": "What happens when you listen to an audiobook?",
        "time": "2024-03-31 00:19:15 UTC",
        "score": 2,
        "link_id": "t3_1brjwu2",
        "parent_id": "t3_1brjwu2"
    },
    {
        "comment_id": "kuhfzvp",
        "subreddit": "books",
        "body": "Aziz Rana calls this the \"freedom to oppress\" and it's origins are settler colonialism. Freedom for white immigrants but not for natives and slaves.",
        "time": "2024-03-12 05:50:04 UTC",
        "score": 3,
        "link_id": "t3_1bc3650",
        "parent_id": "t1_kudip7e"
    },
    {
        "comment_id": "koog8xy",
        "subreddit": "books",
        "body": ">~~embiggened~~\n\nEnlarged, augmented, aggrandized",
        "time": "2024-02-03 01:46:28 UTC",
        "score": 0,
        "link_id": "t3_1ahg96m",
        "parent_id": "t3_1ahg96m"
    },
    {
        "comment_id": "kaj65nx",
        "subreddit": "books",
        "body": "The Powers of Darkness document how the published is definitely not the first draft!",
        "time": "2023-11-24 05:19:22 UTC",
        "score": 2,
        "link_id": "t3_182832m",
        "parent_id": "t1_kah1aaq"
    },
    {
        "comment_id": "k3iss7l",
        "subreddit": "books",
        "body": "They're not free if you're paying for a subscription, they're just included in the price.",
        "time": "2023-10-05 02:22:17 UTC",
        "score": 2,
        "link_id": "t3_16zlm2y",
        "parent_id": "t3_16zlm2y"
    },
    {
        "comment_id": "k1o8mep",
        "subreddit": "books",
        "body": ">On a totally unrelated note, I found out the author of this book admins a painfully millennial meme page on Instagram.\n\nNot on ig, would you mind posting some screenshots? Lol",
        "time": "2023-09-22 05:06:52 UTC",
        "score": 2,
        "link_id": "t3_16ou9ma",
        "parent_id": "t3_16ou9ma"
    }
]