[
    {
        "comment_id": "lt1jkxi",
        "subreddit": "books",
        "body": "I saw a few romances on the shelf with that schtick and it just felt very cringy. I like reading about the Spanish Flu, The Black Death and other plagues but covid is still way too fresh. We are still dealing with the fall out and the annoying bozos that had to turn it into a political statement are still causing problems for us politically as we speak. No thank you.",
        "time": "2024-10-21 18:06:36 UTC",
        "score": 1,
        "link_id": "t3_1g778ef",
        "parent_id": "t3_1g778ef"
    },
    {
        "comment_id": "lsh86v6",
        "subreddit": "books",
        "body": "I have been putting books down like crazy the past few days but not permanently. My mood just changes very quickly so I just put it down and wait for my mood to cycle back around and pick it back up again.",
        "time": "2024-10-18 04:16:29 UTC",
        "score": 1,
        "link_id": "t3_1g64088",
        "parent_id": "t3_1g64088"
    },
    {
        "comment_id": "kghy2na",
        "subreddit": "books",
        "body": "I mean thats why its considered dark romance. Its the romance genre's answer to grimdark fantasy in a way. Personally its not my cup of tea as I am more of a historical romance reader but this is why I don't pick up books that are labeled as dark romance or has a long list of content warnings because guaranteed it will definitely have lots of taboo things because thats the whole point. Its just weird when people pick up a dark romance and then are upset when it does exactly what dark romances are known to do. Also, its good practice to dig deeper into understanding why people are hyping things up rather than just reading something due to hype. It will save you a lot of frustration.",
        "time": "2024-01-05 22:14:34 UTC",
        "score": 37,
        "link_id": "t3_18zeph7",
        "parent_id": "t3_18zeph7"
    },
    {
        "comment_id": "kghv2n1",
        "subreddit": "books",
        "body": "College interfered, didn't even have enough time to read the required stuff for class let alone trying to read recreationally. I started reading again when I had long transit commutes to and from work and wanted something to kill time so that I wasn't paying attention to how painfully slow everything was.",
        "time": "2024-01-05 21:57:06 UTC",
        "score": 2,
        "link_id": "t3_18zha8k",
        "parent_id": "t3_18zha8k"
    },
    {
        "comment_id": "k1y9brt",
        "subreddit": "books",
        "body": "I don't get why you are being downvoted, I am the same way for the most part. I have gotten a few recs of upcoming unreleased books from Youtube in the past but other than that I like to find my own books, it just feels more personal to me. I like to  peruse the shelves and spend my own time just searching on Amazon and similar sites to see what interests me or what might be similar to something I like or a trope I like. I am extremely picky and can't read books purely due to popularity. However, I have read books that later became Tiktok popular, most of which was at best average, so it wasn't a ringing endorsement of Tiktok for me.",
        "time": "2023-09-24 04:30:17 UTC",
        "score": 2,
        "link_id": "t3_16qd1uu",
        "parent_id": "t1_k1wbzx1"
    },
    {
        "comment_id": "k1x8d1a",
        "subreddit": "books",
        "body": "The only good thing I can say about Booktok is that it has made me start shopping at used booksellers (online places like Thrift Books and physical stores I can go to). I am not enjoying the current output from publishers (certainly not worth double the price) and places like Barnes and Noble only really caters to new content and popular stuff so not many hidden gems. Honestly reading older books in my genre is the only thing keeping me as a reader because after way too many lackluster books I was starting to wonder if maybe I no longer enjoyed reading anymore and if there was nothing left for me.",
        "time": "2023-09-23 23:38:36 UTC",
        "score": 50,
        "link_id": "t3_16qd1uu",
        "parent_id": "t3_16qd1uu"
    },
    {
        "comment_id": "k1t6knm",
        "subreddit": "books",
        "body": "Although I will say there were a few times when those \"review\" summaries came in handy because the author had one of those silly first person \"blurbs\" that tell you absolutely nothing about the story just dumb stuff like \"I was lost in this dark world and then he showed up\" blah blah blah. Its an annoying habit I can't stand with self published works. I'm at the point now where if I have to look a reviews just to figure out what your book is actually about because your blurb is poorly written...that means your book is probably just as badly written.",
        "time": "2023-09-23 03:48:19 UTC",
        "score": 3,
        "link_id": "t3_16pfwzm",
        "parent_id": "t3_16pfwzm"
    },
    {
        "comment_id": "k1gsfqz",
        "subreddit": "books",
        "body": "Yesss. I don't think this person ever read any romance novels because they go in painting a broad brush while also being hypocritical (complains about moody heroes while also gushing over a moody hero). I said it elsewhere but I think this person is trying to make this into some sort of \"literary\" piece to hide the fact that she liked a romance novel.",
        "time": "2023-09-20 20:10:49 UTC",
        "score": 11,
        "link_id": "t3_16nsn7l",
        "parent_id": "t1_k1gre7w"
    },
    {
        "comment_id": "k1gru0z",
        "subreddit": "books",
        "body": "Yeah I got the vibe that this article writer has never read any romance novels before and is ashamed of it so she is trying to make this book appear more than it actually is.",
        "time": "2023-09-20 20:07:30 UTC",
        "score": 8,
        "link_id": "t3_16nsn7l",
        "parent_id": "t1_k1gqavw"
    },
    {
        "comment_id": "k1gr1ww",
        "subreddit": "books",
        "body": "As a long time romance reader that article was so cringy and so insulting to the genre as a whole. The romance genre was already a billion dollar industry before Tiktok and will continue to be long after. There have been great romances long before Emily Henry, Ali Hazelwood, and Talia Hibbert. And I'll take \"formulaic\" over books trying to be trendy and relevant for social media audiences.",
        "time": "2023-09-20 20:03:08 UTC",
        "score": 36,
        "link_id": "t3_16nsn7l",
        "parent_id": "t3_16nsn7l"
    },
    {
        "comment_id": "k1dbwdy",
        "subreddit": "books",
        "body": "While I've never been into crime, thriller or mystery books I used to love those types of TV shows as a teenager but these days I just can't watch them anymore. Real life is dark and depressing enough for me and I don't want to be in that headspace anymore than is necessary (though its interesting how I have no problem watching disaster stuff that can be quite tragic). It could be that you are burned out or it could be that what is comfort for you is changing. I used to love historical fiction but lately struggle to read it because it can be so bleak. My comfort genre has changed a few times over the past few years to be honest.",
        "time": "2023-09-20 03:37:42 UTC",
        "score": 5,
        "link_id": "t3_16n8qtr",
        "parent_id": "t3_16n8qtr"
    },
    {
        "comment_id": "k1dbebf",
        "subreddit": "books",
        "body": "I do get anxiety but mostly because of the need to know what happens next and not liking the idea of having to wait for months to years to finish. There was one series that never got completed which does frustrate me but for the most part that isn't something I'm as worried about.",
        "time": "2023-09-20 03:33:27 UTC",
        "score": 2,
        "link_id": "t3_16mmjvs",
        "parent_id": "t3_16mmjvs"
    },
    {
        "comment_id": "k0un6ry",
        "subreddit": "books",
        "body": "I found Anne of Green Gables to be as good as a modern kids book. In fact it gave many of the same feelings that Harry Potter did. I think you should try some kids classics if you are looking for fun stories as they are designed to be that way.",
        "time": "2023-09-16 15:51:16 UTC",
        "score": 3,
        "link_id": "t3_16jpvcc",
        "parent_id": "t3_16jpvcc"
    },
    {
        "comment_id": "k0ulqz8",
        "subreddit": "books",
        "body": "I don't process every detail but I do process the general look and get annoyed by vague descriptions that make it hard to visualize the character. The only thing that frustrates me more is when the author fails to describe how the characters looks early on in the story. It takes me out of the book when the author describes them halfway through the story and its wildly different from what I thought they looked like. This just happened recently, I thought a character had brown hair until past the halfway point it was described as blonde hair. How do you omit a detail like that early on??? Other than that I don't need a book to be too descriptive otherwise it swings too much in the other direction where it slows the story down.",
        "time": "2023-09-16 15:42:21 UTC",
        "score": 2,
        "link_id": "t3_16k8lc0",
        "parent_id": "t3_16k8lc0"
    },
    {
        "comment_id": "k05cvq2",
        "subreddit": "books",
        "body": "I don’t read many black authors mostly because they seem too hung up in writing about subjects I’m trying to avoid (ie police brutality, slavery, Jim Crow or some other racism). I do sometimes read black romance authors if I’m interested enough in the plot but it definitely has to be contemporary. I experience enough racism in my own life that I don’t need to go searching for it in my hobby.\n\nedit\nI do want to add that I understand that sometimes these authors aren't necessarily writing for a black audience and are wanting to share these narratives with people of other racial groups. I just wish there was more variety and not just trauma narratives.",
        "time": "2023-09-11 18:57:16 UTC",
        "score": 204,
        "link_id": "t3_16g0bya",
        "parent_id": "t3_16g0bya"
    },
    {
        "comment_id": "jzu6ake",
        "subreddit": "books",
        "body": "Any series where fans tell you that you need to get through the first 4 books before it gets better....doesn't get any better. These books take padding out stories to an extreme. You should check out the [video](https://www.youtube.com/watch?v=h0PuGgmrd8o) My Name is Marines did on the series if you want a deeper dive into why people don't like this series.",
        "time": "2023-09-09 17:09:32 UTC",
        "score": 6,
        "link_id": "t3_16diu9n",
        "parent_id": "t3_16diu9n"
    },
    {
        "comment_id": "jzozbr1",
        "subreddit": "books",
        "body": "You should also check out r/lightnovels. That series is like a Bible to them lol.",
        "time": "2023-09-08 16:33:18 UTC",
        "score": 17,
        "link_id": "t3_16dcdr3",
        "parent_id": "t3_16dcdr3"
    },
    {
        "comment_id": "jzoyph2",
        "subreddit": "books",
        "body": "Basically any historical fiction in the past 2 years. I usually read stuff related to WWI, Interwar period and WWII. But the political landscape of the last few years has soured me a bit due to the parallels being too hard to ignore and then personal life events in the last year has made it extremely hard to read tragedies when your own life is falling apart.",
        "time": "2023-09-08 16:29:32 UTC",
        "score": 1,
        "link_id": "t3_16d69dh",
        "parent_id": "t3_16d69dh"
    },
    {
        "comment_id": "jxysl0x",
        "subreddit": "books",
        "body": "I’ve seen this happen with a handful of authors in my genre. In one case the author has been writing since the 80s but she got much more popular in recent years due to social media so she has started rewriting some of her older books bc of the problematic elements in the original versions and the specific subgenre in question has changed considerably since. I’m not sure if she was just trying to get ahead of any controversy or not (as we know how unforgiving social media “readers” tend to be). I am of mixed feelings. Books represent the era and world the author is living in at that time. And while later generations may not understand that context, the burden should be on the reader to learn rather than demand changes. Besides authors would drive themselves crazy rewriting their books as society and standards continues to change. I’d rather they just use that energy to make a new work instead.",
        "time": "2023-08-27 15:10:06 UTC",
        "score": 4,
        "link_id": "t3_162hpx0",
        "parent_id": "t3_162hpx0"
    },
    {
        "comment_id": "jxvd6fl",
        "subreddit": "books",
        "body": "I love that I can feel like an active participant with books. I get to visualize the books. There are so many ways people can interpret descriptions. I feel like this allows me to feel more attached to the characters and story as I am more invested. I am not just passively watching the story. Don't get me wrong there are definitely good shows and movies out there that I connect with but it never feels that deep the way it is with books. I just feel more intimate with characters bc my imagination is involved.",
        "time": "2023-08-26 20:04:56 UTC",
        "score": 2,
        "link_id": "t3_161m6z8",
        "parent_id": "t3_161m6z8"
    },
    {
        "comment_id": "jwmsbvf",
        "subreddit": "books",
        "body": "Oh yeah it’s a red flag to me when someone says that you have to read the second book. It depends on how I feel after book 1. If I gave 3 stars or more then I may see the potential and keep going. If it’s 1 or 2 I highly doubt there is anything that will make me miraculously like a series I always was hating.",
        "time": "2023-08-17 21:11:48 UTC",
        "score": 2,
        "link_id": "t3_15tqf7h",
        "parent_id": "t3_15tqf7h"
    },
    {
        "comment_id": "jwmrs36",
        "subreddit": "books",
        "body": "I fully expect mine to be thrown away. Though I’d be ok if they want to try and see if they can get money off it (well they can certainly try lol) or want to donate it. But I live in a world of book haters so I have zero expectations.",
        "time": "2023-08-17 21:08:28 UTC",
        "score": 1,
        "link_id": "t3_15tre6w",
        "parent_id": "t3_15tre6w"
    },
    {
        "comment_id": "jwjoulu",
        "subreddit": "books",
        "body": "I find that self published books tend to be more heavily tropey (which I am ok with), the market can be much more niche compared to traditional publishers. There is a certain kind of story I like to read that I've mostly found in self publishing and only a handful with traditional publishers. But its definitely heavy on the tropes that sell and reads like its a guilty pleasure reveling in it. Fast food fiction as I call it.",
        "time": "2023-08-17 07:30:15 UTC",
        "score": 9,
        "link_id": "t3_15taxp2",
        "parent_id": "t3_15taxp2"
    },
    {
        "comment_id": "jwj9wah",
        "subreddit": "books",
        "body": "ugh I didn't even think of that. can't win at all. interesting that amazon can delete legitimate books because someone uploads an illegal copy but they can't be bothered to do anything about fake books being uploaded. this may work out in traditional publishing's favor in the long run.",
        "time": "2023-08-17 04:38:47 UTC",
        "score": 7,
        "link_id": "t3_15t3w18",
        "parent_id": "t1_jwj31qt"
    },
    {
        "comment_id": "jwierw8",
        "subreddit": "books",
        "body": "I don't know to be honest. I looked at images of that Alice and Sparkle book and it just lacks something to me. Authenticity, warmth, the small details that make it feel like a work of love. I know it sounds silly but it just seems off to me.",
        "time": "2023-08-17 00:37:12 UTC",
        "score": 18,
        "link_id": "t3_15t7824",
        "parent_id": "t3_15t7824"
    },
    {
        "comment_id": "jwidp5w",
        "subreddit": "books",
        "body": "Lol oh my goodness thats so many people. So basically only 1 person in that entire chain of people read the book??? People should never recommend something if they hadn't read it themselves. Fantasy romance like romance novels is something to be very skeptic of and I say that as a romance reader. You never recommend those books to someone unless you can confirm they are a fan of the genre and even then you still gotta be suspicious because of overhype.",
        "time": "2023-08-17 00:29:39 UTC",
        "score": 10,
        "link_id": "t3_15t5s1h",
        "parent_id": "t1_jwid4qr"
    },
    {
        "comment_id": "jwiblnd",
        "subreddit": "books",
        "body": "by ban i mostly just mean they won't let you return books.",
        "time": "2023-08-17 00:15:03 UTC",
        "score": 3,
        "link_id": "t3_15t5s1h",
        "parent_id": "t1_jwibeo7"
    },
    {
        "comment_id": "jwibeo7",
        "subreddit": "books",
        "body": "Gotcha, thats understandable. Be careful tho with the returns as they will ban you if you do it too much. Definitely only get the hyped stuff on sale (usually you can get the ebooks on sale for less than $5, I just put books in my wishlist to check regularly). Nothing more frustrating than wasting money on something you end up hating especially at full price.",
        "time": "2023-08-17 00:13:40 UTC",
        "score": 7,
        "link_id": "t3_15t5s1h",
        "parent_id": "t1_jwiazar"
    },
    {
        "comment_id": "jwiaxmw",
        "subreddit": "books",
        "body": "I literally quite a book with 50 pages left to go because it was frustrating me so much. I hate that I let myself get as far as I did. If a book is making you miserable and you are reading purely for your own self, you can quit the book.",
        "time": "2023-08-17 00:10:18 UTC",
        "score": 1,
        "link_id": "t3_15so5m9",
        "parent_id": "t3_15so5m9"
    },
    {
        "comment_id": "jwiamwv",
        "subreddit": "books",
        "body": "I mainly read for enjoyment. I read romance books (though I have disavowed myself of the romance community due to bullies and some gross behavior), I love light novels and manga. For a time I did enjoy challenging myself with classics, Jane Austen and PG Wodehouse are favorites. Right now I am not in a good place to challenge myself. I do like to read non-fiction to learn though I haven't in a while for much of the same reason. A few years back it was historical non-fiction and memoirs however most recently I've been interested in psychology stuff to help me understand my own mental health problems.",
        "time": "2023-08-17 00:08:12 UTC",
        "score": 1,
        "link_id": "t3_15sv96z",
        "parent_id": "t3_15sv96z"
    },
    {
        "comment_id": "jwi9wdu",
        "subreddit": "books",
        "body": "Sell them if I have time. Donate them if I can't sell them. If I don't have any time to do either I may end up throwing them away (the trials and tribulations of public transit it takes an hour or 2 to go one way anywhere). I keep them to the side for several months in the hopes of having time but life sometimes interferes.",
        "time": "2023-08-17 00:03:05 UTC",
        "score": 1,
        "link_id": "t3_15sw46u",
        "parent_id": "t3_15sw46u"
    },
    {
        "comment_id": "jwi9qos",
        "subreddit": "books",
        "body": "How do you know what to look for when its not a famous author? May just play it safe and only read books with a significant amount of reviews (tho not sure what a good number for that would be either).",
        "time": "2023-08-17 00:01:58 UTC",
        "score": 14,
        "link_id": "t3_15t3w18",
        "parent_id": "t3_15t3w18"
    },
    {
        "comment_id": "jwi9214",
        "subreddit": "books",
        "body": "Glad you got your refund. If you can just borrow overly hyped stuff because 9 times out of 10 its going to be garbage.",
        "time": "2023-08-16 23:57:07 UTC",
        "score": 139,
        "link_id": "t3_15t5s1h",
        "parent_id": "t3_15t5s1h"
    },
    {
        "comment_id": "jwi8v6a",
        "subreddit": "books",
        "body": "I blame it on social media. Publishing now focuses on that audience and social media loves simplification. I've discovered its all about who shouts the loudest.",
        "time": "2023-08-16 23:55:45 UTC",
        "score": 36,
        "link_id": "t3_15t60fz",
        "parent_id": "t3_15t60fz"
    },
    {
        "comment_id": "jvb3fsw",
        "subreddit": "books",
        "body": "Book snobbery comes in many forms as well as self-righteous behavior even if it’s for a noble cause. I just wish people would respect OP’s question. If you don’t buy books that’s ok, just don’t answer as this question isn’t for you. This subreddit has a bad habit of doing stuff like this.",
        "time": "2023-08-08 15:03:22 UTC",
        "score": 2,
        "link_id": "t3_15kly9o",
        "parent_id": "t1_jv79489"
    },
    {
        "comment_id": "jvan94h",
        "subreddit": "books",
        "body": "But hundreds of people flooding a post about book buying options with library answers is just obnoxious. People should still actually answer the question. Just saying you use the library doesn’t answer the question as OP wants to know about buying options.",
        "time": "2023-08-08 13:12:00 UTC",
        "score": 4,
        "link_id": "t3_15kly9o",
        "parent_id": "t1_jv7t4yz"
    },
    {
        "comment_id": "jvam1j6",
        "subreddit": "books",
        "body": "Pretty ironic for a subreddit dedicated to reading how so many didn’t read what OP was asking and as a result didn’t actually answer his question.",
        "time": "2023-08-08 13:02:16 UTC",
        "score": 6,
        "link_id": "t3_15kly9o",
        "parent_id": "t1_jv9za1p"
    },
    {
        "comment_id": "jv8og41",
        "subreddit": "books",
        "body": "it never occurred to me that that could be related to my adhd but i totally experience that anxiety and pressure to the point that I end up not reading it. also doesn't help that the way i read is very haphazard, i start and stop books so much due to concentration issues. i also only recently got diagnosed a few months ago so almost everything is a shock to me lol.",
        "time": "2023-08-08 01:17:31 UTC",
        "score": 4,
        "link_id": "t3_15kly9o",
        "parent_id": "t1_jv7xxr6"
    },
    {
        "comment_id": "jv6grlt",
        "subreddit": "books",
        "body": "Really annoying when people give the library answer on a question about wanting to buy books. Its ok if people want to buy instead of borrow. So some places I've used:\n\nThrift Books is my favorite for used books as they are cheap and quick with shipping\n\nPowells is another option but they are a bit pricier for used books than the likes of Half Price Books but their online website is superior to HPB at least.\n\nKindle Unlimited may be worth subscribing to,  depending on how much of Amazon content interests you and if you plan to read much on a Kindle device. In fact Kindle would be the cheapest option as ebooks go on sale all the time. I usually add a bunch of ebooks to my Amazon wishlist and check it daily to see if any of it went on sale. Easy way to get a book for $2 or $4.\n\nI haven't seen much in the way of major book sales even during the holidays though on occasion Amazon may have a buy 2 get 1 free. Barnes and Noble also does stuff with their points system if you are a member (they have a free version and a premium version where you get discounts). Sometimes they do have a pre-selected sale of books for 50% off but its SOL if none of those selected books are of interest.",
        "time": "2023-08-07 16:40:08 UTC",
        "score": 170,
        "link_id": "t3_15kly9o",
        "parent_id": "t3_15kly9o"
    },
    {
        "comment_id": "jv3nqxs",
        "subreddit": "books",
        "body": "The great thing about reading as a hobby is there are no rules. Its your journey. Just enjoy the ride. Anyways comics, manga, and graphic novels are a form of media separate from the prose novel but still a book.",
        "time": "2023-08-07 00:51:56 UTC",
        "score": 3,
        "link_id": "t3_15jsbui",
        "parent_id": "t3_15jsbui"
    },
    {
        "comment_id": "jv3mudi",
        "subreddit": "books",
        "body": "I mean I have a bad book buying habit in general but lately I've been going down a self publishing rabbit hole because I've been wanting to read fantasy romance which traditional publishing sucks at. Problem is I could read those off of KU but...like I said bad book buying habit. In your case I would see how much of what you want to read is available on KU and then maybe do a monthly plan to read it all and then cancel or subscribe for a year if you feel there is enough content to keep you busy (must point out tho that KU has a lot of garbage to sift through).",
        "time": "2023-08-07 00:44:46 UTC",
        "score": 1,
        "link_id": "t3_15k2thd",
        "parent_id": "t3_15k2thd"
    },
    {
        "comment_id": "jv14yrm",
        "subreddit": "books",
        "body": "Hard no. I will read about the Spanish Flu. I will read about the Bubonic Plague. I have absolutely no desire to read about Covid 19 or even Swine Flu for that matter. Too personal.",
        "time": "2023-08-06 14:11:11 UTC",
        "score": 27,
        "link_id": "t3_15jpkea",
        "parent_id": "t3_15jpkea"
    },
    {
        "comment_id": "jq75umc",
        "subreddit": "books",
        "body": "Jane Eyre made me realize that I could understand older books and not need a dictionary on me at all times (unlike high school me when first trying Jane Austen). But Anne of Green Gables made me realize that an old book could be equally as riveting as a book like Harry Potter. Like the feelings I had were the exact same which caught me by surprise as they are very different books.",
        "time": "2023-06-30 23:45:54 UTC",
        "score": 2,
        "link_id": "t3_14nfsgp",
        "parent_id": "t3_14nfsgp"
    },
    {
        "comment_id": "jq75nyq",
        "subreddit": "books",
        "body": "I never found their rating system to be accurate, its so bad that I get more accuracy from Amazon.",
        "time": "2023-06-30 23:44:27 UTC",
        "score": 1,
        "link_id": "t3_14lnjgk",
        "parent_id": "t3_14lnjgk"
    },
    {
        "comment_id": "jq75cat",
        "subreddit": "books",
        "body": "I feel you, I come up against this alot as a black person when i read old fiction. I just assume authors of the past held horrible views unless proven otherwise. Slightly less disappointment that way.",
        "time": "2023-06-30 23:41:55 UTC",
        "score": 12,
        "link_id": "t3_14mmmu0",
        "parent_id": "t1_jq5ckmu"
    },
    {
        "comment_id": "jna1qd1",
        "subreddit": "books",
        "body": "I rate a book based on how much I enjoyed the overall experience and the likelihood I'd reread it again. I just explain what I liked and what I didn't like in a story to explain the rating. There have been books that I rated highly simply because of how much I loved 1 character. Books I ranked low because of a trope I couldn't stand. There have been books that I don't rate at all just because I am conflicted about my feelings and don't want to make a decision. I just go with the flow of my feelings basically.",
        "time": "2023-06-07 17:09:21 UTC",
        "score": 2,
        "link_id": "t3_1435mju",
        "parent_id": "t3_1435mju"
    },
    {
        "comment_id": "jna13qq",
        "subreddit": "books",
        "body": "This is how it should be. That way there is a real risk involved for Reddit that they may lose a lot of people permanently if threads go dark until they reverse course. People will learn to live without Reddit and for a company that just announced they are laying off staff that would probably spell further disaster.",
        "time": "2023-06-07 17:05:27 UTC",
        "score": 1,
        "link_id": "t3_1437yl1",
        "parent_id": "t1_jn8ef1l"
    },
    {
        "comment_id": "jn6dylu",
        "subreddit": "books",
        "body": "I mean Jane Austen is pretty advanced. I definitely understood her books better as an adult than I did as a teen. And for you to be at the start of your English reading journey and already able to read Jane Austen? Thats pretty impressive since most people have to start with kids books (nothing wrong with that though). I can't help but wonder if that person actually read Ulysses or not because the books you listed are major favorites among the literary snobs. Can't help but wonder if he is trying to cover for his own inferiority complex or something.",
        "time": "2023-06-06 21:58:26 UTC",
        "score": 1,
        "link_id": "t3_142m9hy",
        "parent_id": "t3_142m9hy"
    },
    {
        "comment_id": "jmt5wsw",
        "subreddit": "books",
        "body": "Thank you, finally a voice of reason. Its a reminder of why I tend to not to come to r/books very often. Anyways the success of the romance genre allows publishers to publish books in other genres so people really shouldn't hate on it so much if for that reason alone.",
        "time": "2023-06-04 01:09:07 UTC",
        "score": 7,
        "link_id": "t3_13zsli0",
        "parent_id": "t1_jmt55f0"
    },
    {
        "comment_id": "jmt5bua",
        "subreddit": "books",
        "body": "I absolutely love romance novels. Its my ultimate form of escapism. The genre I hate with a passion is mysteries/thriller/suspense. I tried very hard to get into this genre. I focused on mysteries that kind of run parallel to my tastes. I tried the classics like Agatha Christie and Margery Allingham. I read some historical mysteries and even dabbled with a few thrillers. I finally gave up on the genre this year. I just find murder too bleak of a subject for my interest and I don't care for the mystery formula in general.",
        "time": "2023-06-04 01:04:02 UTC",
        "score": 2,
        "link_id": "t3_13zsli0",
        "parent_id": "t3_13zsli0"
    },
    {
        "comment_id": "jmsfhpi",
        "subreddit": "books",
        "body": "I have a similar issue. I think for me it takes the escapism out of it because I am too familiar with the place/location/setting. It starts to feel too real and then I become too aware and more critical because I can't separate it anymore.",
        "time": "2023-06-03 21:33:55 UTC",
        "score": 2,
        "link_id": "t3_13zfynz",
        "parent_id": "t3_13zfynz"
    },
    {
        "comment_id": "jmsf56a",
        "subreddit": "books",
        "body": "Accept that its going to be uncomfortable the first couple of times you do it. Like with anything else, it takes practice. Forcing yourself to do it and move on and then you do it enough times and it will become second nature to you that you won't feel guilt anymore.",
        "time": "2023-06-03 21:31:14 UTC",
        "score": 2,
        "link_id": "t3_13zk1u4",
        "parent_id": "t3_13zk1u4"
    },
    {
        "comment_id": "jm5xmsf",
        "subreddit": "books",
        "body": "I just look at scifi as science-y stuff, space, and technology where things are explained away using scientific concepts, even if its fake. Its not necessarily about it being realistic. It can be grounded like The Martian, it can be technological like Jurassic Park or The Terminator or it can be a big massive space war like Star Wars. Of course some stuff can change genres simply by changing one element. Think time travel for instance. Back to the Future would be sci fi while Outlander would be more fantasy simply because the former uses technology for time travel while the latter uses magic to fuel time travel. Sometimes its just easier to use the term \"speculative fiction\" as an umbrella term because so much can overlap with each other.",
        "time": "2023-05-30 04:49:09 UTC",
        "score": 3,
        "link_id": "t3_13vfb6m",
        "parent_id": "t3_13vfb6m"
    },
    {
        "comment_id": "jm5wki4",
        "subreddit": "books",
        "body": "I think its a bit of both probably. Alot of light novels get their start as serialized web novels and their main audience tend to be teens so they are comparable to YA in a sense. I'm sure there are also translation challenges as writing rules are also different (such as how many light novels don't always indicate who is talking) and translators have to account for that. Also the people that are translating it into English aren't necessarily writers themselves to polish things up a bit. Its definitely not a genre to go into expecting high quality. I think the best I've seen so far is Tearmoon Empire. But overall I can still enjoy the stories though it can be a bit of a whiplash feeling when switching between a western book and a light novel.",
        "time": "2023-05-30 04:38:08 UTC",
        "score": 14,
        "link_id": "t3_13vfkoi",
        "parent_id": "t3_13vfkoi"
    },
    {
        "comment_id": "jimpl7i",
        "subreddit": "books",
        "body": "I tried reading murder mysteries both old and new. I finally decided to just call it quits with ever trying to like the genre. But I have pushed myself out of my comfort zone by reading fantasy and have managed to find my niche so at least that is working. Also had success with pushing myself to read classics and nonfiction a few years back. I don't read nearly as much now as I did in the beginning, but thats how it always is with me when I embark on something new, I get carried away with it until I find my equilibrium.",
        "time": "2023-05-02 23:44:04 UTC",
        "score": 1,
        "link_id": "t3_1361n69",
        "parent_id": "t3_1361n69"
    },
    {
        "comment_id": "jhwtd78",
        "subreddit": "books",
        "body": "I buy books. Reading is my main hobby and buying is my coping mechanism for dealing with a crappy life. Also a lot of what I read isn’t available at my library and what little is has too long of a waitlist.",
        "time": "2023-04-27 12:28:52 UTC",
        "score": 26,
        "link_id": "t3_130ja00",
        "parent_id": "t3_130ja00"
    },
    {
        "comment_id": "jh86iqv",
        "subreddit": "books",
        "body": "In a way yeah. There are some books that I enjoy so much I am almost afraid to read them because it either makes me anxious to have to stop to go to work or I worry that I won't find another book that will make me feel that way again so I just stop reading it and then months and in some cases years go by and the love I had for the books is forgotten and the magic can't be brought back because too much time passed. Trying to curb that as much as I can. Better to reread them than never finish them.",
        "time": "2023-04-22 02:49:48 UTC",
        "score": 2,
        "link_id": "t3_12urmbq",
        "parent_id": "t3_12urmbq"
    },
    {
        "comment_id": "jh5qllj",
        "subreddit": "books",
        "body": "Princess Bride of course the screenplay being written by the author of the book had everything to do with it being as great as it is.",
        "time": "2023-04-21 16:03:48 UTC",
        "score": 1,
        "link_id": "t3_12tykzl",
        "parent_id": "t3_12tykzl"
    },
    {
        "comment_id": "jfpaddk",
        "subreddit": "books",
        "body": "Not so much due to shame but rather some books are like secret treasures that I don’t want to share with others. They are my happy place and I don’t want people ruining them with gross crass comments (usually misogynistic bs). These genres would be romance, shoujo manga, light novels, and women’s fiction. I read for enjoyment and it’s no one’s business. They don’t get a say in my reading.",
        "time": "2023-04-10 14:52:45 UTC",
        "score": 1,
        "link_id": "t3_12h0sw8",
        "parent_id": "t3_12h0sw8"
    },
    {
        "comment_id": "jexyy5m",
        "subreddit": "books",
        "body": "I wish. Likely I’ll end up offloading books again as I’ve bought too many books due to bookish highs that I’ve late regretted getting.",
        "time": "2023-04-04 17:33:39 UTC",
        "score": 1,
        "link_id": "t3_12bbexj",
        "parent_id": "t3_12bbexj"
    },
    {
        "comment_id": "jeon79j",
        "subreddit": "books",
        "body": "Sometimes I look at upcoming releases on Amazon or from publisher websites. Sometimes I just walk around the bookstore but that one is a hit and miss as I like to sometimes do research before buying something.",
        "time": "2023-04-02 17:41:15 UTC",
        "score": 1,
        "link_id": "t3_129hute",
        "parent_id": "t3_129hute"
    },
    {
        "comment_id": "jeomypj",
        "subreddit": "books",
        "body": "I create collections on my Kindle. Each collection represents a genre, a section dedicated to rereading and what I am currently reading. You can set it up however you want to.",
        "time": "2023-04-02 17:39:35 UTC",
        "score": 1,
        "link_id": "t3_129od35",
        "parent_id": "t3_129od35"
    },
    {
        "comment_id": "jeg3va7",
        "subreddit": "books",
        "body": "Nah there are no rules when it comes to reading. I actually took a break for a few months to focus on video games due to depression and only got back into reading recently due to web comics. If audiobooks work better for you then keep doing that. It’s your hobby, you choose how to enjoy it.",
        "time": "2023-03-31 19:31:39 UTC",
        "score": 1,
        "link_id": "t3_127lj26",
        "parent_id": "t3_127lj26"
    },
    {
        "comment_id": "j70s3dk",
        "subreddit": "books",
        "body": "HarperCollins and their various imprints (specifically Avon, Harlequin, and William Morrow) seems to make up the bulk of the books I own so I guess they are doing something I like. My personal favorite is Furrowed Middlebrow from Dean Street Press because they republish a lot of mid 20th century British women’s fiction (similar to Persephone books which I also like and wish was more accessible)",
        "time": "2023-02-03 06:23:30 UTC",
        "score": 15,
        "link_id": "t3_10s9tyr",
        "parent_id": "t3_10s9tyr"
    },
    {
        "comment_id": "j423viy",
        "subreddit": "books",
        "body": "Honestly if someone is going to go through that much trouble I think it’s time to start reexamining things. Maybe it would be better money spent just reading books from authors you can support and just move on from HP all together.",
        "time": "2023-01-12 17:27:12 UTC",
        "score": 9,
        "link_id": "t3_109tb7v",
        "parent_id": "t3_109tb7v"
    },
    {
        "comment_id": "j3unma0",
        "subreddit": "books",
        "body": "I read kids books from time to time, I especially love Anne of Green Gables and Betsy Tacy. I love the whimsy, charm, and innocence many kids books have. Adult books can sometimes be a bit too cynical and it’s nice to switch to something light. I generally stick with historical fiction, fantasy or classics though because I don’t really enjoy contemporary settings in kids books (honestly it’s a struggle to read contemporary in general lol).",
        "time": "2023-01-11 04:19:59 UTC",
        "score": 3,
        "link_id": "t3_108hhty",
        "parent_id": "t3_108hhty"
    },
    {
        "comment_id": "j3umoyd",
        "subreddit": "books",
        "body": "Britain is probably my most favorite whether it’s written by a Brit or just takes place in Britain. I also enjoy Japanese content specifically manga and light novels though I haven’t tried their regular fiction yet though there are a few on my radar.",
        "time": "2023-01-11 04:12:35 UTC",
        "score": 1,
        "link_id": "t3_108hq6b",
        "parent_id": "t3_108hq6b"
    },
    {
        "comment_id": "j3323ss",
        "subreddit": "books",
        "body": "Reading multiple books at a time won’t get you through your tbr faster it’ll just slow you down in finishing 1 book. When I read 2 books at a time it’s so that if my mood shifts I have something different to switch to and can keep the momentum going. I would say if you are really enjoying your current read focus on that and pull out a second book only if you need the change and if you do go for something of another genre.",
        "time": "2023-01-05 18:43:41 UTC",
        "score": 5,
        "link_id": "t3_1044taj",
        "parent_id": "t3_1044taj"
    },
    {
        "comment_id": "j3309er",
        "subreddit": "books",
        "body": "I wanted to read it but couldn’t push through the sample. Really really hate the writing style. It’s a combination of 2 things I absolutely despise present tense and purple prose. And all the line crossing in the text didn’t help matters either.",
        "time": "2023-01-05 18:32:46 UTC",
        "score": 7,
        "link_id": "t3_1045sck",
        "parent_id": "t3_1045sck"
    },
    {
        "comment_id": "j30mbhz",
        "subreddit": "books",
        "body": "I read the first book and had planned to read the 2nd but I ended up not bothering. I didn’t love the first book enough (Ambrose got on my nerves) and it was already feeling like the author dawdled too long on the school stuff that it felt like the author wrote themselves into a corner. Then I read somewhere that this trilogy was supposed to be a prologue. Like finish what you started before trying to expand. If the author was someone that had reliable releases I probably would have pushed on but I don’t want to read a series with such a massive gap in release dates. It’s not fun.",
        "time": "2023-01-05 05:53:52 UTC",
        "score": 3,
        "link_id": "t3_103o8y0",
        "parent_id": "t3_103o8y0"
    },
    {
        "comment_id": "j2cjy53",
        "subreddit": "books",
        "body": "I have the bad habit of being a completist and will buy the whole thing before I even read the first book. Some series that I’m not as sure about I may get as ebooks as they go on sale.",
        "time": "2022-12-31 06:03:06 UTC",
        "score": 3,
        "link_id": "t3_zzflcd",
        "parent_id": "t3_zzflcd"
    },
    {
        "comment_id": "j2ad1fs",
        "subreddit": "books",
        "body": "The ACOTAR series. I read it back in 2017. Not sure I would read it now as I read cozy fantasy now but I still have fond memories of it and am not ashamed to have loved it at the time.",
        "time": "2022-12-30 20:13:29 UTC",
        "score": 2,
        "link_id": "t3_zz3o7j",
        "parent_id": "t3_zz3o7j"
    },
    {
        "comment_id": "j29sl88",
        "subreddit": "books",
        "body": "It doesn’t happen very often but it happened twice this month. First was Cinder Nanny by Sariah Wilson. It shattered my expectations and is now my second all time favorite. The other is 7th Time Loop by Tokyo Amekawa. I was on the fence about starting this series as it isn’t complete but gave it a go. I’m still feeling sad and want more.",
        "time": "2022-12-30 18:02:45 UTC",
        "score": 1,
        "link_id": "t3_zz2bf7",
        "parent_id": "t3_zz2bf7"
    },
    {
        "comment_id": "j29rran",
        "subreddit": "books",
        "body": "My favorite audiobook is Sh*t My Dad Says by Justin Halpern. Very hilarious narration. I have listened to that so many times when I’m feeling down.",
        "time": "2022-12-30 17:57:34 UTC",
        "score": 1,
        "link_id": "t3_zz4wvi",
        "parent_id": "t3_zz4wvi"
    },
    {
        "comment_id": "j275bzm",
        "subreddit": "books",
        "body": "I attempted to read The Love Hypothesis but only made it 90 pages in. The author’s use of buzzwords annoyed me too much. Just felt like it was trying to hard to be relevant.",
        "time": "2022-12-30 03:16:46 UTC",
        "score": 1,
        "link_id": "t3_zyd3t2",
        "parent_id": "t3_zyd3t2"
    },
    {
        "comment_id": "j2754v8",
        "subreddit": "books",
        "body": "Romance. I like the hopefulness of it. That despite everything love wins. I like knowing that there will be an HEA. It’s also wish fulfillment for my depressing life.",
        "time": "2022-12-30 03:15:17 UTC",
        "score": 2,
        "link_id": "t3_zyde3d",
        "parent_id": "t3_zyde3d"
    },
    {
        "comment_id": "j2483yl",
        "subreddit": "books",
        "body": "Ernest Hemingway and F Scott Fitzgerald. For more recent authors Stephen King. Love the adaptations of his works but I just can’t get into his writing style.",
        "time": "2022-12-29 15:27:00 UTC",
        "score": 1,
        "link_id": "t3_zy3q2d",
        "parent_id": "t3_zy3q2d"
    },
    {
        "comment_id": "j246uk9",
        "subreddit": "books",
        "body": "Wisteria Society for Lady Scoundrels by India Holton. Initially passed on this a year ago but then I discovered some things about my reading taste and saw that this sounded like it would be up my alley after all. \n\nCinder Nanny by Sariah Wilson. Originally passed on it because I thought the plot was something else but then I read the reviews and realized it’s exactly what I want. \n\n7th Time Loop by Touko Amekawa. Just finished this recently. I got pulled in by the covers and realized it’s exactly the kind of story I like.",
        "time": "2022-12-29 15:18:09 UTC",
        "score": 3,
        "link_id": "t3_zy6slm",
        "parent_id": "t3_zy6slm"
    },
    {
        "comment_id": "j22loju",
        "subreddit": "books",
        "body": "I buy mostly so I can control my reading experience. Read books when I want to read them. Everything has a long waitlist and as a mood reader that doesn’t work very well with my reading habits. \n\nI probably go for the library if it’s something I’m really hesitant about or if it’s hard to get my own copy of but the library has it.",
        "time": "2022-12-29 04:51:51 UTC",
        "score": 2,
        "link_id": "t3_zxeapy",
        "parent_id": "t3_zxeapy"
    },
    {
        "comment_id": "j22l1q0",
        "subreddit": "books",
        "body": "It’s not big anymore as I had to get rid of most of my books. But romance makes up the majority.",
        "time": "2022-12-29 04:46:15 UTC",
        "score": 3,
        "link_id": "t3_zxom3l",
        "parent_id": "t3_zxom3l"
    },
    {
        "comment_id": "j1zl3wh",
        "subreddit": "books",
        "body": "Maybe one option can be a classic, another can be the Holocaust and the third can be a graphic novel dealing with a historical topic in general like March, Persepolis, They Called Us Enemy or the Holocaust graphic novel Maus. I find sometimes heavy subjects are easier to read in graphic novel form.",
        "time": "2022-12-28 16:07:49 UTC",
        "score": 3,
        "link_id": "t3_zxcoa0",
        "parent_id": "t3_zxcoa0"
    },
    {
        "comment_id": "j1oq1as",
        "subreddit": "books",
        "body": "I definitely think life experiences can change your tastes. While I’ve never loved grim stuff I was much heavier into superheroes/action stuff, historical fiction and crime TV growing up and into my 20s too. But after some personal struggles I veer largely towards humor and romance now and can only enjoy those other things under certain conditions. I think it’s because I need to feel some sense of hope as my everyday living experience is full of hopelessness and powerlessness.",
        "time": "2022-12-26 03:58:29 UTC",
        "score": 2,
        "link_id": "t3_zutjs8",
        "parent_id": "t3_zutjs8"
    },
    {
        "comment_id": "j0zmrai",
        "subreddit": "books",
        "body": "The only time I find it annoying are Booktubers  listening to audiobooks at like 3x speed or skim read or even claim unfinished books to bolster numbers so they can say they read 100+ books. But I think my issue with them is related to wider questionable practices I have with these channels and their influence on publishing. A regular person can do whatever they want and I wouldn’t care.",
        "time": "2022-12-20 16:31:09 UTC",
        "score": 1,
        "link_id": "t3_zq9x8b",
        "parent_id": "t3_zq9x8b"
    },
    {
        "comment_id": "j0t5mw6",
        "subreddit": "books",
        "body": "I remind myself that I read to enjoy the experience and escapism. I can’t read every book out there anyways so I just want to focus on having a good time. Sometimes I reread a book slowly over time on an as needed basis when nothing else interests me. Sometimes I’ll blast through a reread, just kind of depends on my mood.",
        "time": "2022-12-19 05:28:10 UTC",
        "score": 3,
        "link_id": "t3_zpdkvn",
        "parent_id": "t3_zpdkvn"
    },
    {
        "comment_id": "j0t5ask",
        "subreddit": "books",
        "body": "To read: Does the premise interest me? \n\nTo quit: do I dislike the execution of the premise?",
        "time": "2022-12-19 05:24:39 UTC",
        "score": 130,
        "link_id": "t3_zpitsl",
        "parent_id": "t3_zpitsl"
    },
    {
        "comment_id": "j075tzs",
        "subreddit": "books",
        "body": "I read a lot of modern books and old books from the first half of the 20th century. It’s just a matter of finding your niche. There are several genres as well as literary fiction to choose from when it comes to modern books. Experiment to find what works. I know for me I love social comedies which is why I gravitate towards historical fiction and romance in addition to older works like Austen and Wodehouse.",
        "time": "2022-12-14 15:46:21 UTC",
        "score": 1,
        "link_id": "t3_zlbzdc",
        "parent_id": "t3_zlbzdc"
    },
    {
        "comment_id": "j025e34",
        "subreddit": "books",
        "body": "Escapism. But it’s also a good stress reliever. And it gives me a hobby besides internet surfing. Sometimes I like to read nonfiction to learn but I prefer documentaries whenever I can in that area.",
        "time": "2022-12-13 15:16:52 UTC",
        "score": 1,
        "link_id": "t3_zkswwu",
        "parent_id": "t3_zkswwu"
    },
    {
        "comment_id": "izsormj",
        "subreddit": "books",
        "body": "The Uncle Fred books by PG Wodehouse",
        "time": "2022-12-11 15:49:45 UTC",
        "score": 2,
        "link_id": "t3_ziw2pn",
        "parent_id": "t3_ziw2pn"
    },
    {
        "comment_id": "izfab7w",
        "subreddit": "books",
        "body": "Agreed. Between Booktok’s influence over publishing and the current trend of adapting every popular book for streaming is partly why I started turning to lesser known books. I just want to sit in my quiet little corner and let my imagination run wild. Adaptations just take that magic away from me. But at least in moving away from popular stuff I’ve discovered some pretty neat gems that I otherwise wouldn’t have known about.",
        "time": "2022-12-08 18:07:03 UTC",
        "score": 2,
        "link_id": "t3_zfnqq0",
        "parent_id": "t3_zfnqq0"
    },
    {
        "comment_id": "iyw8eb6",
        "subreddit": "books",
        "body": "I want to get into rereading more. I don’t do it as much as I would like because I have so many unread books and have also been struggling with concentration lately making it even harder to read.",
        "time": "2022-12-04 17:38:34 UTC",
        "score": 1,
        "link_id": "t3_zc6vu8",
        "parent_id": "t3_zc6vu8"
    },
    {
        "comment_id": "ixw1h9l",
        "subreddit": "books",
        "body": "Simply put it successfully reached its target audience specially people that love adult fantasy romance. So of course fans love it. I loved the ACOTAR series when I read it several years ago. It played into a trope I didn’t realized I loved. Also the author made me love the characters. As someone that prefers romance first it worked for me in a way most other fantasy books just don’t.",
        "time": "2022-11-26 20:41:03 UTC",
        "score": 4,
        "link_id": "t3_z5e7sb",
        "parent_id": "t3_z5e7sb"
    },
    {
        "comment_id": "ixtkvos",
        "subreddit": "books",
        "body": "Most of my favorites are lesser known books. Overseas by Beatriz Williams is my all time favorite book but I have only seen one other person on Reddit mention it and it was only because I had introduced them to the book via a previous post apparently lol.",
        "time": "2022-11-26 06:10:13 UTC",
        "score": 1,
        "link_id": "t3_z4oze3",
        "parent_id": "t3_z4oze3"
    },
    {
        "comment_id": "ixtkmt1",
        "subreddit": "books",
        "body": "I prefer Holmes especially since I enjoy the Stephen Fry narration but even without I still prefer it to Poirot. Not really a fan of Agatha Christie.",
        "time": "2022-11-26 06:07:10 UTC",
        "score": 3,
        "link_id": "t3_z4nu8d",
        "parent_id": "t3_z4nu8d"
    },
    {
        "comment_id": "ixkyn10",
        "subreddit": "books",
        "body": "I think it’s a balancing act. Classics are classics for a reason and shouldn’t be completely chucked out the window. But I don’t think they should be put so high up on a pedestal that people act like it’s sacrilegious to want curriculums that emphasize books that are more relevant to students. Society is forever changing and that means what we teach and how we teach needs to be able to adapt to those changes. As much as some people want to keep things how they used to be, that just isn’t the way things work anymore. I think the biggest challenge is deciding what classics and contemporary books should be taught and at what grade level. Unfortunately that is a political hornets nest.",
        "time": "2022-11-24 05:38:05 UTC",
        "score": 5,
        "link_id": "t3_z36yo8",
        "parent_id": "t3_z36yo8"
    },
    {
        "comment_id": "ixdf10r",
        "subreddit": "books",
        "body": "I enjoy books with a slice of life vibe. I particularly love older fiction like Elizabeth Cadell and Angela Thirkell that give me that feel from a bygone era. I also like manga slice of life. There is something oddly comforting about a book that focuses on the mundane and ordinary. Sometimes lots of action is exhausting.",
        "time": "2022-11-22 16:40:39 UTC",
        "score": 5,
        "link_id": "t3_z1umro",
        "parent_id": "t3_z1umro"
    },
    {
        "comment_id": "ix6qagd",
        "subreddit": "books",
        "body": "Noblebright all the way.  Reality is bleak enough for me. I want the books I read to focus on the lighter side of things and to be full of hope.",
        "time": "2022-11-21 04:01:45 UTC",
        "score": 1,
        "link_id": "t3_z0obru",
        "parent_id": "t3_z0obru"
    },
    {
        "comment_id": "iwadzsd",
        "subreddit": "books",
        "body": "To me nothing wrong with reading YA or kids books as an adult. I will say it is rather awkward and uncomfortable when perusing Children’s and YA shelves at bookstores however.",
        "time": "2022-11-14 03:55:43 UTC",
        "score": 1,
        "link_id": "t3_yuijka",
        "parent_id": "t3_yuijka"
    },
    {
        "comment_id": "ivvpwly",
        "subreddit": "books",
        "body": "Nicholas Sparks typically gets categorized in the general fiction section. That section tends to be the catch all for books that don’t fit neatly into genre conventions.",
        "time": "2022-11-10 23:24:45 UTC",
        "score": 2,
        "link_id": "t3_yr05io",
        "parent_id": "t1_ivvl8a8"
    },
    {
        "comment_id": "ivronnx",
        "subreddit": "books",
        "body": "Nope if we want that or a love story with a depressing ending we will read other genres or general fiction. For us it’s not a strange rule as that’s the entire selling point. We read romance because we want to enjoy and celebrate a couple finding true love. We want to enjoy the journey and know that everything will work out in the end. It’s a pretty diverse genre even though they all end with HEAs and HFNs.",
        "time": "2022-11-10 02:43:53 UTC",
        "score": 21,
        "link_id": "t3_yr05io",
        "parent_id": "t1_ivrni5e"
    },
    {
        "comment_id": "ivrlfbk",
        "subreddit": "books",
        "body": "For me it would be romance because it has a non-negotiable rule that you have to have a happily ever after or happily for now. This isn’t a bad thing though as I like many other fans would be angry to see a book mis-labeled as romance when it’s not. However for the purpose of the question  I feel like no other genre has a strict rule on how it must end other than maybe murder mysteries revealing who did it. However even then the broader crime/thriller genre doesn’t necessarily follow that rule.",
        "time": "2022-11-10 02:19:04 UTC",
        "score": 30,
        "link_id": "t3_yr05io",
        "parent_id": "t3_yr05io"
    },
    {
        "comment_id": "ivnzxio",
        "subreddit": "books",
        "body": "Lol when did 25 become old? It can be hard to find your footing once you go out in the real world and find that all your mental energy gets used up by work and obligations. It’s sometimes hard to find that spark again. But also keep in mind every genre including literary fiction goes through trends. Especially now more than ever with publishers chasing after the social media crowd. I know for me I’ve read more older fiction over new releases in the last several years due to my disinterest in current trends. It’s always good to have a diverse range of genres to read from to avoid burn out and disinterest. Sometimes our reading tastes can massively change too.",
        "time": "2022-11-09 10:21:18 UTC",
        "score": 3,
        "link_id": "t3_yqdzwi",
        "parent_id": "t3_yqdzwi"
    },
    {
        "comment_id": "ivmsh4x",
        "subreddit": "books",
        "body": "General fiction and romance are my main sections although the romance section has gone down hill dramatically at my used bookstore since they started focusing primarily on new and popular authors only. I have started going to the mystery genre to look at some Golden age works. Ended up getting lots of used Campion novels because of that.",
        "time": "2022-11-09 02:28:41 UTC",
        "score": 1,
        "link_id": "t3_ypr0ac",
        "parent_id": "t3_ypr0ac"
    },
    {
        "comment_id": "ivbo6ru",
        "subreddit": "books",
        "body": "My mom read mostly religious stuff so very seldom did I read any of her books. But she still fostered a love of reading through taking me to the library a lot and scholastic book orders when she could afford to. No idea if book orders still exists. Anyways, to this day I take great comfort being in libraries and bookstores surrounded by so many potential new favorites. You guys can make a weekly trip to the library, you can sit back and read while you let your kid have run off the place to find whatever it is they want to read. Don’t put any restrictions on them either, I’ve seen some parents do that at the bookstore and it’s always sad to see the deflated looks on the kids faces, no wonder reading ends up feeling like a chore in the end.",
        "time": "2022-11-06 19:58:08 UTC",
        "score": 2,
        "link_id": "t3_ynt5vi",
        "parent_id": "t3_ynt5vi"
    },
    {
        "comment_id": "iv2iij6",
        "subreddit": "books",
        "body": "I love that book and have been meaning to read the sequel at some point. I can reread the stinky cheeses scene over and over again when I’m down in the dumps.",
        "time": "2022-11-04 20:01:42 UTC",
        "score": 10,
        "link_id": "t3_ym5jem",
        "parent_id": "t3_ym5jem"
    },
    {
        "comment_id": "iurerlp",
        "subreddit": "books",
        "body": "Anne of Green Gables, Betsy Tacy and Enola Holmes are a few of my favorite kids books I’ve enjoyed over the years.",
        "time": "2022-11-02 14:03:18 UTC",
        "score": 4,
        "link_id": "t3_yjuhcz",
        "parent_id": "t3_yjuhcz"
    },
    {
        "comment_id": "iump0jn",
        "subreddit": "books",
        "body": "I like reading kids books from time to time especially older ones, there is something simple about them that I find enjoyable. They stood the test of time for a reason. However this doesn’t mean I love every kids book I read. Some are well written with universal messages that anyone can relate to and others are very much books that only a child can love.",
        "time": "2022-11-01 14:38:51 UTC",
        "score": 3,
        "link_id": "t3_yiwtq9",
        "parent_id": "t3_yiwtq9"
    },
    {
        "comment_id": "iuhzhdm",
        "subreddit": "books",
        "body": "I’m a massive romance reader and I skim the sex scenes. They just don’t do anything for me. Puts me at odds with most of the people in that genre as a result. I’ve actually gotten shamed over it.",
        "time": "2022-10-31 14:06:45 UTC",
        "score": 1,
        "link_id": "t3_yhks0d",
        "parent_id": "t3_yhks0d"
    },
    {
        "comment_id": "iudt1n1",
        "subreddit": "books",
        "body": "Well currently I have 3 books going. One memoir, a Golden Age murder mystery, and a children’s mystery because autumn and winter make me want mysteries. Usually I try to totally different genres but in situations like this where the genre is the same I go for different age ranges and/or time periods or different subgenre.",
        "time": "2022-10-30 15:58:30 UTC",
        "score": 2,
        "link_id": "t3_yhbj39",
        "parent_id": "t3_yhbj39"
    },
    {
        "comment_id": "iubndci",
        "subreddit": "books",
        "body": "Elizabeth Peters. I was reading some Pink Carnations books from Lauren Willig and Emmeline Truelove books by Beatriz Williams and read somewhere that both authors loved Elizabeth Peters specifically her Amelia Peabody books and I can totally see in what ways the authors were inspired now.",
        "time": "2022-10-30 02:15:55 UTC",
        "score": 2,
        "link_id": "t3_yh12mw",
        "parent_id": "t3_yh12mw"
    },
    {
        "comment_id": "iton3s5",
        "subreddit": "books",
        "body": "I’ve had to purge shelves twice due to moving. I try and keep stuff I absolutely love and get ebooks of stuff I merely like but wouldn’t reread as frequently or doesn’t bring me nearly as much joy and comfort.",
        "time": "2022-10-25 04:23:02 UTC",
        "score": 2,
        "link_id": "t3_ycnuzt",
        "parent_id": "t3_ycnuzt"
    },
    {
        "comment_id": "itjp1ir",
        "subreddit": "books",
        "body": "My all time favorite Overseas by Beatriz Williams has a 3.5 rating. I can see to an extent as the writing isn’t that great but it does enough of what I love that it doesn’t bother me.",
        "time": "2022-10-24 03:28:19 UTC",
        "score": 2,
        "link_id": "t3_ybkhd6",
        "parent_id": "t3_ybkhd6"
    },
    {
        "comment_id": "it7ebdo",
        "subreddit": "books",
        "body": "I love the escapism and calming qualities of reading. I love leaving my own crappy life behind to experience another. Or sometimes enjoying wish fulfillment. The only guilt I experience is how I turn to books to cope rather than try and figure out ways to make my real life better. I’ve just sort of given up.",
        "time": "2022-10-21 13:59:22 UTC",
        "score": 34,
        "link_id": "t3_y9tw7v",
        "parent_id": "t3_y9tw7v"
    },
    {
        "comment_id": "iruixeq",
        "subreddit": "books",
        "body": "I mean I’ve dealt with weird stares and commentary just for reading romance and comics in public. I just chalk it up to some sort of non-readers syndrome. The need to make fun of what you don’t understand. But I can see it being scary in todays climate reading anything that can be misconstrued for beliefs you don’t have. There isn’t a lot of nuance these days. I agree with others that ebooks may be the better option. Or have an at home book and a public book.",
        "time": "2022-10-11 03:23:59 UTC",
        "score": 231,
        "link_id": "t3_y0woir",
        "parent_id": "t3_y0woir"
    },
    {
        "comment_id": "irt625y",
        "subreddit": "books",
        "body": "I’m not interested in her books but I feel like in  general romance and women’s fiction tend to get more disproportionate amount of hate and criticism than books from other genres. Often held under the guise of “this book is romanticizing toxic relationships” etc as if readers aren’t capable of critical thinking. I think some people do resent that her books got as popular as they did when there isn’t anything extraordinary about them so they play up the problematic elements. It’s natural that when something becomes really popular it’s also going to attract a lot of people that don’t like it for various reasons. The wonderful thing about fiction is it let’s us explore ideas and experiences different from our own. If you enjoy the books there is nothing wrong with that. I’m sure a lot of people that criticize her books read something else that could be considered problematic too.",
        "time": "2022-10-10 21:07:25 UTC",
        "score": 8,
        "link_id": "t3_y0ejs7",
        "parent_id": "t3_y0ejs7"
    },
    {
        "comment_id": "iqc0b6z",
        "subreddit": "books",
        "body": "I read mostly historical fiction and later ya romance. I remember Dear America and similar books being a fave. I also loved books like The Sisterhood of the Traveling Pants. As an adult I still read historical fiction and romance albeit adult stuff. The biggest change is that I also read older fiction now and sometimes experiment with fantasy and mysteries which I read very sparingly as a kid.",
        "time": "2022-09-29 05:23:51 UTC",
        "score": 2,
        "link_id": "t3_xqaise",
        "parent_id": "t3_xqaise"
    },
    {
        "comment_id": "ipqh8uz",
        "subreddit": "books",
        "body": "That’s how I get sometimes when I’m reading early to mid 20th century classics. There is something oddly comforting in the slow paced nature of the stories. It can be soothing when I’m feeling anxious.",
        "time": "2022-09-24 16:51:09 UTC",
        "score": 12,
        "link_id": "t3_xmt2pj",
        "parent_id": "t3_xmt2pj"
    },
    {
        "comment_id": "ipj8rot",
        "subreddit": "books",
        "body": "Her fans get on my nerves bc they block aisles in the bookstores but otherwise I have no care for Hoover herself or her books. No desire to read them. But I don’t have any hate towards them either. She’s not the worst in terms problematic romances, in fact there is an entire sub genre dedicated to that now and she has no obligation to write a certain way for young people as her books are adult. \n\nHonestly I’d rather they hype up Hoover than books and authors I actually like. That’s happened before and it’s not fun, absolutely sucks. Hype just has a way of ruining everything especially if it’s from Booktok.",
        "time": "2022-09-22 23:18:39 UTC",
        "score": 13,
        "link_id": "t3_xlg78j",
        "parent_id": "t3_xlg78j"
    },
    {
        "comment_id": "ipc61k8",
        "subreddit": "books",
        "body": "I didn’t start reading again until I was in my final year and no longer had as much required reading. I had long commutes to my internship which left me more time to do some reading.",
        "time": "2022-09-21 14:51:10 UTC",
        "score": 3,
        "link_id": "t3_xk4mjp",
        "parent_id": "t3_xk4mjp"
    },
    {
        "comment_id": "ip3u5e9",
        "subreddit": "books",
        "body": "If possible start with the library so you can at least save money and return what you don’t like without having to finish. \n\nThere isn’t a simple or easy system. All you can do is figure out the ingredients of what made the books you like work and try to find something similar. See what other authors write in that genre.  Who pops up on a Google search of similar authors. It really is just trial and error. Eventually you read enough to know what you like and dislike.",
        "time": "2022-09-19 19:56:05 UTC",
        "score": 9,
        "link_id": "t3_ximji6",
        "parent_id": "t3_ximji6"
    },
    {
        "comment_id": "ip2vtsh",
        "subreddit": "books",
        "body": "To me there is a difference between historical fiction proper and then historical romance, historical mystery, and historical fantasy. And I say that as a reader of all 4 of those things. The latter 3 is merely a setting and accuracy isn’t usually expected. It’s more of a tool than anything else. The primary function of those books is to be romance, mystery, or fantasy. The former on the other is its own thing where the focus is on historical events and accuracy and doesn’t fit into any genre as it can be about anything. The main function is that the book brings that period and experience to life for the reader.",
        "time": "2022-09-19 16:10:25 UTC",
        "score": 7,
        "link_id": "t3_xi9bme",
        "parent_id": "t3_xi9bme"
    },
    {
        "comment_id": "ioxjxsq",
        "subreddit": "books",
        "body": "You should go to r/romancebooks they can probably give you more help as this is a pretty popular book over there compared to this subreddit.",
        "time": "2022-09-18 14:38:22 UTC",
        "score": 1,
        "link_id": "t3_xh9xt7",
        "parent_id": "t3_xh9xt7"
    },
    {
        "comment_id": "iovw4oj",
        "subreddit": "books",
        "body": "I don’t really have anything specific but I feel like it might be a good time to get back on with some murder mysteries maybe either Lord Peter, Campion, or Amelia Peabody. That or jump back into some regencies from Julia Quinn or Georgette Heyer. Autumn for me makes me think cozy low key books that have humor and a good cast of characters that I want to snuggle up to.",
        "time": "2022-09-18 04:14:10 UTC",
        "score": 5,
        "link_id": "t3_xh2koc",
        "parent_id": "t3_xh2koc"
    },
    {
        "comment_id": "io4cy7u",
        "subreddit": "books",
        "body": "Well since the library no longer operates on tax dollars I think they should push back against these conservative groups and remove all their kind of books for being offensive and when they all get upset over it remind them that they don’t pay taxes and get no say anymore. If they want it back refund the library. I know it does absolutely nothing to fix the problems but when you are dealing with unreasonable bullies sometimes you get to a point where you can’t always be the bigger person.",
        "time": "2022-09-12 13:33:54 UTC",
        "score": 4,
        "link_id": "t3_xcaj9p",
        "parent_id": "t3_xcaj9p"
    },
    {
        "comment_id": "invf7n3",
        "subreddit": "books",
        "body": "PG Wodehouse is like a warm cup of tea to the soul. His books are light hearted and humorous. I love his Uncle Fred books the most but his Jeeves books are most popular. His Psmith series is entirely in the public domain and is a good way to start as well.",
        "time": "2022-09-10 16:28:18 UTC",
        "score": 2,
        "link_id": "t3_xartsh",
        "parent_id": "t3_xartsh"
    },
    {
        "comment_id": "inqe3ob",
        "subreddit": "books",
        "body": "I think most people are open to liking unlikeable characters. Hence the term “love to hate”. It’s just that you still have to make the character compelling and interesting. If the unlikeable character is just annoying and obnoxious then the book becomes too tedious to read. Also for me I have a limit to how many unlikeable or annoying characters I can tolerate in a book. I DNFed a book once for having too many one dimensional antagonists and too many dull protagonists. I read books primarily for the characters so if there isn’t someone of interest to me it’s really hard to push through.",
        "time": "2022-09-09 14:47:37 UTC",
        "score": 2,
        "link_id": "t3_x9fgnq",
        "parent_id": "t3_x9fgnq"
    },
    {
        "comment_id": "inmjnkh",
        "subreddit": "books",
        "body": "At my core my love for romance and historical fiction haven’t changed. But I’ve started reading from genres that I generally don’t like (mysteries and fantasy) because I discovered a well written romance can make them enjoyable for me, however I’m really picky about it. I discovered a love for mid 20th century women’s fiction and social comedies a few years ago and that made up a lot of my reading in recent years. As I get older I’m getting less experimental and more set in my ways. I just want happy endings. \n\nThe most surprising change, I’ve completely lost interest in superhero comics didn’t think that would ever happen. Life stuff resulted in me steadily reading less of it until I realized I didn’t miss it that much. Some stuff like manga and nonfiction runs in cycles for me.",
        "time": "2022-09-08 19:02:13 UTC",
        "score": 2,
        "link_id": "t3_x8un5c",
        "parent_id": "t3_x8un5c"
    },
    {
        "comment_id": "injeniw",
        "subreddit": "books",
        "body": "I love the film adaptations but I have tried reading several books and his style just isn’t for me. Can’t say exactly what puts me off. I just don’t mesh with it. But I understand the appeal to people that like his books. Its no different than with other genre fiction. I’m just not his audience at least with the books.",
        "time": "2022-09-08 02:33:58 UTC",
        "score": 1,
        "link_id": "t3_x8h6pu",
        "parent_id": "t3_x8h6pu"
    },
    {
        "comment_id": "ingbxvq",
        "subreddit": "books",
        "body": "It saddens me when books I love become movies or tv shows. I know it won’t be done right and now I’ll have to hear every obnoxious hype & critique everyone will have to say. It’s like having your secret treasure trove discovered. The Bridgerton books are a major example for me. I despise the show so much. It has little in common with the books. I can’t even enjoy the books as much anymore. Now I strive to find lesser known books that are adaptation-proof. Never want to go through that again.",
        "time": "2022-09-07 14:17:25 UTC",
        "score": 1,
        "link_id": "t3_x80nq9",
        "parent_id": "t3_x80nq9"
    },
    {
        "comment_id": "indxdwm",
        "subreddit": "books",
        "body": "I love Historical fiction (specifically WWI and WWII) but sometimes it can be a bit draining with all the tragedies. I feel like authors overdo it in effort to be “realistic” or to really drive home how awful the past was. I avoid certain topics and like you prefer nonfiction and documentaries on those subjects. I think it’s a matter of finding the right topic that can compliment the nonfiction. I usually aim for HF that focuses on women’s roles in historical events as they tend to be a bit more hopeful in tone and focus on a subject that doesn’t have a lot on the nonfiction side (though I do enjoy what books there are on the topic).",
        "time": "2022-09-07 00:25:04 UTC",
        "score": 5,
        "link_id": "t3_x7mdoh",
        "parent_id": "t3_x7mdoh"
    },
    {
        "comment_id": "in3q8xm",
        "subreddit": "books",
        "body": "I’m someone that gets anxiety and have put books down due to dread. It’s always been an issue but got worse due to real life stuff. One way I try to deal with it is to set aside time to read the book uninterrupted at least to get through a major plot point. It would drive me insane to be in the middle of something intense and be forced to put it down due to life getting in the way. I also am someone that is fine with spoiling the end and just enjoy the journey instead. \n\nQuite honestly most of my reading has shifted towards lower conflict books and light hearted books as well. Pushing through is ok and maybe you can get used to it eventually but if it’s making you feel sick I would think about if this is something you are really enjoying and try to find the kinds of books that work better for you.",
        "time": "2022-09-04 21:06:27 UTC",
        "score": 7,
        "link_id": "t3_x5wurz",
        "parent_id": "t3_x5wurz"
    },
    {
        "comment_id": "in2y588",
        "subreddit": "books",
        "body": "Ain’t that the truth. Long transit commutes is actually what got me back into reading many years ago and then I got a smartphone and things went steadily downhill from there….",
        "time": "2022-09-04 17:49:50 UTC",
        "score": 3,
        "link_id": "t3_x5rabq",
        "parent_id": "t1_in2t14i"
    },
    {
        "comment_id": "in2tydf",
        "subreddit": "books",
        "body": "My only rule regarding what’s considered reading is that it needs to have a Goodreads entry at least so I can add it to my stats. Most web comics seem to have that, at least the ones I’ve been wanting to read. I do keep a separate list for novels vs any graphic art form and then a Goodreads list where it’s all together. I just like to look at how my reading changes over the years.",
        "time": "2022-09-04 17:22:30 UTC",
        "score": 4,
        "link_id": "t3_x5rypv",
        "parent_id": "t3_x5rypv"
    }
]