[
    {
        "comment_id": "lxfsxpe",
        "subreddit": "books",
        "body": "Yes. I wasn’t a reader as a kid so I missed out on many common books. Once as an adult I happened to be reading Call of the Wild; it was in my bag. Anyway, a famous pianist was nearby and I opened my bag to grab a sharpie for him for an autograph. He curled his lip and mockingly asked “why are you reading THAT?!”  I felt ashamed even thought I was thoroughly enjoying the book. I was in my 20s then. Today I think he was just being a smug asshole.",
        "time": "2024-11-16 14:50:55 UTC",
        "score": 3,
        "link_id": "t3_1gsnbnq",
        "parent_id": "t3_1gsnbnq"
    },
    {
        "comment_id": "lvl0atg",
        "subreddit": "books",
        "body": "Yes! Zen and the Art of Motorcycle Maintenance. The MC is an absolute asshole that is abusive to his son. It’s incredible.",
        "time": "2024-11-05 20:32:33 UTC",
        "score": 25,
        "link_id": "t3_1gketck",
        "parent_id": "t3_1gketck"
    },
    {
        "comment_id": "ldag9ui",
        "subreddit": "books",
        "body": "I had a hard time putting down the lord of the rings books, even read some of it driving! (I was young and stupid. Don’t do that!) I tried reading the game of thrones books and only got a few pages in before I was bored.",
        "time": "2024-07-15 13:49:07 UTC",
        "score": 2,
        "link_id": "t3_1e3mzzj",
        "parent_id": "t3_1e3mzzj"
    },
    {
        "comment_id": "k7lunyt",
        "subreddit": "books",
        "body": "Don Quixote. \n\nCervantes ended his book with the main Don Quixote still living, leaving other authors to continue the story. One version became very popular, so popular that Cervantes used it in his own continuation of the story which became part 2 of the novel. It’s absolutely hilarious. Cervantes made damn sure Don Quixote was very dead at the end. The whole book is laugh out loud funny and I hope this post will get some of you to read it. Just read the opening chapter and you’ll see.",
        "time": "2023-11-03 03:42:12 UTC",
        "score": 19,
        "link_id": "t3_17miqkq",
        "parent_id": "t3_17miqkq"
    },
    {
        "comment_id": "k6n1pok",
        "subreddit": "books",
        "body": "I’ll sometimes mark the first time characters are introduced so I can go back and remind myself who they are if I forget. Helps with Tolstoy and other long books.",
        "time": "2023-10-27 04:21:39 UTC",
        "score": 6,
        "link_id": "t3_17gsw06",
        "parent_id": "t3_17gsw06"
    },
    {
        "comment_id": "j6vq402",
        "subreddit": "books",
        "body": "I started the book as an ebook and found plenty of misprints. I bought a hard copy and it’s much much better. Still weird but much more readable.",
        "time": "2023-02-02 05:30:08 UTC",
        "score": 2,
        "link_id": "t3_10rd2n9",
        "parent_id": "t1_j6vpx52"
    },
    {
        "comment_id": "j6vn248",
        "subreddit": "books",
        "body": "Well,,,, not exactly. There is grammar and punctuation. It’s just loaded with non sequitur and is more stream of consciousness than a regular novel. I’m currently reading it and I find it to be weird and beautiful. It’s like music or poetry. Hard to put my finger on it. It’s fun to read.",
        "time": "2023-02-02 04:59:43 UTC",
        "score": 5,
        "link_id": "t3_10rd2n9",
        "parent_id": "t1_j6vmo07"
    },
    {
        "comment_id": "j6vmftw",
        "subreddit": "books",
        "body": "Why?",
        "time": "2023-02-02 04:53:48 UTC",
        "score": 1,
        "link_id": "t3_10rd2n9",
        "parent_id": "t1_j6v4svu"
    },
    {
        "comment_id": "j3rjt89",
        "subreddit": "books",
        "body": "Indeed.  Big sad for me.  Maybe I'll learn the lesson.  I almost watched Don Quixote and now I'm sure I shouldn't.",
        "time": "2023-01-10 16:19:53 UTC",
        "score": 1,
        "link_id": "t3_108djib",
        "parent_id": "t1_j3riwko"
    }
]