[
    {
        "comment_id": "lr01cm5",
        "subreddit": "books",
        "body": "Thanks for the nostalgia.  I fondly remember reading that comic in the 1970s.  I assumed it was older than 1955.  It was in a stack of comics that my grandparents had in a closet, I think left behind by my father, although I would have thought that in 1955 he would have been a little old for the target demographic for Uncle Scrooge comics.  However he has always read everything he thought might be fun or interesting without worrying about that sort of thing, so perhaps not.  In my mid 50s, I'd love to see that comic again.",
        "time": "2024-10-08 21:14:14 UTC",
        "score": 1,
        "link_id": "t3_1fz9dgg",
        "parent_id": "t1_lqzs0hh"
    },
    {
        "comment_id": "l0yp5vk",
        "subreddit": "books",
        "body": "Sure.  This seems like a case in which both things might be true.  The article did cite that the viewers of the show were 58% male and the readers of the books were 60% female.  So by that measure the books do somewhat better than the show with women.  But given how many people read for fun, the total number of people reading the books is probably much smaller than the number of people watching the series.  So I would not assume that enthusiasm for the source material is a dominant factor in the show's popularity with either men or women.  Given the context here, I was more interested in commenting on the popularity of the books, not the show.",
        "time": "2024-04-23 23:02:56 UTC",
        "score": 4,
        "link_id": "t3_1cb4qk9",
        "parent_id": "t1_l0y1rrl"
    },
    {
        "comment_id": "l0wej8o",
        "subreddit": "books",
        "body": "The New York Times even had an article a few months ago pointing out that the Amazon series was doing well with women and the publisher had estimated at some point that the readership for the novels was about 60% women.\n\nI know a lot of women who like mysteries and thrillers.  If I were going to make a guess based on people I know, it would be that perhaps men tend to like anti-heroes more.  But I'm not even confident of that.",
        "time": "2024-04-23 15:13:41 UTC",
        "score": 26,
        "link_id": "t3_1cb4qk9",
        "parent_id": "t1_l0w7rvt"
    },
    {
        "comment_id": "jjsu7q9",
        "subreddit": "books",
        "body": "I used to avoid Ayn Rand.  I still do, but I used to too.\n\n(Apologies to Mitch Hedberg.)",
        "time": "2023-05-11 22:40:20 UTC",
        "score": 4,
        "link_id": "t3_13ep9nt",
        "parent_id": "t3_13ep9nt"
    },
    {
        "comment_id": "jf8en9t",
        "subreddit": "books",
        "body": "Not to mention outliving one son who died very young, two adult daughters, and his wife.  And he had financial problems.  He made bad investments.  Hi publishing business failed.  He lost his fancy house and later declared bankruptcy.  Twain had a pretty grim view of the  world in later life.",
        "time": "2023-04-06 20:40:34 UTC",
        "score": 5,
        "link_id": "t3_12dbkcb",
        "parent_id": "t1_jf6zr91"
    },
    {
        "comment_id": "jajsswp",
        "subreddit": "books",
        "body": "If you enjoy crime fiction at all, his books might be worth a try again.  Especially if 19 was a long time ago.  His style is really pared down with minimal description and all the action happening in very informal natural dialogue.   The author steps almost completely out of the way in favor of the plot and characters.  It can look odd in how consistent he was with that style, but he was very good at it. The plots have fun twists and are often very funny.\n\nOf course, it's also possible Get Shorty was a dud that I haven't read yet.",
        "time": "2023-03-01 22:55:40 UTC",
        "score": 2,
        "link_id": "t3_11f3vot",
        "parent_id": "t1_jajprjx"
    },
    {
        "comment_id": "jajp3my",
        "subreddit": "books",
        "body": "I often feel dated, and that all still seems recent to me.  But the judgment on the book is surprising.  Perhaps Elmore Leonard isn't to your taste?  I can't argue specifics, since I haven't read that particular book.  But I am a fan of the 10 or so books that I have read and Get Shorty is on my list to read soon.  Leonard generally got glowing critical reviews for pretty much everything he wrote, including for Get Shorty (having just checked with a little googling).  I kind of regret that I didn't latch on to Elmore Leonard in the 80s or 90s.  I really only tried his books relatively recently.",
        "time": "2023-03-01 22:30:21 UTC",
        "score": 1,
        "link_id": "t3_11f3vot",
        "parent_id": "t1_jajl8r4"
    },
    {
        "comment_id": "iyf738q",
        "subreddit": "books",
        "body": "I would assume mostly pre-boomers, at least early on in that period. When Reagan was elected, the youngest boomers weren't old enough to vote. And most of the rest were in the age range that everyone complains has had low turnout in elections for several generations at least.  Boomers certainly had a big impact on elections by the '90s, but I don't think they were dominant during the Reagan era in the US.",
        "time": "2022-11-30 23:03:04 UTC",
        "score": 4,
        "link_id": "t3_z8nhjd",
        "parent_id": "t1_iydxuzh"
    }
]