[
    {
        "comment_id": "ly6jbid",
        "subreddit": "books",
        "body": "In the middle of Neal Stephensons' Cryptonomicon, there is a multiple-page treatise for the perfect preparation of a bowl of Cap'n Crunch.",
        "time": "2024-11-21 01:36:21 UTC",
        "score": 6,
        "link_id": "t3_1gw36ki",
        "parent_id": "t3_1gw36ki"
    },
    {
        "comment_id": "lt0jjwx",
        "subreddit": "books",
        "body": "Finished:  A wrinkle in time, by Madeleine L'Engle\n\nStarted: Hell's Detective, by Michael Logan",
        "time": "2024-10-21 14:59:59 UTC",
        "score": 5,
        "link_id": "t3_1g8m07x",
        "parent_id": "t3_1g8m07x"
    },
    {
        "comment_id": "ls9xlk0",
        "subreddit": "books",
        "body": "For me knowing there is a twist makes me look for the twist.  So if I know it does absolutely change my mindset and does act as a spoiler.",
        "time": "2024-10-16 22:35:50 UTC",
        "score": 1,
        "link_id": "t3_1g4dsyu",
        "parent_id": "t3_1g4dsyu"
    },
    {
        "comment_id": "lhjnivb",
        "subreddit": "books",
        "body": "I know this sounds like a hipster, but I read the first one pre-hype. I randomly grabbed and checked them out at the library. It was a quick, fun read, and I really, really enjoyed it largely because I had zero expectations. It had a clever premise, a likable main character, and an intense situation. And it wrapped itself up in a neat little bow without Deus Ex Machina (pun intended) or other random event ending. It was refreshing, not life-changing.",
        "time": "2024-08-11 04:53:57 UTC",
        "score": 1,
        "link_id": "t3_1eoyc4r",
        "parent_id": "t3_1eoyc4r"
    },
    {
        "comment_id": "ki832ob",
        "subreddit": "books",
        "body": "All Systems Red.   The first murderbot book.",
        "time": "2024-01-17 02:42:53 UTC",
        "score": 1,
        "link_id": "t3_198l0cu",
        "parent_id": "t3_198l0cu"
    },
    {
        "comment_id": "k3alsg4",
        "subreddit": "books",
        "body": "For the longest time I loved reading on my Kindle but I realized to my kids it looked no different than browsing the web.  Back to books.  Thankfully we have a good library and I can place holds online.  Now they pick up books more frequently.",
        "time": "2023-10-03 15:24:40 UTC",
        "score": 1,
        "link_id": "t3_16yitdc",
        "parent_id": "t1_k38zjwc"
    },
    {
        "comment_id": "jvvsizr",
        "subreddit": "books",
        "body": "I moved 3 times in 5 years and was cured of my book hoarding addiction.",
        "time": "2023-08-12 15:42:53 UTC",
        "score": 1,
        "link_id": "t3_15p0dpw",
        "parent_id": "t3_15p0dpw"
    },
    {
        "comment_id": "jcw42u8",
        "subreddit": "books",
        "body": "The Myth series by Robert Asprin.  Another Fine Myth, Myth Conceptions, Myth Directions. They aren't even stocked at my municipal library system.   I've got them on my wishlist at [thriftooks.com](https://thriftooks.com) so maybe this is a sign its time.",
        "time": "2023-03-20 00:32:04 UTC",
        "score": 12,
        "link_id": "t3_11vrjjc",
        "parent_id": "t3_11vrjjc"
    },
    {
        "comment_id": "ift03bq",
        "subreddit": "books",
        "body": "I don't disagree entirely, but after moving a few times, I disagree entirely.   I have always lived in areas with a great library system, so now I am all about checking out and returning. I kept physical copies of my favorites that I always go back to, but my wife and I got rid of the bulk of our library through gifting, sales, and charitable donations.  \n\nI agree there is an enormous bang for your buck, but a library card is free. I do feel bad about not contributing to the author, but I assume the system somehow works, so they get compensation for library copies.",
        "time": "2022-07-12 02:08:52 UTC",
        "score": 1,
        "link_id": "t3_vuvphm",
        "parent_id": "t3_vuvphm"
    },
    {
        "comment_id": "ifsyson",
        "subreddit": "books",
        "body": "The Beach by Alex Garland on a beach in Thailand that was near \"the beach\".  I later found almost everywhere claimed to be The One, but it didn't matter.  Fun read.  Improved by the setting and the cocktails.\n\nHeart of Darkness by Joesph Conrad while on a slow boat up the Mekong River. I realize it isn't the same setting but a very very slow boat, against the current in what some might call oppressive heat.   It fit the mood. \n\nBoth books were picked up and returned to lending libraries in hostels and hotels.",
        "time": "2022-07-12 01:59:12 UTC",
        "score": 2,
        "link_id": "t3_vw2q60",
        "parent_id": "t3_vw2q60"
    },
    {
        "comment_id": "ifswxot",
        "subreddit": "books",
        "body": "Finished:   The Long Way to a Small, Angry Planet by Becky Chambers\n\nA great summer space romp.  I enjoyed it, and it fell into my library queue at the perfect time.  (I only wish I got it next week for my beach read).  One of those books where you kind of hope it becomes a series, and you're ok if it isn't because you don't want it \"spoiled\". \n\nStarted: Devolution: a Firsthand Account of the Rainier Sasquatch Massacre by Max Brooks\n\nI liked World War Z.  I lived in the Pacific Northwest.  I have an affinity with Bigfoot.  I'm looking forward to it (and again I wish I got this one next week for my beach read).",
        "time": "2022-07-12 01:45:16 UTC",
        "score": 4,
        "link_id": "t3_vwepcb",
        "parent_id": "t3_vwepcb"
    }
]