[
    {
        "comment_id": "lvlxqjt",
        "subreddit": "books",
        "body": "It’s usually left up to the teacher, but every classroom I’ve taught in has something similar.  Silent reading time, DEAR(drop everything and read), etc.",
        "time": "2024-11-05 23:20:52 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvlwbyg"
    },
    {
        "comment_id": "lvlorfj",
        "subreddit": "books",
        "body": "Funny you say that, as I was the exact same way.  I got away from reading and found I couldn’t stay focused enough to read like I used to.  Last summer I met up with an old travel buddy who I hadn’t seen in 10+ years, and she had a list of books she’s read that she thought I’d like.  I felt embarrassed to say I basically haven’t read since we had travelled together, so I made a vow to myself to read more.  It’s nice bonding time with my daughter to just sit under a blanket together and read, even when it’s our own separate books.\n\nTry to be a good model for your daughter in the sense that she will see you reading for personal enjoyment instead of just reading to her.  It may entice her to pick up a book more!",
        "time": "2024-11-05 22:32:29 UTC",
        "score": 2,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvlltrx"
    },
    {
        "comment_id": "lvkoc5e",
        "subreddit": "books",
        "body": "Yup.  I did the same.  My daughter is 8 and now reads at every opportunity.  I actually have to take books away at the table while she’s eating or else she’ll forget to eat.   Even though she reads herself, we still have a big chapter book that I read to her most nights after she has some personal reading time before bed.  \n\nAs a teacher, parents tell me that they don’t have time to read to their kids at night, but I talk to my students and they tell me their parents are watching tv or on their phone.",
        "time": "2024-11-05 19:33:47 UTC",
        "score": 76,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvj7mke"
    },
    {
        "comment_id": "l3grik0",
        "subreddit": "books",
        "body": "I’m sorry to hear that, dude.  I’m a teacher, and I stress daily to parents that they need to read to their kids at a young age.  It’s so important in the long run.",
        "time": "2024-05-10 18:12:15 UTC",
        "score": 4,
        "link_id": "t3_1co6uzu",
        "parent_id": "t1_l3cea22"
    }
]