[
    {
        "comment_id": "ltl69h0",
        "subreddit": "books",
        "body": "Milo's egg scheme is literally just buying eggs for 1c and selling them for 5c. All the rest of the obfuscation is basically irrelevant, because everyone involved is just him reselling to himself.\n\n\nHe's not selling to himself at the end of the chain though, he's mostly selling to the US army / airforce. The end buyer isn't him, it's the mess halls etc. He  controls all the mess halls towards the end of the book and ensures that they buy from him, but he's not buying it with his own money - the mess halls are paying with US government money. ",
        "time": "2024-10-24 22:10:15 UTC",
        "score": 9,
        "link_id": "t3_1gb3zeq",
        "parent_id": "t1_ltj4t5s"
    },
    {
        "comment_id": "lrdf54a",
        "subreddit": "books",
        "body": "It's actually the \"good guys\" who are quite rapey in the series. E.g. F'nor straight up rapes Brekke (I think it's in The White Dragon, but could be in another book as it's been quite a while). \n\n\nShe's portrayed as shy and inexperienced, but she likes F'nor. So he initiates sex to \"help\" her. It's shown that she is initially interested but tries to stop things going to actual sex. He's then surprised when she \"tries to fight him\" when he does it anyway. He overpowers her and then, because she's fighting him, \"he wasn't gentle but he was thorough\" (that disgusting sentence is burned in my brain years later).\n\n\nThis is never shown to be bad, on the contrary she decides she loves him and they stay together, with her being raped somehow making her more confident.\n\n\nThis sort of thing happens throughout the series. A lot of it is couched in euphemistic language, but as an adult reading it you notice how often it happens - not just that there's no explicit consent, but that there's (explicitly or implicitly) **nonconsent**.",
        "time": "2024-10-11 05:48:00 UTC",
        "score": 15,
        "link_id": "t3_1g0o72y",
        "parent_id": "t1_lrd910s"
    },
    {
        "comment_id": "lrcwtgm",
        "subreddit": "books",
        "body": "I read them as a kid but man, rereading them they did not age well. They are so rapey. ",
        "time": "2024-10-11 03:11:05 UTC",
        "score": 9,
        "link_id": "t3_1g0o72y",
        "parent_id": "t1_lrccw83"
    },
    {
        "comment_id": "l5fd9w7",
        "subreddit": "books",
        "body": "The women in the book are women who are encountered by soldiers in WWII - prostitutes, nurses, and a few civilians (e.g. Luciana, and the maid murdered by Aarfy). \n\nI think you may have missed a lot of the point though. For example, Heller explicitly spells out that Nately's Whore's Kid Sister doesn't get a name (he writes out the whole description every time) because young girls in wartime are nameless brutalized victims. The women are mostly prostitutes because that's how they are treated in an occupied city. Aarfy's story about his fraternity days is literally a description of him and his friends gang raping teenagers. \n\nHeller doesn't think this stuff is ok, he's beating you over the head with how gross and wrong it is, but also how normalised it is in wartime.",
        "time": "2024-05-24 04:19:50 UTC",
        "score": 4,
        "link_id": "t3_1cytpby",
        "parent_id": "t1_l5dq0mw"
    },
    {
        "comment_id": "l1w77tw",
        "subreddit": "books",
        "body": "*Fear of Flying* by Erica Jong when I was 13. Probably the book which has had the single biggest impact on me - reading a woman talking about what, in her words, \"made her cunt drip\" certainly had an effect on a teenage boy. Having said that, it's the thing that got me interested in feminism and shaped a lot of my ideas about women and how I relate to them. \n\nFunnily enough, last time I mentioned this to someone they absolutely blasted me for saying that reading this book gave me a better understanding of women as sexual beings in their own right. Apparently that's something that a 13yo should just know.",
        "time": "2024-04-30 04:18:29 UTC",
        "score": 1,
        "link_id": "t3_1cg3ztu",
        "parent_id": "t3_1cg3ztu"
    },
    {
        "comment_id": "kvnsjhp",
        "subreddit": "books",
        "body": "MLO is a pretty easy and comparatively straight forward read, so long as you remember the guts from the first two.",
        "time": "2024-03-20 00:06:18 UTC",
        "score": 2,
        "link_id": "t3_1binh8l",
        "parent_id": "t1_kvlzgkm"
    }
]