[
    {
        "comment_id": "lrzfs55",
        "subreddit": "books",
        "body": "Finished **Kafka on the Shore, by Haruki Murakami**. Kind of have mixed feelings about this. I really liked some of the musings on music/literature, the scenes at the cabin, and most of the Tanaka sections. On the other hand there were lots of cinfusing aspects and strange sex scenes. Guessing I would probably catch more on a reread.\n\nStarting **Pedro Páramo, by Juan Rulfo**. Probably going to dive into some Hemingway short stories as well",
        "time": "2024-10-15 03:10:37 UTC",
        "score": 1,
        "link_id": "t3_1g3c8ey",
        "parent_id": "t3_1g3c8ey"
    },
    {
        "comment_id": "lr05umy",
        "subreddit": "books",
        "body": "Varies depending on the airline and movie. There are definitely some that still include graphic sex scenes",
        "time": "2024-10-08 21:41:07 UTC",
        "score": 1,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqzkzzc"
    },
    {
        "comment_id": "lqzdizl",
        "subreddit": "books",
        "body": "Dune",
        "time": "2024-10-08 19:00:29 UTC",
        "score": 5,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqyidgn"
    },
    {
        "comment_id": "lqzcwc5",
        "subreddit": "books",
        "body": "And even the movies/shows provided on the inflight entertainment sometimes have nudity/sex. Those are way more visible to people sitting around you than a book would be",
        "time": "2024-10-08 18:57:01 UTC",
        "score": 6,
        "link_id": "t3_1fz2l5t",
        "parent_id": "t1_lqyoqtz"
    },
    {
        "comment_id": "lqvz7hv",
        "subreddit": "books",
        "body": "Finished **Distant Star by Roberto Bolaño** - felt like I missed a bunch of references due to my lack of poetry knowledge and I didn't feel fully satisfied. Still, it did leave me looking forward to reading *The Savage Detectives* and *2666*.\n\nStarted **Kafka on the Shore by Haruki Murakami**",
        "time": "2024-10-08 03:35:07 UTC",
        "score": 2,
        "link_id": "t3_1fy3zxz",
        "parent_id": "t3_1fy3zxz"
    },
    {
        "comment_id": "lqkmob1",
        "subreddit": "books",
        "body": "Recently finished **The Sun Also Rises by Ernest Hemingway** and **Snow Crash by Neal Stephenson** and enjoyed both of them. I'm glad that I read some background info on TSAR as I think I would have been somewhat confused otherwise. I particularly enjoyed the latter half during the festival. I also recently traveled to Spain, so it was cool to read about some of the locations that I had visited.\n\n Snow Crash was much better than Ready Player One which I read recently as well. The religious history/linguistics/virology stuff was interesting, but the exposition dumps did become a bit of a slog and I found some of the logic/premises to be tenuous.\n\nCurrently reading **Distant Star by Roberto Bolaño**. There are some great passages/scenes but I do feel like I'm missing out by not understanding all of the various poetry references.",
        "time": "2024-10-06 04:53:57 UTC",
        "score": 1,
        "link_id": "t3_1fsrvtj",
        "parent_id": "t3_1fsrvtj"
    },
    {
        "comment_id": "lptfetf",
        "subreddit": "books",
        "body": "I had a 36 ACT, 12 AP tests with a 5 on every single one (including lit and language which required reading books), 3.98 unweighted, 5.7 weighted (97% average), and would have been able to walk onto one of their sports teams and still got rejected. Guess I should have paid someone to write my application essays like other kids at my high school did",
        "time": "2024-10-01 14:30:17 UTC",
        "score": 9,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt4vcu"
    },
    {
        "comment_id": "lomnwwt",
        "subreddit": "books",
        "body": "Finished - **Player Piano, by Kurt Vonnegut**. Probably not quite as strong as the others that I have read from him (Slaughterhouse-Five,  Cat's Cradle), but interesting and pretty relevant to some of today's hot topics like automation. Also thought it was pretty funny that he basically predicted the current state of college football\n\n\nStarted - **The Sun Also Rises, by Ernest Hemingway**",
        "time": "2024-09-24 02:17:47 UTC",
        "score": 3,
        "link_id": "t3_1fngsns",
        "parent_id": "t3_1fngsns"
    }
]