[
    {
        "comment_id": "ly4bged",
        "subreddit": "books",
        "body": "Just kiss each other already, Jesus.",
        "time": "2024-11-20 16:24:39 UTC",
        "score": 1,
        "link_id": "t3_1gvqymx",
        "parent_id": "t1_ly46dz2"
    },
    {
        "comment_id": "danao1f",
        "subreddit": "books",
        "body": "\"I'm going away now.\" - Alex the Parrot. ",
        "time": "2016-12-01 06:38:07 UTC",
        "score": 9,
        "link_id": "t3_5ftsnt",
        "parent_id": "t1_dan0vbn"
    },
    {
        "comment_id": "cp5yn40",
        "subreddit": "books",
        "body": "jesus h christ, its a vagina. realized a decade later.",
        "time": "2015-03-06 04:33:54 UTC",
        "score": 11,
        "link_id": "t3_2y0ytg",
        "parent_id": "t1_cp5udva"
    },
    {
        "comment_id": "coh79eo",
        "subreddit": "books",
        "body": "I WIN AGAIN LEWS THERIN! ",
        "time": "2015-02-10 17:43:45 UTC",
        "score": 1,
        "link_id": "t3_2vdjbz",
        "parent_id": "t3_2vdjbz"
    },
    {
        "comment_id": "cnvm7jt",
        "subreddit": "books",
        "body": "How would you differentiate storytelling and literature? ",
        "time": "2015-01-21 02:18:54 UTC",
        "score": 19,
        "link_id": "t3_2t2ayi",
        "parent_id": "t1_cnv8okt"
    },
    {
        "comment_id": "clwnqxo",
        "subreddit": "books",
        "body": "Yea last two books were real let downs to me too. Was kind of pissed Jimmy was just relegated to a crazy person. Clearly he had issues but he was pretty damn aware in the first book. ",
        "time": "2014-11-08 15:44:54 UTC",
        "score": 1,
        "link_id": "t3_2locsk",
        "parent_id": "t1_clwnbhp"
    },
    {
        "comment_id": "cesa32r",
        "subreddit": "books",
        "body": "The wheel of time turns and ages come and go. It does not end :) I guess when I think about it I enjoyed Demandred being the Dragon of that place. I wonder if Rand was supposed to be the actual Bao the Wild. ",
        "time": "2014-01-17 23:09:40 UTC",
        "score": 2,
        "link_id": "t3_1vfs2y",
        "parent_id": "t1_ces7dz5"
    },
    {
        "comment_id": "ces9vbf",
        "subreddit": "books",
        "body": "Ah my B totally misinterpreted what u meant. Thanks for clarifying I totally agree. Sorry if I rebutted too aggressively ",
        "time": "2014-01-17 23:00:50 UTC",
        "score": 0,
        "link_id": "t3_1vfs2y",
        "parent_id": "t1_ces7eu6"
    },
    {
        "comment_id": "ces5t5r",
        "subreddit": "books",
        "body": "[Book 5 Spoiler](/s \"GRRM couldn't figure out, for a very long time, how to deal with the political ramifications of Dany flying off on Drogon in Meereen since she was the only POV in Slaver's Bay he said that he didn't want her to come back and have all the events that transpired told to her through exposition so he made Selmy a POV.\") I'm pretty sure. I know that was at least a large part of the delay. ",
        "time": "2014-01-17 20:32:24 UTC",
        "score": 1,
        "link_id": "t3_1vfs2y",
        "parent_id": "t1_ces3v3m"
    },
    {
        "comment_id": "ces5jbd",
        "subreddit": "books",
        "body": "I won't deny that Sanderson had a hell of a job to tackle. I have been a fan of WoT for over 13 years and fully understand the extent of the mess Jordan left. I just feel that Rand's confrontation with the Dark One, the haphazard introduction of Demandred, [the deaths of](/s \"Egwene and Gawyn plus Galad losing an arm despite being the best swordsman,I love Lan and am happy he put down Demandred but Galad had been hyped as the best for awhile\") and the compulsion in the LB were just silly as was the the last chapter. No to mention Aviendha's vision. Very little closure all around.",
        "time": "2014-01-17 20:22:41 UTC",
        "score": 3,
        "link_id": "t3_1vfs2y",
        "parent_id": "t1_ces3yfo"
    },
    {
        "comment_id": "ces549o",
        "subreddit": "books",
        "body": "It is strongly implied that Loras and Renly had a romantic and sexual relationship and I think there is a level of tenderness and respect given to Loras' attitude about Renly that negates any accusation of homophobia. GRRM may be stereotypical in his depiction of homosexual individuals but not homophobic. There is zero evidence that Loras likes woman, where are you getting this from?\n\nEDIT: I'd also like to add that homophobia is a symptom of Westeros, not the writing, gay men are ostracized in the world and such preferences are commonly seen as shameful or at least not publicly spoken of. This is not a reflection at all on GRRM's opinions and I think it shows the strength of his writing to create an accurate depiction of a homophobic society without indulging or subscribing to that mindset. ",
        "time": "2014-01-17 20:07:59 UTC",
        "score": 13,
        "link_id": "t3_1vfs2y",
        "parent_id": "t1_ces4a3p"
    },
    {
        "comment_id": "cerwq5f",
        "subreddit": "books",
        "body": "I've read 1-4 at least 4-6 times and the 5th twice. The first three are brilliant. I personally think the show only did justice for the first book and every season since has been underwhelming and sparse interpretations of the latter books. The differences between season 2 and book 2, especially the development of lore and magic, are painful (i.e Dany's time in the House of the Undying, Jon's story line with Halfhand & Ygritte, and Sandor/Sansa development are terrible in the show but AWESOME in the book). George is a rather clever writer in his ability to hide clues in seemingly unimportant events, television being television a lot of the subtlety in the writing has been replaced with pretty much a giant finger pointing you towards the answer. For example Loras' and Renly's homosexuality was only ever hinted at and alluded to in the text whereas in the show you more or less see em go at it several times. Book four is a tough read only because the first three were roller coasters of war, murder, and intrigue. Four is much more focused on the political and societal repercussions of the War of Five Kings. Hence a certain character spending most of her time wandering around the Riverlands just talking to people whose lives were destroyed by the clash between Stark and Lannister. There is little to no action in book 4 but there is some really beautiful prose (Septon's speech on Broken Men is some of GRRM's greatest writing). I am one of the many who waited 6 years between books 4 and 5 despite being told 5 was halfway done when GRRM started (damn you Meerenese Knot!) thus when it finally released there was no way it wouldn't disappoint in some ways as 5 paralleled 4 in terms of addressing the aftermath of Dany and Jon's actions in 3. All in all it is an amazing series that better not pull a Wheel of Time or I may lose my shit. Memory of Light blew donkey balls.\n\nEDIT: An to address your question as to the structure of the novels, GRRM writes from a point of view perspective for various characters, unlike in the show where you see Robb alone or with non Stark characters in the books you only ever see him through Cat's eyes. Thus it allows for a great sense of subjectivity in terms of whether what your reading a character see is accurate to what is actually occuring. Sansa is painful to read in how perfectly GRRM capture a naive and innocent mind. Like physically painful. But her growth in Book 4 is very well done.  ",
        "time": "2014-01-17 14:57:42 UTC",
        "score": 181,
        "link_id": "t3_1vfs2y",
        "parent_id": "t3_1vfs2y"
    },
    {
        "comment_id": "cbw2i4v",
        "subreddit": "books",
        "body": "The Hyperion Cantos. [EDIT] Should have kept scrolling down someone beat me to it. ",
        "time": "2013-08-27 03:54:12 UTC",
        "score": 1,
        "link_id": "t3_1l4ncy",
        "parent_id": "t3_1l4ncy"
    },
    {
        "comment_id": "cbw2b8z",
        "subreddit": "books",
        "body": "Yea this was a huuuge let down. So many hanging plot threads I feel like the author just got bored by the end and just quit.",
        "time": "2013-08-27 03:44:09 UTC",
        "score": 1,
        "link_id": "t3_1l4fu5",
        "parent_id": "t1_cbvshnq"
    },
    {
        "comment_id": "cbrd2if",
        "subreddit": "books",
        "body": "Hyperion is pretty far up. I didn't realize anyone else had read that. Everyone I've ever asked who claims to be into \"sci-fi books\" has never heard of it/read it. So sad. ",
        "time": "2013-08-20 04:38:18 UTC",
        "score": 1,
        "link_id": "t3_1knyki",
        "parent_id": "t3_1knyki"
    }
]