[
    {
        "comment_id": "lu93tvu",
        "subreddit": "books",
        "body": "It’s wild!",
        "time": "2024-10-28 22:20:13 UTC",
        "score": 3,
        "link_id": "t3_1gdybbt",
        "parent_id": "t1_lu73jub"
    },
    {
        "comment_id": "lu63hkx",
        "subreddit": "books",
        "body": "Started and finished All Fours by Miranda July.",
        "time": "2024-10-28 13:00:27 UTC",
        "score": 5,
        "link_id": "t3_1gdybbt",
        "parent_id": "t3_1gdybbt"
    },
    {
        "comment_id": "kasgexf",
        "subreddit": "books",
        "body": "Oh, funny - I just read the description on Amazon and realized I’ve read it, so went to Goodreads and saw that I gave it 4 stars in 2016.  : )",
        "time": "2023-11-26 03:27:24 UTC",
        "score": 1,
        "link_id": "t3_1837q8s",
        "parent_id": "t1_kapivsx"
    },
    {
        "comment_id": "kasfmqc",
        "subreddit": "books",
        "body": "Thanks for the recommendation.  I’ll check it out.",
        "time": "2023-11-26 03:21:27 UTC",
        "score": 1,
        "link_id": "t3_1837q8s",
        "parent_id": "t1_kapivsx"
    },
    {
        "comment_id": "kanhmwq",
        "subreddit": "books",
        "body": "I tend to read a book only once, but right now I’m listening to the audible version of “The Sparrow,” which I read many, many years ago and loved.  I wanted to see if I’d still enjoy it as much all these years later.  Seeing as I can’t wait to get back to it tonight, I’d say it’s still one of my faves.",
        "time": "2023-11-25 03:29:05 UTC",
        "score": 3,
        "link_id": "t3_1837q8s",
        "parent_id": "t3_1837q8s"
    },
    {
        "comment_id": "k9tcxcs",
        "subreddit": "books",
        "body": "Both great books!",
        "time": "2023-11-18 22:04:36 UTC",
        "score": 3,
        "link_id": "t3_17yec8s",
        "parent_id": "t1_k9t6dz4"
    },
    {
        "comment_id": "k2dfb5c",
        "subreddit": "books",
        "body": "For sure!  Whenever more rights are taken away from women in this country, I can’t help but think of this book.",
        "time": "2023-09-27 01:46:40 UTC",
        "score": 2,
        "link_id": "t3_16t4zdc",
        "parent_id": "t1_k2d94sw"
    },
    {
        "comment_id": "k0zb48m",
        "subreddit": "books",
        "body": "The Covenant of Water by Abraham Verghese.  I didn’t even realize until I was halfway through the audible version that it was the author himself actually reading the book!  He brought so much life to every character, most likely better than anyone else could have possibly done.  A truly wonderful book.",
        "time": "2023-09-17 13:42:44 UTC",
        "score": 1,
        "link_id": "t3_16kpwic",
        "parent_id": "t3_16kpwic"
    },
    {
        "comment_id": "k0n0xnj",
        "subreddit": "books",
        "body": "I listened to the audible version of IQ84 and enjoyed every minute…so much so that I was sad when it ended.",
        "time": "2023-09-15 01:46:27 UTC",
        "score": 1,
        "link_id": "t3_16hs175",
        "parent_id": "t1_k0fp8ve"
    },
    {
        "comment_id": "jzdpjir",
        "subreddit": "books",
        "body": "I joined a book club a gazillion years ago when there were 12 women.  We’re now down to 7, one of which lives too far to come to our monthly meetings, and it’s actually very nice being small.  In the beginning, one woman would host the group at her home, providing appetizers, wine, sodas and a dessert, but now we just meet at a restaurant for a couple of hours.  I would say the hard part would be finding other people who love to read as much as you do and going from there.  Even if it’s just 2 people discussing a book together, it’s still enjoyable, right?  In time, you can invite others along.  Many women have come and gone from my club, and that’s just fine - lives get busy and many people “don’t have time” to read as much as book-lovers make the time to read.  Also, I think it’s important that people know it’s a “real” book club, not a party.  In mine, whoever chose the book leads the discussion (after about 30 minutes of socializing) and has a list of questions to bring about a discussion.  It’s worked well for us.  Maybe you can begin by telling people that you are starting a book club and ask if they have any interest.",
        "time": "2023-09-06 14:00:32 UTC",
        "score": 3,
        "link_id": "t3_16bjxdi",
        "parent_id": "t3_16bjxdi"
    },
    {
        "comment_id": "jym1w00",
        "subreddit": "books",
        "body": "I just finished “A Covenant of Water,” and although one would not call it a “happy” ending, it was a satisfying ending in that it wrapped up the book very well.  This is a long book and I had not planned on attempting to read it, but once a friend of mine read it and told me how good it was, I bought the audible version, which is read by the author who is EXCELLENT!  Highly recommend!  Oprah does a 6 part podcast interviewing the author, which I just started today and it adds even more to the entire experience.",
        "time": "2023-09-01 02:34:55 UTC",
        "score": 1,
        "link_id": "t3_16633xd",
        "parent_id": "t3_16633xd"
    },
    {
        "comment_id": "jlda1fe",
        "subreddit": "books",
        "body": "Yes, love Marin Ireland, too.",
        "time": "2023-05-24 01:15:52 UTC",
        "score": 2,
        "link_id": "t3_13pxwcn",
        "parent_id": "t1_jlcrd76"
    },
    {
        "comment_id": "j51z8sy",
        "subreddit": "books",
        "body": "The Sparrow for sure!",
        "time": "2023-01-19 20:57:05 UTC",
        "score": 1,
        "link_id": "t3_10ca52e",
        "parent_id": "t1_j4fsow4"
    },
    {
        "comment_id": "j4javad",
        "subreddit": "books",
        "body": "I have been in a book club for over 15 years. We started with around 12 women and are now down to 7. We meet in person once a month, usually at a restaurant…we socialize for about 30 minutes and then discuss the book. Whoever chose the book has to lead the discussion. It’s fun!",
        "time": "2023-01-16 02:49:31 UTC",
        "score": 2,
        "link_id": "t3_10ca52e",
        "parent_id": "t1_j4eza17"
    },
    {
        "comment_id": "j4gyajf",
        "subreddit": "books",
        "body": "Goodreads",
        "time": "2023-01-15 17:37:27 UTC",
        "score": 1,
        "link_id": "t3_10cks3a",
        "parent_id": "t3_10cks3a"
    },
    {
        "comment_id": "j0xgpte",
        "subreddit": "books",
        "body": "Nuclear Family by Joseph Han",
        "time": "2022-12-20 03:19:42 UTC",
        "score": 2,
        "link_id": "t3_zpojnn",
        "parent_id": "t3_zpojnn"
    },
    {
        "comment_id": "j0ewgd9",
        "subreddit": "books",
        "body": "Just to pop in here to say I love Murakami’s books, especially 1Q84. I listened to the audible version and was actually sad when it ended.  It’s always interesting how different our interests are.  Everyone LOVED “Hail Mary” and I hated it and could not finish the book.",
        "time": "2022-12-16 03:21:14 UTC",
        "score": 1,
        "link_id": "t3_zmp9vd",
        "parent_id": "t1_j0cak99"
    },
    {
        "comment_id": "j0evx64",
        "subreddit": "books",
        "body": "I just have to say I also just finished Parable of the Sower and agree with you 100%.  I almost put it aside, deciding not to even finish, but since it’s such a famous book, I continued to the end.  The main woman was too preachy for me, and I wasn’t impressed with her ideas of a new society…and I didn’t find any of the other characters interesting at all.  There are SO many better books out there!  Just my opinion, of course.",
        "time": "2022-12-16 03:17:02 UTC",
        "score": 1,
        "link_id": "t3_zmp9vd",
        "parent_id": "t3_zmp9vd"
    },
    {
        "comment_id": "ixv3z3p",
        "subreddit": "books",
        "body": "I enjoyed the different perspective on the world the convenience store woman has. Odd book for sure…but not nearly as odd as Earthlings. When I finished Earthlings I said to myself, “That was the weirdest book you ever read and I can’t believe you finished it!”",
        "time": "2022-11-26 16:42:13 UTC",
        "score": 19,
        "link_id": "t3_z58raf",
        "parent_id": "t3_z58raf"
    },
    {
        "comment_id": "ix1dtvc",
        "subreddit": "books",
        "body": "This is amazing!  Thanks for posting this.",
        "time": "2022-11-20 00:10:44 UTC",
        "score": 1,
        "link_id": "t3_yzgjpy",
        "parent_id": "t3_yzgjpy"
    },
    {
        "comment_id": "iweaotx",
        "subreddit": "books",
        "body": "There is a calming that comes with reading a book vs. listening to an audiobook, but I love both.  So in the evening I try to read between 30 to 60 minutes before bed, and then when I turn the lights out, I listen to an audible book for 30 minutes, hoping it’ll put me to sleep.",
        "time": "2022-11-15 00:18:20 UTC",
        "score": 1,
        "link_id": "t3_ytsdd3",
        "parent_id": "t3_ytsdd3"
    },
    {
        "comment_id": "iv8nqkr",
        "subreddit": "books",
        "body": "One of my all time favorites!",
        "time": "2022-11-06 03:25:20 UTC",
        "score": 1,
        "link_id": "t3_ymoemg",
        "parent_id": "t1_iv5m8zu"
    },
    {
        "comment_id": "hzhxjew",
        "subreddit": "books",
        "body": "I adore Wuthering Heights…and seem to enjoy every movie made about it, as well (there are so many).",
        "time": "2022-03-05 21:20:43 UTC",
        "score": 2,
        "link_id": "t3_t7ax3z",
        "parent_id": "t1_hzgrria"
    }
]