[
    {
        "comment_id": "lwkrph5",
        "subreddit": "books",
        "body": "I actually like this. To me it feels honest and unpretentious. Otherwise a writer would use cues that remind the reader of an earlier detail more seamlessly. But I think something is lost.",
        "time": "2024-11-11 13:28:14 UTC",
        "score": 3,
        "link_id": "t3_1gom7rk",
        "parent_id": "t1_lwk2w35"
    },
    {
        "comment_id": "lw3m2lq",
        "subreddit": "books",
        "body": "There was a chapter in Moby Dick that was so beautiful to me I couldn't continue. Every time I would read it and put it down only to read it again the next time. Until I eventually stopped.\n\nI went on to finish the book a few years later. It is definitely not my favorite but probably up there in my top 10.",
        "time": "2024-11-08 16:20:22 UTC",
        "score": 1,
        "link_id": "t3_1gm71rw",
        "parent_id": "t3_1gm71rw"
    },
    {
        "comment_id": "lqy7984",
        "subreddit": "books",
        "body": "Any format specific stuff or extensive footnotes or endnotes, and I prefer physical.\n\nIf the book is huge I much prefer ebooks as it's so much more comfortable to hold.",
        "time": "2024-10-08 15:09:35 UTC",
        "score": 2,
        "link_id": "t3_1fyvq9w",
        "parent_id": "t3_1fyvq9w"
    },
    {
        "comment_id": "lq41hh2",
        "subreddit": "books",
        "body": "No more themes than you can hold strawberries with one hand. For real not even joking",
        "time": "2024-10-03 09:37:53 UTC",
        "score": 1,
        "link_id": "t3_1fug7f3",
        "parent_id": "t3_1fug7f3"
    },
    {
        "comment_id": "lox37pg",
        "subreddit": "books",
        "body": "I see, it's just a tool for advancing your chosen party, not an interest in freedom of information. Just like Republicans paying lip service to freedom and not meaning it either. That is sad.",
        "time": "2024-09-25 21:04:03 UTC",
        "score": 1,
        "link_id": "t3_1fnpuqa",
        "parent_id": "t1_lom7r08"
    },
    {
        "comment_id": "lom7r08",
        "subreddit": "books",
        "body": "Be principled in your pro-liberty stances r/books! I love to see this, and hope you react the same way when similarly authoritarian governments in Europe are trying to fine Twitter, or are arresting the CEO of an encrypted messaging service.",
        "time": "2024-09-24 00:37:03 UTC",
        "score": -7,
        "link_id": "t3_1fnpuqa",
        "parent_id": "t3_1fnpuqa"
    },
    {
        "comment_id": "llkh8la",
        "subreddit": "books",
        "body": "What exactly is wrong with writing with AI? It's just a tool that could be used like any other. Echoes of literature's long history of being opposed to new technologies.",
        "time": "2024-09-05 02:27:47 UTC",
        "score": -5,
        "link_id": "t3_1f8nukm",
        "parent_id": "t3_1f8nukm"
    },
    {
        "comment_id": "lioisu4",
        "subreddit": "books",
        "body": "Exactly, I remember far better a book I read over months than ones I read in a few days or a week. It has longer to occupy and percolate in your mind as you're reading it. It's \"with you\" longer.",
        "time": "2024-08-18 06:32:54 UTC",
        "score": 5,
        "link_id": "t3_1eur7d2",
        "parent_id": "t1_limauge"
    },
    {
        "comment_id": "ktk4c6b",
        "subreddit": "books",
        "body": "Lame rule in this context since its basically a discussion",
        "time": "2024-03-06 03:33:08 UTC",
        "score": 1,
        "link_id": "t3_1b77f30",
        "parent_id": "t1_kth5ocu"
    },
    {
        "comment_id": "ktgqsoe",
        "subreddit": "books",
        "body": "It totally depends on the author! On one hand, there is English language literary fiction that is totally accessible with plain language (still, past basic conversational) that I would guess you could handle easily. Hemingway is probably a great start for native speaking English literature. Another easy way might be to read a modern english translation of a work originally in another language. Modern translations tend to render things in more plain english in my experience. Like the Christine Donaugher translation of Les Miserables (The Wretched), or a modern translation of Dostoevsky.\n\nOn the other hand, there are authors who you have to look up constantly and that will probably never change. I'm a native english speaker who has read all my life and Nabakov and Joyce will always kick my ass. Pale Fire had me looking up words multiple times a page. Joyce's Ulysses famously has something like 20,000 unique words in it. I haven't read it in years but I'm sure it would still be as much of a study session as a reading session for me.\n\nGood luck and have fun!",
        "time": "2024-03-05 15:50:54 UTC",
        "score": 1,
        "link_id": "t3_1b77f30",
        "parent_id": "t3_1b77f30"
    },
    {
        "comment_id": "kg0lrta",
        "subreddit": "books",
        "body": "Another like this is the fragments we have from Epicurus. No coincidence I think that Boccaccio was probably an Epicurean.",
        "time": "2024-01-02 19:21:54 UTC",
        "score": 4,
        "link_id": "t3_18wrym7",
        "parent_id": "t1_kg0lnu1"
    },
    {
        "comment_id": "kg0lnu1",
        "subreddit": "books",
        "body": "Boccaccio's Decameron is from the middle ages and feels written by a totally reasonable, modern person.",
        "time": "2024-01-02 19:21:16 UTC",
        "score": 3,
        "link_id": "t3_18wrym7",
        "parent_id": "t3_18wrym7"
    },
    {
        "comment_id": "k2qv00a",
        "subreddit": "books",
        "body": "Fantastic response. Thank you for pointing this out. I was shocked something so presumptuous and arrogant  was upvoted so highly.",
        "time": "2023-09-29 16:51:17 UTC",
        "score": 6,
        "link_id": "t3_16uuyqi",
        "parent_id": "t1_k2qigtm"
    },
    {
        "comment_id": "k00o7ai",
        "subreddit": "books",
        "body": "She went to great effort on every occasion to clarify what she meant by selfishness, and why she used that word. Yet, almost every argument against her philosophy on this thread is fundamentally misunderstanding her. It is incredibly frustrating as somebody who has carefully read her ideas and become a much better person because of it.\n\nHere is a quote that is just one of the many occasions she clarified her pro-selfishness position. I wager 95% or more of the vocal Rand haters on this subreddit do not understand this. I cannot vocally hating someone you don't understand unless you just want to participate in an echo chamber.\n\n\"To redeem both man and morality, it is the concept of “selfishness” that one has to redeem.\r  \nThe first step is to assert man’s right to a moral existence—that is: to recognize his need of a moral code to guide the course and the fulfillment of his own life . . . .\r  \nThe reasons why man needs a moral code will tell you that the purpose of morality is to define man’s proper values and interests, that concern with his own interests is the essence of a moral existence, and that man must be the beneficiary of his own moral actions.\r  \nSince all values have to be gained and/or kept by men’s actions, any breach between actor and beneficiary necessitates an injustice: the sacrifice of some men to others, of the actors to the nonactors, of the moral to the immoral. Nothing could ever justify such a breach, and no one ever has.\"\r  \n\r  \n\\-- Rand, from the Introduction to the Virtue of Selfishness.\n\nI'm reading The Gay Science next! I'm excited because it looks like the one I may find the most redeeming, if any of his writings. So far his writing has just seemed angry and brutish to be honest, although I like his criticism of Christianity.",
        "time": "2023-09-10 20:50:45 UTC",
        "score": -10,
        "link_id": "t3_16f4zp7",
        "parent_id": "t1_k00l4iw"
    },
    {
        "comment_id": "k00km8o",
        "subreddit": "books",
        "body": "\"To redeem both man and morality, it is the concept of “selfishness” that one has to redeem.  \nThe first step is to assert man’s right to a moral existence—that is: to recognize his need of a moral code to guide the course and the fulfillment of his own life . . . .  \nThe reasons why man needs a moral code will tell you that the purpose of morality is to define man’s proper values and interests, that concern with his own interests is the essence of a moral existence, and that man must be the beneficiary of his own moral actions.  \nSince all values have to be gained and/or kept by men’s actions, any breach between actor and beneficiary necessitates an injustice: the sacrifice of some men to others, of the actors to the nonactors, of the moral to the immoral. Nothing could ever justify such a breach, and no one ever has.\"\n\n\\-- Rand, from the Introduction to the Virtue of Selfishness.\n\n&#x200B;\n\nWow, she supports *selfishness!?* So sociopathic!",
        "time": "2023-09-10 20:30:17 UTC",
        "score": -11,
        "link_id": "t3_16f4zp7",
        "parent_id": "t1_k00f0qg"
    },
    {
        "comment_id": "k00jnfi",
        "subreddit": "books",
        "body": "Can you explain Rand's concept of selfishness? Surely you understand that it's a distinctive conception of selfishness, and that the word deliberately chosen to \"reclaim\" a word that Rand believe was misused.\n\n&#x200B;\n\nIf not, you shouldn't comment about a philosopher you don't understand. I'm not on here lambasting Nietzsche even though almost every bit I've read of him looks mean, cruel, and ignorant.",
        "time": "2023-09-10 20:24:41 UTC",
        "score": -12,
        "link_id": "t3_16f4zp7",
        "parent_id": "t1_k000kiv"
    },
    {
        "comment_id": "k00ispe",
        "subreddit": "books",
        "body": "Like OP said, this has nothing to do with Rand's ideas. Not sure why this was commented or upvoted.",
        "time": "2023-09-10 20:19:44 UTC",
        "score": -20,
        "link_id": "t3_16f4zp7",
        "parent_id": "t1_jzzkf35"
    },
    {
        "comment_id": "k00impz",
        "subreddit": "books",
        "body": "Your responses show that you understand Rand and are committed to responding to the very bad arguments and character assassination, both through misrepresenting her life and her ideas. Most people here are only interested in repeating what they've heard, instead of doing fresh and honest thinking. I commend your dedication to truth but yelling at a hivemind that it's a hivemind is pretty pointless in my opinion. Far better to share with people who have a more honest approach.",
        "time": "2023-09-10 20:18:46 UTC",
        "score": -9,
        "link_id": "t3_16f4zp7",
        "parent_id": "t3_16f4zp7"
    },
    {
        "comment_id": "jutt9kl",
        "subreddit": "books",
        "body": "Rand, Joyce, Boccaccio, Dickens, Hugo, DFW",
        "time": "2023-08-04 23:12:52 UTC",
        "score": 1,
        "link_id": "t3_15hxn5u",
        "parent_id": "t3_15hxn5u"
    },
    {
        "comment_id": "jp7m264",
        "subreddit": "books",
        "body": "Bank teller! Make sure to take your lunch breaks in the vault, especially if geopolitical tensions are rising.",
        "time": "2023-06-23 11:42:12 UTC",
        "score": 16,
        "link_id": "t3_14gqvjc",
        "parent_id": "t3_14gqvjc"
    }
]