[
    {
        "comment_id": "lt7te1j",
        "subreddit": "books",
        "body": "According to my annual spreadsheet, I'm at $3,487.75 for 2024. And not only that, my kiddo has booked a room for his monthly D&D club, free of charge. I shout my love for libraries from the rooftop.",
        "time": "2024-10-22 18:54:41 UTC",
        "score": 6,
        "link_id": "t3_1g9oe7o",
        "parent_id": "t3_1g9oe7o"
    },
    {
        "comment_id": "kv4ylu0",
        "subreddit": "books",
        "body": "Yeah, same here. If I listened on audio, I'll say that first, and then will jot down a couple comments on what I thought.",
        "time": "2024-03-16 13:43:29 UTC",
        "score": 3,
        "link_id": "t3_1bg5d0l",
        "parent_id": "t1_kv4wzy6"
    },
    {
        "comment_id": "ki06zu2",
        "subreddit": "books",
        "body": "$2,474.45. Down from $3,770.02 in 2022. But I didn't read quite as much last year, as I started doing puzzles and video gamed more. I'm off to a decent start this year, $156.35. \n\nThere's absolutely no way I could read as much if I bought everything to read only once, even buying used.",
        "time": "2024-01-15 19:00:34 UTC",
        "score": 3,
        "link_id": "t3_197e9vf",
        "parent_id": "t1_ki05hr7"
    },
    {
        "comment_id": "ki0507r",
        "subreddit": "books",
        "body": "This is me as well. I bought 4 books last year for myself; Heartstopper Volumes 1-4. I've borrowed them from the library and read them multiple times, so figured I'd purchase them. \nI very rarely re-read something, so the library is my jam. I can use Libby all day long for audio books while at work, and request pretty much any book I want from my library and they usually have it within a week. I'm a bit of a nerd,  so I also keep a spreadsheet with the books I read in a given year and how much they would cost if I bought all new.",
        "time": "2024-01-15 18:49:49 UTC",
        "score": 5,
        "link_id": "t3_197e9vf",
        "parent_id": "t1_khzsk3g"
    },
    {
        "comment_id": "kcy3fg1",
        "subreddit": "books",
        "body": "Came here to find this one! It's been on my Goodreads page since 2017. But, promising news I recently heard is that it's coming out next year and there is a cover reveal. So hey, there might be hope yet!",
        "time": "2023-12-11 21:05:41 UTC",
        "score": 1,
        "link_id": "t3_18fyo00",
        "parent_id": "t1_kcxu3y2"
    },
    {
        "comment_id": "hok85uk",
        "subreddit": "books",
        "body": "It was this book that finally made me throw away my stupid commitment to finish books I start. There are still few I won't finish when I start, but this one made me see the light and not feel guilty.\n\n*edited for spelling",
        "time": "2021-12-14 21:20:26 UTC",
        "score": 2,
        "link_id": "t3_rfxv66",
        "parent_id": "t1_hok1tan"
    },
    {
        "comment_id": "ho0b4a6",
        "subreddit": "books",
        "body": "Exactly! I loved that it had its own category. Even though my boys are 12 and 14, I still find myself checking out some picture books from the library every now and then. The illustrations in some are so beautifully amazing, along with the messages and stories in others and I liked that category because it told me which ones I should check at the end of the year if I hadn't already. Oh well.",
        "time": "2021-12-10 17:12:53 UTC",
        "score": 4,
        "link_id": "t3_rcxs9h",
        "parent_id": "t1_ho09e5j"
    },
    {
        "comment_id": "hnzogcb",
        "subreddit": "books",
        "body": "Agreed. I voted in like 3 categories this year, because I had read 3-5 of the choices, but still, there's a chance that something else on that list was way better than the ones I had picked up. So yeah, I know I'm part of the problem by voting without having read all of the choices.",
        "time": "2021-12-10 14:36:16 UTC",
        "score": 3,
        "link_id": "t3_rcxs9h",
        "parent_id": "t1_hnyycjx"
    },
    {
        "comment_id": "hnzo5k2",
        "subreddit": "books",
        "body": "I just want to know what happened to the Picture Books category. I think there was one picture book in the Middle Grade/Children's category, but it was up against Rick Riordan, so it obviously didn't stand a chance.\n\nWas surprised this year by two things - that Nicholas Sparks and Stephen King didn't win. Not because everything they write is wonderful, but that it's such a popularity contest that someone else topped them, and by quite a lot in the case of Sparks.",
        "time": "2021-12-10 14:34:03 UTC",
        "score": 11,
        "link_id": "t3_rcxs9h",
        "parent_id": "t3_rcxs9h"
    },
    {
        "comment_id": "hbxku9o",
        "subreddit": "books",
        "body": "Yes, Perfume. I always feel weirded out recommending this one as it's one of my favorites due to the beautiful descriptions of scent/smell, one of the senses we don't get to read enough about,  in my opinion. But yeah, disturbing book as a whole, for sure!",
        "time": "2021-09-07 14:06:06 UTC",
        "score": 2,
        "link_id": "t3_pj6wxo",
        "parent_id": "t1_hbwdneq"
    },
    {
        "comment_id": "hakjkxp",
        "subreddit": "books",
        "body": "Same here, with the personal notes. I like to think my Goodreads profile is for me and my keeping track of books, and if someone wants to read my review, they can, or they can scroll on by.",
        "time": "2021-08-27 15:55:15 UTC",
        "score": 8,
        "link_id": "t3_pcjfec",
        "parent_id": "t1_hajzlfy"
    },
    {
        "comment_id": "gzr0jbf",
        "subreddit": "books",
        "body": "I just listened to it on audiobook and was surprised with how much I liked it! At first I thought ugh - pretentious college kids, what am I doing with my life, but the more I listened, the more involved I felt with the characters.",
        "time": "2021-05-28 12:13:48 UTC",
        "score": 40,
        "link_id": "t3_nmvy8n",
        "parent_id": "t3_nmvy8n"
    },
    {
        "comment_id": "gz9s5t5",
        "subreddit": "books",
        "body": "I almost could have written your reply myself! For fun this year, I decided to keep a spreadsheet of the cost of the books I've read/listened to and as of today, I'm at $2,263.57. I don't want to spend that much money on reading/listening to books, and I'm in a 800 sqft house with three other people and a dog, so where would I put them all?! \n\nIf I truly LOVE LOVE a book I'll buy a physical copy of it, but I'm pretty much a one and done reader, so there's no point for me. The last book I bought was Allie Brosh's \"Solutions and Other Problems\" because I do like physical copies of graphic novels.",
        "time": "2021-05-24 13:39:46 UTC",
        "score": 2,
        "link_id": "t3_njfjed",
        "parent_id": "t1_gz8ru9d"
    },
    {
        "comment_id": "e7gm09j",
        "subreddit": "books",
        "body": "Definitely Maus as my first choice. I'd also have to say My Favorite Thing is Monsters by Emil Ferris and Mooncop and Baking with Kafka by Tom Gauld. ",
        "time": "2018-10-09 17:03:10 UTC",
        "score": 1,
        "link_id": "t3_9mgyg7",
        "parent_id": "t3_9mgyg7"
    },
    {
        "comment_id": "dfqlcnx",
        "subreddit": "books",
        "body": "I can't recall the last time I purchased a book. Friends and family will buy them for me, but other than that, it's the library all the way. I just can't justify spending $20 on a book if I don't even know it's going to be good (new releases, especially). I'll only buy a book if it's fantastic and I will definitely read it again (which is not that common). In the past few years, I've actually reduced my collection quite a bit because I bought books and have decided not to re-read them.",
        "time": "2017-04-02 19:23:56 UTC",
        "score": 2,
        "link_id": "t3_6316iy",
        "parent_id": "t3_6316iy"
    },
    {
        "comment_id": "dex4n35",
        "subreddit": "books",
        "body": "I really liked that one and Digital Fortress as well. I thought they were a heck of a lot better than the Langdon books. ",
        "time": "2017-03-14 16:34:37 UTC",
        "score": 1,
        "link_id": "t3_5z9mwg",
        "parent_id": "t1_dewfev8"
    },
    {
        "comment_id": "deuqgt0",
        "subreddit": "books",
        "body": "So true for me as well. One of very few books that I couldn't even finish. ",
        "time": "2017-03-13 01:43:59 UTC",
        "score": 1,
        "link_id": "t3_5yyuuf",
        "parent_id": "t1_deu91ut"
    },
    {
        "comment_id": "ddv2ec5",
        "subreddit": "books",
        "body": "I still read aloud nightly with my 10 and almost 8 years old sons. We're currently reading Lemony Snicket's Series now. ",
        "time": "2017-02-17 14:14:50 UTC",
        "score": 2,
        "link_id": "t3_5uekns",
        "parent_id": "t3_5uekns"
    },
    {
        "comment_id": "ddv2720",
        "subreddit": "books",
        "body": "What a beautiful list. I've read four already, and now can't wait to read the others. ",
        "time": "2017-02-17 14:09:39 UTC",
        "score": 1,
        "link_id": "t3_5ugnvk",
        "parent_id": "t3_5ugnvk"
    },
    {
        "comment_id": "ddssa30",
        "subreddit": "books",
        "body": "I do this almost nightly. My husband goes to sleep much earlier than I like to so in order for me to read, I'll hunker down under the covers so the light isn't bothering him. I suppose I could read in another room, but I like his warm body close to mine. ",
        "time": "2017-02-16 00:38:27 UTC",
        "score": 1,
        "link_id": "t3_5u4m0q",
        "parent_id": "t3_5u4m0q"
    },
    {
        "comment_id": "dd09o8n",
        "subreddit": "books",
        "body": "Yes! We read this in book club recently and I think I was the only one who couldn't stand it. I didn't like a single thing about it and as much as I wanted to because of the hype, I just could not. ",
        "time": "2017-01-28 04:07:54 UTC",
        "score": 4,
        "link_id": "t3_5qkvw7",
        "parent_id": "t1_dd040zv"
    }
]