[
    {
        "comment_id": "ltbfv0h",
        "subreddit": "books",
        "body": "If it's part of the story, of course I read it. Sometimes there's a forward by the author, but that's usually dry and fairly meaningless since you don't have any context. And then there are forwards that are just \"Hi, I'm an irrelevant celebrity and, in this reprint of a beloved story, I want to tell you what it means to me.\" SKIP.",
        "time": "2024-10-23 09:58:57 UTC",
        "score": 2,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "lrg8aql",
        "subreddit": "books",
        "body": "I know a librarian that specifically took classes on restoring old books. Preserving the book as a book is more valuable than keeping it's original cover like it's on Antique Roadshow.",
        "time": "2024-10-11 18:26:30 UTC",
        "score": 1,
        "link_id": "t3_1g1cgio",
        "parent_id": "t3_1g1cgio"
    },
    {
        "comment_id": "lij4r20",
        "subreddit": "books",
        "body": "If you're at the right level of friendship, you just roast each other.\n\n\"This book sucks!\" \"No, you just don't appreciate fine literature.\" \"Wtf is wrong with you?\" \"Wtf is wrong with *you*?\" \"Any more recommendations?\" \"Yeah. Here's 3.\"",
        "time": "2024-08-17 06:59:47 UTC",
        "score": 141,
        "link_id": "t3_1eu432h",
        "parent_id": "t1_lihrmlx"
    },
    {
        "comment_id": "lh6872a",
        "subreddit": "books",
        "body": "I think of any spoilers, the \"middle of the story\" ones are the best. There are some shows and books I didn't start until I heard about some twist halfway through. It showed me something intriguing about the writing, gave me something to look forward too in the early sections, and allowed me to see any early hints of the reveal. But, most importantly, once I got myself invested and reached that part, I still had the entire rest of the story to experience unspoiled.",
        "time": "2024-08-08 21:03:57 UTC",
        "score": 1,
        "link_id": "t3_1en9w0n",
        "parent_id": "t3_1en9w0n"
    },
    {
        "comment_id": "lgy67lf",
        "subreddit": "books",
        "body": "I guess it'd be overly long uninteresting tangents.\n\nTangents can be charming. Everybody knows the opening of the Hobbit, \"not a nasty, dirty, wet hole... nor a dry, bare sandy hole... : it was a hobbit-hole, and that means comfort.\" And the Guide to the Galaxy and Series of Unfortunate Events are full of charming tangents from the narrator.\n\nBut some books just have so many words about nothing. The easiest culprit that comes to mind is Van Helsing from Dracula. It's obvious Stoker likes the sound of his own words too much at times and, as the smartest man in any room, Helsing gets a lot of them. There's a scene where Helsing tries to convince the others to entertain the possibility of vampires, which could be summed up as \"It's a strange idea, but we live in a strange world and these are strange circumstances.\" Instead he decided to wax poetically for multiple pages about how strange and incredible the world is. It dragged the pacing of what's already a leisurely paced book to a grinding halt. I love Dracula, but I think I just skipped this part halfway through.\n\nSo yeah. Long boring tangents that add nothing to the story.\n\nEdit: Just to fully emphasize this, I pulled up an online copy of Dracula, typed \"Find: elephant\" (because, yes, he gets sidetracked into talking about *elephants* in this monologue), and found the section I was talking about. From \"Do you mean to tell me... you have no suspicion...?\" to \"My thesis is this: I want you to believe.\" is 1034 words of text in a massive block with almost no breaks. Stoker took a high school essay to write a single paragraph's worth of information.",
        "time": "2024-08-07 15:03:57 UTC",
        "score": 1,
        "link_id": "t3_1elxpdo",
        "parent_id": "t3_1elxpdo"
    }
]