[
    {
        "comment_id": "m054mf1",
        "subreddit": "books",
        "body": "And Then There Were None by Agatha Christie has the most intricate murder-mystery plot I’ve read. She said it was the biggest challenge she gave herself as a mystery writer. Is it a great book? Not really but I found it pleasant to puzzle over and satisfying to read the reveal.",
        "time": "2024-12-03 02:51:38 UTC",
        "score": 10,
        "link_id": "t3_1h5daal",
        "parent_id": "t3_1h5daal"
    },
    {
        "comment_id": "lza7ui8",
        "subreddit": "books",
        "body": "So much nuance and potential for compelling character development is lost by giving historical characters modern viewpoints on these topics. Instead all we got was “sad marginalized people get sadder and more marginalized until they die a gruesome early death”.",
        "time": "2024-11-27 18:44:56 UTC",
        "score": 160,
        "link_id": "t3_1h19se5",
        "parent_id": "t1_lz9zsic"
    },
    {
        "comment_id": "lwm4k73",
        "subreddit": "books",
        "body": "Finished The Left Hand of Darkness by Le Guin and started System Collapse, the 6th Murderbot book. Kind of opposite ends of the sci-fi spectrum, lol.",
        "time": "2024-11-11 17:58:30 UTC",
        "score": 3,
        "link_id": "t3_1gopnb2",
        "parent_id": "t3_1gopnb2"
    },
    {
        "comment_id": "lsijnm0",
        "subreddit": "books",
        "body": "Hey, please be kind to yourself. I grew up loving to read and I stopped reading for pleasure entirely in college. I think that you’re brain and your days are too overwhelmed by all of the new information you are exposed to and trying to process. Like the last thing I felt I wanted to do was pick up a book. I played lots of video games. You’re already asking a lot of your brain, it’s like asking a professional football player why they don’t feel like tossing a ball around on their days off. Just be patient and when life calms down a bit, I promise you will be picking books up again.",
        "time": "2024-10-18 12:11:01 UTC",
        "score": 8,
        "link_id": "t3_1g6ga5i",
        "parent_id": "t3_1g6ga5i"
    },
    {
        "comment_id": "lpidjym",
        "subreddit": "books",
        "body": "I had the same reaction, and I think a lot of people who pick up this book are people who’s experienced sexual violence. It’s not hard to understand why we don’t want to be immediately asked to sympathize with a child rapist war criminal. \n\nIt’s fine to put the book down, or criticize it for this. I don’t think that makes us rabid moral absolutists who can’t handle books that deal with nuanced people. It’s a book about healing trauma that has portions that trigger a lot of peoples traumas. I think it’s actually a valid criticism of the book.",
        "time": "2024-09-29 16:17:42 UTC",
        "score": 20,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpe3m5p"
    },
    {
        "comment_id": "lmbwevt",
        "subreddit": "books",
        "body": "Unresolved Textual Tension for sci-fi/fantasy review+analyses",
        "time": "2024-09-09 20:15:58 UTC",
        "score": 1,
        "link_id": "t3_1fc6zu5",
        "parent_id": "t3_1fc6zu5"
    },
    {
        "comment_id": "lfzny3x",
        "subreddit": "books",
        "body": "When I was a kid I read one of his anthology books, M is for Magic, and in one story he describes a giant naked troll sniffing a little girls breasts and genitals. I haven’t felt right about him since, even continuing to read his other works that people lauded. The way he writes about girls and women gave me the ick about him.",
        "time": "2024-08-01 15:38:02 UTC",
        "score": 23,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t3_1ehh0u4"
    },
    {
        "comment_id": "kogw146",
        "subreddit": "books",
        "body": "I love fantasy, and YA is a huge chunk of that genre. In my experience good writing transcends age category. I’ve read amazing and terrible books written for children, teens, and adults. I will say that YA is perhaps an inundated genre with more mediocrity to sift through than some less popular ones.",
        "time": "2024-02-01 18:22:48 UTC",
        "score": 1,
        "link_id": "t3_1agetdc",
        "parent_id": "t3_1agetdc"
    }
]