[
    {
        "comment_id": "lzfm2to",
        "subreddit": "books",
        "body": "I don’t know where you live but there’s a chain called Half Price Books that will buy anything. There used to be one near my house and I would go there constantly and buy books from them.",
        "time": "2024-11-28 17:21:02 UTC",
        "score": 4,
        "link_id": "t3_1h20hlt",
        "parent_id": "t3_1h20hlt"
    },
    {
        "comment_id": "lpta1fb",
        "subreddit": "books",
        "body": "When I was in high school in the 90’s we didn’t read Grapes of Wrath…. We watched the movie instead. Same for other books. On the one hand I was fine with it because I read tons of Stephen King and Chick Palahniuk. On the other hand, what a lazy move by the high school.",
        "time": "2024-10-01 13:59:07 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt205h"
    },
    {
        "comment_id": "lovevhl",
        "subreddit": "books",
        "body": "I read the stand when I was 13 or 14 and was a huge fan of the dark tower series (at least what was written at that time) and the eyes of the dragon. I was maybe 11 or 12 when I read that. Probably read other ones but can't remember all of them. \n\nI think King has a pretty approachable writing style. Not a lot of big words and straightforward plots making them easier for younger kids to follow. I don't think it's a weird reading trend.",
        "time": "2024-09-25 15:52:52 UTC",
        "score": 2,
        "link_id": "t3_1fozps4",
        "parent_id": "t3_1fozps4"
    },
    {
        "comment_id": "l7wh66a",
        "subreddit": "books",
        "body": "A 4th one?? ",
        "time": "2024-06-10 01:43:50 UTC",
        "score": 2,
        "link_id": "t3_1dbsdaa",
        "parent_id": "t1_l7v9g5n"
    },
    {
        "comment_id": "l580ygb",
        "subreddit": "books",
        "body": "I feel like–and this may sound harsh–Andy Weir might end up being science fiction's answer to Dan Brown. They're both authors that write really straight forward books with straight forward characters and easy to digest plots. Almost one dimensional. I think my next Andy Weir book I'll save for when I'm going to be poolside somewhere or at a beach with a cocktail. They seem like that kind of book to me.",
        "time": "2024-05-22 20:18:03 UTC",
        "score": 39,
        "link_id": "t3_1cy445k",
        "parent_id": "t3_1cy445k"
    },
    {
        "comment_id": "kgzvqoi",
        "subreddit": "books",
        "body": "Oh wow I think it’s time for me to re-read Hyperion",
        "time": "2024-01-09 02:50:12 UTC",
        "score": 115,
        "link_id": "t3_1923ele",
        "parent_id": "t3_1923ele"
    },
    {
        "comment_id": "kgv7iof",
        "subreddit": "books",
        "body": "Hello! Recently finished a book that might fit this. Rampage: MacArthur, Yamashita and the Battle of Manila. \n\nWestern education doesn’t spend enough time talking about how fucked up things were in Asia during WWII and too much time talking about how much of a genius MacArthur was in the Pacific Theater. \n\nI cried during parts of this book (awkward because I was in a coffee shop when reading it). I talked about it with Filipino friends of mine who grew up there and they were already well aware of what happened. Growing up in the US, I just remember MacArthur sweeping into the Philippines liberating them and that was that. Boy did it not go down that way….",
        "time": "2024-01-08 08:00:20 UTC",
        "score": 3,
        "link_id": "t3_191dwnm",
        "parent_id": "t3_191dwnm"
    },
    {
        "comment_id": "kgr2bpm",
        "subreddit": "books",
        "body": "I just read them like I would a novel. I don't study or take notes though I might read a little slower and I retain enough of what I read to feel like I've learned new things.",
        "time": "2024-01-07 17:01:08 UTC",
        "score": 2,
        "link_id": "t3_190olaa",
        "parent_id": "t3_190olaa"
    },
    {
        "comment_id": "kg6wjdp",
        "subreddit": "books",
        "body": "Yeah. Probably why I started reading less and less of him.",
        "time": "2024-01-03 22:22:37 UTC",
        "score": 1,
        "link_id": "t3_18xiw27",
        "parent_id": "t1_kg6vkjo"
    },
    {
        "comment_id": "kg4siw2",
        "subreddit": "books",
        "body": "You know it’s funny. I liked his books in my 20’s but haven’t thought about him since probably my mid 30’s.",
        "time": "2024-01-03 14:59:14 UTC",
        "score": 9,
        "link_id": "t3_18xiw27",
        "parent_id": "t1_kg4kjvf"
    },
    {
        "comment_id": "kfjvgav",
        "subreddit": "books",
        "body": "If the words become fuzzy maybe have your eyes checked. I did a few months ago and BOOM! reading glasses.\n\nAnd I totally get being distracted. I noticed I've taken to becoming a regular at a coffee shop to read, and that's helped. When I read at home, I do it late in the evening with a single light on. I've also tried to limit books I read on my iPad (although the reading focus actually helps a little) and go for regular books instead. I feel like taking myself away from home to read has helped: no cats yelling at me, or TV, or thinking about other things I have to do.",
        "time": "2023-12-30 13:24:16 UTC",
        "score": 3,
        "link_id": "t3_18udlen",
        "parent_id": "t3_18udlen"
    },
    {
        "comment_id": "kfbuhed",
        "subreddit": "books",
        "body": "I buy books. When I’m done I rarely sell them back to the used book store. More often I keep them on my book shelves. Other people decorate their shelves with trinkets and souvenirs…. I’ve always prefered books.",
        "time": "2023-12-28 22:15:51 UTC",
        "score": 1,
        "link_id": "t3_18t34pl",
        "parent_id": "t3_18t34pl"
    },
    {
        "comment_id": "kf5bfks",
        "subreddit": "books",
        "body": "Wind up Bird Chronicle and Kafka by the Shore!",
        "time": "2023-12-27 17:32:29 UTC",
        "score": 5,
        "link_id": "t3_18s2xff",
        "parent_id": "t1_kf4y1us"
    },
    {
        "comment_id": "kf5b7oc",
        "subreddit": "books",
        "body": "I just bought the Andran Sequence trilogy of books (When Gravity Fails) and the Sprawl Trilogy. Been on a cyberpunk kick after reading the new Richard K Morgan book.",
        "time": "2023-12-27 17:31:10 UTC",
        "score": 1,
        "link_id": "t3_18s2xff",
        "parent_id": "t3_18s2xff"
    },
    {
        "comment_id": "kde0ynv",
        "subreddit": "books",
        "body": "I read books that I think are interesting regardless of genre or subject matter. So I've read fiction, non fiction, literature, science fiction, horror, historical fiction... Japanese and German authors.... (probably from other countries too, just can't think off the top of my head).\n\nI guess I don't consciously try to read diverse authors or subjects but I think it kinda happens anyway.",
        "time": "2023-12-14 23:21:58 UTC",
        "score": 11,
        "link_id": "t3_18iijaa",
        "parent_id": "t3_18iijaa"
    },
    {
        "comment_id": "kcaa7lp",
        "subreddit": "books",
        "body": "I've never read Haruki Murakami or Cixin Liu Books in their native languages but I feel the translations have been beautiful (I read Murakami will translate his own books into English and then back into Japanese to simplify the language and the flow; I don't know if he still does it though). To me their books read like poetry.\n\nI also read the English translation of the Volker Kutscher Gereon Rath books (Babylon Berlin, etc) and those translations seem a little rough. I don't know if it has to do with the German language. They're still good noir books so there aren't really a lot of details to pick up on. So I feel like the translations can be hit or miss.",
        "time": "2023-12-06 22:00:14 UTC",
        "score": 1,
        "link_id": "t3_18ceet2",
        "parent_id": "t3_18ceet2"
    },
    {
        "comment_id": "kafnmhp",
        "subreddit": "books",
        "body": "Stephen King has a bunch of books divided into either short stores or longer novellas. So you can just read one or two then go back to it later.",
        "time": "2023-11-23 13:12:41 UTC",
        "score": 1,
        "link_id": "t3_181zuec",
        "parent_id": "t3_181zuec"
    },
    {
        "comment_id": "ka98ae3",
        "subreddit": "books",
        "body": "On Killing by Dave Grossman. I read the whole thing and was glad I did because I was able to better articulate to my friend who recommended it why it was such a horrible book. After reading the book I learned about the Killology seminars he gives to cops where he equates killing people to the enjoyment of having sex. \n\nI wish I had known that before reading the book. These days I'll read up on authors I want to read, ESPECIALLY non fiction books. Lesson learned.",
        "time": "2023-11-22 03:47:32 UTC",
        "score": 2,
        "link_id": "t3_180waa5",
        "parent_id": "t3_180waa5"
    },
    {
        "comment_id": "ka42ecw",
        "subreddit": "books",
        "body": "We Can Remember it for you Wholesale",
        "time": "2023-11-21 03:40:05 UTC",
        "score": 52,
        "link_id": "t3_1806f0v",
        "parent_id": "t1_ka3vdrz"
    },
    {
        "comment_id": "ka1xcir",
        "subreddit": "books",
        "body": "Oh wow it’s on you tube? I had looked for it but didn’t think to check there. Thanks!!",
        "time": "2023-11-20 19:14:14 UTC",
        "score": 1,
        "link_id": "t3_17yy3ml",
        "parent_id": "t1_ka05j6f"
    },
    {
        "comment_id": "k9yabuw",
        "subreddit": "books",
        "body": "yes! The first season wasn’t great but holy cow!",
        "time": "2023-11-19 23:35:37 UTC",
        "score": 2,
        "link_id": "t3_17z9g1f",
        "parent_id": "t1_k9y893g"
    },
    {
        "comment_id": "k9y74u0",
        "subreddit": "books",
        "body": "Snow Crash satirizes the cyberpunk genre and I think breathes fresh life into it in the process. Worth checking out. \n\nCheck out the Takeshi Kovacs trilogy by Richard K. Morgan. The first one is Altered Carbon and I forget the other two off the top of my head. They got made into a Netflix series, but don’t bother. Or if you do, only watch the first season and skip the second one. They put the last two books together in that season and it was a total mess.",
        "time": "2023-11-19 23:11:32 UTC",
        "score": 3,
        "link_id": "t3_17z9g1f",
        "parent_id": "t3_17z9g1f"
    },
    {
        "comment_id": "k9ww07k",
        "subreddit": "books",
        "body": "wow. I wish I had read his wikipedia page before reading the book. (yes it was a bad as you'd think. I read the updated version and stopped at the end when he was trashing Obama for reasons so thin I don't even remember why).",
        "time": "2023-11-19 17:51:59 UTC",
        "score": 1,
        "link_id": "t3_17yy3ml",
        "parent_id": "t1_k9wp6rm"
    },
    {
        "comment_id": "k9wvimw",
        "subreddit": "books",
        "body": "Yeah, I read that book too. The book seemed off, like fodder for conspiracy theories. The author states that he \"does his own research\" and then doesn't convince me that any of its sound. Try reading the Shock Doctrine if you want to get into weaponized capitalism. Far more credible author with better sources that she states clearly.\n\nI read it on a friend's recommendation and told my friend what I thought of it. He also recommended On Killing, which I also read and then stopped taking recommendations from him altogether.",
        "time": "2023-11-19 17:48:31 UTC",
        "score": 3,
        "link_id": "t3_17yy3ml",
        "parent_id": "t1_k9w5ep2"
    },
    {
        "comment_id": "k9wuw3g",
        "subreddit": "books",
        "body": "I read the Remembrance of Earth's Past trilogy and still think about it. My stepson's a Marine and I got him to read the books when I told him about the Dark Forest and how to protect yourself agains attack from other species. He took it from a tactical viewpoint and said it was pretty sound.",
        "time": "2023-11-19 17:43:57 UTC",
        "score": 6,
        "link_id": "t3_17yy3ml",
        "parent_id": "t3_17yy3ml"
    },
    {
        "comment_id": "k9uqbph",
        "subreddit": "books",
        "body": "The cast was great. When it came out it Charlotte Rampling and a who's who of young British actors.",
        "time": "2023-11-19 04:43:13 UTC",
        "score": 7,
        "link_id": "t3_17yj4x4",
        "parent_id": "t1_k9uh5ss"
    },
    {
        "comment_id": "k9twwqn",
        "subreddit": "books",
        "body": "I thought the film was good. They cut some of the meat out about what it means to have a soul and what makes a human, but I still enjoyed the movie.",
        "time": "2023-11-19 00:38:32 UTC",
        "score": 27,
        "link_id": "t3_17yj4x4",
        "parent_id": "t1_k9tsk13"
    },
    {
        "comment_id": "k9twrns",
        "subreddit": "books",
        "body": "This was the first book I read that I had to meditate on after reading. Subtle yet profound meditation on regret. Klara and the Sun came out last year and I liked it. A girl with a terminal illness befriends a sentient doll her mom buys her in a toy store.",
        "time": "2023-11-19 00:37:25 UTC",
        "score": 25,
        "link_id": "t3_17yj4x4",
        "parent_id": "t3_17yj4x4"
    },
    {
        "comment_id": "ir41wr8",
        "subreddit": "books",
        "body": "When I was a teenager my dad got me a copy of \"The Millionaire Next Door.\" I read it and thought, okay... but when I got older I realized it was full of shit. Everyone he talks about in the book are people who live frugally and below their means (which is fine) but they're also all successful small business owners. Which is not something that everyone can be. \n\nThere was a book I read 10 years ago or so called \"Pound Foolish\" debunking the financial services industry and she includes a chapter on Rich Dad, Poor Dad. The author is a journalist who covers finance (if I remember correctly) and would recommend reading it. She also mentions \"The Millionaire Next Door.\"",
        "time": "2022-10-05 04:29:26 UTC",
        "score": 2,
        "link_id": "t3_xva343",
        "parent_id": "t3_xva343"
    }
]