[
    {
        "comment_id": "lvl92he",
        "subreddit": "books",
        "body": "I *hate* the trope of >!making a character loveable and perfect just to make it soooo sad when they get killed off. And it was done in such a soap opera way—he dives in front of a bullet to save someone (highly improbable) just as Sadie finds out she's pregnant?!< I rolled my eyes so hard. That was the precise moment I decided to just skim-read the rest.",
        "time": "2024-11-05 21:15:01 UTC",
        "score": 61,
        "link_id": "t3_1gketck",
        "parent_id": "t1_lvksymq"
    },
    {
        "comment_id": "lsfqrsd",
        "subreddit": "books",
        "body": "It's marketed as a \"platonic love story\" but it missed that mark completely. I didn't really see the so-called *love* between them at any point in the book; they just spend the whole time hating each other over miscommunications and rarely do anything, big or small, that demonstrates actual love.",
        "time": "2024-10-17 22:27:38 UTC",
        "score": 113,
        "link_id": "t3_1g61vc1",
        "parent_id": "t1_lsfkvy8"
    },
    {
        "comment_id": "liy2zsy",
        "subreddit": "books",
        "body": "It really is! Imagine thinking Handmaid's Tale is badly written just because it's present tense/first person.",
        "time": "2024-08-19 22:16:39 UTC",
        "score": 2,
        "link_id": "t3_1ew6pkm",
        "parent_id": "t1_lixz693"
    },
    {
        "comment_id": "lixz1te",
        "subreddit": "books",
        "body": "Seriously. By these comments you'd think a book cannot possibly be good unless it's written in a Redditor-approved tense/person.",
        "time": "2024-08-19 21:54:27 UTC",
        "score": 11,
        "link_id": "t3_1ew6pkm",
        "parent_id": "t1_liwv16y"
    },
    {
        "comment_id": "lixy2cn",
        "subreddit": "books",
        "body": "I'm actually baffled by how important tense and person are to so many readers. Those things don't even register in my brain when I start reading a new book; all I care about is whether the prose is good and the concept seems promising.",
        "time": "2024-08-19 21:49:04 UTC",
        "score": 2,
        "link_id": "t3_1ew6pkm",
        "parent_id": "t1_liwf64s"
    },
    {
        "comment_id": "ldzdj3q",
        "subreddit": "books",
        "body": "Oscar Wao absolutely deserves a spot on this list.\n\nMost of the others were... whelming, at best.",
        "time": "2024-07-19 20:12:28 UTC",
        "score": 6,
        "link_id": "t3_1e6s1yv",
        "parent_id": "t1_ldwpjpw"
    },
    {
        "comment_id": "ldnfyz0",
        "subreddit": "books",
        "body": "I was a massive fan of the Eragon books as a kid (even skipped school to go get my copy signed by the author haha) and just started rereading them before I read Murtagh. I didn't expect it to be as engaging or magical as it was when I was young, but to my surprise these books *really* hold up. The prose alone is honestly stronger than pretty much any recent adult romantasy I've read.",
        "time": "2024-07-17 18:37:29 UTC",
        "score": 3,
        "link_id": "t3_1e5f7dl",
        "parent_id": "t1_ldmnkhe"
    },
    {
        "comment_id": "kf2yssf",
        "subreddit": "books",
        "body": "Yeah, the level of satisfaction really doesn't compare. My interest in TV/YouTube has waned considerably since I became a lot more active with my reading, and I find myself actually craving my book when I'm away from it.",
        "time": "2023-12-27 04:27:13 UTC",
        "score": 1,
        "link_id": "t3_18rm0ug",
        "parent_id": "t1_kf1yw34"
    },
    {
        "comment_id": "kd3ddmj",
        "subreddit": "books",
        "body": "There were midnight release parties for Iron Flame where people showed up dressed in homemade dragon rider flight leathers. I'm no fan but there is definitely an insane amount of hype around these books—reminds me of being in high school and dressing up for Harry Potter or Twilight releases.",
        "time": "2023-12-12 21:37:32 UTC",
        "score": 6,
        "link_id": "t3_18glx2r",
        "parent_id": "t1_kd1e2gi"
    },
    {
        "comment_id": "k0g7lpj",
        "subreddit": "books",
        "body": "I read it thinking Mal would be used to show how a friend/partner can hold you back and keep you from being your true self because of their own jealousies and insecurities. He was being a crybaby (and fooled around with a ton of other girls before she left, THEN realized he wanted her once he couldn't have her--ugh), meanwhile Alina was learning how to use and harness her powers and I thought it was gonna be this metaphor for how we outgrow those who try to hold us back. I mean, her power is literally creating light and he was trying to dim that.\n\nBoy was I mad when I finished the trilogy.",
        "time": "2023-09-13 19:43:52 UTC",
        "score": 24,
        "link_id": "t3_16hfcl0",
        "parent_id": "t1_k0eb1w9"
    },
    {
        "comment_id": "k0apse2",
        "subreddit": "books",
        "body": "They *did* deserve each other, which is something the movie didn't really emphasize in the end; Ben Affleck's Nick is portrayed as the baby-trapped victim, but Book Nick is different:\n\n>“Yes, I am finally a match for Amy. The other morning I woke up next to her, and I studied the back of her skull. I tried to read her thoughts. For once I didn’t feel like I was staring into the sun. I’m rising to my wife’s level of madness. Because I can feel her changing me again: I was a callow boy, and then a man, good and bad. Now at last I’m the hero. I am the one to root for in the never-ending war story of our marriage. It’s a story I can live with. Hell, at this point, I can’t imagine my story without Amy. She is my forever antagonist.”",
        "time": "2023-09-12 19:03:36 UTC",
        "score": 56,
        "link_id": "t3_16gxk4w",
        "parent_id": "t1_k0annlk"
    },
    {
        "comment_id": "jtl6thz",
        "subreddit": "books",
        "body": "[This godawful version](https://m.media-amazon.com/images/I/71T9aJ3RO2L._AC_UF1000,1000_QL80_.jpg) of The Thorn Birds looks like it was photoshopped by a drunk toddler. The image quality. The clipart border (only on three out of four sides). The awkwardly placed picture of a house with blurred edges. Truly a masterpiece.",
        "time": "2023-07-26 22:46:23 UTC",
        "score": 1,
        "link_id": "t3_15afcdi",
        "parent_id": "t3_15afcdi"
    },
    {
        "comment_id": "jrzff3v",
        "subreddit": "books",
        "body": "Your awareness of it, and your willingness to better yourself, already puts you miles ahead of your own parents (and mine).\n\nNo matter what you're going to make mistakes along the way, but that's not what defines you as a person or a mother. Owning up to what you did, apologizing, letting your kid(s) express their feelings without fear of reprimand, and learning from your mistakes will make a world of difference.",
        "time": "2023-07-14 20:49:19 UTC",
        "score": 32,
        "link_id": "t3_14zke8y",
        "parent_id": "t1_jrynv21"
    },
    {
        "comment_id": "jj7xv28",
        "subreddit": "books",
        "body": "Printed for sure! I like the feel of them and how they look on my shelf. Also I read a lot of nonfiction and like to flip back a few pages to remind myself of dates or names, which is harder to do with ebooks. And I have auditory processing issues so audiobooks aren't an option.",
        "time": "2023-05-07 15:37:13 UTC",
        "score": 1,
        "link_id": "t3_13ajad6",
        "parent_id": "t3_13ajad6"
    },
    {
        "comment_id": "jhu19bs",
        "subreddit": "books",
        "body": "I get so much reading done just on my lunch break! I work a somewhat hectic job and being able to disconnect for that half hour each day is such a relief",
        "time": "2023-04-26 20:44:41 UTC",
        "score": 7,
        "link_id": "t3_12zbbzx",
        "parent_id": "t1_jhrheso"
    },
    {
        "comment_id": "j93fyqf",
        "subreddit": "books",
        "body": "Yep, this is who I came to say!\n\nMy copy of A Peculiar Peril came in the mail and I sat down on the couch to read it. My sister noticed and asked me what it was about, and... I legitimately had no idea. Hadn't even read the synopsis before I hit \"pre-order\" lol",
        "time": "2023-02-18 23:13:59 UTC",
        "score": 17,
        "link_id": "t3_115t320",
        "parent_id": "t1_j93cxrk"
    },
    {
        "comment_id": "iyxcxc9",
        "subreddit": "books",
        "body": "Same! I can't do book clubs either; I'm fairly picky about what I read and my tastes generally don't align with what other people want to read (I'm a majority nonfiction reader, for one thing). What we need is a \"Listen to me gush about this book and I'll do the same for you and hopefully we'll have some overlap in our reading material once in a while\" club but that's a bit of a mouthful",
        "time": "2022-12-04 21:58:23 UTC",
        "score": 46,
        "link_id": "t3_zclini",
        "parent_id": "t1_iyxbzq1"
    },
    {
        "comment_id": "ivb6ekj",
        "subreddit": "books",
        "body": "Just finished Earthlings yesterday! Such a huge tone shift from Convenience Store Woman, but I still love both. That ending is gonna live rent-free in my head for a very long time.\n\nI'd say \"enjoy\" but I don't think that's the right word for this book haha",
        "time": "2022-11-06 18:05:39 UTC",
        "score": 5,
        "link_id": "t3_ynnudh",
        "parent_id": "t3_ynnudh"
    }
]