[
    {
        "comment_id": "lvk98fo",
        "subreddit": "books",
        "body": "Thanks for that detailed information. I really appreciate it! I’ll look into the references provided. Much food for thought there indeed.",
        "time": "2024-11-05 18:20:46 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvk60ga"
    },
    {
        "comment_id": "lvivxcr",
        "subreddit": "books",
        "body": ">The real key is that reading on a device means the kid has a device therefore they are vulnerable to the other bad stuff.\n\nAgreed. The solution is for these device makers and sites to give parents easy ways to limit the bad stuff. \n\n>Screen use is absolutely ubiquitous so urging caution as if we could be going too hard against it is absurd.\n\nMy annecdata is that I personally know several parents who constantly rail on their kids that \"screens\" are BAD without any sense of nuance whatsoever because it is easy to use shorthand. \"Screens\" includes so many things that are as positive or even more positive than reading many books. And as already mentioned, many people actually read books on screens. I cannot read dead trees anymore because reading on a ereader is such a superior experience.",
        "time": "2024-11-05 14:13:43 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lviss8w"
    },
    {
        "comment_id": "lvir1y5",
        "subreddit": "books",
        "body": ">Screens instead of reading is severely harmful to the brain and mental health.\n\nAre you using \"screens\" as shorthand for playing games and watching inane videos or are you really saying that reading on a screen vs a physical book is somehow negative?\n\nIf the former, then please stop using shorthand because helicopter parents read all this screes=bad crap and swing the banhammer blindly. \n\nIf the latter, then please show your sources as that is a pretty extraordinary claim (beyond blue light before bedtime concerns).",
        "time": "2024-11-05 13:45:05 UTC",
        "score": 0,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvi2mq3"
    }
]