[
    {
        "comment_id": "lqk4u3m",
        "subreddit": "books",
        "body": "Sometimes I'll put it up to 1.5x speed. The problem ii have though is when they encode the whole audiobook at 96kbps like it's still 2002 and they're scared of filling up my time hard drive.\n\nThe more time I spend with content, the better it needs to sound because I'm gonna hear more the artifacts and crap quality over 17 hours than I would hear in a three minute song.",
        "time": "2024-10-06 02:37:48 UTC",
        "score": 1,
        "link_id": "t3_1fwwz1g",
        "parent_id": "t3_1fwwz1g"
    },
    {
        "comment_id": "lgr7nq3",
        "subreddit": "books",
        "body": "I did as a teenager, I would put on an album and read half the night.\n\nThen as an adult I would often stay up watching things, and crawl into bed after midnight and drop into sleep.\n\nNow a few years later, I have made little led torches like I used to make as a kid, and I read when I come to bed. Slowly getting used to the backlight of the kindle too, although paper books are nicer.\n\nI have one rule though:\nDon't push through the sleepiness. If my eyes close, my nose clears and my mind wanders, I need to put down the book, even if the scene is really gripping. This rule works quite well when you practice it.\n\nIf I do keep reading though, I don't hold it against myself the next day. It is always time well spent, and my body is at least resting even if my mind isn't really asleep. Sometimes I sleep better if I finish the book rather than put it down int he penultimate chapter.",
        "time": "2024-08-06 11:32:16 UTC",
        "score": 1,
        "link_id": "t3_1ekx3em",
        "parent_id": "t3_1ekx3em"
    },
    {
        "comment_id": "l5q2mi2",
        "subreddit": "books",
        "body": "You need to read Flowers For Algernon. There aren't many books that made me cry...",
        "time": "2024-05-26 09:28:21 UTC",
        "score": 1,
        "link_id": "t3_1d0g99i",
        "parent_id": "t3_1d0g99i"
    },
    {
        "comment_id": "l119wkn",
        "subreddit": "books",
        "body": "Hatchet, definitely. Really enjoyed Swallows and Amazons by Arthur Ransome. Moby Dick was an amazing read full of details about a kind of man and a kind of industry that no longer exists.\n\nThere's an anthology of tales from Ireland telling the story of Cuchulainn, called The Red Bull. Absolutely wild and brutal, but human too.\n\nAs a Christian the book of Job in the Old Testament is a really fascinating, harrowing read about one man's unperturbable faith amidst odds literally stacked against him.\n\nI read a lot of science fiction as well, which doesn't exactly exclude female readers but my wife is often bored by the ones that I find really fascinating, and she reads ten times the books I do. I can recommend Hyperion and Scalzi's series Old Man's War, in which elderly retirees are transplanted into youthful clones of themselves and put into service as cunning space warriors on dangerous missions to protect planet earth and her interests. The experience and wisdom of the old people make them fantastic tacticians",
        "time": "2024-04-24 12:29:39 UTC",
        "score": 1,
        "link_id": "t3_1cb4qk9",
        "parent_id": "t3_1cb4qk9"
    }
]