[
    {
        "comment_id": "lwf4ouc",
        "subreddit": "books",
        "body": "Yes, Jim Butcher, Battleground (Dresden files). A big fight, big emotions. Then, suddenly, A knock knock joke with Sasquatch as the punchline. I had to put the book away for a couple of minutes to laugh out loud.",
        "time": "2024-11-10 15:10:46 UTC",
        "score": 1,
        "link_id": "t3_1gnxwky",
        "parent_id": "t3_1gnxwky"
    },
    {
        "comment_id": "lvnzi42",
        "subreddit": "books",
        "body": "Oh yes, so much. In Dutch contemporary literature I dislike a lot of the main characters. I hate reading the books but have a lot of respect for the writer.\n\nIn \"Knielen op een bed violen\" by Jan Siebelink (In My Fathers Garden) the main character is a deeply religious Christian. He is so passive and accepts everything as gods will. It made me so angry I had to put the book away. I do still plan to try again someday because it was so well written.",
        "time": "2024-11-06 06:57:55 UTC",
        "score": 2,
        "link_id": "t3_1gketck",
        "parent_id": "t3_1gketck"
    },
    {
        "comment_id": "lu5k7w8",
        "subreddit": "books",
        "body": "I like Kazuo Ishiguro because of his unreliable narrators. They do not try to lie to you as much as they lie to themselves. He puts hints in his stories that you cannot trust them. If you read one of his books the difference between \"just first person\" and unreliable might become clearer. \n\nI would suggest \"A Pale View of Hills\" or \"The Remains of the Day\" for the unreliable narrator.",
        "time": "2024-10-28 10:30:09 UTC",
        "score": 61,
        "link_id": "t3_1gdxxkg",
        "parent_id": "t3_1gdxxkg"
    },
    {
        "comment_id": "lu5iwq0",
        "subreddit": "books",
        "body": "OP, maybe you would like [https://www.bbc.co.uk/programmes/m001bz77](https://www.bbc.co.uk/programmes/m001bz77)   \nIt is an episode of In Our Time from the BBC where experts talk about the book and its influence. It also goes into The Julia Character and the problems there.\n\nMaybe it will change your mind, maybe it won't. I just hope it will be a fun listen for you (and others here).",
        "time": "2024-10-28 10:16:54 UTC",
        "score": 2,
        "link_id": "t3_1gdug23",
        "parent_id": "t3_1gdug23"
    }
]