[
    {
        "comment_id": "lvhwof0",
        "subreddit": "books",
        "body": "When I was a kid I didn't read much because I really did not like fiction for kids. I found it stupid, boring and written for girls. So I only read (for pleasure) comic books and nonfiction science books (dinosaurs, animals, space, etc).\nThen, by 11 or 12 I started reading Sci-fi and fantasy books. My mind was blown. I couldn't believe they made us read such stupid books in school when there were such cool and interesting books around!\nSo many kids don't read because they don't know there are cool books out there that are interesting and fun to read without being written specifically for kids or young adults.",
        "time": "2024-11-05 09:29:00 UTC",
        "score": 5,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t3_1gk1bxm"
    },
    {
        "comment_id": "jj7k4jo",
        "subreddit": "books",
        "body": "First blood by David Morrell. I wanted to see how much different the movie was from the book.",
        "time": "2023-05-07 13:51:26 UTC",
        "score": 1,
        "link_id": "t3_135eg2y",
        "parent_id": "t3_135eg2y"
    },
    {
        "comment_id": "j4uxyv5",
        "subreddit": "books",
        "body": "I didn't know you could return books, I always thought that you couldn't. What stops you from reading them and returning them?",
        "time": "2023-01-18 13:06:34 UTC",
        "score": 1,
        "link_id": "t3_10cr55l",
        "parent_id": "t3_10cr55l"
    },
    {
        "comment_id": "hjncud2",
        "subreddit": "books",
        "body": "I really liked 'A wild sheep chase'. It's quite weird, but very fun to read.",
        "time": "2021-11-07 06:59:40 UTC",
        "score": 2,
        "link_id": "t3_qn7rcg",
        "parent_id": "t1_hjgd5cx"
    },
    {
        "comment_id": "gjlijah",
        "subreddit": "books",
        "body": "I use Wikipedia a lot. I will look for Nobel prize awards, or Hugo or Nebula award winners for example. I also check books mentioned in other books. However, I mostly read classics and other \"older\" works.",
        "time": "2021-01-17 15:13:06 UTC",
        "score": 3,
        "link_id": "t3_kz58nx",
        "parent_id": "t3_kz58nx"
    },
    {
        "comment_id": "gg8juu5",
        "subreddit": "books",
        "body": "Congo by Michael Crichton. They made a movie in the 90s, I think. I liked it as a kid.\nAlso, The Planet of the Apes. I haven't read the book, but I heard that it's more interesting as it goes deeper into the different ape classes and their respective social roles.",
        "time": "2020-12-18 09:44:25 UTC",
        "score": 1,
        "link_id": "t3_kevfhb",
        "parent_id": "t3_kevfhb"
    },
    {
        "comment_id": "fijtj81",
        "subreddit": "books",
        "body": "Don Quijote de la Mancha (Spanish)\nA hundred years of solitude (Spanish)\nCrime and Punishment (Russian)\nAnna Karenina (Russian)\nMadame Bovary (French)\nThe Red and the Black (Stendhal)",
        "time": "2020-02-23 13:11:48 UTC",
        "score": 10,
        "link_id": "t3_f876al",
        "parent_id": "t3_f876al"
    },
    {
        "comment_id": "eyu3tcx",
        "subreddit": "books",
        "body": "I find it very interesting what you are saying because I never had something like this happen to me. And I think it is because I started reading Fantasy / Sci-Fi when I was a young teenager. Actually, I only read these kinds of books, except for school required readings. Now that I think about it, it did take me a lot of effort to read the Lord of the Rings trilogy when I was 13, but I always thought that it was because I was not used to reading so much, not because I was really doing a lot of 'brain work'. Thank you for sharing your thoughts, I think I now understand my past experiences better.",
        "time": "2019-09-02 19:25:02 UTC",
        "score": 1,
        "link_id": "t3_cyocxt",
        "parent_id": "t3_cyocxt"
    }
]