[
    {
        "comment_id": "lrm4jk7",
        "subreddit": "books",
        "body": "I've never been scared of a movie the way I can get scared by a book- I was obsessed with the scary stories to tell in the dark when I was little & have been horrified by a number of other (better-written) books. I've never once been truly scared by a movie. \n\nI also don't find Stephen king books or movies scary tho so perhaps I'm not the best person answer",
        "time": "2024-10-12 19:51:51 UTC",
        "score": 1,
        "link_id": "t3_1g1vfsk",
        "parent_id": "t3_1g1vfsk"
    },
    {
        "comment_id": "lkgdeis",
        "subreddit": "books",
        "body": "I read this book a few weeks ago & same, + the fact that i have a similar journaling habit to the main character. My reaction was to stay up all night reading, though, which is probably unhelpful",
        "time": "2024-08-29 04:42:00 UTC",
        "score": 2,
        "link_id": "t3_1f315tq",
        "parent_id": "t1_lkaqi0u"
    },
    {
        "comment_id": "leqi4sx",
        "subreddit": "books",
        "body": "Rodgert's thesaurus is structured so that you look up a concept & it gives you a word- a pretty interesting concept, although I haven't read or used it at all\n\nKinda unrelated but fun fact when comics replace profanity with symbols it has a real name- they call it Grawlix  or  obscenicon :)",
        "time": "2024-07-24 17:05:51 UTC",
        "score": 1,
        "link_id": "t3_1eb3btx",
        "parent_id": "t3_1eb3btx"
    },
    {
        "comment_id": "lbjwv6e",
        "subreddit": "books",
        "body": "Did you just have this on-hand",
        "time": "2024-07-04 04:38:16 UTC",
        "score": 6,
        "link_id": "t3_1dufwnl",
        "parent_id": "t1_lbi8z3g"
    },
    {
        "comment_id": "l8to5m3",
        "subreddit": "books",
        "body": "We read some murakami short stories in class, & I had to go find the rest of his work",
        "time": "2024-06-16 05:36:51 UTC",
        "score": 1,
        "link_id": "t3_1dgd54f",
        "parent_id": "t1_l8pg9mj"
    },
    {
        "comment_id": "l8tntz8",
        "subreddit": "books",
        "body": "\"[Rock collecting] was like diving through my own interior blank-blackness to remember the starting species of a dream. There was a blue lake, a wit h, a lighthouse, a yellow path and an old, old coin. Nothing was as it seemed. The earth was like a shut eye. Mother's not dead, dear, only sleeping. Pry open the lid to find a crystalline intelligence inside, a rayed & sidereal beauty... adding plane after plane in obedience to an absolute geometry that even the stones- maybe only the stones- understood. \"\n-An American childhood by Annie Dillard \n\nI recently enjoyed a secret history by Donna tart for the details, too, it made for a quick (not short)  & easy read",
        "time": "2024-06-16 05:33:25 UTC",
        "score": 2,
        "link_id": "t3_1dgd54f",
        "parent_id": "t3_1dgd54f"
    }
]