[
    {
        "comment_id": "lpv0ap6",
        "subreddit": "books",
        "body": "A lot of people seem to like this but OP, I’m with you. By the time X’s chapter comes back around, I’ve forgotten what was going on.",
        "time": "2024-10-01 19:32:37 UTC",
        "score": 2,
        "link_id": "t3_1ft53dp",
        "parent_id": "t3_1ft53dp"
    },
    {
        "comment_id": "lgy4116",
        "subreddit": "books",
        "body": "The Outsiders is hands down one of the best books I’ve ever read. It was required reading when I was 12 and I had no idea what to expect but I fell in love with it. I was hooked fairly early because I grew up near Tulsa and it was nice to have a familiar location as the backdrop of the story. I still have Frost’s ‘Nothing Gold Can Stay’ memorized because I found it so beautiful. You’ve made me want to re-read it!",
        "time": "2024-08-07 14:52:23 UTC",
        "score": 4,
        "link_id": "t3_1em6dlw",
        "parent_id": "t3_1em6dlw"
    },
    {
        "comment_id": "lc5888h",
        "subreddit": "books",
        "body": "I have (had) a copy of Runaway I bought at a secondhand store. I hadn’t gotten around to reading it yet, but reading this made me so absolutely livid that I made a point to get up and find the book so I could rip the pages from the spine and throw it in the trash. I *never* disrespect books, but I wouldn’t feel comfortable letting a book by that person be put back into circulation. \n\nI’m glad the second hand store got my money, they deserve it. But what a waste.",
        "time": "2024-07-08 04:13:15 UTC",
        "score": 7,
        "link_id": "t3_1dxrypr",
        "parent_id": "t1_lc3ylz4"
    },
    {
        "comment_id": "lbxp2oj",
        "subreddit": "books",
        "body": "Same. I have a whole host of mental health struggles and I related to the feeling overwhelmed, alone, confused, just trying to make choices for me, instead of choices made *for* me aspect of the character. It’s still one of my favorite books of all time and I re-read it regularly.",
        "time": "2024-07-06 19:23:06 UTC",
        "score": 49,
        "link_id": "t3_1dwu02k",
        "parent_id": "t1_lbxjd42"
    },
    {
        "comment_id": "ksyzr28",
        "subreddit": "books",
        "body": "The Anne of Green Gables series left quite the impact on me. I still have a soft spot for those books, and Anne as a character and I’m 29 now.",
        "time": "2024-03-02 07:00:08 UTC",
        "score": 2,
        "link_id": "t3_1b4i0t8",
        "parent_id": "t3_1b4i0t8"
    },
    {
        "comment_id": "kq4vzoi",
        "subreddit": "books",
        "body": "I can’t count the number of times I’ve read this book. I even used it as a performance speech in high school. I know now that it wasn’t real but as a kid, I was enthralled.",
        "time": "2024-02-12 20:53:08 UTC",
        "score": 4,
        "link_id": "t3_1aotbrw",
        "parent_id": "t1_kq261js"
    },
    {
        "comment_id": "kq4vuc6",
        "subreddit": "books",
        "body": "This is my answer as well. I actually had to read it twice in school (I moved as a teen) and I loved it. I asked my parents to buy me my own copy at 13 because it was so good.",
        "time": "2024-02-12 20:52:17 UTC",
        "score": 2,
        "link_id": "t3_1aotbrw",
        "parent_id": "t1_kq1xtdv"
    },
    {
        "comment_id": "k0p7bvt",
        "subreddit": "books",
        "body": "I read Dorian Grey for the first time a few years ago and it changed how I read and how I write. His prose is absolutely beautiful. I wish I could re-read that for the first time.",
        "time": "2023-09-15 14:13:40 UTC",
        "score": 21,
        "link_id": "t3_16jaikv",
        "parent_id": "t1_k0orp4x"
    },
    {
        "comment_id": "k0k8mt2",
        "subreddit": "books",
        "body": "I read every one of these that our library had. I loved the author so much",
        "time": "2023-09-14 15:22:12 UTC",
        "score": 2,
        "link_id": "t3_16ic02c",
        "parent_id": "t1_k0jlhi2"
    },
    {
        "comment_id": "k0k8dh8",
        "subreddit": "books",
        "body": "I found this book for 10¢ at a book sale and got it immediately. This book definitely impacted me when we read it in high school.",
        "time": "2023-09-14 15:20:39 UTC",
        "score": 1,
        "link_id": "t3_16ic02c",
        "parent_id": "t1_k0jadbu"
    },
    {
        "comment_id": "k0k88bl",
        "subreddit": "books",
        "body": "Our teacher read these to us in elementary school and they were some of my favorites! Such cute little stories <3",
        "time": "2023-09-14 15:19:48 UTC",
        "score": 1,
        "link_id": "t3_16ic02c",
        "parent_id": "t1_k0ji55h"
    },
    {
        "comment_id": "k0k7zd0",
        "subreddit": "books",
        "body": "I absolutely loved that book as a kid. Thanks for reminding me of it!",
        "time": "2023-09-14 15:18:20 UTC",
        "score": 1,
        "link_id": "t3_16ic02c",
        "parent_id": "t1_k0jk3du"
    },
    {
        "comment_id": "k0funub",
        "subreddit": "books",
        "body": "I re-read this a few months ago and had forgotten how much I love the novel. It’s really interesting to see his inspiration-and kinda bananas to me that this situation actually happened in some capacity. (At least the attempt)\n\nThanks for sharing this!",
        "time": "2023-09-13 18:28:49 UTC",
        "score": 22,
        "link_id": "t3_16hqi6p",
        "parent_id": "t3_16hqi6p"
    },
    {
        "comment_id": "jy4sf6r",
        "subreddit": "books",
        "body": "The Valentine’s Day one was my favorite. Thanks for bringing back a sweet memory!",
        "time": "2023-08-28 19:46:09 UTC",
        "score": 5,
        "link_id": "t3_163tf8t",
        "parent_id": "t3_163tf8t"
    },
    {
        "comment_id": "ioxlkyz",
        "subreddit": "books",
        "body": "I’m 28 now and I’ve read Catcher 3 or 4 times since I was 18. Everyone I’ve talked to about it either hated it or didn’t get it. But I still love it. As someone who struggles with mental health issues, I could relate to his character more than most characters I was reading about around the same time. Yes he uses a lot of repetitive statements and he’s maybe kind of a jerk at times, but the kid has had a lot of bad happen to him. And he’s broken. \n\nThe fact that he’s recapping it all from inside a hospital/institution makes it all the more real for me. I’m sure middle aged Holden would be embarrassed of some of the things he said or did when he was a teenager but it doesn’t mean they weren’t true to his emotional state at the time. \n\nPlus Salinger is a fantastic writer, in my opinion.",
        "time": "2022-09-18 14:49:48 UTC",
        "score": 30,
        "link_id": "t3_xhcntd",
        "parent_id": "t1_iox4o6t"
    },
    {
        "comment_id": "imm5gtc",
        "subreddit": "books",
        "body": "I’ll check it out, thanks!",
        "time": "2022-09-01 03:31:45 UTC",
        "score": 1,
        "link_id": "t3_x2i9ql",
        "parent_id": "t1_imkbhjw"
    },
    {
        "comment_id": "imm5fur",
        "subreddit": "books",
        "body": "Will do, thanks for the rec!",
        "time": "2022-09-01 03:31:32 UTC",
        "score": 1,
        "link_id": "t3_x2i9ql",
        "parent_id": "t1_imlj1jt"
    },
    {
        "comment_id": "imk91p7",
        "subreddit": "books",
        "body": "This makes me want to try Hemingway again. I read A Farewell To Arms in high school and hated it. He’s a classic so I want to be interested, but oof that book was rough.",
        "time": "2022-08-31 19:29:37 UTC",
        "score": 4,
        "link_id": "t3_x2i9ql",
        "parent_id": "t1_imjmdh1"
    },
    {
        "comment_id": "ieysbdk",
        "subreddit": "books",
        "body": "The Bell Jar and Catcher in the Rye are both on my list too. They’re so different but I’m obsessed with anything that deals with (slightly) mentally unhinged characters.",
        "time": "2022-07-05 17:21:37 UTC",
        "score": 2,
        "link_id": "t3_vrzfe5",
        "parent_id": "t1_ieybrwt"
    },
    {
        "comment_id": "ieyrzob",
        "subreddit": "books",
        "body": "I adored Secret History and Dorian Gray, and I’m a Potterhead through and through, but I could not get into Cuckoo’s Nest at all. Loved the movie, but I got 25 or 30 pages into the book before I lost all interest.",
        "time": "2022-07-05 17:19:31 UTC",
        "score": 3,
        "link_id": "t3_vrzfe5",
        "parent_id": "t1_ieybv0y"
    },
    {
        "comment_id": "iemx925",
        "subreddit": "books",
        "body": "Read this book for the first time when I was 10 or 11. I thought it was true and was obsessed. Even with the ending, it made me wanna try all the things she did in the book. \n\nI was crushed when I found out it was fake but I still go back for a re-read sometimes anyway.",
        "time": "2022-07-02 23:38:39 UTC",
        "score": 6,
        "link_id": "t3_vpo504",
        "parent_id": "t1_iekpv0c"
    },
    {
        "comment_id": "id2kwqd",
        "subreddit": "books",
        "body": "As a teen I read a Christopher Pike series called Thirst (at least that’s what was on the over of the omnibus). Ancient vampire in modern times. I remember almost nothing from that book except what I learn about Hare Krishna, Vishnu, and some Hindu reincarnations. It’s how I learned that Buddha is in both. I’ve been fascinated ever since.",
        "time": "2022-06-20 15:53:33 UTC",
        "score": 5,
        "link_id": "t3_vgiekr",
        "parent_id": "t3_vgiekr"
    },
    {
        "comment_id": "icuo05n",
        "subreddit": "books",
        "body": "If it weren’t for Watchman, TKAM wouldn’t exist. So in that sense, I’m glad it was written. I didn’t enjoy the story much, and I felt suuuper betrayed by that one relationship that is very different in TKAM. But I’m still glad I read it. \n\nI won’t read it again though. TKAM I re-read regularly.",
        "time": "2022-06-18 17:17:10 UTC",
        "score": 20,
        "link_id": "t3_vezp9e",
        "parent_id": "t1_ictlxx6"
    },
    {
        "comment_id": "i79z8uj",
        "subreddit": "books",
        "body": "Another vote for The Green Mile here. It’s the only King I’ve read and I was pleasantly surprised how much I liked it. I haven’t seen the movie yet because I didn’t want to ruin the image I have in my head of the story. It’s obviously not a thriller like his normal stuff, and maybe that’s why it’s so good? Either way it’s definitely worth reading in my opinion, and short enough to get through pretty quickly.",
        "time": "2022-05-04 10:54:39 UTC",
        "score": 1,
        "link_id": "t3_ui2ayp",
        "parent_id": "t3_ui2ayp"
    },
    {
        "comment_id": "i6wusu9",
        "subreddit": "books",
        "body": "Are you me? I literally only read the books in high school because everyone else was. My mom got them for me because they were the ‘new Harry potter’ and I liked those. I was incredibly disappointed. I can’t remember anything from that series I liked, except that my sister and I now use it as a standard for how bad a book is.",
        "time": "2022-05-01 15:07:39 UTC",
        "score": 6,
        "link_id": "t3_ufrtcq",
        "parent_id": "t1_i6wfotq"
    },
    {
        "comment_id": "i5vn6y5",
        "subreddit": "books",
        "body": "I had some suspicions at the beginning but I tried not to mentally commit to any of them or think too hard about it because I wanted the story to unfold naturally. That being said, I knew who the author was *trying* to imply so I had a pretty good idea it wasn’t the obvious choice.",
        "time": "2022-04-23 14:02:32 UTC",
        "score": 11,
        "link_id": "t3_u9yik9",
        "parent_id": "t1_i5vhc0m"
    },
    {
        "comment_id": "i37sy1h",
        "subreddit": "books",
        "body": "This was my first thought as well! I have dreamt of visiting since I read the books as a child and I would re-read them in a heartbeat, especially if I got to go to PEI",
        "time": "2022-04-03 12:33:13 UTC",
        "score": 5,
        "link_id": "t3_tuy915",
        "parent_id": "t1_i36ejag"
    }
]