[
    {
        "comment_id": "lt9g7no",
        "subreddit": "books",
        "body": "There's no way in the world I (or most people, I'm sure) would buy new copies of all the books I read if the library didn't exist. For me thinking of the library's value is not based on book purchase savings, but rather on the value I ascribe to being able to read instead of some other activity like watching TV.",
        "time": "2024-10-23 00:12:06 UTC",
        "score": 2,
        "link_id": "t3_1g9oe7o",
        "parent_id": "t3_1g9oe7o"
    },
    {
        "comment_id": "lrysh5s",
        "subreddit": "books",
        "body": "No, he's had the *great* idea recently to occasionally release entire podcast episodes that are nothing but advertisements for his beloved sponsors.",
        "time": "2024-10-15 00:41:27 UTC",
        "score": 1,
        "link_id": "t3_1g3j753",
        "parent_id": "t3_1g3j753"
    },
    {
        "comment_id": "lpjfl99",
        "subreddit": "books",
        "body": "Crime and Punishment *really* got into my head in a weird way. Almost like I became Raskolnikov.",
        "time": "2024-09-29 19:34:06 UTC",
        "score": 1,
        "link_id": "t3_1frpquv",
        "parent_id": "t3_1frpquv"
    },
    {
        "comment_id": "lng8sic",
        "subreddit": "books",
        "body": "I've read all 5 books 3 times through, and it's one of favorite things to read. I will be thrilled if book 6 comes out eventually, but I think it's very unrealistic to expect book 7 before grrm dies.",
        "time": "2024-09-16 18:49:46 UTC",
        "score": 5,
        "link_id": "t3_1fic4pi",
        "parent_id": "t3_1fic4pi"
    },
    {
        "comment_id": "lmshriv",
        "subreddit": "books",
        "body": "Many years ago my sister mentioned to me that she was reading War & Peace. That was enough motivation for me to pick it up and give it a try. It wasn't super easy to get into at first, but once I did I was totally blown away by the breadth and depth of the story. I realized that 'classic' books are classic for a reason. That removed the invisible boundary that had been in place, and I have been richly rewarded ever since.",
        "time": "2024-09-12 16:52:19 UTC",
        "score": 5,
        "link_id": "t3_1feimre",
        "parent_id": "t3_1feimre"
    },
    {
        "comment_id": "ll0rm35",
        "subreddit": "books",
        "body": "If you actually did finish it, your opinion may be different.",
        "time": "2024-09-01 17:46:30 UTC",
        "score": 0,
        "link_id": "t3_1f609gr",
        "parent_id": "t1_lkxk17u"
    },
    {
        "comment_id": "lisfqox",
        "subreddit": "books",
        "body": "If I find myself not caring what happens next, I'll drop it. Sometimes I'll come back to it months or even years later; and I have enjoyed books occasionally that I had previously given up on.",
        "time": "2024-08-18 22:56:41 UTC",
        "score": 1,
        "link_id": "t3_1evljsu",
        "parent_id": "t3_1evljsu"
    },
    {
        "comment_id": "kvtb2ef",
        "subreddit": "books",
        "body": "Pretty much every Ishiguro book features a protagonist who fundamentally misunderstands some aspect of their reality. And usually the reader is taken on a journey of discovery along with the protagonist. This gives us some profound insight into our understanding of our own reality - in real life; and I think this deep insight is a big part of why Ishiguro was awarded the Nobel. \n\n*Klara and the Sun* is a more obvious example of the main character not understanding what's going on at first, but *The Unconsoled* is a slower burn where the reader eventually realizes something is a little off.",
        "time": "2024-03-20 23:46:24 UTC",
        "score": 7,
        "link_id": "t3_1bjh80a",
        "parent_id": "t1_kvt6dmw"
    },
    {
        "comment_id": "kk9psj5",
        "subreddit": "books",
        "body": "Mine is ASOIAF. I just finished it for the third time. I feel like I know the characters, and each time I re-read it I get to know them even better. I've read the 5 existing books every 6 years (2011, 2017, 2023) in the hope that they will still be somewhat fresh in my mind if and when book 6 is ever published.",
        "time": "2024-01-30 15:35:44 UTC",
        "score": 4,
        "link_id": "t3_1aeovwu",
        "parent_id": "t3_1aeovwu"
    },
    {
        "comment_id": "kilbm74",
        "subreddit": "books",
        "body": "The descriptions are what set Steinbeck's books apart for me. I ended up spending a couple of summers in the Salinas valley and Monterey specifically because he described them so well! I do totally understand though how some people may prefer the parts of books that more directly advance the plot.",
        "time": "2024-01-19 14:33:19 UTC",
        "score": 1,
        "link_id": "t3_19a40g7",
        "parent_id": "t3_19a40g7"
    },
    {
        "comment_id": "kh7njii",
        "subreddit": "books",
        "body": "I don't get most of the comments in this thread. Why do so many people care what others do with or think about books? I just do my own thing, and let others do theirs.",
        "time": "2024-01-10 14:48:48 UTC",
        "score": 2,
        "link_id": "t3_192pkyd",
        "parent_id": "t3_192pkyd"
    },
    {
        "comment_id": "k6opdhu",
        "subreddit": "books",
        "body": "My 12 year old son has been reading her books. I had never heard of her until a couple of months ago. Whatever it takes to get him into reading, I guess.",
        "time": "2023-10-27 14:32:04 UTC",
        "score": -5,
        "link_id": "t3_17hmpfg",
        "parent_id": "t3_17hmpfg"
    },
    {
        "comment_id": "k2sqdyo",
        "subreddit": "books",
        "body": "This was the first Ishiguro novel I read, and I agree that it was very uncomfortable to read, while being so good at the same time. But then I read a few of his other books, and they're all so good. *The Unconsoled* is particularly memorable, but in a strange way. Each of books essentially explores the same idea of beginning from a place where the main characters do not fully understand or appreciate the nature of the reality in which they exist. He has become perhaps my favorite author.",
        "time": "2023-09-30 00:02:13 UTC",
        "score": 29,
        "link_id": "t3_16vqo1x",
        "parent_id": "t3_16vqo1x"
    },
    {
        "comment_id": "jy9rtxu",
        "subreddit": "books",
        "body": "Ignatius Reilly bears a *very* close resemblance in behavior and temperament to The Comic Book Guy on the simpsons, in my opinion.",
        "time": "2023-08-29 19:15:54 UTC",
        "score": 2,
        "link_id": "t3_164kjfi",
        "parent_id": "t1_jy9nst4"
    },
    {
        "comment_id": "jy723qu",
        "subreddit": "books",
        "body": "I was born in the 70s, and only remember having the first Little Critter book, *Just for You*, when I was young. But I bought two larger collections of the books for my kids when they were young, and they loved them!",
        "time": "2023-08-29 06:04:57 UTC",
        "score": 3,
        "link_id": "t3_163tf8t",
        "parent_id": "t3_163tf8t"
    },
    {
        "comment_id": "jxk2t8o",
        "subreddit": "books",
        "body": "I also loved The Buried Giant! Have you read Ishiguro's other novels? While *Remains of the Day* and *Never Let Me Go* are also very good, my favorite of his is *The Unconsoled*, which is a masterpiece. As I was reading it I was several times left absolutely gobsmacked at Ishiguro's audacity in producing such a consistently intriguing yet frustrating narrative. If you end up loving The Buried Giant, I highly recommend it. If not, than maybe not.",
        "time": "2023-08-24 14:27:49 UTC",
        "score": 1,
        "link_id": "t3_15zfbkj",
        "parent_id": "t3_15zfbkj"
    },
    {
        "comment_id": "jwhswvt",
        "subreddit": "books",
        "body": "I hate to be that guy, but chatGPT can instantly tell you how long almost any book is,  in pages or words or characters or probability hundreds of other measures.",
        "time": "2023-08-16 22:07:21 UTC",
        "score": 1,
        "link_id": "t3_15scg3h",
        "parent_id": "t3_15scg3h"
    },
    {
        "comment_id": "jw3ona3",
        "subreddit": "books",
        "body": "I've read the Silmarillian a few times, and I love it. It's the kind of book you may want to read slowly, so you can make sure you understand what's being described. I even took notes as I was reading, just to keep a bunch of the names straight. There are several kind of separate sections and stories, some of which are expanded elsewhere as you referenced. It does help explain some of the mythology and references in the main lotr story, and it certainly helps you contextualize Middle Earth in the larger picture that Tolkien envisioned. It largely focuses on the history of the Elves, and their dealings with the *Valar*. To me it helped emphasize the implicit meaning behind many of the secondary and tertiary aspects of the LOTR. The two main reasons It's not easy to read are that it is written in slightly archaic language, and that it's really a collection of narratives that are only partially connected in some cases.",
        "time": "2023-08-14 05:12:25 UTC",
        "score": 11,
        "link_id": "t3_15qkkiu",
        "parent_id": "t3_15qkkiu"
    },
    {
        "comment_id": "jtuehmz",
        "subreddit": "books",
        "body": "I'm a middle-aged hetero man, and I read constantly. And honestly I find it difficult to have genuine friendships with people who don't read, and especially with people who are proud and vocal about not reading.",
        "time": "2023-07-28 19:18:02 UTC",
        "score": 1,
        "link_id": "t3_15bu98m",
        "parent_id": "t3_15bu98m"
    },
    {
        "comment_id": "jto3kqg",
        "subreddit": "books",
        "body": "I didn't start reading for pleasure until after grad school when I was 31 years old. In the 15 years since then I've been trying to catch up, but it seems like people keep writing even more books!",
        "time": "2023-07-27 14:40:25 UTC",
        "score": 1,
        "link_id": "t3_15ay1pl",
        "parent_id": "t3_15ay1pl"
    },
    {
        "comment_id": "jrk5zjo",
        "subreddit": "books",
        "body": "I hope this post is meant as satire. Kids are pretty resilient in the face of bathroom humor.",
        "time": "2023-07-11 17:26:13 UTC",
        "score": 22,
        "link_id": "t3_14wx2bp",
        "parent_id": "t3_14wx2bp"
    },
    {
        "comment_id": "jg0iz6i",
        "subreddit": "books",
        "body": "I used to absolutely hate him because I assumed he was intentionally spreading misinformation; but after reading some of his stuff he doesn't ever actually claim to be an expert, so I'm a little more neutral about him now. He is a good story teller, and that's all.",
        "time": "2023-04-12 21:43:59 UTC",
        "score": 4,
        "link_id": "t3_12jqkv7",
        "parent_id": "t3_12jqkv7"
    },
    {
        "comment_id": "jfuk1m2",
        "subreddit": "books",
        "body": "I know she wrote 6 other novels, and I have been intending to read more of them, but sadly I haven't yet. I especially want to read her post-apocalyptic novel *The Last Man*.",
        "time": "2023-04-11 16:54:46 UTC",
        "score": 1,
        "link_id": "t3_12inv5w",
        "parent_id": "t1_jfuioe8"
    },
    {
        "comment_id": "jfudiuz",
        "subreddit": "books",
        "body": "When I first read Frankenstein a few years ago I was very surprised at it's depth and poignancy, owing primarily to the fact that my expectations were based largely on Hollywood tropes about the lumbering and slow-witted 'monster'. A friend had recommended that I read it, and told me that I would not be disappointed, so I gave it a shot. It's a beautiful story, and bears almost no resemblance to the old movie version that I had expected. The narrative structure is a bit complex, with multiple narrators, but in a way that helps the reader see at least parts of the whole story from those separate points of view. Given how long ago the book was written, it seems more impressive than if it was a more recent work. As an avid fan of modern science fiction, I was interested to read it from the point of view that this was essentially the very first science fiction novel.",
        "time": "2023-04-11 16:12:29 UTC",
        "score": 7,
        "link_id": "t3_12inv5w",
        "parent_id": "t3_12inv5w"
    },
    {
        "comment_id": "jf5hcfz",
        "subreddit": "books",
        "body": "I love that one. I've read many dystopian novels, and this one is close to the top of the list as the most plausible. And good news - there's a sequel that was just written recently. Margaret Atwood has a few other well-written books, most notably Oryx and Crake, which is more science fictiony.",
        "time": "2023-04-06 05:30:24 UTC",
        "score": 4,
        "link_id": "t3_12d9n4c",
        "parent_id": "t3_12d9n4c"
    },
    {
        "comment_id": "jf2519n",
        "subreddit": "books",
        "body": "I once read a fan-fic Harry Potter book that I 'found' online by accident when I was trying to find a copy of whichever one was new at the time. Maybe book 5. It was not the quality I was expecting, but I finished it anyway!",
        "time": "2023-04-05 15:03:50 UTC",
        "score": 1,
        "link_id": "t3_12ca2w5",
        "parent_id": "t3_12ca2w5"
    },
    {
        "comment_id": "jeg2ftt",
        "subreddit": "books",
        "body": "“Wovon man nicht sprechen kann, darüber muß man schweigen.”\n\n-Ludwig Wittgenstein, Tractatus Logico-Philosophicus",
        "time": "2023-03-31 19:22:05 UTC",
        "score": 2,
        "link_id": "t3_127bzhf",
        "parent_id": "t3_127bzhf"
    },
    {
        "comment_id": "jbbx6d6",
        "subreddit": "books",
        "body": "I've loved pretty much all of Ted Chiang's short stories. Most of them are contained in two collections: *Stories of Your Life and Others*, and *Exhalation: Stories*. The movie Arrival was based on his short story *Story of Your Life*.",
        "time": "2023-03-07 22:52:15 UTC",
        "score": 2,
        "link_id": "t3_11lcz26",
        "parent_id": "t3_11lcz26"
    },
    {
        "comment_id": "jb82uf6",
        "subreddit": "books",
        "body": "Others may disagree, but I think that *The Unconsoled* is an unparalleled masterpiece that showcases Ishiguro's skill in a way that isn't as fully developed in his other books. That being said, *The Remains of the Day* is also brilliant in a more accessible way. And I agree that *Never Let Me Go* is unique and wonderful too. All his books have significant thematic overlap, even with their vastly different settings. I think he deserved that Nobel Prize as much as anyone.",
        "time": "2023-03-07 03:17:34 UTC",
        "score": 23,
        "link_id": "t3_11km5nz",
        "parent_id": "t3_11km5nz"
    },
    {
        "comment_id": "jas5odp",
        "subreddit": "books",
        "body": "What is your favorite, or *a* favorite, novel (that wasn't written by you)?",
        "time": "2023-03-03 17:52:32 UTC",
        "score": 116,
        "link_id": "t3_11h6hg5",
        "parent_id": "t3_11h6hg5"
    },
    {
        "comment_id": "j868ex1",
        "subreddit": "books",
        "body": "It sounds like you're the wrong kind of person for this book. Some people really like Andy Weir's style, and some don't. If you want more 'literary' science fiction try something like Hyperion by Dan Simmons.",
        "time": "2023-02-11 23:08:45 UTC",
        "score": 17,
        "link_id": "t3_10zzqer",
        "parent_id": "t3_10zzqer"
    }
]