[
    {
        "comment_id": "lri2n5f",
        "subreddit": "books",
        "body": "Unabridged Moby Dick by Herman Melville. Started several times and liked what I could understand, used dictionary constantly. In the Heart of the Sea by Nathial Philbrick was easier and extremely 9interesting. Lots of annotations explaining portions as well.",
        "time": "2024-10-12 01:14:04 UTC",
        "score": 1,
        "link_id": "t3_1g1jd25",
        "parent_id": "t3_1g1jd25"
    },
    {
        "comment_id": "lihy3f7",
        "subreddit": "books",
        "body": "Read the Goldfinch twice.  Love it!  The pace picks up soon and lots of adventure. All characters are well developed. Don't give up on it!",
        "time": "2024-08-17 01:06:02 UTC",
        "score": 47,
        "link_id": "t3_1eu4m18",
        "parent_id": "t3_1eu4m18"
    },
    {
        "comment_id": "h3nbalo",
        "subreddit": "books",
        "body": "Have you ever lived in the South?  Did your mother abandon your entire family, and eventually your father as well?  Read \"Caste\" by Wilkenson if you truly want to read about racism.  That is a very difficult read, but I feel necessary.  Fiction should just whet your appetite to read some non-fiction. Excellent fiction are the Pulitzer Prize winers. The main character was helped by kind, poor Black people.  Men were around doing the same things she was, such as fishing and hunting  Unlikely she woud see many women doing the same. Any woman alone having a place of her own (which was very unusual) had to be on the lookout for men who may have thought she was a easy target. Isn't it still that way now to some degree? Every woman I now that lives alone takes safety measures.\n\nEDIT: 136 weeks on the New York Times Best Seller list means a lot.",
        "time": "2021-07-01 04:32:52 UTC",
        "score": 4,
        "link_id": "t3_oawoxa",
        "parent_id": "t1_h3kkh5a"
    },
    {
        "comment_id": "h3naleu",
        "subreddit": "books",
        "body": "What authors do you enjoy?",
        "time": "2021-07-01 04:25:29 UTC",
        "score": 1,
        "link_id": "t3_oawoxa",
        "parent_id": "t1_h3lb2l3"
    },
    {
        "comment_id": "h3naewr",
        "subreddit": "books",
        "body": "I enjoyed the entire book.  Main character was a survivor and lived a wonderful life after she didnt have to struggle as much. Times were rough then, but she held her own.  Just read \"The Big Rock Candy Mountain,\" and \"Angle of Repose\" by Wallace Stegner...survival was making use out of available resources was what people did in the 19th century.  Loved the ending.",
        "time": "2021-07-01 04:23:36 UTC",
        "score": 1,
        "link_id": "t3_oawoxa",
        "parent_id": "t1_h3kl2ls"
    },
    {
        "comment_id": "gyvuiwd",
        "subreddit": "books",
        "body": "Also fun are the books without any text (or very little.)  Your kids can \"read\" to you making their own narrative.  Encourages creativity.  Some of my favorites:  Free Fall by David Wiesner, Journey by Aaron Becker, The Red Book by Barbara Lehman, and Chalk by Bill Thompson.",
        "time": "2021-05-20 23:37:39 UTC",
        "score": 3,
        "link_id": "t3_ngya79",
        "parent_id": "t1_gyv107z"
    },
    {
        "comment_id": "gyvthwu",
        "subreddit": "books",
        "body": "I too read to my kids starting very young.  For every hour they were playing video games, they would spend an hour reading.  Both still read a lot as adults and both have occupations as professionals working with people who also engaged with books at an early age. Children's picture books are fun to read as as parents too.",
        "time": "2021-05-20 23:28:49 UTC",
        "score": 2,
        "link_id": "t3_ngya79",
        "parent_id": "t3_ngya79"
    },
    {
        "comment_id": "guq7n4c",
        "subreddit": "books",
        "body": "My book group is made up of teachers.  Over time it has changed to women who travel frequently.  Our rule was to read the entire book, whoever suggested the book to do a bit of background information on the author to share with others.  I suggested \"The Goldfinch\" by Donna Tartt.  Noone completed  reading it (except me.) Yes, it was a Pulitizer Prize winner and nearly 1,000 pages. I ended up telling members how the plot developed, major highlights.  I was disappointed our club had changed to just showing up (or not.) Yes, we were younger awhile ago and were raising our kids, also volunteering our time for Great Books with 4th and 5th graders then (which was so satisfying). I would love a new group wher I am living now; they are so hard to find!  It is so enlightening to hear other people's interpretations of what we read to broaden our outlooks.",
        "time": "2021-04-16 14:27:46 UTC",
        "score": 1,
        "link_id": "t3_ms0axi",
        "parent_id": "t3_ms0axi"
    },
    {
        "comment_id": "gowfoo9",
        "subreddit": "books",
        "body": "Love that place.  And no sales tax in OR!",
        "time": "2021-02-26 22:35:14 UTC",
        "score": 3,
        "link_id": "t3_lt20l1",
        "parent_id": "t3_lt20l1"
    },
    {
        "comment_id": "go6wyxs",
        "subreddit": "books",
        "body": "I read it twice.  Loved it.",
        "time": "2021-02-21 03:52:29 UTC",
        "score": 1,
        "link_id": "t3_loiz47",
        "parent_id": "t1_go6vfin"
    },
    {
        "comment_id": "gl4lspk",
        "subreddit": "books",
        "body": "Loved the ending.  Loved her independence.  I totally enjoyed this book.",
        "time": "2021-01-28 18:39:13 UTC",
        "score": 14,
        "link_id": "t3_l6xw2t",
        "parent_id": "t3_l6xw2t"
    },
    {
        "comment_id": "g63ozx7",
        "subreddit": "books",
        "body": "Rage",
        "time": "2020-09-21 13:56:24 UTC",
        "score": 1,
        "link_id": "t3_iwxhr7",
        "parent_id": "t3_iwxhr7"
    },
    {
        "comment_id": "g0son0l",
        "subreddit": "books",
        "body": "My son had a Dorsey-Kingsley book about castles.  Lots of explanations for the building of these castles.  Loved the book.",
        "time": "2020-08-08 15:31:24 UTC",
        "score": 5,
        "link_id": "t3_i6005g",
        "parent_id": "t3_i6005g"
    }
]