[
    {
        "comment_id": "lzxx6s0",
        "subreddit": "books",
        "body": "To go into detail, there's a long poet/storytelling tradition in Ireland, with seanchaí being storytellers who were pretty high status, similar to bards. Added to that, the dialect, Hiberno-English, retains a lot of the grammar of Irish, different sentence structures, things like that, as well as the extra tense I mentioned.\n\nThere is a bit of indirect dialogue, but it can flow between direct and indirect, without necessarily signposting that it's doing so.\n\nThere's also just a tendency to play with language a bit more than is usual, I think.",
        "time": "2024-12-01 22:19:44 UTC",
        "score": 1,
        "link_id": "t3_1h3uo4q",
        "parent_id": "t1_lzxuidr"
    },
    {
        "comment_id": "lzuyx3u",
        "subreddit": "books",
        "body": "I think Ulysses is well worth reading without caring if you're getting it or not, I know I missed a lot, but it's still very enjoyable.",
        "time": "2024-12-01 12:07:10 UTC",
        "score": 7,
        "link_id": "t3_1h3uo4q",
        "parent_id": "t1_lztta8s"
    },
    {
        "comment_id": "lzuypsd",
        "subreddit": "books",
        "body": "Not necessarily, it's more that it's not so much a type of experiment writing as it is something that's part of how stories are told.\n\nHow well it works depends on the writer and the reader.\n\nBut, for example, Walter Macken sometimes uses clear punctuation, and sometimes doesn't. But his narration has a voice that's distinct from the characters' voices. \n\nIt's much more like speech, if someone's telling you a story, you wouldn't stop stop them and ask for speech tags, and if the storyteller is good enough you get into the flow of it.\n\nIf I'm reading Stephen King the narrator sort of isn't there, I'm observing the things he's talking about, but when I read Macken it's always Macken himself telling a story.",
        "time": "2024-12-01 12:05:07 UTC",
        "score": 3,
        "link_id": "t3_1h3uo4q",
        "parent_id": "t1_lztvhcz"
    },
    {
        "comment_id": "lztp61s",
        "subreddit": "books",
        "body": "I think it's part of Irish storytelling tradition, we have a specific dialect that's fairly different from standard English, we even have a tense that only exists in Hiberno English.\n\nFor a lot of historical reasons Irish people are going to have quirks in language that are less prevalent elsewhere.",
        "time": "2024-12-01 04:25:39 UTC",
        "score": 24,
        "link_id": "t3_1h3uo4q",
        "parent_id": "t1_lzto56b"
    },
    {
        "comment_id": "lztojzs",
        "subreddit": "books",
        "body": "They're not all difficult, that's mainly Ulysses",
        "time": "2024-12-01 04:21:02 UTC",
        "score": 24,
        "link_id": "t3_1h3uo4q",
        "parent_id": "t1_lztoc2q"
    },
    {
        "comment_id": "lzoztcn",
        "subreddit": "books",
        "body": "For Ulysses specifically you can read it without much understanding, and I doubt anyone just reads it and fully gets it.\n\nIt's way too weird.",
        "time": "2024-11-30 10:05:41 UTC",
        "score": 40,
        "link_id": "t3_1h397o5",
        "parent_id": "t1_lzoz7v7"
    },
    {
        "comment_id": "lzicraf",
        "subreddit": "books",
        "body": "Malazan, it has several hundred pov characters, and it's done really well.",
        "time": "2024-11-29 03:44:51 UTC",
        "score": 20,
        "link_id": "t3_1h2cq2j",
        "parent_id": "t3_1h2cq2j"
    },
    {
        "comment_id": "lzgze2o",
        "subreddit": "books",
        "body": "American Tabloid by James Ellroy",
        "time": "2024-11-28 21:58:52 UTC",
        "score": 2,
        "link_id": "t3_1h26onk",
        "parent_id": "t3_1h26onk"
    },
    {
        "comment_id": "lycccgi",
        "subreddit": "books",
        "body": "You might be interested in The Authoritarians [https://theauthoritarians.org/](https://theauthoritarians.org/)",
        "time": "2024-11-22 01:14:32 UTC",
        "score": 5,
        "link_id": "t3_1gwkwr8",
        "parent_id": "t1_lyb0tib"
    },
    {
        "comment_id": "ly0uhk5",
        "subreddit": "books",
        "body": "yep",
        "time": "2024-11-20 00:50:30 UTC",
        "score": 0,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_ly0m7ya"
    },
    {
        "comment_id": "ly00jes",
        "subreddit": "books",
        "body": "Death of the artist is only meant to be a framework for analysing texts, it's been changed into something completely different when people start excusing the author's behaviour.",
        "time": "2024-11-19 22:03:02 UTC",
        "score": 17,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxyz8um"
    },
    {
        "comment_id": "lxrchr5",
        "subreddit": "books",
        "body": "It's a very strange series, it's brilliant in a lot of ways, but it's incredibly dark, and in an adult not-cool way, and the things that are brilliant are also the things that make it such a tough read.\n\nI agree with another commenter about the assault scene, it's necessary for the story, but even if it were possible to remove that scene I don't think it's adaptable, the whole thing hinges on the internal worlds of the characters, and any adaptation would lose that.\n\nI think its legacy is probably secure, there's a few major writers who've taken inspiration from it, ASOIAF seems to have references to it, and Martin has been very complimentary to Donaldson. Stephen Erikson lists it as a major inspiration, and Malazan's themes are concerned with the same things, while certain plotlines and characters seem like they just wouldn't exist without Covenant's influence.\n\nWhenever this series comes up a ton of comments will say that Covenant himself is too disgusting to read it, but imo this is like saying Crime and Punishment shouldn't be read because Raskolnikov is a murderer.\n\nThis is often accompanied by the claim that the leads have no redeeming qualities, which is a mind-blowing statement to me, since the leads spend the entire series trying to make up for their shortcomings.\n\nIt's still a difficult, and often unpleasant, piece, so I wouldn't fault people for not getting through it, but refusing to read it because the main characters do bad things is very shot sighted to me.\n\nUltimately, I think it's worth the effort of reading it, and it deserves to be recognised as the landmark it is, and after Tolkien I'd say it's the book that did the most to define where fantasy writing is now.",
        "time": "2024-11-18 14:24:48 UTC",
        "score": 20,
        "link_id": "t3_1gtzs08",
        "parent_id": "t3_1gtzs08"
    },
    {
        "comment_id": "lv3ldky",
        "subreddit": "books",
        "body": "Nah, that's just defensive bullshit, I like King, but more often than not he flubs the landing. That's such a well known fact that there's multiple jokes about it in the new version of It.\n\nI never said anything about what good story has to be, and I've said repeatedly that he's a great storyteller. But a good writer, someone who's good at the craft can plot.\n\nRead King's book about the Kennedy assassination, then read Ellroy's. \n\nEllroy's is obviously far better written, and Ellroy isn't a literary darling he's a pulp writer.",
        "time": "2024-11-02 23:47:21 UTC",
        "score": -1,
        "link_id": "t3_1gi331u",
        "parent_id": "t1_lv3g50u"
    },
    {
        "comment_id": "lv2xijs",
        "subreddit": "books",
        "body": "Absolutely structure is part of mechanics, and plot is the most basic level of structure. \n\nBeing a good storyteller just means people enjoy your stories, which they obviously do with King.\n\nI'm not talking about his point of view, his point of view is that plotting is bad, that's absurd. Whether or not he can or can't plot only says something about his skill, not about plotting. \n\nThe fact that he can't plot is just an obvious weakness in his writing ability.",
        "time": "2024-11-02 21:27:22 UTC",
        "score": -3,
        "link_id": "t3_1gi331u",
        "parent_id": "t1_lv2uw8t"
    },
    {
        "comment_id": "lv2q1xz",
        "subreddit": "books",
        "body": "Nah, he's not great at the mechanics, that's why he can't write an ending, it's why he thinks plotting is opposed to good writing.\n\nIt has nothing to do with prettiness or being poetic, it's about disdain for the craft of writing beyond story telling. \n\nRead James Ellroy's American Tabloid, you'll never read better technical writing, and you'll have a hard time finding anything as ugly. \n\nKing is a master storyteller, and deserves his fame and popularity, but he's a mediocre writer at best.",
        "time": "2024-11-02 20:45:18 UTC",
        "score": -7,
        "link_id": "t3_1gi331u",
        "parent_id": "t1_lv2a4c7"
    },
    {
        "comment_id": "lv285j6",
        "subreddit": "books",
        "body": "This is exactly it, he's never been a great writer, he's mediocre at best. But he writes page turners that are easy to read.\n\nThe confusion comes because for a lot of readers he's the best writer they've ever read.",
        "time": "2024-11-02 19:08:03 UTC",
        "score": -12,
        "link_id": "t3_1gi331u",
        "parent_id": "t1_lv252da"
    },
    {
        "comment_id": "lufv0vz",
        "subreddit": "books",
        "body": "That's true, the worms are the only aliens in Dune other than like mice type things.\n\nMy take on God Emperor is just that Leto's full of shit. There is no Golden Path, there was no threat of extinction, it's all just him being a megalomaniac.",
        "time": "2024-10-30 00:06:58 UTC",
        "score": 2,
        "link_id": "t3_1gdtebh",
        "parent_id": "t1_lu7mya3"
    },
    {
        "comment_id": "ludauo2",
        "subreddit": "books",
        "body": "Book of the Fallen first, in published order for sure.",
        "time": "2024-10-29 16:12:18 UTC",
        "score": 1,
        "link_id": "t3_1gey7bs",
        "parent_id": "t3_1gey7bs"
    },
    {
        "comment_id": "lteyb6e",
        "subreddit": "books",
        "body": "That's pretty much it, \"The ends justify the means\" is a paraphrase of “For although the act condemns the doer, the end may justify him…” which is a quote from... Machiavelli.",
        "time": "2024-10-23 22:01:36 UTC",
        "score": 5,
        "link_id": "t3_1gakvhc",
        "parent_id": "t1_ltet83u"
    },
    {
        "comment_id": "lsrp4mv",
        "subreddit": "books",
        "body": "Yeah, but think about how much editing has to be done to a decent author's work vs a rubbish one. You can spend time getting the rubbish to the level the other one starts at, and the target audience doesn't care or notice.\n\nAnd you only have so many people editing, so that's time wasted that could be better spent elsewhere.",
        "time": "2024-10-20 00:27:45 UTC",
        "score": 3,
        "link_id": "t3_1g7jezo",
        "parent_id": "t1_lsriusf"
    },
    {
        "comment_id": "lsre88v",
        "subreddit": "books",
        "body": "Most entertainment producers have to live by a philosophy of releasing rubbish that makes money, to fund good things that don't.\n\nI wouldn't write off publishers this way too easily, I forget the name, but one of EMI's executives had a quote about how MC Hammer paid for Radiohead. Similar things apply in all kinds of publishing.",
        "time": "2024-10-19 23:18:45 UTC",
        "score": 31,
        "link_id": "t3_1g7jezo",
        "parent_id": "t1_lsr3o28"
    },
    {
        "comment_id": "lrhp65c",
        "subreddit": "books",
        "body": "I think a lot of this actually is just stylistic, a lot of the time the best approach is to just read it without worrying too much about taking it in, usually it'll click fairly quickly, then I just start again.",
        "time": "2024-10-11 23:40:54 UTC",
        "score": 4,
        "link_id": "t3_1g1jd25",
        "parent_id": "t3_1g1jd25"
    },
    {
        "comment_id": "lr6xxpr",
        "subreddit": "books",
        "body": "And then you read God Emperor and realise that Herbert's thought Paul was bad for not committing to the Jihad like he should've.",
        "time": "2024-10-10 02:20:38 UTC",
        "score": 2,
        "link_id": "t3_1fzraea",
        "parent_id": "t1_lr6pypt"
    },
    {
        "comment_id": "lq99z1w",
        "subreddit": "books",
        "body": "It's actually shite with really good prose.",
        "time": "2024-10-04 05:11:37 UTC",
        "score": -12,
        "link_id": "t3_1fvqleu",
        "parent_id": "t1_lq96etg"
    },
    {
        "comment_id": "lq9985a",
        "subreddit": "books",
        "body": "Hot take: Blood Meridian is absolute dogshit.\n\nOne of the worst books I've ever read, complete tripe packaged in excellent prose.\n\nI will give it that, the prose is phenomenal, but prose is wrapping paper, and inside this wrapping paper is nothing at all.\n\nIt actually upsets me that  people call this the great American novel when Mark Twain, Steinbeck, James Ellroy, and Joseph Heller exist. I'm probably missing other writers who also piss all over McCarthy's trite, nonsensical gibberish are out there.\n\nEdgy bullshit for twelve year olds with a patina of depth that only a retarded child could take seriously.",
        "time": "2024-10-04 05:04:33 UTC",
        "score": 1,
        "link_id": "t3_1fvqleu",
        "parent_id": "t3_1fvqleu"
    },
    {
        "comment_id": "locgxcd",
        "subreddit": "books",
        "body": "Orwell wasn't even trying to predict anything tho, he was just exaggerating things that were already happening.",
        "time": "2024-09-22 11:17:02 UTC",
        "score": 23,
        "link_id": "t3_1fmibgk",
        "parent_id": "t1_lobwf6c"
    },
    {
        "comment_id": "lnmhlnd",
        "subreddit": "books",
        "body": "You're in for a wild ride, I won't say any more than that.",
        "time": "2024-09-17 20:02:21 UTC",
        "score": 2,
        "link_id": "t3_1fj7pe8",
        "parent_id": "t1_lnmfnvg"
    },
    {
        "comment_id": "lnme3kl",
        "subreddit": "books",
        "body": "Karsa's just a kid :P",
        "time": "2024-09-17 19:44:31 UTC",
        "score": 2,
        "link_id": "t3_1fj7pe8",
        "parent_id": "t1_lnmclhu"
    },
    {
        "comment_id": "lni2jb5",
        "subreddit": "books",
        "body": "Jesus.",
        "time": "2024-09-17 01:07:12 UTC",
        "score": 1,
        "link_id": "t3_1filb3c",
        "parent_id": "t3_1filb3c"
    },
    {
        "comment_id": "ln4weeu",
        "subreddit": "books",
        "body": "If you liked Hitch-Hiker's, Catch-22, it's the blueprint for everything Adams and Pratchett did.",
        "time": "2024-09-14 19:58:53 UTC",
        "score": 1,
        "link_id": "t3_1fgnkx6",
        "parent_id": "t3_1fgnkx6"
    },
    {
        "comment_id": "lm78plv",
        "subreddit": "books",
        "body": "Feel free to point out the flaws.",
        "time": "2024-09-08 23:59:09 UTC",
        "score": 1,
        "link_id": "t3_1fbyr71",
        "parent_id": "t1_lm750bs"
    },
    {
        "comment_id": "lm53pg9",
        "subreddit": "books",
        "body": "Yeah that was a dumb move.\n\nI have mixed feelings on them tbh, but they're a great example of a band who know how to craft a song. None of them do anything particularly special, they have one job each, within a formula, and they do that exact job every time.\n\nWhether they're doing a blues, or pop, or rock, or electronic, each of them is doing the exact same thing in every song, basically just with slightly different effects.\n\nIt's pretty impressive in a weird way.",
        "time": "2024-09-08 17:02:47 UTC",
        "score": 4,
        "link_id": "t3_1fbyr71",
        "parent_id": "t1_lm4wgd1"
    },
    {
        "comment_id": "lm4p38a",
        "subreddit": "books",
        "body": "Swift is a master of her craft, her songs may not be particularly good, but they're pretty much flawless, on top of that she's also exceptionally good at marketing. \n\nSame goes for lots of huge bands, U2 and Coldplay spring to mind.",
        "time": "2024-09-08 15:45:18 UTC",
        "score": 13,
        "link_id": "t3_1fbyr71",
        "parent_id": "t1_lm4nkrs"
    },
    {
        "comment_id": "lm41roj",
        "subreddit": "books",
        "body": "Not just that it's not real, but that the philosophy it's advocating is very silly.",
        "time": "2024-09-08 13:39:51 UTC",
        "score": 5,
        "link_id": "t3_1fbscr3",
        "parent_id": "t1_lm3zvil"
    },
    {
        "comment_id": "lm3w6s9",
        "subreddit": "books",
        "body": "It's very important to remember, and it's utterly forgotten by a lot of fans, that Dune is a thesis statement from an author with a very specific ideology/mythos. \n\nIf you don't share that outlook then a lot of it doesn't make much sense, because Frank Herbert wasn't a God Emperor, or even someone with particular expertise in what he's talking about, he's just a bloke, and he's just factually wrong about how things work.\n\nWhether or not Leto's plan *is* working, isn't because it's realistic or not at all, but because that's how Herbert wrote it.\n\nI love the series, I think it's a great story, but at the end of the day, it's Frank Herbert's fantasy of how the world is, and has basically nothing in common with reality.",
        "time": "2024-09-08 13:06:21 UTC",
        "score": 18,
        "link_id": "t3_1fbscr3",
        "parent_id": "t1_lm35tj4"
    }
]