[
    {
        "comment_id": "lvylqin",
        "subreddit": "books",
        "body": "Of course. If I'm not getting enjoyment out of it, I better be getting something else out of it or I'm wasting my time.",
        "time": "2024-11-07 20:41:07 UTC",
        "score": 2,
        "link_id": "t3_1gm09hg",
        "parent_id": "t3_1gm09hg"
    },
    {
        "comment_id": "lvk2g1o",
        "subreddit": "books",
        "body": "But even recreational ebooks have educational value that blog posts don't.  \n\n\nThink about a good fiction book for a second, where they've built their world up, built up their characters, and now character X made decision Y. Why did X make that decision? Did it truly fit the scenario the best objectively or did their background play into it? \n\n\nFiction can pose deep questions indirectly. Blog posts neither have the time nor inclination to do so, it's just not where the money is.",
        "time": "2024-11-05 17:48:12 UTC",
        "score": 1,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvipa4k"
    },
    {
        "comment_id": "lvintak",
        "subreddit": "books",
        "body": "This is true, but the content is different. Blog posts and comments sections generally don't have the same educational value as an ebook.",
        "time": "2024-11-05 13:25:25 UTC",
        "score": 9,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvi3gb4"
    },
    {
        "comment_id": "lvinjqr",
        "subreddit": "books",
        "body": "Remember that parents aren't in the classroom. They're often going by impressions left by the school. When schools want to show off that they are a forward-leaning institution on the cutting edge of education, these Chromebooks and smart projectors are everywhere.",
        "time": "2024-11-05 13:23:46 UTC",
        "score": 17,
        "link_id": "t3_1gk1bxm",
        "parent_id": "t1_lvia23w"
    },
    {
        "comment_id": "lu38vka",
        "subreddit": "books",
        "body": "Money.",
        "time": "2024-10-27 23:07:18 UTC",
        "score": 2,
        "link_id": "t3_1gdgvlf",
        "parent_id": "t1_lu2jjcp"
    },
    {
        "comment_id": "lk6bk1e",
        "subreddit": "books",
        "body": "But you yourself are denying the possibility that it is happening to someone else. If you suffered abuse then frankly you should know better.",
        "time": "2024-08-27 13:53:30 UTC",
        "score": 40,
        "link_id": "t3_1f2gehf",
        "parent_id": "t1_lk6b0mw"
    }
]