[
    {
        "comment_id": "lv1qe17",
        "subreddit": "books",
        "body": "I don't even remember that ending.  All I remember is the \"big reveal\" that >!the government started the plague!< but it had been telegraphed so far out that I absolutely did not care, which is the opposite of what the ending of a book should do.",
        "time": "2024-11-02 17:34:42 UTC",
        "score": 1,
        "link_id": "t3_1gguk4d",
        "parent_id": "t1_luso7gn"
    },
    {
        "comment_id": "j4jhtxq",
        "subreddit": "books",
        "body": "I use my library extensively through my kindle.  Check to see if your library has overdrive/libby and borrow books through there.  I need to go into the physical library once every year or two so they can re-verify my address but that's it.  In addition, I read a lot of fantasy and scifi so I hang out on r/Fantasy a lot.  I find a fair amount of free books for my kindle that way.  You might be able to find similar deals on other subreddits for genres you enjoy.",
        "time": "2023-01-16 03:42:14 UTC",
        "score": 2,
        "link_id": "t3_10cskrg",
        "parent_id": "t3_10cskrg"
    },
    {
        "comment_id": "iinfbh2",
        "subreddit": "books",
        "body": "This right here. I read a book a few years back from an author I met at an art fair. Decent book, story was obviously not done (IIRC the book didn't even have a real ending, just a pause and wait), and when I checked the author's website 18 months later it said he was taking care of family stuff and book 2 would be delayed. To my knowledge it still hasn't come out yet. However, when I bought book 1 I was aware it was unfinished and I didn't have the promise of \"the whole thing is written and just needs publishing.\"",
        "time": "2022-08-02 14:58:18 UTC",
        "score": 4,
        "link_id": "t3_wdoiq2",
        "parent_id": "t1_iikw8bx"
    },
    {
        "comment_id": "icefo1z",
        "subreddit": "books",
        "body": "It works for me. Transferring my books to my Kindle via USB also works.  I usually have 10-15 holds at the library and when a bunch hit at the same time I can either game the system or wait another 6 months for some of my books.",
        "time": "2022-06-15 01:11:10 UTC",
        "score": 1,
        "link_id": "t3_vc44ye",
        "parent_id": "t1_iccqwdx"
    },
    {
        "comment_id": "i9xdqpz",
        "subreddit": "books",
        "body": "Is it available online?  I'd expect something like that to be scanned in full and available in an easily-searchable format online.  I wouldn't even think to find it at my local library because I just wouldn't expect them to have such a volume.",
        "time": "2022-05-25 12:25:02 UTC",
        "score": 5,
        "link_id": "t3_uxai9a",
        "parent_id": "t1_i9wwg09"
    },
    {
        "comment_id": "i4mfznq",
        "subreddit": "books",
        "body": "I throw books back all the time.  Even if I'm relatively enjoying them but they're not doing what I want them to do right now.  Many I go back to, some I don't.  Reading what you're not enjoying is a chore and hobbies aren't meant to be chores.",
        "time": "2022-04-13 22:03:37 UTC",
        "score": 1,
        "link_id": "t3_u2uri1",
        "parent_id": "t3_u2uri1"
    },
    {
        "comment_id": "hr646bk",
        "subreddit": "books",
        "body": "It might have been *The Bear and the Dragon*  (spoilers ahead, but I might have the wrong Ryanverse book) >!but he had whole chapters of two guys driving a truck full of fertilizer across the country to blow up the white house.  Dialogue, thought processes, timelines, so much time spent with these guys who were on a mission to blow up the white house.  Of course since it's a Jack Ryan book they're not going to blow up the white house, but they're probably going to get close, right?  Nope.  They stop for the night at a hotel like six states from where they started and an employee notices that their truck smells so he calls the cops and they get arrested.  And that's it.  No more story for them.  The main plot of the story continues on and we hear no other word from them even in passing.!<",
        "time": "2022-01-04 03:58:58 UTC",
        "score": 1,
        "link_id": "t3_rv8c6p",
        "parent_id": "t1_hr52h7b"
    },
    {
        "comment_id": "hq2xxrc",
        "subreddit": "books",
        "body": "I felt like even the third was well wrapped up enough that if the fourth is never published it'll be ok.  Only the first is truly standalone to me though because the second had one particular plot point still outstanding at the end.",
        "time": "2021-12-26 23:32:19 UTC",
        "score": 6,
        "link_id": "t3_rozd17",
        "parent_id": "t1_hq2opdh"
    },
    {
        "comment_id": "hp4b0vl",
        "subreddit": "books",
        "body": "I borrow lots of ebooks from the library. I also borrow books for my kids from the library. I buy physical books for myself from the used book store because I can read them in the bathtub without freaking out about potentially getting them wet.",
        "time": "2021-12-19 02:08:10 UTC",
        "score": 1,
        "link_id": "t3_rjfu02",
        "parent_id": "t3_rjfu02"
    },
    {
        "comment_id": "hmo46mh",
        "subreddit": "books",
        "body": "I read The Giver the first time in sixth grade.  Then found it again after she had written the rest of the quartet and read them while I was nursing my second child.  Several of those scenes hit really different when you're older.",
        "time": "2021-11-30 15:09:38 UTC",
        "score": 3,
        "link_id": "t3_r59ca6",
        "parent_id": "t3_r59ca6"
    },
    {
        "comment_id": "hjfpnf4",
        "subreddit": "books",
        "body": ">When he got hit and it was looking like he might not survive it for awhile,  there were so many fans getting hell points for thinking \"the Tower series will never be finished?!\" before they worried over the author himself...I may have been one of them... sorry Mr. King.\n\nAs long as you're not publicly crass about it, I don't really see a problem with thinking of the books before the author.  In the end, you don't know King personally, but you've had a personal experience with his books.",
        "time": "2021-11-05 16:54:55 UTC",
        "score": 3,
        "link_id": "t3_qncjys",
        "parent_id": "t1_hjfjalk"
    },
    {
        "comment_id": "hec8ynx",
        "subreddit": "books",
        "body": "If your library uses Libby/Overdrive, download the book to your computer and use the Overdrive program to transfer it to your phone.  No return at 21 days.  Delete the file when you're done.",
        "time": "2021-09-26 12:41:17 UTC",
        "score": 1,
        "link_id": "t3_pv81c7",
        "parent_id": "t1_he8d1ho"
    }
]