[
    {
        "comment_id": "lrggpz6",
        "subreddit": "books",
        "body": "yes, but I could never find a physical copy of la vegetariana, found it on English the first day I was looking though",
        "time": "2024-10-11 19:13:01 UTC",
        "score": 1,
        "link_id": "t3_1g0g61b",
        "parent_id": "t1_lrf3s4x"
    },
    {
        "comment_id": "lra8gta",
        "subreddit": "books",
        "body": "I've only read the vegetarian of hers, I looked for almost 10 years the book in Spanish, in my country, Chile, and in Argentina, I only found it in epub, but I don't have an e-reader and didn't want to read in my phone, so I ended up reading it in English, still was worth it, I really liked it, but here was also impossible to find her books",
        "time": "2024-10-10 17:43:32 UTC",
        "score": 4,
        "link_id": "t3_1g0g61b",
        "parent_id": "t1_lr9fya5"
    },
    {
        "comment_id": "jjyt7y7",
        "subreddit": "books",
        "body": "you're right, I never thought of that, and it's not farfetched or for a distant future, it could happen now or even soon and the same AI create the references it would link in the wiki article.",
        "time": "2023-05-13 05:19:37 UTC",
        "score": 11,
        "link_id": "t3_13ftubl",
        "parent_id": "t1_jjysrzr"
    },
    {
        "comment_id": "jjyqhy0",
        "subreddit": "books",
        "body": "And in wikipedia you can always check easily the veracity of the information, unlike social media, which requires performing an actual search,which is too much for a lot of people.",
        "time": "2023-05-13 04:50:27 UTC",
        "score": 30,
        "link_id": "t3_13ftubl",
        "parent_id": "t1_jjye7yj"
    },
    {
        "comment_id": "jjy1ph2",
        "subreddit": "books",
        "body": "Yeah, and people still says Wikipedia is unreliable, but they believe everything from Google, even from Instagram or TikTok.\n\nWikipedia is easier to navigate than Google's results and thanks to the references that I can check, I do think it's quite reliable.",
        "time": "2023-05-13 01:13:07 UTC",
        "score": 229,
        "link_id": "t3_13ftubl",
        "parent_id": "t1_jjx5row"
    },
    {
        "comment_id": "iklg58a",
        "subreddit": "books",
        "body": "or maybe someone will train an AI, maybe in a close future AI will need less feed and will render a more accurate outcome.",
        "time": "2022-08-17 00:47:16 UTC",
        "score": 1,
        "link_id": "t3_wpi9dr",
        "parent_id": "t1_ikh5sgp"
    },
    {
        "comment_id": "i9lfw8f",
        "subreddit": "books",
        "body": "we also call it that way here, in Chile.\n\nTea used to be the hot beverage by default up until mid 90's I think, when coffee started to become popular and now most people think they're some kind of coffee sommelier, but the saying is still on us, and I think it gave the name to that snack time because they had tea with something to eat like biscuits or a small sandwich.",
        "time": "2022-05-22 18:58:34 UTC",
        "score": 1,
        "link_id": "t3_uvc3yh",
        "parent_id": "t1_i9l13jd"
    },
    {
        "comment_id": "d8eg559",
        "subreddit": "books",
        "body": "I checked \nhttps://www.nobelprize.org\n\nthe official page of the Nobel, and yes, this sub is about literature, but you said the younger nobel laureate was over 40, although not incorrect is incomplete.\n\nI hope you never write for a scientific publication, because with your accuracy you'll never get published.",
        "time": "2016-10-05 02:03:34 UTC",
        "score": 0,
        "link_id": "t3_55o838",
        "parent_id": "t1_d8d7m2j"
    },
    {
        "comment_id": "d8cmfkr",
        "subreddit": "books",
        "body": ">Nobody under 40 has ever won.\n\nThat's incorrect, Malala won with 17, although in a different field. The youngest literature laureate is Rudyard Kipling with 42.\n\n>Nobody over the age of 87 has ever won.\n\nThe eldest writer winning a Nobel is Doris Lessing in 2007, with 88 years, so that was incorrect too.",
        "time": "2016-10-03 20:45:30 UTC",
        "score": -5,
        "link_id": "t3_55o838",
        "parent_id": "t1_d8clf77"
    }
]