[
    {
        "comment_id": "lzfv8tz",
        "subreddit": "books",
        "body": "I never got into Harry Potter. And now I never will because I'm not reading anything by that bitch. Kinda sad I missed out on the hype though, so would have been cool if I didn't know anything.",
        "time": "2024-11-28 18:11:02 UTC",
        "score": 1,
        "link_id": "t3_1h11hwm",
        "parent_id": "t3_1h11hwm"
    },
    {
        "comment_id": "lwzi6pk",
        "subreddit": "books",
        "body": "When I was growing up there were lots of books that were if not actually meant for, then at least fun for boys to read. You know who made fun of me for reading? Every single boy I knew.\n\nPublishers didn't abandon boys, boys abandoned reading.",
        "time": "2024-11-13 21:42:57 UTC",
        "score": 10,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t3_1gq1vwu"
    },
    {
        "comment_id": "luq66fk",
        "subreddit": "books",
        "body": "I don't do this, but your friends and husband need to buzz off. How dare you enjoy reading in a way that makes it more fun for you?",
        "time": "2024-10-31 17:24:02 UTC",
        "score": 2,
        "link_id": "t3_1gfutz8",
        "parent_id": "t3_1gfutz8"
    },
    {
        "comment_id": "ll1cv4q",
        "subreddit": "books",
        "body": "And the hippos were boiled in their tanks. This kid was stalked across the world by an older man who was obsessed with him, and everyone just accepted that and acted all shocked when the kid murdered the guy.",
        "time": "2024-09-01 19:46:24 UTC",
        "score": 1,
        "link_id": "t3_1f67yo5",
        "parent_id": "t3_1f67yo5"
    },
    {
        "comment_id": "lkybg93",
        "subreddit": "books",
        "body": "The first time I read The Secret History, I hated it. I read it  a second time a few years later because it's my childhood best friend's favorite book, and I wanted to make her happy. Anyway I didn't even remember what it was about, so it was like reading a new book in a way.\n\nI loved it.\n\nSince then I've actually been rereading a lot of books I hated before, and I've realized my reading preferences have definitely changed.",
        "time": "2024-09-01 06:43:01 UTC",
        "score": 2,
        "link_id": "t3_1f632ff",
        "parent_id": "t3_1f632ff"
    }
]