[
    {
        "comment_id": "lyu00y0",
        "subreddit": "books",
        "body": "lol You still have time to rethink this!",
        "time": "2024-11-25 00:57:17 UTC",
        "score": 7,
        "link_id": "t3_1gyw7rk",
        "parent_id": "t1_lyturea"
    },
    {
        "comment_id": "lyt6vro",
        "subreddit": "books",
        "body": "Thanks I really appreciate it. I have had this paraphrased quote knocking around in my head for years.",
        "time": "2024-11-24 22:07:34 UTC",
        "score": 3,
        "link_id": "t3_1gy6zps",
        "parent_id": "t1_lyt5z2c"
    },
    {
        "comment_id": "lys1gur",
        "subreddit": "books",
        "body": "It's such a trope at this point that I don't think I'd ever read a book that is titled with this format. Might as well call it \"I am very original I promise\"",
        "time": "2024-11-24 18:36:39 UTC",
        "score": 107,
        "link_id": "t3_1gyw7rk",
        "parent_id": "t1_lyrut81"
    },
    {
        "comment_id": "lyrgt7r",
        "subreddit": "books",
        "body": "Thank you! Do you know where this is from?",
        "time": "2024-11-24 16:48:01 UTC",
        "score": 2,
        "link_id": "t3_1gy6zps",
        "parent_id": "t1_lyo4ktd"
    },
    {
        "comment_id": "lyne2fn",
        "subreddit": "books",
        "body": "I read a quote a long time ago that I can't find a reference for now. But it was something about how when people don't get the opportunity to find freedom through education, they seek freedom through controlling others. Education is supposed to be expansive.",
        "time": "2024-11-23 22:35:35 UTC",
        "score": 30,
        "link_id": "t3_1gy6zps",
        "parent_id": "t3_1gy6zps"
    },
    {
        "comment_id": "lwrxy0e",
        "subreddit": "books",
        "body": "I read Sociopath right after it came out and I'm always surprised I never see it mentioned on reddit.",
        "time": "2024-11-12 17:13:27 UTC",
        "score": 2,
        "link_id": "t3_1gpparj",
        "parent_id": "t3_1gpparj"
    },
    {
        "comment_id": "lwimg49",
        "subreddit": "books",
        "body": "I loved Kindred but the 2 books could have easily been from different authors in my mind. Very different in the writing and the scope and just everything really.",
        "time": "2024-11-11 02:20:49 UTC",
        "score": 2,
        "link_id": "t3_1go8ntr",
        "parent_id": "t1_lwi0n57"
    },
    {
        "comment_id": "lwim2gz",
        "subreddit": "books",
        "body": "I read it several years ago around the same time that Amazon was in the news for talks about creating company towns. It led me down a rabbit hole of research about company towns and I fully freaked myself out.",
        "time": "2024-11-11 02:18:32 UTC",
        "score": 4,
        "link_id": "t3_1go8ntr",
        "parent_id": "t1_lwhu2sl"
    },
    {
        "comment_id": "lwa0vle",
        "subreddit": "books",
        "body": "Unfortunately I think this is about framing. You want a place that works like this but is somehow in a different category to \"social media.\" But any website that works just like this one is going to be the same kind of thing no matter what we call it. This is a forum and you're looking for another forum. \n\nIf this sub is important, stay on reddit and just only visit this sub. Don't go to your homepage and scroll through it. Open this sub's web address and look at the day's posts.",
        "time": "2024-11-09 17:34:53 UTC",
        "score": 1,
        "link_id": "t3_1gn5h2v",
        "parent_id": "t3_1gn5h2v"
    },
    {
        "comment_id": "lwa0de6",
        "subreddit": "books",
        "body": "/booksuggestions\n/bookdiscussions\n/suggestmeabook\n/weirdlit",
        "time": "2024-11-09 17:32:12 UTC",
        "score": 4,
        "link_id": "t3_1gn5h2v",
        "parent_id": "t1_lw9u298"
    },
    {
        "comment_id": "lvlkz8x",
        "subreddit": "books",
        "body": "Lately I just search the book subs when I'm looking for something to read. I don't agree with all the widely accepted opinions on books reddits but I've found a lot of great nonfiction reads this way. Just yesterday there was a thread about nonfiction books you can't put down. I decided on a whim to read the top comment and I ended up finishing it by last night. It was Endurance by Alfred Lansing",
        "time": "2024-11-05 22:12:59 UTC",
        "score": 1,
        "link_id": "t3_1gkavcn",
        "parent_id": "t3_1gkavcn"
    },
    {
        "comment_id": "lvdal2x",
        "subreddit": "books",
        "body": "I read My Dark Vanessa right after reading Tiger, Tiger by Margaux Fragoso and Tiger, Tiger was much more disturbing to me. It's a memoir about similar abuse that started off much younger and the author was entangled with the same man well into adulthood.",
        "time": "2024-11-04 16:27:25 UTC",
        "score": 1,
        "link_id": "t3_1gjcf17",
        "parent_id": "t3_1gjcf17"
    },
    {
        "comment_id": "lt6mqop",
        "subreddit": "books",
        "body": "I usually read it, but I stop if it's telling me how to interpret or digest the book. I have no interest in reading a book that I need a bunch of context for that's not in the actual book.",
        "time": "2024-10-22 15:14:54 UTC",
        "score": 1,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "lrgpm1p",
        "subreddit": "books",
        "body": "It's like they want to put all the ideas in your head before you get a chance to form your own ideas about it. I find that it sets up certain expectations. I definitely hate it. Especially egregious is when they include that there's a \"shocking twist ending!\"",
        "time": "2024-10-11 20:02:54 UTC",
        "score": 2,
        "link_id": "t3_1g0izhz",
        "parent_id": "t3_1g0izhz"
    },
    {
        "comment_id": "lr576r2",
        "subreddit": "books",
        "body": "I like the stuff that can't be summarized in cliff notes. The experience you have on each page. The atmosphere that builds while you read and disappears when you finish leaving you with an empty feeling.",
        "time": "2024-10-09 20:03:54 UTC",
        "score": 10,
        "link_id": "t3_1fzwoc7",
        "parent_id": "t1_lr4y3le"
    },
    {
        "comment_id": "lr4j57o",
        "subreddit": "books",
        "body": "This is it exactly. I'm really trying to pin down what makes reading a good experience for me. It's rarely the plot. It's definitely an \"it's about the journey\" thing for me.",
        "time": "2024-10-09 17:55:44 UTC",
        "score": 35,
        "link_id": "t3_1fzwoc7",
        "parent_id": "t1_lr4fnzn"
    },
    {
        "comment_id": "lr4hz30",
        "subreddit": "books",
        "body": "I can't do bad prose at all. I wouldn't even know if a story was good if the writing is bad. I could read good prose about absolutely nothing though. I enjoy the experience of reading more than like, the information. A good story only needs to be a book if it can be written well.",
        "time": "2024-10-09 17:49:33 UTC",
        "score": 2,
        "link_id": "t3_1fzwoc7",
        "parent_id": "t3_1fzwoc7"
    },
    {
        "comment_id": "lr4exqu",
        "subreddit": "books",
        "body": "I started reading The Plague by Camus after I got my wisdom teeth out in February 2020. I was still reading it when we went into lockdown.",
        "time": "2024-10-09 17:33:26 UTC",
        "score": 83,
        "link_id": "t3_1fzvwmb",
        "parent_id": "t3_1fzvwmb"
    },
    {
        "comment_id": "lquxhha",
        "subreddit": "books",
        "body": "I have bad memory problems and I've learned to appreciate this actually. I have the same thing with shows. My husband will randomly be in the room while I'm watching something and remember the scene when I watch it again 5 years later and I barely even remember watching the show at all. It means I can re-read and re-watch the things I love after not too long of a wait because I forget a lot of the important stuff.\n\nI do usually remember that I read something, even if I don't remember the content though. I will occasionally watch a movie twice and not realize until deep into it that I've seen it already",
        "time": "2024-10-07 23:33:41 UTC",
        "score": 1,
        "link_id": "t3_1fy1x3w",
        "parent_id": "t3_1fy1x3w"
    },
    {
        "comment_id": "lqua4m8",
        "subreddit": "books",
        "body": "I love this book so much. I have a picture in my phone somewhere of my favorite passage but I won't post it since it basically spoils the book and the spoiler tag never works when I try it\n\nEdit: Just kidding [here it is](https://i.imgur.com/BL3wjpk.jpeg)",
        "time": "2024-10-07 21:17:18 UTC",
        "score": 8,
        "link_id": "t3_1fyidww",
        "parent_id": "t3_1fyidww"
    },
    {
        "comment_id": "lqpj0j5",
        "subreddit": "books",
        "body": "I think there's a window where it's a magical book, and that window coincides with adolescence. You read it when you're a teenager or in college and the world is in front of you to grab. It's exciting. Maybe it holds some of that appeal again to people in mid-life crisis. Otherwise it's not a fun book. I feel this way as someone who had this as my favorite book for years, I own the original stream of consciousness transcript and everything.",
        "time": "2024-10-07 01:06:38 UTC",
        "score": 1,
        "link_id": "t3_1fxqbbk",
        "parent_id": "t3_1fxqbbk"
    },
    {
        "comment_id": "lqgw6os",
        "subreddit": "books",
        "body": "> I would assume it's broadly the same for American students. \n\nThat's too generous of an assumption I'm afraid. Our education seems to be intentionally avoiding anything that could result in critical thinking on the part of young people.",
        "time": "2024-10-05 15:31:10 UTC",
        "score": 1,
        "link_id": "t3_1fwlyuj",
        "parent_id": "t1_lqgc72n"
    },
    {
        "comment_id": "lpv5zfp",
        "subreddit": "books",
        "body": "That's what really worries me here. I went to a private christian school and I only went to college because someone offered me a student worker job but I needed to be a student. The 100 level courses filled in SO much of the gaps from my education, and there were even remedial classes for people that needed even more catching up. My English 100 class was the first time I ever read a full length novel for school purposes since 5th grade, and we read 3 and had to write lengthy essays on them every single week. I had also never done a research paper. \n\nNow it seems like the level of public education has fallen to the level of my unaccredited, barely passable education. And the normalization of that means that college has to get easier too? College was what saved me. Idk it's very depressing to think I could have been in the same situation 10 years later and not been challenged even in college. For character-building reasons alone, it was important to be challenged like that and to be expected to do things that are difficult.",
        "time": "2024-10-01 20:01:33 UTC",
        "score": 4,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpu103j"
    },
    {
        "comment_id": "lpv2wrj",
        "subreddit": "books",
        "body": "> the abandoning of phonics\n\nI heard about this not that long ago and it's so incredible to me that it feels like it's deliberate. I taught myself to read before I even started school by \"sounding things out.\" The only foundation I needed was the alphabet. I know I'm an outlier here, but it was basically what phonics is. It's so intuitive. It's just crazy that we know how to teach kids to read in proven ways and they feel the need to change it.",
        "time": "2024-10-01 19:45:57 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt4fnc"
    },
    {
        "comment_id": "lpuz0i5",
        "subreddit": "books",
        "body": "My father in law actually recommended this to  me and I totally forgot about it. I just finished under the banner of heaven and I think I'm going to dive into this one next. Thanks!",
        "time": "2024-10-01 19:25:59 UTC",
        "score": 1,
        "link_id": "t3_1fqk61o",
        "parent_id": "t1_lpu5dfb"
    },
    {
        "comment_id": "lpqvh12",
        "subreddit": "books",
        "body": "This looks super interesting!",
        "time": "2024-10-01 01:35:44 UTC",
        "score": 1,
        "link_id": "t3_1fqk61o",
        "parent_id": "t1_lpquhpn"
    },
    {
        "comment_id": "lpnwokw",
        "subreddit": "books",
        "body": "I haven't but I'm definitely going to",
        "time": "2024-09-30 15:37:57 UTC",
        "score": 1,
        "link_id": "t3_1fqk61o",
        "parent_id": "t1_lpnw77t"
    },
    {
        "comment_id": "lpkbbi0",
        "subreddit": "books",
        "body": "Harrison Bergeron by Kurt Vonnegut. \n\nIt's a short story I read in high school and it has stuck with me for 20 years.",
        "time": "2024-09-29 22:27:39 UTC",
        "score": 1,
        "link_id": "t3_1frpquv",
        "parent_id": "t3_1frpquv"
    },
    {
        "comment_id": "lpf7m5y",
        "subreddit": "books",
        "body": "Those look great. Thanks!",
        "time": "2024-09-29 00:36:16 UTC",
        "score": 3,
        "link_id": "t3_1fqk61o",
        "parent_id": "t1_lpf3dgh"
    },
    {
        "comment_id": "lpe3nbh",
        "subreddit": "books",
        "body": "I don't think that is a direct response. I can understand why seeing someone who hurts you get hurt feels good. I'll admit I've fantasized about people that hurt me getting what's coming to them. For me this doesn't translate remotely into feeling comfortable or happy when this \"punishment\" is doled out by the state, because I have perspective. The fact there are people I'd like to see in pain is not the same as thinking that the government should enact that pain upon them. \n\nFurthermore I don't think it's healthy for me to feel this way, and I don't think a system which supports the idea that it's healthy to feel this way is anything but corrosive to the social function of a society. I also don't think it makes sense at all to feel this way about people who have hurt others. That's when we get into very emotionally dicey territory where people are projecting their own tormentors onto anybody deemed a \"criminal\" and uncritically deciding they all deserve to be treated as sub-human.",
        "time": "2024-09-28 20:22:50 UTC",
        "score": 5,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpe2bl8"
    },
    {
        "comment_id": "lpdy2nc",
        "subreddit": "books",
        "body": "> If you can't see something of yourself in your enemies you'll never see yourself becoming them.\n\nThis is exactly why these people scare me. Some people (consciously or not) have themselves as the prime moral good. This leads them to justify any action or thought they have, because since they're the \"good person\" anything they do is also good. And anybody that disagrees with them is \"bad.\" As a moral guideline it is purely narcissistic.",
        "time": "2024-09-28 19:50:01 UTC",
        "score": 5,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpdqgof"
    },
    {
        "comment_id": "lpdv3n2",
        "subreddit": "books",
        "body": "Prison abolition doesn't really mean get rid of all prisons before we figure out what to do with the people inside. It's about a process where the goal is that we don't have to imprison people. Maybe other prison abolitionists would disagree with me, but I can't imagine a society in which nobody needs to be kept away from the general population. Even then though, the goal is finding a more humane way to do it than the vindictive and dehumanizing prison system. We have to inspect the reasons why we think it's okay to treat anybody the way we treat prisoners. We know it doesn't rehabilitate them.",
        "time": "2024-09-28 19:32:43 UTC",
        "score": 15,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpdemdy"
    },
    {
        "comment_id": "lpdthy8",
        "subreddit": "books",
        "body": "You explained this phenomenon so well! Especially the part about being unsafe with these people. For me it's not only the fact they will tear you down, but that any disagreement with them becomes a moral failing on your part. In their minds they are the pillar of morality, so any dissenting opinions actually means the disagree-ers are also bad people. It's impossible to discuss anything with people like this unless you are just agreeing with them and telling them how right they are the entire time.",
        "time": "2024-09-28 19:23:26 UTC",
        "score": 44,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpdc9cg"
    },
    {
        "comment_id": "lpddn3l",
        "subreddit": "books",
        "body": "I just finished Into Thin Air, and I'm so sad its over. I'm trying to figure out what I like about it exactly so I can find other things that are similar. I started reading Under the Banner of Heaven by Krakauer because at first I thought, maybe I'm just really into the way he writes. It's not captivating me in the same way though. \n\nI think what I'm looking for is a non-fiction story or memoir that is about facing life-threatening stuff, but **not** at the hands of other people. I think I'm burnt out on interpersonal violence. I think Into Thin Air got me because while it was a story of difficulty and survival, for the most part people were working together against a non-human threat. So any recommendations along those lines? Other stories of extreme survival, tension, even tragedy that doesn't revolve around a \"bad guy\" \n\nAppreciate any suggestions! I feel like I'm having withdrawals from that book. I read it within 24 hours lol",
        "time": "2024-09-28 17:52:28 UTC",
        "score": 6,
        "link_id": "t3_1fqk61o",
        "parent_id": "t3_1fqk61o"
    },
    {
        "comment_id": "lpda5sx",
        "subreddit": "books",
        "body": "They are usually equally silent when you try to get at what causes the behavior in the first place. Prevention is bad. Redemption is bad. I  honestly don't know what they want, and my theories are pretty bleak so I try not to spend much time dwelling on them.",
        "time": "2024-09-28 17:33:01 UTC",
        "score": 18,
        "link_id": "t3_1frfkel",
        "parent_id": "t1_lpcpauc"
    },
    {
        "comment_id": "lpd9bwa",
        "subreddit": "books",
        "body": "This is a problem I've specifically noticed in some of the types of communities where you'd see this type of book discussed. \"social justice\" type of communities (if there's a better name for them now let me know.) I used to spend a lot of time in them and in mental health ones that were full of the same people and took that same lean. It's hard to explain, but so often people's pain and anger was prioritized above all. So if something offended anyone, and they put up a big enough stink about it, any attempt at nuanced discussion was seen as some sort of attack, and you're usually silenced by being called some kind of bigot. \n\nI grew up evangelical christian, and I ended up having to leave these spaces when it became clear they operated in the same puritanical way. \n\nAll that to say that I don't think this is a *general* reading comprehension issue. I think with subject matter like this, the type of people that are attracted to it are often traumatized people that don't know how to operate outside of their emotional reactions to triggers, and often don't want to learn. They lean into their feelings as a guidance of what is morally right and wrong, and therefore their interpretation that the book is war crime apologist material is not up for debate.\n\nI have seen and had good discussions about this book, but generally these conversations don't happen on reddit because reddit is an extremely adversarial atmosphere. Outside of reddit they are still difficult to find because of the stuff I mentioned already. The people that are triggered are usually the loudest and most intolerant of any other interpretations, and it can be hard to fight back against that when they are using shame and manipulation to get other people to fall in line with them. (IE: if you like this book you're a war crime apologist)",
        "time": "2024-09-28 17:28:24 UTC",
        "score": 5,
        "link_id": "t3_1frfkel",
        "parent_id": "t3_1frfkel"
    }
]