[
    {
        "comment_id": "lvijc0b",
        "subreddit": "books",
        "body": "Not sure it'll answer all your questions, but look up the novel Somehow Crystal for a clearer example of what this very brand-conscious writing reflected about Japanese society and literature at the time.",
        "time": "2024-11-05 12:56:22 UTC",
        "score": 1,
        "link_id": "t3_1gk40ni",
        "parent_id": "t3_1gk40ni"
    },
    {
        "comment_id": "lfdyp1g",
        "subreddit": "books",
        "body": "It draws from her personal experience of grooming, just not by a teacher.",
        "time": "2024-07-28 20:21:44 UTC",
        "score": 3,
        "link_id": "t3_1ed27pz",
        "parent_id": "t1_lf4uhh4"
    },
    {
        "comment_id": "kp8v9de",
        "subreddit": "books",
        "body": "I mean, it's certainly been done. My Dark Vanessa (fiction) and Being Lolita (memoir) both explore this in detail.\n\nI had my own issues with the podcast, though, and the sheer volume of people who recommend it under any discussion of Lolita since it came out has made these posts sort of like a drinking game.",
        "time": "2024-02-06 22:32:48 UTC",
        "score": 5,
        "link_id": "t3_1ak65qn",
        "parent_id": "t1_kp89q6c"
    },
    {
        "comment_id": "kipbpj3",
        "subreddit": "books",
        "body": "There's definitely more than just that excerpt, but it's a pretty short book, only 144 pages.",
        "time": "2024-01-20 05:36:50 UTC",
        "score": 28,
        "link_id": "t3_19b2rn5",
        "parent_id": "t1_kipaupm"
    },
    {
        "comment_id": "kip880i",
        "subreddit": "books",
        "body": "An article from [IT Media](https://www.itmedia.co.jp/news/articles/2401/18/news090.html) in Japan shows a page of the book where its fictional AI appears and gives boilerplate AI responses (ellipses are where the full sentence was cut off in the photo):\n\n>**Sara:** Do you know that you're illiterate?\n\n>**AI-built:** *No, I am a text-based data-processing AI model, so I \\[am\\] not. Furthermore, \"illiterate\" is a discriminatory expression that can have connotations of insult or contempt. Due to this ... possibility, its use should be avoided. By the use of this word... so as not to show belittling or disrespectful attitudes... to elevate literacy rates...*\n\nI assume this would reflect the 5% she says she used verbatim, which doesn't particularly offend me. I'm very curious to read it based on the premise and the praise the author has received for her writing.\n\nEdit to correct an error in my translation, sorry about that!",
        "time": "2024-01-20 05:05:01 UTC",
        "score": 608,
        "link_id": "t3_19b2rn5",
        "parent_id": "t3_19b2rn5"
    },
    {
        "comment_id": "k83917p",
        "subreddit": "books",
        "body": "That's the explanation I've always heard, for portability and also having to do with places where people might read in public like cramped trains, etc., so you don't bother others near you by needing to open up a huge book.",
        "time": "2023-11-06 16:55:36 UTC",
        "score": 2,
        "link_id": "t3_17ozi4s",
        "parent_id": "t1_k82w0a0"
    },
    {
        "comment_id": "k1zvdj0",
        "subreddit": "books",
        "body": "You don't think there's an obvious connection between him being mistrustful of adults due to implied abuse and the way he mentally turns a song about sex into a manifestation of his desire to protect children from harm instead?",
        "time": "2023-09-24 14:29:11 UTC",
        "score": 30,
        "link_id": "t3_16qvziw",
        "parent_id": "t1_k1znbqh"
    },
    {
        "comment_id": "f464ldt",
        "subreddit": "books",
        "body": "If you really need this book and other options aren't available, it actually looks like it might still be available for purchase on their [Japanese website](https://shinkenchiku.online/shop/special-issues/book-410608/) at a much better price than the used copies floating around. There are services you can use to buy things for you from Japan for a reasonable fee.",
        "time": "2019-10-18 13:06:19 UTC",
        "score": 1,
        "link_id": "t3_djmlmu",
        "parent_id": "t3_djmlmu"
    }
]