[
    {
        "comment_id": "lyfhq05",
        "subreddit": "books",
        "body": "I've read most of McMurtry’s books.  *The Last Picture Show* was a great book and movie.  Some of the characters in that book continue in his later books *Texasville* and *Duane's Depressed*.  These are not westerns, but set in 20th century Texas where pickups have replaced horses.",
        "time": "2024-11-22 15:48:11 UTC",
        "score": 2,
        "link_id": "t3_1gwxkli",
        "parent_id": "t3_1gwxkli"
    },
    {
        "comment_id": "lxa3s8g",
        "subreddit": "books",
        "body": "By \"too toxic\" he means \"people don't agree with me.\"",
        "time": "2024-11-15 15:50:44 UTC",
        "score": -10,
        "link_id": "t3_1grx1by",
        "parent_id": "t3_1grx1by"
    },
    {
        "comment_id": "gyc9udg",
        "subreddit": "books",
        "body": "Was this quote from Dickens himself or a character in one of his books?",
        "time": "2021-05-16 16:44:56 UTC",
        "score": 4,
        "link_id": "t3_ndfktm",
        "parent_id": "t1_gybp7m2"
    },
    {
        "comment_id": "gyc9goi",
        "subreddit": "books",
        "body": "This is cancel culture at work.",
        "time": "2021-05-16 16:42:03 UTC",
        "score": 0,
        "link_id": "t3_ndfktm",
        "parent_id": "t1_gybq2w1"
    },
    {
        "comment_id": "gxeeyys",
        "subreddit": "books",
        "body": "I did the same over a period of 9 months, reading several other books in between.  I don't know why I approached it that way.  Maybe I somehow sensed it was just \"too good\" and I didn't want to gulp it down.",
        "time": "2021-05-08 16:15:15 UTC",
        "score": 1,
        "link_id": "t3_n7ghos",
        "parent_id": "t1_gxcz4aq"
    },
    {
        "comment_id": "gwuihcq",
        "subreddit": "books",
        "body": "When Abra suddenly switched to Cal at the end it really didn't seem that strange to me.  She explained that Aron had always pictured her as a \"perfect\" person ever since they met as children.  She knew she could never live up to the mental image that Aron held of her and it was causing her some stress.  She had years to think about this and figure it out.  Then when she realized herself to be a woman, she made the rational decision to drop him, at least mentally and emotionally.  Their relationship was not unlike the worship that Adam had for Kate (Cathy).  He couldn't see the real person, he could only see and relate to the image he held of her, which was the opposite of her true nature.  I guess Aron, being Adam's son, followed the same line of thinking with Abra, except Abra was a good person, not evil like Kate.",
        "time": "2021-05-04 00:02:58 UTC",
        "score": 41,
        "link_id": "t3_mmrzvy",
        "parent_id": "t3_mmrzvy"
    },
    {
        "comment_id": "gwsxwbv",
        "subreddit": "books",
        "body": "I just finished this book yesterday and it took 9 months for me to get through it.  My conclusion is that John Steinbeck sees human nature with clear eyes and he expresses it eloquently and without apology.",
        "time": "2021-05-03 17:06:14 UTC",
        "score": 6,
        "link_id": "t3_n387nd",
        "parent_id": "t3_n387nd"
    },
    {
        "comment_id": "glzrcgd",
        "subreddit": "books",
        "body": "I also recommend them.  After the first one, it's hard to stop reading her books. They're light reading and humorous, yes, with outrageous characters, and just what my mind needs for a break from the heavy stuff.",
        "time": "2021-02-04 14:57:00 UTC",
        "score": 3,
        "link_id": "t3_lc36vg",
        "parent_id": "t1_glxk145"
    },
    {
        "comment_id": "gc0552l",
        "subreddit": "books",
        "body": "Books make me happy.  I used them as a childhood escape to get away from dysfunctional family members.  Books were my safe place to go away.  I carried the reading habit into adulthood.  I feel sorry for the prisoners who will no longer have access to books.  If anyone needs a mental escape, it's them.",
        "time": "2020-11-12 03:18:27 UTC",
        "score": 1,
        "link_id": "t3_jrbdht",
        "parent_id": "t3_jrbdht"
    },
    {
        "comment_id": "g56nf3l",
        "subreddit": "books",
        "body": "I discovered Libby a couple of years ago.  I can't do a book a day like you, but I sure have enjoyed having it.  The only problem is there is usually a waitlist for the book so I just order several at one time and read them in the order they come in.\n\nI have some backup \"real\" books on the shelf at home in case Libby keeps me on hold too long.",
        "time": "2020-09-14 00:40:03 UTC",
        "score": 20,
        "link_id": "t3_isa9dl",
        "parent_id": "t3_isa9dl"
    },
    {
        "comment_id": "dv4lbv9",
        "subreddit": "books",
        "body": "I'm currently reading Pillars of the Earth because I enjoyed World without End so much.\n\nKen Follet has a knack for writing so simply that you feel you are in the room with the characters.  The only thing I don't like is how angry I get at some of the characters' bad behavior.  Sometimes it's infuriating, but you know it's coming!",
        "time": "2018-03-03 17:29:06 UTC",
        "score": 2,
        "link_id": "t3_81qokp",
        "parent_id": "t3_81qokp"
    }
]