[
    {
        "comment_id": "lwih3jz",
        "subreddit": "books",
        "body": "His first fiction novel had me laughing so hard.",
        "time": "2024-11-11 01:48:54 UTC",
        "score": 2,
        "link_id": "t3_1gnxwky",
        "parent_id": "t1_lwemrtr"
    },
    {
        "comment_id": "lfvf3qi",
        "subreddit": "books",
        "body": "I didn't know Found Family was a legit trope, now I know what to put in searches for books bc I love that too!",
        "time": "2024-07-31 20:43:37 UTC",
        "score": 2,
        "link_id": "t3_1egsibe",
        "parent_id": "t1_lfupnku"
    },
    {
        "comment_id": "lfvetbo",
        "subreddit": "books",
        "body": "Me too! Every first snow fall!!!",
        "time": "2024-07-31 20:42:06 UTC",
        "score": 2,
        "link_id": "t3_1egsibe",
        "parent_id": "t1_lfud4ly"
    },
    {
        "comment_id": "l2wbwgs",
        "subreddit": "books",
        "body": "Wellness by Nathan Hill",
        "time": "2024-05-06 22:33:11 UTC",
        "score": 1,
        "link_id": "t3_1clvk3v",
        "parent_id": "t3_1clvk3v"
    },
    {
        "comment_id": "kp16le8",
        "subreddit": "books",
        "body": "Not sure how old you are but this started happening really badly to me when I turned 38ish. Mentioned it to my eye doctor after a few years and they changed my script to really mild bifocals (can't even tell looking at the glasses) bc she said the muscles get a little weak and it helps. Haven't had an issue since!",
        "time": "2024-02-05 15:05:52 UTC",
        "score": 4,
        "link_id": "t3_1ajia71",
        "parent_id": "t3_1ajia71"
    },
    {
        "comment_id": "kebnlba",
        "subreddit": "books",
        "body": "I enjoyed the Institute and it wasn't horror but definitely suspenseful.",
        "time": "2023-12-21 14:00:50 UTC",
        "score": 1,
        "link_id": "t3_18nkt7j",
        "parent_id": "t1_keb9avj"
    },
    {
        "comment_id": "kebnhml",
        "subreddit": "books",
        "body": "The Ring is very scary. I had nightmares. From the movie and the book. It just has that atmosphere of creeping dread and terror all throughout.",
        "time": "2023-12-21 14:00:05 UTC",
        "score": 1,
        "link_id": "t3_18nkt7j",
        "parent_id": "t1_kebgzpa"
    },
    {
        "comment_id": "kd3ul6z",
        "subreddit": "books",
        "body": "I've had the opposite happen - seeing how close I was to the end of Infinite Jest with only 2 of my 7391 questions answered, I started to panic. Rightfully so, one of the most unsatisfying books I've ever read.",
        "time": "2023-12-12 23:27:31 UTC",
        "score": 50,
        "link_id": "t3_18gy8ox",
        "parent_id": "t3_18gy8ox"
    },
    {
        "comment_id": "kc5j4z8",
        "subreddit": "books",
        "body": "I read her memoir bc I love me some Britney fully expecting it to be all ghost writers but they certainly made a point to leave her voice as the backbone and, I love the girl, but that was a bad call. Leaving her down home southern \"aw shucks\" voice made the entire thing even worse than if it was a nice polished obvious ghost write.",
        "time": "2023-12-05 22:53:01 UTC",
        "score": 15,
        "link_id": "t3_18blao2",
        "parent_id": "t1_kc5hevm"
    },
    {
        "comment_id": "kc5ieg7",
        "subreddit": "books",
        "body": "Ugh - yes! Karin Slaughter and her torture porn. Just have a clever twist and keep me engaged, stop telling me about nightmare fuel over and over again.",
        "time": "2023-12-05 22:48:00 UTC",
        "score": 5,
        "link_id": "t3_18blao2",
        "parent_id": "t1_kc545uo"
    },
    {
        "comment_id": "kbej40j",
        "subreddit": "books",
        "body": "It actually works really well if you have a mind that wanders. I have OCD and doing this can help me focus better. Plus it's a totally different way to experience a book! And you can always switch between the two as well as doing it simultaneously.",
        "time": "2023-11-30 13:57:40 UTC",
        "score": 8,
        "link_id": "t3_187h0xi",
        "parent_id": "t3_187h0xi"
    },
    {
        "comment_id": "kag8z7n",
        "subreddit": "books",
        "body": "Iirc her religious phase was a reaction to Hurricane Katrina. She had a \"come to Jesus\" sort of conversion bc back then lots of preachers were saying the hurricane was punishment for New Orleans wickedness (like Poseidon's rage but Christian) and then she sort of got over it and went back to writing about vampires and incestual witches.",
        "time": "2023-11-23 15:57:09 UTC",
        "score": 34,
        "link_id": "t3_1821s0c",
        "parent_id": "t3_1821s0c"
    },
    {
        "comment_id": "ka92ufc",
        "subreddit": "books",
        "body": "Neil Gaiman referred to Dracula as (not the exact quote) a bunch of boring people writing to each other about a vampire. Perfect description.",
        "time": "2023-11-22 03:04:47 UTC",
        "score": 10,
        "link_id": "t3_180waa5",
        "parent_id": "t1_ka914qd"
    },
    {
        "comment_id": "ka92m8c",
        "subreddit": "books",
        "body": "I still remember the pages of him explaining how to lasso something in space and now I never read a book listed as hard science fiction. I have never been so bored.",
        "time": "2023-11-22 03:03:05 UTC",
        "score": -1,
        "link_id": "t3_180waa5",
        "parent_id": "t1_ka8lkut"
    },
    {
        "comment_id": "ka5qvvb",
        "subreddit": "books",
        "body": "Patton, a Genius for War. It was a gift from one of my favorite in laws and a history buff and will finish that doorstopper. I'm 10% in but my goal is done by Christmas.",
        "time": "2023-11-21 14:07:15 UTC",
        "score": 2,
        "link_id": "t3_180b7e2",
        "parent_id": "t3_180b7e2"
    },
    {
        "comment_id": "k6ov5oc",
        "subreddit": "books",
        "body": "You seem to understand story building really well based on this post. I bet your books are gonna be fire!!!",
        "time": "2023-10-27 15:08:40 UTC",
        "score": -1,
        "link_id": "t3_17hmpfg",
        "parent_id": "t1_k6op21y"
    },
    {
        "comment_id": "k6okmlo",
        "subreddit": "books",
        "body": "I LOVE Sanderson. I'm just a big ol' prude and get uncomfortable reading spicy books, so SJM is on my No Thanks list.",
        "time": "2023-10-27 14:00:34 UTC",
        "score": 171,
        "link_id": "t3_17hmpfg",
        "parent_id": "t1_k6ojwth"
    },
    {
        "comment_id": "k6ok1o1",
        "subreddit": "books",
        "body": "Your \"have faith\" comment is so spot on. You can't lose what you never had. I suffer from fear of failure but then remember that Gerard Way was offered his dream job drawing for Spiderman before he was MCR and turned it down because he was afraid he'd fail. Could you imagine?? So now I just go for it, and have failed many things spectacularly but also done amazing things I never knew I could!",
        "time": "2023-10-27 13:56:37 UTC",
        "score": 9,
        "link_id": "t3_17hmpfg",
        "parent_id": "t1_k6og8g1"
    },
    {
        "comment_id": "k6ojn2c",
        "subreddit": "books",
        "body": "And your responses have been so dignified and pleasant to people just shitting on your nice post! Ignore the hate, you seem like a really nice human.",
        "time": "2023-10-27 13:53:50 UTC",
        "score": 86,
        "link_id": "t3_17hmpfg",
        "parent_id": "t1_k6oi0tp"
    },
    {
        "comment_id": "k6of4k8",
        "subreddit": "books",
        "body": "I'm not a fan of her work, just not my taste, but damn can that girl hustle. She puts books out regularly, she knows what her fans like, seems like she's good at twists (from what I've heard) and it looks like she exploded overnight but she really did put the work in. \n\nGood for her. Inspiring for all of us to keep at it.",
        "time": "2023-10-27 13:22:16 UTC",
        "score": 2508,
        "link_id": "t3_17hmpfg",
        "parent_id": "t3_17hmpfg"
    },
    {
        "comment_id": "k6m6ebb",
        "subreddit": "books",
        "body": "Just looked it up - woah. That is a lot of books covering all the genres.",
        "time": "2023-10-27 00:25:19 UTC",
        "score": 260,
        "link_id": "t3_17haeki",
        "parent_id": "t3_17haeki"
    },
    {
        "comment_id": "k6lzsww",
        "subreddit": "books",
        "body": "Good point- I would never force her to read them, it'll definitely be her choice. But I know how much connections to my mom mean to me now that she's gone, so I've made a point to intentionally have things like that for my daughter for when I'm gone.",
        "time": "2023-10-26 23:38:25 UTC",
        "score": 11,
        "link_id": "t3_17gsw06",
        "parent_id": "t1_k6lu7y7"
    },
    {
        "comment_id": "k6j9fab",
        "subreddit": "books",
        "body": "So I do it in books I hope my daughter reads when she's older. I have a shelf in my library called Books for Lily. Books so when she's an adult, if she wants to read them, she'll see what caught my eye, what quotes I thought were important, etc. And when I'm gone, maybe she'll still be able to look through these and feel close to me. I have my mom's old copy of Sense and Sensibility (she passed 5 years ago) and it's one of my most treasured possessions. So I wanted to leave a few behind for my daughter, too.",
        "time": "2023-10-26 13:23:09 UTC",
        "score": 89,
        "link_id": "t3_17gsw06",
        "parent_id": "t3_17gsw06"
    },
    {
        "comment_id": "k5ze0mo",
        "subreddit": "books",
        "body": "I always sort of saw it like the tablet thing Ender had in Enders Game. Like the new story telling will be books integrated with technology. They went from oral to written, only makes sense there will be another evolution. And people still tell stories orally. People will still read written words. But I'm with you, there will be some new way to experience stories with the same depth as books one day. Technology always moves forward.",
        "time": "2023-10-22 16:26:05 UTC",
        "score": 3,
        "link_id": "t3_17dthbu",
        "parent_id": "t1_k5ywrat"
    },
    {
        "comment_id": "k5mbsn5",
        "subreddit": "books",
        "body": "Karin Slaughter does torture porn. They have lurid, descriptive torture scenes over and over. The fear isn't in what is going to happen or even really fear, it's just detail written torture. Her one and only book I read (hate torture porn) had pages of a girl in a sack getting peed on and how the scent of the urine was inescapable and just it kept going. I felt physically ill. I've read IT and many King books, he does take wayyyy too long to tell his plot, but his ability to stress and scare you is not based in just gross, inventive ways to hurt characters explained down to the nitty gritty detail as often as possible. He gets in your brain and highjacks your amygdala. Torture porn is like if you're watching very graphic porn but instead of sex, it's torture.",
        "time": "2023-10-19 23:57:01 UTC",
        "score": 2,
        "link_id": "t3_17bt718",
        "parent_id": "t3_17bt718"
    },
    {
        "comment_id": "k5h6igy",
        "subreddit": "books",
        "body": "I was so mad at that, I threw the book and screamed! And immediately bought book two.",
        "time": "2023-10-18 23:54:14 UTC",
        "score": 15,
        "link_id": "t3_17aw5f8",
        "parent_id": "t1_k5g6fka"
    },
    {
        "comment_id": "k4wuydt",
        "subreddit": "books",
        "body": "Omg yes! The first one was so good but I couldn't even finish the second one.",
        "time": "2023-10-15 00:00:15 UTC",
        "score": 2,
        "link_id": "t3_1780lpj",
        "parent_id": "t1_k4wpyjr"
    },
    {
        "comment_id": "k2boirk",
        "subreddit": "books",
        "body": "Oh man, the idea that if you talked chemistry to women they'd discuss melting thresholds or kelvins regarding their cast iron pans - if I turned on a cooking show and they didn't use the common words for me ingredients, I wouldn't feel like it was making me oh so smart, I'd turn the damn thing off. \n\nA 2 page exposition about making perfect coffee? I don't have time for that shit and frankly, as a mother of a toddler, she shouldn't have either.",
        "time": "2023-09-26 19:09:09 UTC",
        "score": 10,
        "link_id": "t3_16sp5uz",
        "parent_id": "t1_k2aynsf"
    },
    {
        "comment_id": "k2ajk5o",
        "subreddit": "books",
        "body": "Ugh, hated this one. The dog and language? So stupid. The negligent parenting portrayed as progressive and how to make smart kids? So patronizing to anyone who's ever had a toddler. I hated every second of it.",
        "time": "2023-09-26 15:10:04 UTC",
        "score": 94,
        "link_id": "t3_16sp5uz",
        "parent_id": "t1_k2adf2r"
    },
    {
        "comment_id": "k069nr2",
        "subreddit": "books",
        "body": "So,I HATED the book because 1- I have OCD (legit, diagnosed) and disturbing images are sticky in my mind and 2- I need concrete endings. \n\nThat being said, I too had forgotten the first pages that at the time just made no sense and also, my God, with the footnotes the book is like reading 7 Bibles (exaggeration, but what it feels like). \n\nI also had to look up what the hell the ending was (went down a rabbit hole and wasted an entire day not working) and reread the beginning. I hated the book, but to have a book about entertainment that you watch over and over again until you die that requires you to read it and then reread it and then reread it to fully absorb it, f*cking brilliant. \n\nAnd don't feel bad, I have a degree in English and didn't catch on and remember either.\n\nEdit - spelling errors",
        "time": "2023-09-11 22:12:57 UTC",
        "score": 8,
        "link_id": "t3_16g89oc",
        "parent_id": "t3_16g89oc"
    },
    {
        "comment_id": "jzfedak",
        "subreddit": "books",
        "body": "I loved this book so much and have avoided rereading it as an adult for fear it would ruin my first \"favorite book.\" But it sounds like maybe I can read it after all and not ruin it?",
        "time": "2023-09-06 20:01:56 UTC",
        "score": 16,
        "link_id": "t3_16bt344",
        "parent_id": "t1_jzfdyhz"
    },
    {
        "comment_id": "jyjsyxu",
        "subreddit": "books",
        "body": "Half and half. Now that you mention it, I often lose steam around that book in a series.\n\nI think with WoT I was so disappointed because I love Sanderson and heard the series was amazing and I just didn't connect and the books never seemed to pick up for me.",
        "time": "2023-08-31 17:46:31 UTC",
        "score": 1,
        "link_id": "t3_165s84d",
        "parent_id": "t1_jyjrps5"
    },
    {
        "comment_id": "jyig2y7",
        "subreddit": "books",
        "body": "Just bc I wasn't a fan doesn't mean they aren't good! Every fantasy reader in my life LOVED them. Don't let my opinion dampen your enthusiasm - I hope you love the hell out of it.",
        "time": "2023-08-31 12:39:33 UTC",
        "score": 1,
        "link_id": "t3_165s84d",
        "parent_id": "t1_jyh3908"
    },
    {
        "comment_id": "jyh363w",
        "subreddit": "books",
        "body": "Not at all!",
        "time": "2023-08-31 03:45:52 UTC",
        "score": -1,
        "link_id": "t3_165s84d",
        "parent_id": "t1_jyh22df"
    },
    {
        "comment_id": "jyfvk9e",
        "subreddit": "books",
        "body": "I totally misunderstood your post - sorry!",
        "time": "2023-08-30 22:28:08 UTC",
        "score": 2,
        "link_id": "t3_165s84d",
        "parent_id": "t1_jyfuiqa"
    },
    {
        "comment_id": "jyfsbe8",
        "subreddit": "books",
        "body": "Wheel of Time. By book 4 I was utterly exhausted with every character. And they seemed unnecessarily long;  he could have cut half the pages and still hit all important parts.",
        "time": "2023-08-30 22:06:28 UTC",
        "score": 50,
        "link_id": "t3_165s84d",
        "parent_id": "t3_165s84d"
    },
    {
        "comment_id": "jy669cr",
        "subreddit": "books",
        "body": "Ok, so I thought this was totally normal. Tingling in my hands and wrists after holding a book for like 5 minutes. Totally NOT normal and had an MRI show vertebrae were pushed into my spinal cord and nerves in my neck. Definitely mention it to your Dr and they can do some reflex tests to see if it's a nerve thing. Get it checked!",
        "time": "2023-08-29 01:22:58 UTC",
        "score": 3,
        "link_id": "t3_1643mr5",
        "parent_id": "t3_1643mr5"
    },
    {
        "comment_id": "jxhlw20",
        "subreddit": "books",
        "body": "Such a great read! I'm buying Wishing Game for all my book lovers for Christmas.",
        "time": "2023-08-24 00:17:41 UTC",
        "score": 2,
        "link_id": "t3_15zfbkj",
        "parent_id": "t1_jxgmqlb"
    },
    {
        "comment_id": "jpws8or",
        "subreddit": "books",
        "body": "Lessons in Chemistry. Ugh.",
        "time": "2023-06-28 21:16:47 UTC",
        "score": 109,
        "link_id": "t3_14lks3e",
        "parent_id": "t3_14lks3e"
    },
    {
        "comment_id": "jp7scue",
        "subreddit": "books",
        "body": "No, it' was a woman. I always liked Monk. That seemed a legit and accurate portrayal of what it's like to suffer OCD.",
        "time": "2023-06-23 12:41:33 UTC",
        "score": 2,
        "link_id": "t3_14ga982",
        "parent_id": "t1_jp67w1f"
    },
    {
        "comment_id": "jp55dv3",
        "subreddit": "books",
        "body": "I was just thinking about this. I've seen it a lot in mysteries- the girl on the spectrum whose difference is how she solves the case.\n\nExamples - \n\nHolly Gibney is the Mr Mercedes books\n\nRory Moore in Some Choose Darkness by Charlie Donlea and the sequel, Suicide House\n\nAnd now that I'm trying to think of them my mind is blank, but the obsessive compulsive detective who keeps having panic attacks bc the crime hits too close to home trope needs to go, and they all need to read about actual OCD.",
        "time": "2023-06-22 21:12:42 UTC",
        "score": 8,
        "link_id": "t3_14ga982",
        "parent_id": "t3_14ga982"
    },
    {
        "comment_id": "jksg5rw",
        "subreddit": "books",
        "body": "Anything written in present tense is pretentious and trying too hard to be literary versus contemporary. And excruciating to read.",
        "time": "2023-05-19 16:21:40 UTC",
        "score": 1,
        "link_id": "t3_13lzqam",
        "parent_id": "t3_13lzqam"
    },
    {
        "comment_id": "j8aytn4",
        "subreddit": "books",
        "body": "I take 100 minus my age.",
        "time": "2023-02-12 23:47:49 UTC",
        "score": 3,
        "link_id": "t3_110rdib",
        "parent_id": "t3_110rdib"
    },
    {
        "comment_id": "j7z7f97",
        "subreddit": "books",
        "body": "Maybe in Another Life was soooo good. 7 Husbands was her best (IMHO) but Maybe in another Life was like the movie Sliding Doors and I ended up highlighting a lot of quotes and putting it on a shelf for my daughter to read when she's older.",
        "time": "2023-02-10 13:36:32 UTC",
        "score": 5,
        "link_id": "t3_10ynan0",
        "parent_id": "t1_j7z637h"
    },
    {
        "comment_id": "j7z1ahl",
        "subreddit": "books",
        "body": "I also got frustrated with it. It feels like since 7 Husbands, each book my TRJ gets worse. Which is a shame, I've really enjoyed her books up until DJATS.",
        "time": "2023-02-10 12:41:33 UTC",
        "score": 8,
        "link_id": "t3_10ynan0",
        "parent_id": "t3_10ynan0"
    },
    {
        "comment_id": "j7g78y9",
        "subreddit": "books",
        "body": "The main character's cell mate's name in American Gods. His nickname was Low-Key. It was when someone on Reddit mentioned it was Loki that I finally realized it. A smooth 5 or so years after I read it. Not to mention, at the time, I had 2 cats. Buttons and, you guessed it, Loki.",
        "time": "2023-02-06 15:58:52 UTC",
        "score": 14,
        "link_id": "t3_10v6v8l",
        "parent_id": "t3_10v6v8l"
    },
    {
        "comment_id": "j7b2xbw",
        "subreddit": "books",
        "body": "Not true. That leaves one entire day to read! If you prioritize reading, you will. I've read entire books over the course of a month or so by just reading them on my phone in line for groceries or waiting on hold. Three hours a day can add up to a lot of books, so working 9 hours 6 days a week leaves so much space for reading if it's what you do whenever you have a free moment. It's a matter of what you prioritize. It's my only hobby so assuming the same for most others, it's not farfetched to finish 100s a year.",
        "time": "2023-02-05 13:49:39 UTC",
        "score": 23,
        "link_id": "t3_10ubxmy",
        "parent_id": "t1_j7b1toq"
    },
    {
        "comment_id": "j6kn3oh",
        "subreddit": "books",
        "body": "I have been feeling the same way and figured I was just done with thrillers but then my husband bought me If We We're Villains and I have been devouring it. Can't tell you if the ending is good or not, but I'm about 80% in and it's been great!",
        "time": "2023-01-31 00:14:06 UTC",
        "score": 2,
        "link_id": "t3_10p83ty",
        "parent_id": "t3_10p83ty"
    },
    {
        "comment_id": "j5pk8jt",
        "subreddit": "books",
        "body": "And he makes a point to meaningfully engage with all fans who want to chat- he'll stay for hours to make sure no one feels rushed or shorted. He's amazing at book signings. I love his work and he seems such a good human.",
        "time": "2023-01-24 17:58:19 UTC",
        "score": 55,
        "link_id": "t3_10ka8w0",
        "parent_id": "t1_j5pdi35"
    },
    {
        "comment_id": "j5ko95x",
        "subreddit": "books",
        "body": "I loved this book! It got me out of a long reading slump. Enjoy!",
        "time": "2023-01-23 18:13:25 UTC",
        "score": 2,
        "link_id": "t3_10jihsh",
        "parent_id": "t3_10jihsh"
    },
    {
        "comment_id": "j436a5n",
        "subreddit": "books",
        "body": "Thanks! The 2 books I listed have now taught me if I read one upsetting passage, just put the book down. I look up how it ends on the internet and move on with my TBR. I hope you enjoy IJ, DFW is such a phenomenal writer!",
        "time": "2023-01-12 21:20:00 UTC",
        "score": 1,
        "link_id": "t3_109961d",
        "parent_id": "t1_j433504"
    },
    {
        "comment_id": "j42ksol",
        "subreddit": "books",
        "body": "Anne Rice - Preternatural",
        "time": "2023-01-12 19:09:32 UTC",
        "score": 15,
        "link_id": "t3_10a6tgn",
        "parent_id": "t3_10a6tgn"
    },
    {
        "comment_id": "j41rfzq",
        "subreddit": "books",
        "body": "I have OCD which makes disturbing images sort of stay and take on different proportions in my mind. If the first gross/upsetting/alarming thing you read you are able to shake off and want to keep going, then you'll be fine!",
        "time": "2023-01-12 16:09:38 UTC",
        "score": 2,
        "link_id": "t3_109961d",
        "parent_id": "t1_j3yyq0z"
    },
    {
        "comment_id": "j3xxcec",
        "subreddit": "books",
        "body": "So much violence and gore. The cat being killed, the videos his dad made, the sexual abuse- just gratuitous violence and abuse.",
        "time": "2023-01-11 20:48:01 UTC",
        "score": 0,
        "link_id": "t3_109961d",
        "parent_id": "t1_j3xw9ai"
    },
    {
        "comment_id": "j3x5s2y",
        "subreddit": "books",
        "body": "Infinite Jest \n\nA Little Life",
        "time": "2023-01-11 17:59:27 UTC",
        "score": 8,
        "link_id": "t3_109961d",
        "parent_id": "t3_109961d"
    },
    {
        "comment_id": "j25xzt1",
        "subreddit": "books",
        "body": "James Patterson",
        "time": "2022-12-29 22:10:09 UTC",
        "score": 511,
        "link_id": "t3_zyi1rd",
        "parent_id": "t3_zyi1rd"
    },
    {
        "comment_id": "j24dtlj",
        "subreddit": "books",
        "body": "Wayyy too many, I own hundreds. \n\nBut what I have decided to do is read 10 books I already own but haven't read yet per 1 new book I purchase. There are some new releases I'm excited about but I have to read my 10 before I can get it. My husband is doing the same thing with his video games. Has to play through 10 bought but never finished before he gets a new one. And we're allowed to DNF if they're awful.",
        "time": "2022-12-29 16:05:31 UTC",
        "score": 6,
        "link_id": "t3_zxyvp7",
        "parent_id": "t3_zxyvp7"
    },
    {
        "comment_id": "j1sbvn3",
        "subreddit": "books",
        "body": "The Midnight Library. \n\nIt was like a hug to my heart, I had so much going on at the time I read it (put my cat down, ended a decades long friendship) and it just made me feel so much better. Bought it for all my family members for Christmas last year (also loved it) and come to find out everyone on Reddit absolutely hates it.",
        "time": "2022-12-27 00:36:34 UTC",
        "score": 265,
        "link_id": "t3_zvyr5m",
        "parent_id": "t3_zvyr5m"
    },
    {
        "comment_id": "iw73vc8",
        "subreddit": "books",
        "body": "I read it about 10 years ago and am just now about a third through for a reread. Such an amazing book.",
        "time": "2022-11-13 13:50:57 UTC",
        "score": 3,
        "link_id": "t3_yu0gap",
        "parent_id": "t3_yu0gap"
    },
    {
        "comment_id": "ivu8whp",
        "subreddit": "books",
        "body": "I had to DNF it and look up what the big reveal that was constantly referenced was. I hated the dialogue and no character was likeable. Such a slog.",
        "time": "2022-11-10 17:28:37 UTC",
        "score": 10,
        "link_id": "t3_yrko21",
        "parent_id": "t3_yrko21"
    },
    {
        "comment_id": "it9djqu",
        "subreddit": "books",
        "body": "Depends. Some books you missed the bread crumbs and want to reread to see the clues and hints you missed. \n\nI used to have a job I could read at so I could read 100 or so books a year (not a brag, just lucky and reading was my hobby) so rereading a book, with 100s of books between the readings, was like seeing an old friend and the memories were buried deep. \n\nAnd sometimes, even if I know the book like the back of my hand, it reminds me of something. Like my mother passed 4 years ago and rereading her favorite feels like home.",
        "time": "2022-10-21 22:02:00 UTC",
        "score": 2,
        "link_id": "t3_ya5vhv",
        "parent_id": "t3_ya5vhv"
    },
    {
        "comment_id": "isy2gx4",
        "subreddit": "books",
        "body": "Love that movie- my husband and I use \"you were right, I was... less right\" all the time.",
        "time": "2022-10-19 15:21:03 UTC",
        "score": 1,
        "link_id": "t3_y83csz",
        "parent_id": "t1_isxqrlw"
    },
    {
        "comment_id": "is6j0lj",
        "subreddit": "books",
        "body": "I feel you. I read Riley Sager and his plots got more and more ridiculous. And all the paranormal crap being added in. It's not a twist if the secret is >!lake ghost!< The paranormal explanation really feels like a dues ex machina sort of thing. It's a twist bc you can't have expected it to be (making this up for an example) the ghost of Grandma's Springer spaniel getting revenge on the daughter of the hunter who accidentally shot it. Like, the point of a thriller is to have the bread crumbs and then be shocked you missed them- not have a major invention show up. Like, yeah, I didn't see space ghosts taking possession of the antagonist bc, I dunno, it's not usually on the list of suspects rules out in a given crime. \n\nI feel like almost all new thrillers have jumped the shark.",
        "time": "2022-10-13 17:38:17 UTC",
        "score": 8,
        "link_id": "t3_y32zv9",
        "parent_id": "t3_y32zv9"
    },
    {
        "comment_id": "is2nxs7",
        "subreddit": "books",
        "body": "Awww. I used to work at B&N and I wish everyone was this nice about returning a book. If you're nervous, just go up, say \"I already have this one, can I exchange it for the 4th\" and they'll help you out with no hassle. Large chain book retail employees get yelled at and have customers make crazy demands, someone nicely asking for help? That's the reason most work there!",
        "time": "2022-10-12 21:20:56 UTC",
        "score": 1,
        "link_id": "t3_y2fnc2",
        "parent_id": "t3_y2fnc2"
    },
    {
        "comment_id": "irkqsmn",
        "subreddit": "books",
        "body": "I also thought the story had so much potential but soo much sex. I finally, about halfway through, decided if they had sex before the next plot point, I was done. A paragraph later they see a glen and, naturally, dismount and screw. I was done.",
        "time": "2022-10-09 00:27:19 UTC",
        "score": 1,
        "link_id": "t3_xyxn26",
        "parent_id": "t3_xyxn26"
    },
    {
        "comment_id": "iq1jl5x",
        "subreddit": "books",
        "body": "Check your settings, the default is 14 days but you can change it to 21. \n\nAnd like everyone else suggested, turn off wifi on a tablet until you finish.",
        "time": "2022-09-27 00:22:23 UTC",
        "score": 3,
        "link_id": "t3_xoz47m",
        "parent_id": "t3_xoz47m"
    },
    {
        "comment_id": "iphvivj",
        "subreddit": "books",
        "body": "Oh I totally get it!",
        "time": "2022-09-22 17:43:45 UTC",
        "score": 1,
        "link_id": "t3_xl5v3d",
        "parent_id": "t1_iphudoi"
    },
    {
        "comment_id": "iphra04",
        "subreddit": "books",
        "body": "Ok. I just feel if I bought a book, I should own it, ya know?",
        "time": "2022-09-22 17:17:11 UTC",
        "score": 4,
        "link_id": "t3_xl5v3d",
        "parent_id": "t1_iphpqrh"
    },
    {
        "comment_id": "iphot5f",
        "subreddit": "books",
        "body": "How do you strip the DRM? I believe that's the stupid awful thing saying \"yes, you bought the book but you didn't like BUY BUY the book, we can take it back if we want; we totally wont, but just an fyi, like, we could,\" right?",
        "time": "2022-09-22 17:01:47 UTC",
        "score": 5,
        "link_id": "t3_xl5v3d",
        "parent_id": "t1_iphnwft"
    },
    {
        "comment_id": "ip8xwdq",
        "subreddit": "books",
        "body": "I'd also read a few pages and am not a fan of first person narratives and seeing such a bad review I was like \"ugh, I knew it, wasted my money\" but I was happily wrong.",
        "time": "2022-09-20 21:23:40 UTC",
        "score": 3,
        "link_id": "t3_xhr60t",
        "parent_id": "t1_ip8uxdq"
    },
    {
        "comment_id": "ip76t3x",
        "subreddit": "books",
        "body": "I thought it picked up and was really interesting with the history parts, but the sequels I found to be awful and couldn't finish the second.",
        "time": "2022-09-20 14:39:24 UTC",
        "score": 2,
        "link_id": "t3_xj8hhe",
        "parent_id": "t3_xj8hhe"
    },
    {
        "comment_id": "iozgfmg",
        "subreddit": "books",
        "body": "Good advice!",
        "time": "2022-09-18 21:50:47 UTC",
        "score": 1,
        "link_id": "t3_xhr60t",
        "parent_id": "t1_iozehd4"
    },
    {
        "comment_id": "ioz4o9u",
        "subreddit": "books",
        "body": "I was so reluctant because I read such a hateful opinion of it on Reddit but my ebook was past the return date so I figured I might as well read it and I am so glad I started it. I'm about 70% through and I'm getting huge Tad Williams vibes and love it.",
        "time": "2022-09-18 20:36:07 UTC",
        "score": 13,
        "link_id": "t3_xhr60t",
        "parent_id": "t3_xhr60t"
    },
    {
        "comment_id": "iosgtbd",
        "subreddit": "books",
        "body": "Infinite Jest and a Little Life to get the disturbing imagery out of my mind.\n\nHarry Potter for the first time.",
        "time": "2022-09-17 12:43:44 UTC",
        "score": 4,
        "link_id": "t3_xggcp5",
        "parent_id": "t3_xggcp5"
    },
    {
        "comment_id": "iosgko2",
        "subreddit": "books",
        "body": "The Other Boleyn Girl by Philips Gregory. Trashy, not entirely historically accurate, but so bad it was good.",
        "time": "2022-09-17 12:41:27 UTC",
        "score": 367,
        "link_id": "t3_xgiez8",
        "parent_id": "t3_xgiez8"
    },
    {
        "comment_id": "ioak59u",
        "subreddit": "books",
        "body": "Damn paywall! She I love that author, too!",
        "time": "2022-09-13 18:55:09 UTC",
        "score": 1,
        "link_id": "t3_xdeswz",
        "parent_id": "t3_xdeswz"
    },
    {
        "comment_id": "io9fv1m",
        "subreddit": "books",
        "body": "I did the same but then I tried it again and LOVED it.",
        "time": "2022-09-13 14:29:22 UTC",
        "score": 3,
        "link_id": "t3_xd4khb",
        "parent_id": "t1_io8x16u"
    },
    {
        "comment_id": "imoiv6k",
        "subreddit": "books",
        "body": "So I like plot, lots of plot. And do not like dreamy airy vibes. Hated Piranesi. Didn't like the Night Circus. Quit after 3 chapters. I had TSS on audiobook and absolutely adored it!",
        "time": "2022-09-01 16:51:42 UTC",
        "score": 4,
        "link_id": "t3_x3a7yn",
        "parent_id": "t3_x3a7yn"
    },
    {
        "comment_id": "imk13x4",
        "subreddit": "books",
        "body": "Hate it. I always get tense knowing it's coming when I read \"He recognized his working class accent\" because I know every time that guy talks, it's going to be missing 25% of the letters.",
        "time": "2022-08-31 18:39:41 UTC",
        "score": 6,
        "link_id": "t3_x2kpez",
        "parent_id": "t3_x2kpez"
    },
    {
        "comment_id": "imjvurk",
        "subreddit": "books",
        "body": "A Walk in the Woods by Bill Bryson",
        "time": "2022-08-31 18:05:45 UTC",
        "score": 1,
        "link_id": "t3_x2gwpu",
        "parent_id": "t3_x2gwpu"
    },
    {
        "comment_id": "im4cjpb",
        "subreddit": "books",
        "body": "And the supernatural element was so awful. I feel they should have warned that wansa factor because when that showed up halfway through, I was super pissed.",
        "time": "2022-08-28 12:30:38 UTC",
        "score": 1,
        "link_id": "t3_wzot64",
        "parent_id": "t1_im43cta"
    },
    {
        "comment_id": "im4cdxj",
        "subreddit": "books",
        "body": "Yes! Or even worse, not only is it a almost dues ex machina twist, but they add some weird ass super natural element as well. Riley Sager's newest one (after her last book, I was giving her one more chance) was just, ugh. I thought it was about a creepy neighbor spying across a lake and maybe some domestic violence or a family secret tossed in, but alas, it was mainly about >!lake ghosts!<. I miss straight forward thrillers. \n\nSeems the choices are either a psychological twistfest of stupidity or a grizzled old cop with a shitty attitude that I hate. I'm not looking for Nancy fucking Drew, but if I could have straight forward mystery with a likeable and reliable narrator, that'd be great.",
        "time": "2022-08-28 12:29:01 UTC",
        "score": 7,
        "link_id": "t3_wzot64",
        "parent_id": "t3_wzot64"
    },
    {
        "comment_id": "im215y8",
        "subreddit": "books",
        "body": "Yeah, I hated it too. Such a waste of so much time, I didn't find anything redeeming in it.",
        "time": "2022-08-27 22:07:44 UTC",
        "score": 23,
        "link_id": "t3_wze7jl",
        "parent_id": "t3_wze7jl"
    },
    {
        "comment_id": "ilxqp0r",
        "subreddit": "books",
        "body": "So much red wine while drinking GoT",
        "time": "2022-08-26 23:39:30 UTC",
        "score": 1,
        "link_id": "t3_wylhf5",
        "parent_id": "t3_wylhf5"
    },
    {
        "comment_id": "il8seir",
        "subreddit": "books",
        "body": "No time like the present!",
        "time": "2022-08-21 21:39:05 UTC",
        "score": 7,
        "link_id": "t3_wuacwk",
        "parent_id": "t1_il8qayn"
    },
    {
        "comment_id": "il6exhs",
        "subreddit": "books",
        "body": "Half Blood Prince - so I'm excited",
        "time": "2022-08-21 10:38:56 UTC",
        "score": 1,
        "link_id": "t3_wtlzmj",
        "parent_id": "t1_il4wxxn"
    },
    {
        "comment_id": "il4w3zc",
        "subreddit": "books",
        "body": "I'm just starting Half Blood Prince in my reread and, ugh, so good. I'm glad you're enjoying it. Goblet is my second fave of the series. Enjoy them!!!",
        "time": "2022-08-21 00:50:09 UTC",
        "score": 8,
        "link_id": "t3_wtlzmj",
        "parent_id": "t3_wtlzmj"
    },
    {
        "comment_id": "ikzv3b5",
        "subreddit": "books",
        "body": "Oh man... Yeah. Candles is just too far. Too far.",
        "time": "2022-08-19 22:39:30 UTC",
        "score": 14,
        "link_id": "t3_wslyct",
        "parent_id": "t1_ikzfzg0"
    },
    {
        "comment_id": "ikz5c30",
        "subreddit": "books",
        "body": "And the rest of the store was games, collectables, and kids toys. (At least in my days at B&N)",
        "time": "2022-08-19 19:44:38 UTC",
        "score": 96,
        "link_id": "t3_wslyct",
        "parent_id": "t1_ikz2hlq"
    },
    {
        "comment_id": "ikt5k27",
        "subreddit": "books",
        "body": "And elves and fae age, just on their own (very slow) time, so they seem ageless to humans. At least that's from the books I've read and the elven lore of JRRT.",
        "time": "2022-08-18 15:52:45 UTC",
        "score": 2,
        "link_id": "t3_wrmxr4",
        "parent_id": "t3_wrmxr4"
    },
    {
        "comment_id": "ikkf2d0",
        "subreddit": "books",
        "body": "I just felt some of the last book was a little bit jumping the shark, but enjoyed it enough to look into another series by him and damn did Unwind nail it!",
        "time": "2022-08-16 20:25:14 UTC",
        "score": 1,
        "link_id": "t3_wppjdl",
        "parent_id": "t1_ikk3lxd"
    },
    {
        "comment_id": "iki6u5p",
        "subreddit": "books",
        "body": "I loved that series. And the whole part about people having a \"sacrifice\" child intentionally to unwind - I couldn't even imagine. Omg, that trilogy was great, far better conclusion than his Scythe books, and it has stuck with me. I think about it all the time watching the current meltdown of rights and civil division. And whenever I hug my baby.",
        "time": "2022-08-16 11:14:43 UTC",
        "score": 19,
        "link_id": "t3_wppjdl",
        "parent_id": "t3_wppjdl"
    },
    {
        "comment_id": "ik4mo0c",
        "subreddit": "books",
        "body": "Agreed 100%. I think there's something seriously wrong with the author. No emotionally sound person writes that over and over again.",
        "time": "2022-08-13 13:54:52 UTC",
        "score": 5,
        "link_id": "t3_wmy6ms",
        "parent_id": "t1_ik4etv1"
    },
    {
        "comment_id": "ik4gxb9",
        "subreddit": "books",
        "body": "I think part of the issue is DFW can WRITE. So when he writes about child rape and animal torture (things I avoid as it is in a book) it just sears in. Glad I could save you the experience. Read his essays - brilliant and witty and funny, all the things IJ has going for it minus all the gruesome things it doesn't!",
        "time": "2022-08-13 13:05:45 UTC",
        "score": 0,
        "link_id": "t3_wmy6ms",
        "parent_id": "t1_ik35emc"
    },
    {
        "comment_id": "ik2wwln",
        "subreddit": "books",
        "body": "So many disturbing images. From torturing cats to his dad's video shorts - the imagery of so much of it stuck in my mind.",
        "time": "2022-08-13 02:32:54 UTC",
        "score": 8,
        "link_id": "t3_wmy6ms",
        "parent_id": "t1_ik2scyd"
    },
    {
        "comment_id": "ik2p69o",
        "subreddit": "books",
        "body": "All the disturbing scenes written out of child abuse over and over again.",
        "time": "2022-08-13 01:32:27 UTC",
        "score": 21,
        "link_id": "t3_wmy6ms",
        "parent_id": "t1_ik27qs2"
    },
    {
        "comment_id": "ik25uvv",
        "subreddit": "books",
        "body": "Ugh. Hated it.",
        "time": "2022-08-12 23:06:28 UTC",
        "score": 4,
        "link_id": "t3_wmy6ms",
        "parent_id": "t1_ik2519n"
    },
    {
        "comment_id": "ik25qki",
        "subreddit": "books",
        "body": "Infinite Jest\n\nA Little Life",
        "time": "2022-08-12 23:05:38 UTC",
        "score": 11,
        "link_id": "t3_wmy6ms",
        "parent_id": "t3_wmy6ms"
    },
    {
        "comment_id": "ik114rf",
        "subreddit": "books",
        "body": "I see you already mentioned overseas shipping. Sorry. Didn't catch that. It's showing up Out of Stock for hardcover, so that's probably it. Once they print more, maybe it'll go down?",
        "time": "2022-08-12 18:30:35 UTC",
        "score": 1,
        "link_id": "t3_wms9ur",
        "parent_id": "t1_ik10twx"
    },
    {
        "comment_id": "ik10twx",
        "subreddit": "books",
        "body": "So this happened to me with Before You Knew My Name. Turns out it was released in the US yet, so it was so much for overseas shipping or 3rd party selling. It took like half a year for the US release and now it's regular price. So maybe it's being released later for you?",
        "time": "2022-08-12 18:28:42 UTC",
        "score": 1,
        "link_id": "t3_wms9ur",
        "parent_id": "t3_wms9ur"
    },
    {
        "comment_id": "ijuicwv",
        "subreddit": "books",
        "body": "There's so much wrong with it but I think of the scene with the train going through the tunnel and everyone suffocating All The Time. Many times I've needed approval for something obvious but got shifted all around to different people who didn't want the responsibility of saying yes and ugh. I just see that damn coal burning train. \n\nI think John Galt's speeches are so much smoke up his own ass he could become a hot air balloon. The whole book is just selfish extreme capitalistic propaganda but that damn train scene is brilliant. It taught me to add \"I'll take all responsibility\" when I need something done quickly and I'm confident in it.",
        "time": "2022-08-11 12:08:47 UTC",
        "score": 8,
        "link_id": "t3_wldvcm",
        "parent_id": "t3_wldvcm"
    },
    {
        "comment_id": "ijkp0v0",
        "subreddit": "books",
        "body": "StoryGraph isn't great but it's loads better than GoodReads",
        "time": "2022-08-09 13:02:11 UTC",
        "score": 2,
        "link_id": "t3_wjs1o3",
        "parent_id": "t1_ijjuh0s"
    },
    {
        "comment_id": "ijgdd6b",
        "subreddit": "books",
        "body": "Yep. Exact same thing happened to me.",
        "time": "2022-08-08 15:47:32 UTC",
        "score": 1,
        "link_id": "t3_wjbofs",
        "parent_id": "t3_wjbofs"
    },
    {
        "comment_id": "ijfoqll",
        "subreddit": "books",
        "body": "It is filled with explicit scenes of abuse, I don't want to spoil it for you, but every revenue where someone complained about it, the scenes were way worse than you can imagine. I hated that aspect of it.",
        "time": "2022-08-08 12:53:47 UTC",
        "score": 3,
        "link_id": "t3_wj7z72",
        "parent_id": "t3_wj7z72"
    },
    {
        "comment_id": "ijaz7m7",
        "subreddit": "books",
        "body": "I don't mind first person back and forth, I do however HATE when they jump back to first person as a child. Like \"The sun filtering in reminded me of when my father passed.\" Jump back, \"Mamma said not to get my new frock dirty but Bessie dared me blah blah blah.\" I hate it. Writing from a child's perspective just grates everything inside of me.",
        "time": "2022-08-07 12:44:28 UTC",
        "score": 1,
        "link_id": "t3_wi7lns",
        "parent_id": "t3_wi7lns"
    },
    {
        "comment_id": "ijaym8m",
        "subreddit": "books",
        "body": "And that Molly's bogart showed both of them, even she couldn't imagine losing just one. If it had been both, but just the one...",
        "time": "2022-08-07 12:38:45 UTC",
        "score": 3,
        "link_id": "t3_whx03p",
        "parent_id": "t1_ij9ey3z"
    },
    {
        "comment_id": "ij8gpm6",
        "subreddit": "books",
        "body": "Hedwig. It made me think of putting down my favorite cat and it tears my heart out. Everyone that has lost a beloved pet... Fucking Hedwig man.\n\nAnd Boromir. Ooof.",
        "time": "2022-08-06 21:34:37 UTC",
        "score": 35,
        "link_id": "t3_whx03p",
        "parent_id": "t3_whx03p"
    },
    {
        "comment_id": "ij6ifyk",
        "subreddit": "books",
        "body": "If electronic, as mentioned, I press the word to immediately look it up. If hard copy, I write it in a notebook to look up later if after I'm done reading, I still am unclear. (This is usually after I've tapped the word twice on the page and realized it's not a kindle- I'm usually pretty tired when I get to read.)",
        "time": "2022-08-06 12:58:57 UTC",
        "score": 2,
        "link_id": "t3_whhekr",
        "parent_id": "t3_whhekr"
    },
    {
        "comment_id": "iitod3b",
        "subreddit": "books",
        "body": "I'm not being a troll, sincere question- what is the difference between a comic book versus a cartoon book? Or Manga?",
        "time": "2022-08-03 19:52:22 UTC",
        "score": 12,
        "link_id": "t3_wfg1tc",
        "parent_id": "t3_wfg1tc"
    },
    {
        "comment_id": "iishoyw",
        "subreddit": "books",
        "body": "Fair enough.",
        "time": "2022-08-03 15:12:57 UTC",
        "score": 2,
        "link_id": "t3_wf81u1",
        "parent_id": "t1_iisgu2p"
    },
    {
        "comment_id": "iisfrgp",
        "subreddit": "books",
        "body": "Plus \"well written and engaging story\" does not describe Twilight. Much the opposite.",
        "time": "2022-08-03 15:00:18 UTC",
        "score": 5,
        "link_id": "t3_wf81u1",
        "parent_id": "t1_iisdnig"
    },
    {
        "comment_id": "iio299d",
        "subreddit": "books",
        "body": "It didn't happen with movies or CDs or even gift cards- I'm sure they could have it activated at purchase.",
        "time": "2022-08-02 17:20:37 UTC",
        "score": 3,
        "link_id": "t3_wefy8b",
        "parent_id": "t1_iinssyr"
    },
    {
        "comment_id": "iinbxsy",
        "subreddit": "books",
        "body": "Omg yes- a good cozy mystery! And so many are cat themed and I love it. Fat Cat Takes the Cake is so fuzzy feeling and the lemon bar recipe in the back is delicious.",
        "time": "2022-08-02 14:36:08 UTC",
        "score": 2,
        "link_id": "t3_webger",
        "parent_id": "t1_iin7dhv"
    },
    {
        "comment_id": "iin4osx",
        "subreddit": "books",
        "body": "House in the Cerulean Sea by TJ Klune",
        "time": "2022-08-02 13:45:32 UTC",
        "score": 36,
        "link_id": "t3_webger",
        "parent_id": "t3_webger"
    },
    {
        "comment_id": "iil2ovz",
        "subreddit": "books",
        "body": "Currently listening to the Harry Potter series and damn does it hit different now that I'm a parent. Just listened to the chapter where Molly sees the bogart as her kids dead and oh man... and every time I read about Lily's sacrifice. I would step between anyone/anything harmful and my child and it just rings different in your soul. And really noticing all the times a mother's love has played a major role- Lily, >!Barty Crouch's mother's, Narcissa!< - this time around.",
        "time": "2022-08-02 01:12:52 UTC",
        "score": 3,
        "link_id": "t3_wdvo0w",
        "parent_id": "t3_wdvo0w"
    },
    {
        "comment_id": "iiin29n",
        "subreddit": "books",
        "body": "A lot of people crap on Weir's writing ability but he made me invest and cry over a space spider covered in rocks, so he's aces in my book.",
        "time": "2022-08-01 15:26:05 UTC",
        "score": 210,
        "link_id": "t3_wdihyp",
        "parent_id": "t1_iiilrao"
    },
    {
        "comment_id": "iiilb7z",
        "subreddit": "books",
        "body": "\"You sleep, I watch.\" \n\n\"Fist me!\"\n\nRocky is the best supporting character. Hands down my favorite.",
        "time": "2022-08-01 15:14:14 UTC",
        "score": 695,
        "link_id": "t3_wdihyp",
        "parent_id": "t3_wdihyp"
    },
    {
        "comment_id": "iidggtt",
        "subreddit": "books",
        "body": "You're hanging with a-holes then. Why would they be offended if you didn't read it? I loved the series but the only person I would suggest it to will be my kid- who will probably decline out of rebellion and be a Twilight girl.",
        "time": "2022-07-31 12:15:04 UTC",
        "score": 1,
        "link_id": "t3_wckakl",
        "parent_id": "t1_iid4att"
    },
    {
        "comment_id": "iidg6x0",
        "subreddit": "books",
        "body": "Agreed. I saw someone refer to PoA as Harry Potter and When JK Finally Learns to Write.",
        "time": "2022-07-31 12:12:06 UTC",
        "score": 2,
        "link_id": "t3_wckakl",
        "parent_id": "t1_iiddky2"
    },
    {
        "comment_id": "iidfjhv",
        "subreddit": "books",
        "body": "Finding his skeleton sure put a damper on their whole \"he wasn't deformed!\" theory. But, despite how he may or may not have gotten the throne, he was a good king.",
        "time": "2022-07-31 12:05:01 UTC",
        "score": 7,
        "link_id": "t3_wcjupv",
        "parent_id": "t1_iidd2h6"
    },
    {
        "comment_id": "iidfa8d",
        "subreddit": "books",
        "body": "Hard same",
        "time": "2022-07-31 12:02:11 UTC",
        "score": 3,
        "link_id": "t3_wcanpl",
        "parent_id": "t1_iibt4be"
    },
    {
        "comment_id": "iidf8xo",
        "subreddit": "books",
        "body": "I also find it surprising people keep calling it funny. Yes, there were funny parts and characters (long live The Darkness!) but there were so many effed up, horrific, torture porn scenes that I would call it disturbing 100 times over before referring to it as funny.",
        "time": "2022-07-31 12:01:47 UTC",
        "score": 1,
        "link_id": "t3_wcanpl",
        "parent_id": "t1_iibjbta"
    },
    {
        "comment_id": "ii8x4x6",
        "subreddit": "books",
        "body": "I loved the trilogy.",
        "time": "2022-07-30 11:43:48 UTC",
        "score": 10,
        "link_id": "t3_wbuzwe",
        "parent_id": "t3_wbuzwe"
    },
    {
        "comment_id": "ihxiqcu",
        "subreddit": "books",
        "body": "Oh I got it, I just didn't like it. I much prefer DFWs essays.",
        "time": "2022-07-28 01:02:30 UTC",
        "score": 1,
        "link_id": "t3_w97eo2",
        "parent_id": "t1_ihxf5nh"
    },
    {
        "comment_id": "ihuclur",
        "subreddit": "books",
        "body": "Infinite Jest. There are horrific scenes, and so many. Sexual violence. Physical violence. Animal abuse. It's a smorgasbord of pretension sprinkled with nightmare fuel all throughout.",
        "time": "2022-07-27 12:18:46 UTC",
        "score": 5,
        "link_id": "t3_w97eo2",
        "parent_id": "t3_w97eo2"
    },
    {
        "comment_id": "ihucd0e",
        "subreddit": "books",
        "body": "A friend's boyfriend, who is very funny, said it was his favorite book. After reading it I thought he had played a joke on me because the book was so bad. But no, he loves it, tons of people love it, I was annoyed and bored the entire time I read it.",
        "time": "2022-07-27 12:16:33 UTC",
        "score": 5,
        "link_id": "t3_w97eo2",
        "parent_id": "t1_ihtldqp"
    },
    {
        "comment_id": "ihuc6oz",
        "subreddit": "books",
        "body": "Read it ages ago and thought of it so much when my cat died. Then I had a baby and oooof. You couldn't pay me to reread it with my new perspective. Nope nope nope.\n\nBecause I would do it, knowing it would go badly, I'd hike my ass up to that plot and I couldn't imagine reading it and having it fresh.",
        "time": "2022-07-27 12:14:56 UTC",
        "score": 8,
        "link_id": "t3_w97eo2",
        "parent_id": "t1_ihtm3ol"
    },
    {
        "comment_id": "ihfv75g",
        "subreddit": "books",
        "body": "I'm 3 books in and am loving the series so much!!",
        "time": "2022-07-24 12:24:04 UTC",
        "score": 3,
        "link_id": "t3_w6tql7",
        "parent_id": "t1_ihfujxl"
    },
    {
        "comment_id": "ih9eyuh",
        "subreddit": "books",
        "body": "Your lack of focus in not just reading but all hobbies makes me worried that maybe its depression. Have you talked to a therapist? \n\nMy other theory is uni is overwhelming, your brain may just want to sit and do nothing and need a passive hobby until it has a break from school.",
        "time": "2022-07-23 00:19:47 UTC",
        "score": 2,
        "link_id": "t3_w5pmhd",
        "parent_id": "t3_w5pmhd"
    },
    {
        "comment_id": "ih8wfuq",
        "subreddit": "books",
        "body": "I liked it, as did all the ladies in my family. I bought it for grandmom to read in the hospital and she passed it on to all the aunts. I'm surprised it's in a lit class bc it is very much the book equivalent of a disposable razor- doesn't last but good for one use.",
        "time": "2022-07-22 22:02:14 UTC",
        "score": 3,
        "link_id": "t3_w5jxqj",
        "parent_id": "t1_ih8fn07"
    },
    {
        "comment_id": "ih6ut1u",
        "subreddit": "books",
        "body": "Island of the Blue Dolphins",
        "time": "2022-07-22 14:00:31 UTC",
        "score": 10,
        "link_id": "t3_w5b0zi",
        "parent_id": "t3_w5b0zi"
    },
    {
        "comment_id": "ih6oetr",
        "subreddit": "books",
        "body": "Oh yeah! Check out Brandon Sanderson's Stormlight series. He did it masterfully in that. A main character is an artist and there are pages of her sketch pad  (showing uniforms, creatures, people, etc) at the beginning of some chapters. Really adds to the world!",
        "time": "2022-07-22 13:14:11 UTC",
        "score": 3,
        "link_id": "t3_w59oe9",
        "parent_id": "t3_w59oe9"
    },
    {
        "comment_id": "ih3nht2",
        "subreddit": "books",
        "body": "Calibre",
        "time": "2022-07-21 20:47:27 UTC",
        "score": 2,
        "link_id": "t3_w4r0rp",
        "parent_id": "t3_w4r0rp"
    },
    {
        "comment_id": "ih1s9bv",
        "subreddit": "books",
        "body": "How I Became a Famous Novelist by Steve Hely. It's absolutely hysterical and I woke the napping baby laughing so hard at one point.",
        "time": "2022-07-21 13:41:58 UTC",
        "score": 1,
        "link_id": "t3_w4a8dw",
        "parent_id": "t3_w4a8dw"
    },
    {
        "comment_id": "igwwh2o",
        "subreddit": "books",
        "body": "Not only his over inflated prose but the gruesome and unnecessary graphic scenes of abuse and torture- that book gave me nightmares and still has images from scenes I wish I could bleach out of my mind. If I could go back in time and unread one book, it'd be IJ for its admittedly creative, over abundance of torture porn.",
        "time": "2022-07-20 13:22:29 UTC",
        "score": 1,
        "link_id": "t3_w3eila",
        "parent_id": "t1_igwclyk"
    },
    {
        "comment_id": "igwvvtc",
        "subreddit": "books",
        "body": "I read 3 or 4 Pratchett books and just, nope. Couldn't get into it. I feel almost blasphemous admitting it, especially on this sub. And I usually love British humor, but he just was such a miss for me.",
        "time": "2022-07-20 13:18:05 UTC",
        "score": 6,
        "link_id": "t3_w3eila",
        "parent_id": "t1_igwm0mv"
    },
    {
        "comment_id": "igwvg6h",
        "subreddit": "books",
        "body": "In a fun, fantasy series about people going in to and out of books (Thursday Next series) the part I remember most was random plots were landing in Scarlet Letter and someone screamed \"oh no! Can you imagine a Scarlet Letter where something ACTUALLY happens?!?!\" and I laughed hard.",
        "time": "2022-07-20 13:14:42 UTC",
        "score": 2,
        "link_id": "t3_w3eila",
        "parent_id": "t1_igvt2he"
    },
    {
        "comment_id": "igwuxad",
        "subreddit": "books",
        "body": "Hard same to Fifth Season. Tried 3 or so times and just couldn't.",
        "time": "2022-07-20 13:10:38 UTC",
        "score": 2,
        "link_id": "t3_w3eila",
        "parent_id": "t3_w3eila"
    },
    {
        "comment_id": "igsdb8u",
        "subreddit": "books",
        "body": "I didn't think he fed him the cum peach- but after forcing myself to keep reading after that scene I finally noped out at the oh so romantic pushing on the other guys belly while he was pooping scene. I tried for the supposed literary value but nope. Nope nope nope.",
        "time": "2022-07-19 15:18:28 UTC",
        "score": 28,
        "link_id": "t3_w2u96g",
        "parent_id": "t3_w2u96g"
    },
    {
        "comment_id": "iga59b5",
        "subreddit": "books",
        "body": "Harry Potter!!!",
        "time": "2022-07-15 16:26:23 UTC",
        "score": 2,
        "link_id": "t3_vzsio4",
        "parent_id": "t3_vzsio4"
    },
    {
        "comment_id": "ig92k26",
        "subreddit": "books",
        "body": "\"Fist me!\" made me spit my coffee. That book was so great and Rocky- Weir isn't the greatest but he sure did make me care deeply about a space spider made of rocks. He's my favorite secondary character in a novel.\n\nAs for your criticism, I'm not so sure. Didn't everyone band together and then politicize and go after the people who did it? Or at least they assumed that's what would happen. And even when he >!sent the answer, he was worried earth couldn't get it's shit together enough to work together and save the planet. If I recall, he was a little surprised that they did it when he found out.!< Oh man, I got choked up thinking of the last scene. Think I need to dive into it again.\n\nEdit to add - I think it's 50/50. We would either all just die or get it together. Depends on a lot. If it happened in 50 years when all the old turtles of hate and corruption and greed die out and have been replaced by empathetic, big dreaming millennial and Gen Zs- we'd definitely cooperate and save the day. If it happened tomorrow? Time to do heroin and say goodbye because we're toast. So I see your point, I forget when the book was set, but that'd be a big factor.",
        "time": "2022-07-15 11:38:25 UTC",
        "score": 10,
        "link_id": "t3_vzlzez",
        "parent_id": "t3_vzlzez"
    },
    {
        "comment_id": "ig91zpd",
        "subreddit": "books",
        "body": "Dan Brown gets shit on a lot, but he's a fun, fast read. \n\nNot every book needs to be littered with flowery prose or pathos. \n\nIt's like food. Is a prime cut, med rare steak washed down with expensive red wine amazing? Yes. Is it sustainable to have it every meal? Sometimes you just want/need a burger and Mac n cheese. Dan Brown is the book equivalent of potluck food. Is it going to win awards? No. Will Gordon Ramsey like it? No. Is it filling and delicious? Yes.",
        "time": "2022-07-15 11:32:42 UTC",
        "score": 3,
        "link_id": "t3_vzm3ff",
        "parent_id": "t3_vzm3ff"
    },
    {
        "comment_id": "ig15d9p",
        "subreddit": "books",
        "body": "Based on how much he froths at the mouth about the Apocalypse, I'd guess he's only read Revelations. Because yeah, the Old Testament, starting that book at the beginning, violent.",
        "time": "2022-07-13 19:31:45 UTC",
        "score": 20,
        "link_id": "t3_vy4j7u",
        "parent_id": "t1_ig11c9b"
    },
    {
        "comment_id": "ig0c6lk",
        "subreddit": "books",
        "body": "The Bible. And this isn't to be edgy. My fundamentalist father went on a kick for a bit when I was in 4th grade that it was the only book I was allowed to read. When I asked him was a \"pin is\" was because they kept mentioning them, and he had to correct the pronunciation for me, I was suddenly allowed to read books about girls competing in the big talent show or girls starting baby sitting clubs again. It wasn't intentional, either, I was just like \"what is this thing these guys are so worried about cutting?\"",
        "time": "2022-07-13 16:24:14 UTC",
        "score": 53,
        "link_id": "t3_vy4j7u",
        "parent_id": "t3_vy4j7u"
    },
    {
        "comment_id": "ifwdf4l",
        "subreddit": "books",
        "body": "It wasn't the weirdness of it just the frequency it happened or was thought about. Same reason I had to stop reading Outlander, so much gratuitous sex (of the non vampire variety) there seemed no reason to continue. \n\nI've never watched True Blood, but now I'm curious!",
        "time": "2022-07-12 19:55:00 UTC",
        "score": 3,
        "link_id": "t3_vx5xu7",
        "parent_id": "t1_ifvicgk"
    },
    {
        "comment_id": "iful6ak",
        "subreddit": "books",
        "body": "I need to download this app!\n\nAnd, also have OCD, I was going to suggest audiobook at the same time as reading. \n\nI'm sorry this compulsion is causing you such grief and robbing you of joy in reading. It's such a hard disease. I do highly recommend talking to a Dr and seeing about an ssri. I had to try a few before finding the one that worked best, but one day I woke up and it was just, my anxiety went from front and center with a bullhorn to an annoying whisper in the back.",
        "time": "2022-07-12 12:35:58 UTC",
        "score": 2,
        "link_id": "t3_vx4930",
        "parent_id": "t1_ifudz8o"
    },
    {
        "comment_id": "ifukceh",
        "subreddit": "books",
        "body": "I rank book 4, after 6, as my favorite! Really enjoyed it! (This may be because the twist at the end floored me and I love a good surprise). Book 5- I could slam my head against that brick of a book and get more pleasure than reading it. And book 2 is awful.",
        "time": "2022-07-12 12:28:31 UTC",
        "score": 9,
        "link_id": "t3_vx5xu7",
        "parent_id": "t1_ifu1brk"
    },
    {
        "comment_id": "ifuk05j",
        "subreddit": "books",
        "body": "Couldn't even make it through the second, and the first one was so good. Just, how much vampire sex can I care about? And that's saying a lot coming from me as I read Anne Rice!",
        "time": "2022-07-12 12:25:26 UTC",
        "score": 22,
        "link_id": "t3_vx5xu7",
        "parent_id": "t1_ifuc0wt"
    },
    {
        "comment_id": "ifujq18",
        "subreddit": "books",
        "body": "This review made my morning. I also think the 5th is her best but oh man, I Iaughed so much. It's so spot on. The 1st, 3rd, and 5tg VC are my favorite guilty pleasure but yeah, space aliens, the Mayfair witches and the book Lestat keeps saying \"dude,\" and all the non sex sex. It's a hot mess.",
        "time": "2022-07-12 12:22:50 UTC",
        "score": 16,
        "link_id": "t3_vx5xu7",
        "parent_id": "t1_ifu8duf"
    },
    {
        "comment_id": "ifquufk",
        "subreddit": "books",
        "body": "Utterly unbelievable, obvious who the killer was, the screen play gimmick beyond awful. I hated that book so much.",
        "time": "2022-07-11 17:18:37 UTC",
        "score": 8,
        "link_id": "t3_vwljss",
        "parent_id": "t1_ifqqk3h"
    },
    {
        "comment_id": "iflfbov",
        "subreddit": "books",
        "body": "Happy cake day!!!",
        "time": "2022-07-10 13:42:55 UTC",
        "score": 0,
        "link_id": "t3_vvr4rw",
        "parent_id": "t1_iflec8w"
    },
    {
        "comment_id": "ifl9097",
        "subreddit": "books",
        "body": "This isn't unpopular on this subreddit at all. Goodreads is garbage and shoved down your face by Amazon if you read Kindle books.\n\nEdit- misspelled Goodreads",
        "time": "2022-07-10 12:46:05 UTC",
        "score": 59,
        "link_id": "t3_vvqnw7",
        "parent_id": "t3_vvqnw7"
    },
    {
        "comment_id": "ifl8w71",
        "subreddit": "books",
        "body": "I hope he does. I truly do, but I'm losing hope. Even if we get WoW, I don't see how we can get Spring.",
        "time": "2022-07-10 12:44:58 UTC",
        "score": 1,
        "link_id": "t3_vvpkzm",
        "parent_id": "t1_ifl6ac7"
    },
    {
        "comment_id": "ifcsf9c",
        "subreddit": "books",
        "body": "I don't think it's identify as in seeing themselves inserted in place of them so much as an inability to connect with what motivates them. Part of what makes reading great- imo - is feeling emotions as you read. A main character that you can't empathize with, or care about, (and I feel this is often the result of bad/flat writing) robs one of the pleasure of feeling a book versus reading a book.",
        "time": "2022-07-08 15:30:31 UTC",
        "score": 86,
        "link_id": "t3_vucxxf",
        "parent_id": "t3_vucxxf"
    },
    {
        "comment_id": "if80gvc",
        "subreddit": "books",
        "body": "Project Hail Mary by Andy Weir",
        "time": "2022-07-07 16:07:08 UTC",
        "score": 2,
        "link_id": "t3_vtm2wb",
        "parent_id": "t3_vtm2wb"
    },
    {
        "comment_id": "if4wz4o",
        "subreddit": "books",
        "body": "Good point!",
        "time": "2022-07-06 23:02:37 UTC",
        "score": 0,
        "link_id": "t3_vsww64",
        "parent_id": "t1_if4hhr9"
    },
    {
        "comment_id": "if3zlfv",
        "subreddit": "books",
        "body": "Kafka- his friend, Max Brod, was instructed from Kafka's death bed to destroy all of his unpublished works. Instead he published all of them including The Trial and The Castle.",
        "time": "2022-07-06 19:08:00 UTC",
        "score": 31,
        "link_id": "t3_vsww64",
        "parent_id": "t3_vsww64"
    },
    {
        "comment_id": "iet5vd8",
        "subreddit": "books",
        "body": "Cedric for sure!",
        "time": "2022-07-04 12:14:17 UTC",
        "score": 2,
        "link_id": "t3_vr0ea4",
        "parent_id": "t1_iet08t7"
    },
    {
        "comment_id": "iet5tnb",
        "subreddit": "books",
        "body": "Ned Stark's fate at the end of GoT",
        "time": "2022-07-04 12:13:47 UTC",
        "score": 3,
        "link_id": "t3_vr0ea4",
        "parent_id": "t3_vr0ea4"
    },
    {
        "comment_id": "iet5r69",
        "subreddit": "books",
        "body": "Nin fiction- Marie Antoinette: The Journey by Antonia Fraser\n\nFiction - Abundance: A Novel of Marie Antoinette by Sena Jeter Naslund",
        "time": "2022-07-04 12:13:05 UTC",
        "score": 2,
        "link_id": "t3_vm22zg",
        "parent_id": "t1_iesu1dd"
    },
    {
        "comment_id": "iekusrw",
        "subreddit": "books",
        "body": "Jane Austen, Sue Monk Kidd, Victor Hugo",
        "time": "2022-07-02 14:13:17 UTC",
        "score": 8,
        "link_id": "t3_vprxgx",
        "parent_id": "t3_vprxgx"
    },
    {
        "comment_id": "iebqrfj",
        "subreddit": "books",
        "body": "And right now in r/bookclub we're reading East of Eden. Today's discussion is up to Chapter 22 (I think) but there's discussions about the allegories and story going on over there every Friday!\n\nEdit- grammar\n\nEdit 2- today is Thursday, tomorrow is Chapters 16 - 22. No wonder there wasn't anything going on when I kept checking. My brain is fluff. Sorry.",
        "time": "2022-06-30 15:00:33 UTC",
        "score": 3,
        "link_id": "t3_vo9vvq",
        "parent_id": "t3_vo9vvq"
    },
    {
        "comment_id": "ie7n4rb",
        "subreddit": "books",
        "body": "Oh man, I remember slogging through some miserable pages of hard science to get to the story and being wildly disappointed at the end. The thing I remember most is thinking for pages, \"I DO NOT CARE HOW TO LASSO SOMETHING IN THE VACUUM OF SPACE.\" \n\nI hated that book.",
        "time": "2022-06-29 17:41:40 UTC",
        "score": 2,
        "link_id": "t3_vni0nx",
        "parent_id": "t1_ie7eqd8"
    },
    {
        "comment_id": "ie273sq",
        "subreddit": "books",
        "body": "Salems Lot when she punches her baby. That's the only thing I really recall of it and it upsets me every time.",
        "time": "2022-06-28 14:47:47 UTC",
        "score": 9,
        "link_id": "t3_vmondf",
        "parent_id": "t3_vmondf"
    },
    {
        "comment_id": "idzg7dc",
        "subreddit": "books",
        "body": "Awesome! Thanks, I'm excited!",
        "time": "2022-06-27 22:39:53 UTC",
        "score": 1,
        "link_id": "t3_vlrkem",
        "parent_id": "t1_idzeq2g"
    },
    {
        "comment_id": "idymrj8",
        "subreddit": "books",
        "body": "Marie Antoinette's World: Intrigued, Infidelity, and Adultery in Versailles by Will Bashor\n\nA new analysis of Marie Antoinette and the world she was thrust into? Sign me up!\n\nThe \"new info\"? Star charts and handwriting analysis. Are you kidding me? The conclusion? He was convinced she had VD and had confirmation biases about it in view of every fact. And very pornographic passages. I have never hated a book so much.",
        "time": "2022-06-27 18:40:37 UTC",
        "score": 12,
        "link_id": "t3_vm22zg",
        "parent_id": "t3_vm22zg"
    },
    {
        "comment_id": "idx7nsm",
        "subreddit": "books",
        "body": "I have KU AND I do enjoy a good Golden Ave detective story. Can you recommend a few?",
        "time": "2022-06-27 12:36:00 UTC",
        "score": 1,
        "link_id": "t3_vlrkem",
        "parent_id": "t1_idx1xas"
    },
    {
        "comment_id": "idlnqx5",
        "subreddit": "books",
        "body": "I pace.",
        "time": "2022-06-24 19:55:53 UTC",
        "score": 0,
        "link_id": "t3_vjrwzx",
        "parent_id": "t3_vjrwzx"
    },
    {
        "comment_id": "idjul14",
        "subreddit": "books",
        "body": "I love mine. Since the moment I bought it, it's been nearby at all times. The best is when my eyes get tired I can turn down the light and make the font bigger.",
        "time": "2022-06-24 12:33:51 UTC",
        "score": 7,
        "link_id": "t3_vjmmet",
        "parent_id": "t3_vjmmet"
    },
    {
        "comment_id": "idiab3j",
        "subreddit": "books",
        "body": "I didn't mind the first one, it was good and I believe (it's been so many years and so many books ago) that you do get the entire background of that in the first book.",
        "time": "2022-06-24 01:48:06 UTC",
        "score": 3,
        "link_id": "t3_vjbei9",
        "parent_id": "t1_idi5p1g"
    },
    {
        "comment_id": "idi4kae",
        "subreddit": "books",
        "body": "Ooof, if you don't like the first, you probably  won't make it through the rest. I tried to read the second one 3 separate times and could never finish it. And this is from someone who has managed to read all the Vampire Chronicles.",
        "time": "2022-06-24 01:01:42 UTC",
        "score": 5,
        "link_id": "t3_vjbei9",
        "parent_id": "t3_vjbei9"
    },
    {
        "comment_id": "idgmgkw",
        "subreddit": "books",
        "body": "It's so fun- sounds kinda like a harpsichord through a metal grate.",
        "time": "2022-06-23 18:26:20 UTC",
        "score": 32,
        "link_id": "t3_viv9kn",
        "parent_id": "t1_idglc3n"
    },
    {
        "comment_id": "idf7l40",
        "subreddit": "books",
        "body": "I just have them on the top shelf of my bookshelf and when someone looks at my books I say, \"the ones on top are all signed!\"",
        "time": "2022-06-23 12:19:55 UTC",
        "score": 4,
        "link_id": "t3_vivibf",
        "parent_id": "t3_vivibf"
    },
    {
        "comment_id": "idf7eki",
        "subreddit": "books",
        "body": "Rocky is definitely one of my all time favorite characters. I second the recommendation to listen to the audiobook.",
        "time": "2022-06-23 12:18:13 UTC",
        "score": 327,
        "link_id": "t3_viv9kn",
        "parent_id": "t3_viv9kn"
    },
    {
        "comment_id": "ics3bhf",
        "subreddit": "books",
        "body": "The first 5, imo, and then some of the other vampire's stories are so good. The second book is great bc you see the first one from Lestat's pov as well as learn their history.",
        "time": "2022-06-18 00:38:36 UTC",
        "score": 2,
        "link_id": "t3_vetsya",
        "parent_id": "t3_vetsya"
    },
    {
        "comment_id": "icpldik",
        "subreddit": "books",
        "body": "I loved Conclave. Gonna have to add these to my TBR!",
        "time": "2022-06-17 14:04:16 UTC",
        "score": 1,
        "link_id": "t3_vedomc",
        "parent_id": "t3_vedomc"
    },
    {
        "comment_id": "ickojeo",
        "subreddit": "books",
        "body": "So, just an FYI, this is the new \"lay in bed and be embarrassed\" moment of my life.",
        "time": "2022-06-16 12:24:46 UTC",
        "score": 2,
        "link_id": "t3_vcpwwa",
        "parent_id": "t1_icilww6"
    },
    {
        "comment_id": "icik5a2",
        "subreddit": "books",
        "body": "Oh. I did. F*ck. My bad. Now it all makes sense. And thanks, I do love me my Libby hold pile. And I love to advocate it and a Brooklyn out of state card. Paid for itself a squillion times over.\n\nI am embarrassed and sorry. I was... well... my brain is clearly not firing. In my (weak) defense, my baby doesn't sleep so I don't either. I feel like a tool.",
        "time": "2022-06-15 23:01:09 UTC",
        "score": 2,
        "link_id": "t3_vcpwwa",
        "parent_id": "t1_icij4n0"
    },
    {
        "comment_id": "iciixo5",
        "subreddit": "books",
        "body": "I got it the idea from the title of your original post",
        "time": "2022-06-15 22:51:47 UTC",
        "score": 2,
        "link_id": "t3_vcpwwa",
        "parent_id": "t1_icig9ub"
    },
    {
        "comment_id": "icif25p",
        "subreddit": "books",
        "body": "I didn't say your TBR had to be all purchased. And, I mentioned I use the library as well in my initial post.\n\nYour first post is shitting all over people who buy lots of books and like, why? If they can afford it and it brings them happiness, why do you have to he all pretentious about what books people should buy? Or be all pissy they aren't exclusively utilizing their library?",
        "time": "2022-06-15 22:22:31 UTC",
        "score": 1,
        "link_id": "t3_vcpwwa",
        "parent_id": "t1_ici7ajx"
    },
    {
        "comment_id": "ici660p",
        "subreddit": "books",
        "body": "I have tons of books on hold, too. I even purchased an out of state Brooklyn library card to have more selection and hold slots. But back in the before Covid times, there was nothing as relaxing and wonderful as sipping a coffee from the Cafe and browsing the bookstore to grab a couple books. And buying a book, oh man, I can't WAIT for my daughter to discover my Kindle library when she's older. \n\nWhy are you so anti book ownership? My most treasured possession is my deceased mother's battered copy of Sense & Sensibility. People can own books they plan to read AND borrow from a library.",
        "time": "2022-06-15 21:17:41 UTC",
        "score": 1,
        "link_id": "t3_vcpwwa",
        "parent_id": "t1_ici3r9n"
    },
    {
        "comment_id": "icfzvf8",
        "subreddit": "books",
        "body": "Sometimes you need the right mood for a book, like music. You have to have a varied and stocked TBR pile.\n\nAnd purchasing helps fund bookstores and authors. I have tons of books AND utilize my library.",
        "time": "2022-06-15 11:47:21 UTC",
        "score": 36,
        "link_id": "t3_vcpwwa",
        "parent_id": "t3_vcpwwa"
    },
    {
        "comment_id": "icd4kz6",
        "subreddit": "books",
        "body": "And all the stress from Umbridge makes you want to tear your skin off",
        "time": "2022-06-14 19:10:58 UTC",
        "score": 1,
        "link_id": "t3_vc2ss6",
        "parent_id": "t1_icd1dvs"
    },
    {
        "comment_id": "icd14qs",
        "subreddit": "books",
        "body": "At least most of us agree on OOP! I'm listening to the audio books and excited to be at book 3 bc it and 4 are stellar but then... the big slump",
        "time": "2022-06-14 18:47:08 UTC",
        "score": 1,
        "link_id": "t3_vc2ss6",
        "parent_id": "t1_iccwvyb"
    },
    {
        "comment_id": "iccjva8",
        "subreddit": "books",
        "body": "Oh no. They are, in order of best to worst:\nHBP\nGOF\nPOA\nDH\nSS\nCOS\nOOP",
        "time": "2022-06-14 16:49:39 UTC",
        "score": 4,
        "link_id": "t3_vc2ss6",
        "parent_id": "t1_iccbuq7"
    },
    {
        "comment_id": "icbwos9",
        "subreddit": "books",
        "body": "That's the best one of the series! Enjoy.your first time reading it- I'm jealous.",
        "time": "2022-06-14 14:07:18 UTC",
        "score": 8,
        "link_id": "t3_vc2ss6",
        "parent_id": "t1_icbsgny"
    },
    {
        "comment_id": "icbfj8i",
        "subreddit": "books",
        "body": "I don't think it will be a big success because there's no way the final volume will be released. I've read all of them thus far and have no intention of reading WoW.",
        "time": "2022-06-14 11:30:26 UTC",
        "score": 6,
        "link_id": "t3_vbq0z8",
        "parent_id": "t3_vbq0z8"
    },
    {
        "comment_id": "ic8r66u",
        "subreddit": "books",
        "body": "\nTranscribe the parts with it mentioned in Google translate.",
        "time": "2022-06-13 19:59:56 UTC",
        "score": 2,
        "link_id": "t3_vbkrc5",
        "parent_id": "t3_vbkrc5"
    },
    {
        "comment_id": "ibrqztx",
        "subreddit": "books",
        "body": "Hoopla and Libby both have the option to read without downloading on your phone and are free with a library card.",
        "time": "2022-06-09 19:52:41 UTC",
        "score": 1,
        "link_id": "t3_v8p8l0",
        "parent_id": "t3_v8p8l0"
    },
    {
        "comment_id": "ibqkxs9",
        "subreddit": "books",
        "body": "*Due\n\nPlease make sure your book is edited.\n\nGrassroots on your insta account?\n\n(Edit to add actual helpfulness instead of just a sh*tty comment- have a headache and was uncharacteristically feeling mean. My apologies.)",
        "time": "2022-06-09 14:55:19 UTC",
        "score": 1,
        "link_id": "t3_v8icvw",
        "parent_id": "t3_v8icvw"
    },
    {
        "comment_id": "ibq9bcp",
        "subreddit": "books",
        "body": "I felt the same as you. Let down and the payoff at the end wasn't enough to make it worth it.",
        "time": "2022-06-09 13:25:22 UTC",
        "score": 2,
        "link_id": "t3_v8gfbj",
        "parent_id": "t3_v8gfbj"
    },
    {
        "comment_id": "ibq75f5",
        "subreddit": "books",
        "body": "Kinda- if it has less than 250 pages, I'm not paying the usual $14.99 Kindle price for it. I don't try to get huge books, but I avoid ones barely out of the novella category unless I've heard absolutely amazing things about them.",
        "time": "2022-06-09 13:06:38 UTC",
        "score": 2,
        "link_id": "t3_v8g7kp",
        "parent_id": "t3_v8g7kp"
    },
    {
        "comment_id": "ibn0b22",
        "subreddit": "books",
        "body": "This is what was torn out in Dead Poet's, yes?",
        "time": "2022-06-08 18:29:55 UTC",
        "score": 0,
        "link_id": "t3_v7w5zr",
        "parent_id": "t1_ibmzm7m"
    },
    {
        "comment_id": "ibe4qfr",
        "subreddit": "books",
        "body": "Heartbreaking Work of Staggering Genius",
        "time": "2022-06-06 17:59:06 UTC",
        "score": 2,
        "link_id": "t3_v655jc",
        "parent_id": "t3_v655jc"
    },
    {
        "comment_id": "iawxd0s",
        "subreddit": "books",
        "body": "I read her Marie Antionette biography, I should see what others she has!",
        "time": "2022-06-02 14:15:27 UTC",
        "score": 2,
        "link_id": "t3_v35dbm",
        "parent_id": "t1_iawp21e"
    },
    {
        "comment_id": "iawlcup",
        "subreddit": "books",
        "body": "The Six Wives of Henry VIII by Alison Weir\n\nHer fictionalized versions are not so great but her non fiction buographies- amazing.",
        "time": "2022-06-02 12:35:55 UTC",
        "score": 4,
        "link_id": "t3_v35dbm",
        "parent_id": "t3_v35dbm"
    },
    {
        "comment_id": "ias2uxi",
        "subreddit": "books",
        "body": "I think my username can answer my opinion on that...",
        "time": "2022-06-01 12:38:43 UTC",
        "score": 8,
        "link_id": "t3_v289xo",
        "parent_id": "t3_v289xo"
    },
    {
        "comment_id": "iaovig3",
        "subreddit": "books",
        "body": "No, but I can check for you if you message me the list!",
        "time": "2022-05-31 18:12:58 UTC",
        "score": 1,
        "link_id": "t3_uz0hfb",
        "parent_id": "t1_iaoshcp"
    },
    {
        "comment_id": "ianm58k",
        "subreddit": "books",
        "body": "They were so good- I loved them!",
        "time": "2022-05-31 12:33:19 UTC",
        "score": 2,
        "link_id": "t3_v1nyd4",
        "parent_id": "t3_v1nyd4"
    },
    {
        "comment_id": "iagsgt2",
        "subreddit": "books",
        "body": "100 pages minus my age. The order I get, the less time I have for something I don't enjoy. When I was 16, I had the energy to invest 84 pages, now I only have to put up with 59.",
        "time": "2022-05-29 20:23:25 UTC",
        "score": 3,
        "link_id": "t3_v0javx",
        "parent_id": "t3_v0javx"
    },
    {
        "comment_id": "ia7z2em",
        "subreddit": "books",
        "body": "Or pay $50 for an out of state Brooklyn Library Card for Libby- sooo worth it. Wait times for holds were halved, sooo many books that were unavailable at my usual were available- it's paid for itself multiple times.",
        "time": "2022-05-27 18:05:29 UTC",
        "score": 22,
        "link_id": "t3_uz0hfb",
        "parent_id": "t1_ia7bjwt"
    },
    {
        "comment_id": "ia7yup4",
        "subreddit": "books",
        "body": "Even cheaper with cheaper shipping on Ebay!",
        "time": "2022-05-27 18:03:57 UTC",
        "score": 1,
        "link_id": "t3_uz0hfb",
        "parent_id": "t1_ia7b0m7"
    },
    {
        "comment_id": "ia6ob9c",
        "subreddit": "books",
        "body": "This book was like a warm cup of tea for my soul. I loved it. Sometimes you just need a happy, non stressful read.",
        "time": "2022-05-27 12:24:36 UTC",
        "score": 64,
        "link_id": "t3_uyua5l",
        "parent_id": "t3_uyua5l"
    },
    {
        "comment_id": "i9gx818",
        "subreddit": "books",
        "body": "It absolves me to DNF a book. Too many good ones to put time into one I'm not enjoying.",
        "time": "2022-05-21 17:14:24 UTC",
        "score": 3,
        "link_id": "t3_uup1u9",
        "parent_id": "t3_uup1u9"
    },
    {
        "comment_id": "i9fxe1p",
        "subreddit": "books",
        "body": "Project Hail Mary",
        "time": "2022-05-21 12:18:59 UTC",
        "score": 0,
        "link_id": "t3_uui3iz",
        "parent_id": "t3_uui3iz"
    },
    {
        "comment_id": "i94s6sq",
        "subreddit": "books",
        "body": "Goodreads recommends books and if you click that you've read it, you get prompted to review it. So when I first signed up, it probably showed I gave stars to 100s of books within a week from 30 plus years of reading.",
        "time": "2022-05-18 22:42:00 UTC",
        "score": 2,
        "link_id": "t3_usm5yd",
        "parent_id": "t3_usm5yd"
    },
    {
        "comment_id": "i8q9ycp",
        "subreddit": "books",
        "body": "Ugh, I felt the same. I must have missed something since everyone says what a masterpiece it is, but it was just excruciating and, despite being relatively short, took herculean will to finish.",
        "time": "2022-05-15 19:18:55 UTC",
        "score": 7,
        "link_id": "t3_uqahyu",
        "parent_id": "t3_uqahyu"
    },
    {
        "comment_id": "i8hps0l",
        "subreddit": "books",
        "body": "He sure did! And your books were easy to make a great audio of being amazing themselves!",
        "time": "2022-05-13 19:45:35 UTC",
        "score": 4,
        "link_id": "t3_uovpac",
        "parent_id": "t1_i8hnkxd"
    },
    {
        "comment_id": "i8gy2l3",
        "subreddit": "books",
        "body": "Simon Vance!",
        "time": "2022-05-13 16:37:28 UTC",
        "score": 35,
        "link_id": "t3_uovpac",
        "parent_id": "t3_uovpac"
    },
    {
        "comment_id": "i8bkf08",
        "subreddit": "books",
        "body": "I also dnfd. Got about 50 pages in, wasn't connecting, donating it to the book exchange at the local pharmacy.",
        "time": "2022-05-12 14:19:20 UTC",
        "score": 3,
        "link_id": "t3_uo07kq",
        "parent_id": "t3_uo07kq"
    },
    {
        "comment_id": "i833pc6",
        "subreddit": "books",
        "body": "One of the few movies as good if not better than the book- I definitely second watching the movie then reading.",
        "time": "2022-05-10 18:58:56 UTC",
        "score": 7,
        "link_id": "t3_umnfz9",
        "parent_id": "t3_umnfz9"
    },
    {
        "comment_id": "i7t2cyq",
        "subreddit": "books",
        "body": "Looked it up on Amazon, it's so cute. It would make a great Board Book.",
        "time": "2022-05-08 15:33:37 UTC",
        "score": 1,
        "link_id": "t3_ul41hm",
        "parent_id": "t3_ul41hm"
    },
    {
        "comment_id": "i7srxbp",
        "subreddit": "books",
        "body": "Absolutely",
        "time": "2022-05-08 14:13:54 UTC",
        "score": 8,
        "link_id": "t3_ul2fv7",
        "parent_id": "t3_ul2fv7"
    },
    {
        "comment_id": "i6tm2u9",
        "subreddit": "books",
        "body": "Christopher Pike wasn't known for his literary prowess. They're cheap, YA, horror/supernatural books from the 90s. Like Stephen King for middle school. I read the hell out of him when I was young but certainly don't recommend him for anyone over the age of 14ish.",
        "time": "2022-04-30 19:16:50 UTC",
        "score": 12,
        "link_id": "t3_ufhkn7",
        "parent_id": "t3_ufhkn7"
    },
    {
        "comment_id": "i6kt42v",
        "subreddit": "books",
        "body": "Once I had my daughter, my reading time tanked and I went from over a hundred books a year to maybe two a month if I read while she's napping. It has changed my relationship to reading so so much. Having to meander through a book, having time for it to marinate and resonate before picking it back up, I've always loved reading but now it's so much better. I'll DNF bc I have such limited reading time, I'm not wasting it. Slowing down and savoring is so enjoyable and I hope I keep the habit of reading that way once my baby is older and I have more time.",
        "time": "2022-04-28 20:17:29 UTC",
        "score": 157,
        "link_id": "t3_ue3x1p",
        "parent_id": "t3_ue3x1p"
    },
    {
        "comment_id": "i5uzsf9",
        "subreddit": "books",
        "body": "There's a book called Paperback Crush about the series of books like that in the 80s & 90s.",
        "time": "2022-04-23 09:53:18 UTC",
        "score": 14,
        "link_id": "t3_ua1t0i",
        "parent_id": "t3_ua1t0i"
    },
    {
        "comment_id": "i5f53br",
        "subreddit": "books",
        "body": "I was really disappointed with it,  too.",
        "time": "2022-04-20 00:48:24 UTC",
        "score": 9,
        "link_id": "t3_u7j7hb",
        "parent_id": "t3_u7j7hb"
    },
    {
        "comment_id": "i50yfll",
        "subreddit": "books",
        "body": "Not true for every one with mental health issues- I have debilitating (and diagnosed) OCD and GAD and was suffering perinatal depression and this book was a warm salve to my psyche.\n\nI get it may not help everyone, but it has helped me and others. I wouldn't substitute my medication for the book, but it let some much needed sun in when I needed it the most. \n\n(I specified my ocd and gad is diagnosed because so many people diagnose themselves for typical human anxieties and because it was the quirky cool diagnosis in the 90s- I was hospitaized for that sh*t, it's no fun.)",
        "time": "2022-04-17 00:56:12 UTC",
        "score": 23,
        "link_id": "t3_u537jv",
        "parent_id": "t1_i501icl"
    },
    {
        "comment_id": "i47ofgj",
        "subreddit": "books",
        "body": "Yeah, if you don't like book 2, stop now. Book 3 just jumped the shark and was insane. Unsatisfactory is a GREAT way to describe it. It was very WTF.",
        "time": "2022-04-10 21:17:20 UTC",
        "score": 4,
        "link_id": "t3_u0n8b3",
        "parent_id": "t3_u0n8b3"
    },
    {
        "comment_id": "i3wn1ue",
        "subreddit": "books",
        "body": "I absolutely loved it and gifted it to a friend who is an author and it's one of her favorites. I was in a bad reading slump, nothing could hold my attention, picked up Invisible Life and could not put it down. I'll check out some of your recs that I haven't already read. Thanks for the post!",
        "time": "2022-04-08 14:42:50 UTC",
        "score": 8,
        "link_id": "t3_tyvp4c",
        "parent_id": "t3_tyvp4c"
    },
    {
        "comment_id": "i2lntda",
        "subreddit": "books",
        "body": "I'll also try for free, I'll buy my own book, I'll just need a bookclub to join!",
        "time": "2022-03-29 19:04:39 UTC",
        "score": 2,
        "link_id": "t3_trddsh",
        "parent_id": "t3_trddsh"
    },
    {
        "comment_id": "i2fsjkz",
        "subreddit": "books",
        "body": "It's so hard to lose one. We had a huge surgery for Buttons and he just didn't bounce back and the vet said the cancer would be back. It was so so hard. I'm so sorry to hear about Biscuit, sounds like he had a great life and was very loved- most cats with FIV don't get that, what a lucky boy he was.",
        "time": "2022-03-28 14:02:17 UTC",
        "score": 3,
        "link_id": "t3_tpx03m",
        "parent_id": "t1_i2fnwvx"
    },
    {
        "comment_id": "i2dqpmg",
        "subreddit": "books",
        "body": "Midnight Library - the chapter with her cat. Read it shortly after putting my best guy, Buttons, down at age 5 from an aggressive cancer. Cathartic, even healing, but boy was I a mess!",
        "time": "2022-03-28 00:55:21 UTC",
        "score": 19,
        "link_id": "t3_tpx03m",
        "parent_id": "t3_tpx03m"
    },
    {
        "comment_id": "i2bc6mk",
        "subreddit": "books",
        "body": "You choose one book out of 5 (now 7). You don't get all the books for $14.99 you get one.\n\nEdit - also the books are made specifically for BoTM, the hardback are embossed so I think manufacturing is cheaper as well.",
        "time": "2022-03-27 14:07:44 UTC",
        "score": 106,
        "link_id": "t3_tpkfdx",
        "parent_id": "t3_tpkfdx"
    },
    {
        "comment_id": "i22e3ci",
        "subreddit": "books",
        "body": "Also, I'm in my 40s and when we lost my best boy, Buttons, we bought a blanket of a black cat on a starry background and still refer to it as the Buttons StarClan blanket.",
        "time": "2022-03-25 14:03:46 UTC",
        "score": 1,
        "link_id": "t3_tn81if",
        "parent_id": "t3_tn81if"
    },
    {
        "comment_id": "i2022jn",
        "subreddit": "books",
        "body": "Right? I was 35ish when I read it and I wrapped around my cat and sobbed. I made my husband read the set and came home to him sitting with tears down his face from that part, too.",
        "time": "2022-03-25 00:06:21 UTC",
        "score": 2,
        "link_id": "t3_tn81if",
        "parent_id": "t1_i1zwdxf"
    },
    {
        "comment_id": "i1zvgjy",
        "subreddit": "books",
        "body": "I read the first trilogy, but >!Silverstream!< made me cry so hard. So I stopped at the end of those 3 and a few of the short stories, like Tigerpaw's dad's story, but again, too many tears.",
        "time": "2022-03-24 23:17:38 UTC",
        "score": 17,
        "link_id": "t3_tn81if",
        "parent_id": "t3_tn81if"
    },
    {
        "comment_id": "i1t1287",
        "subreddit": "books",
        "body": "That too- I loved some of his essays, bought IJ, and forced myself to finish it assuming something redeeming would happen. It's my most hated book I've ever finished.",
        "time": "2022-03-23 15:30:30 UTC",
        "score": 3,
        "link_id": "t3_tktn2q",
        "parent_id": "t1_i1svnmg"
    },
    {
        "comment_id": "i1suqbm",
        "subreddit": "books",
        "body": "There's too many to name. Every time I mention it in a post like this, someone posts something different- which I think says a lot about the amount of disturbing images.",
        "time": "2022-03-23 14:49:39 UTC",
        "score": 18,
        "link_id": "t3_tktn2q",
        "parent_id": "t1_i1sq6lz"
    },
    {
        "comment_id": "i1spivf",
        "subreddit": "books",
        "body": "Infinite Jest - some of the scenes I read still loop terror in my brain.",
        "time": "2022-03-23 14:14:48 UTC",
        "score": 34,
        "link_id": "t3_tktn2q",
        "parent_id": "t3_tktn2q"
    },
    {
        "comment_id": "i1oa75y",
        "subreddit": "books",
        "body": "I love your username! Three of the best things in life!",
        "time": "2022-03-22 15:50:49 UTC",
        "score": 2,
        "link_id": "t3_tk4sjd",
        "parent_id": "t1_i1o87ss"
    },
    {
        "comment_id": "i1o7urr",
        "subreddit": "books",
        "body": "This is mine for 2022 as well. It's so bittersweet at times but also filled with so much humor and heart.",
        "time": "2022-03-22 15:35:22 UTC",
        "score": 2,
        "link_id": "t3_tk4sjd",
        "parent_id": "t1_i1o7f12"
    },
    {
        "comment_id": "i1o48y1",
        "subreddit": "books",
        "body": "Wow! That was an amazingly thorough answer- thank you!",
        "time": "2022-03-22 15:11:27 UTC",
        "score": 3,
        "link_id": "t3_tk3xpw",
        "parent_id": "t1_i1o3b3e"
    },
    {
        "comment_id": "i1nz8l4",
        "subreddit": "books",
        "body": "I feel so stupid asking this question-\n\nIs there a difference between officially speed reading versus people who just naturally read quickly?",
        "time": "2022-03-22 14:37:30 UTC",
        "score": 14,
        "link_id": "t3_tk3xpw",
        "parent_id": "t3_tk3xpw"
    }
]