[
    {
        "comment_id": "lu7ande",
        "subreddit": "books",
        "body": "John Updike. He died briefly after becoming one of my favourite authors.",
        "time": "2024-10-28 16:51:57 UTC",
        "score": 1,
        "link_id": "t3_1gdqsvk",
        "parent_id": "t3_1gdqsvk"
    },
    {
        "comment_id": "lqike3t",
        "subreddit": "books",
        "body": "How is France not second or first on the list?\n\nVerne, Dumas, Balzac, Stendahl, Verlene, Proust, Faubert, Zola, Sartre, Saint-Exupery, Baudelaire, Sand, Heouellebecq, Ernaux, and unlike ru lit it didn't start and end within 70 years.",
        "time": "2024-10-05 20:53:28 UTC",
        "score": 1,
        "link_id": "t3_gi8ycv",
        "parent_id": "t3_gi8ycv"
    },
    {
        "comment_id": "lk5eh27",
        "subreddit": "books",
        "body": "That's post-modern literature for you.",
        "time": "2024-08-27 09:38:39 UTC",
        "score": 1,
        "link_id": "t3_1f2a3de",
        "parent_id": "t1_lk4yx3l"
    },
    {
        "comment_id": "lk5e7ge",
        "subreddit": "books",
        "body": "The End of Eternity – humanity has discovered a solution to all of its problems, like hunger, illness, war, genocide, war, but the main character, after contemplating for half of the book, decides to give it all away, because life is way too predetermined this way, and people should just live their own life. Also, he has reliable info that Infinity (the world in all times) would fall apart if he acts the way he eventually does. 🤷",
        "time": "2024-08-27 09:35:42 UTC",
        "score": 6,
        "link_id": "t3_1f2a3de",
        "parent_id": "t3_1f2a3de"
    },
    {
        "comment_id": "liojlhd",
        "subreddit": "books",
        "body": "\"The Years\" is absolutely wonderful imo. I am currently reading it and the concept is so thrilling to me – a history of a nation through para-personal experiences, but it would do nothing if the writing were not so brilliant.\n\nI have an idea why it felt weird to you, though. From the rest of your post it seems that you are a fast reader, while \"The Years\" felt more like a poetry book to me, and I decided to only read a few pages per day. That feels like the right pace to be able to appreciate it.\n\nI came upon this post because I was looking for recommendations about similar books about other nations, because I would be really interested to read some of those after I am done with this book.\n\nDid it grow on you after writing the post? Did you finish it?",
        "time": "2024-08-18 06:41:19 UTC",
        "score": 2,
        "link_id": "t3_190t6v8",
        "parent_id": "t3_190t6v8"
    },
    {
        "comment_id": "lhn1jus",
        "subreddit": "books",
        "body": "No way! I wonder if there is another book that was included by mistake instead of the novel inside the novel, and what it was called!",
        "time": "2024-08-11 20:13:13 UTC",
        "score": 0,
        "link_id": "t3_37mkhq",
        "parent_id": "t1_cro3ja8"
    }
]