[
    {
        "comment_id": "m01xuuf",
        "subreddit": "books",
        "body": "Check out Max Gladstone, his *Craft Sequence* books, *Last Exit*, and *This is How You Lose the Time War*.  He completely avoids the issues you raise despite being male and often having female protagonists.",
        "time": "2024-12-02 16:17:18 UTC",
        "score": 1,
        "link_id": "t3_1h4yb1i",
        "parent_id": "t3_1h4yb1i"
    },
    {
        "comment_id": "ly6mh15",
        "subreddit": "books",
        "body": "The spy novel *Red Sparrow* has a lot of food descriptions, and the end of each chapter has a recipe for one of the foods mentioned in the chapter.",
        "time": "2024-11-21 01:54:53 UTC",
        "score": 1,
        "link_id": "t3_1gw36ki",
        "parent_id": "t3_1gw36ki"
    },
    {
        "comment_id": "ly26jga",
        "subreddit": "books",
        "body": "I’ve stuck to my guns on that one. \n\nI thought it was boring nostalgia-bait from the get-go and have not changed my opinion on it. \n\nThe fact that so many people loved it at first was silly to me, but even more silly was how not long after people over on r/PrintSF started denying it was ever one of the most commonly recommended books in the sub.",
        "time": "2024-11-20 06:10:44 UTC",
        "score": 3,
        "link_id": "t3_1gv1if7",
        "parent_id": "t1_lxyk08c"
    },
    {
        "comment_id": "lx62jhf",
        "subreddit": "books",
        "body": "I feel that this is a common misconception about young people’s capacity to understand things, as well as the point and power of discussion and communication. \n\nA person doesn’t have to grasp every detail of something understand the subject at hand and to pull out important points and lessons from it. Indeed, I’d suggest that sometimes in the context of a discussion oriented setting that’s actually slightly preferable as the participants don’t assume they know and understand everything and are thus perhaps more receptive to the discussion. \n\nAlso, this was a time and in a part of the country without the flurry of book banning and dumbing down of non-STEM type education topics that we have been seeing in the last couple of decades.",
        "time": "2024-11-14 23:09:33 UTC",
        "score": 1,
        "link_id": "t3_1gr3l07",
        "parent_id": "t1_lx56uo0"
    },
    {
        "comment_id": "lx2wyx7",
        "subreddit": "books",
        "body": "I went go high school in the late ‘80s.  Moved around a bit, so two different high schools.\n\nIt was required reading at both of my high schools, and was optional reading at one of the junior high schools I went to.",
        "time": "2024-11-14 13:05:23 UTC",
        "score": 8,
        "link_id": "t3_1gr3l07",
        "parent_id": "t1_lx2tpks"
    },
    {
        "comment_id": "lvwebwo",
        "subreddit": "books",
        "body": "This sort of thing is exactly why so many people love Neal Stephenson’s books.  This is one of his signature moves.",
        "time": "2024-11-07 14:17:57 UTC",
        "score": 4,
        "link_id": "t3_1glp896",
        "parent_id": "t3_1glp896"
    },
    {
        "comment_id": "luppwdd",
        "subreddit": "books",
        "body": "Yeah, and it’s not like he’s not writing or working.  He has written a lot during that time, just on other stuff.  He has a lot of irons in the fire.",
        "time": "2024-10-31 15:58:59 UTC",
        "score": 1,
        "link_id": "t3_1gg0dmp",
        "parent_id": "t1_lulzifq"
    },
    {
        "comment_id": "lt60fjr",
        "subreddit": "books",
        "body": "It varies, but I often read them first.\n\nIf it’s an analysis of the book by a different person I’ll read a bit to see what they’re saying and if I want to read it before reading the book, but if it’s from the author themselves I’ll usually find it first.",
        "time": "2024-10-22 13:08:35 UTC",
        "score": 1,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "lsoq4bi",
        "subreddit": "books",
        "body": "The protagonist gets *far* more annoying as the series progresses.",
        "time": "2024-10-19 14:04:31 UTC",
        "score": 14,
        "link_id": "t3_1g771ul",
        "parent_id": "t1_lsoikbh"
    },
    {
        "comment_id": "lsopz4m",
        "subreddit": "books",
        "body": "Not really.  \n\nIt’s more banal low-grade angsty teenage crush type stuff where nothing ever happens, combined with constantly searching for approval and acceptance.",
        "time": "2024-10-19 14:03:35 UTC",
        "score": 16,
        "link_id": "t3_1g771ul",
        "parent_id": "t1_lso85f7"
    },
    {
        "comment_id": "lrvnzwk",
        "subreddit": "books",
        "body": "Depends on the book and what else is going on.\n\nUsually it’s at minimum a chapter before a ‘break’, but that more because something comes up as need to deal with, not because I’m taking a break.\n\nIf it’s a book I’m really enjoying and I have the time I’ll go through a 300-400 page book in one sitting.\n\nIf it’s something I’m not really enjoying at the moment, or I’m distracted, I can find myself looking for an excuse to put the book down and do something else.",
        "time": "2024-10-14 14:21:11 UTC",
        "score": 1,
        "link_id": "t3_1g3fun9",
        "parent_id": "t3_1g3fun9"
    },
    {
        "comment_id": "lrl34f8",
        "subreddit": "books",
        "body": "I read it as a teen back in the ‘80s and loved it.\n\nRead a bunch of his other books as well and for me this one stays pretty high ranking.",
        "time": "2024-10-12 16:24:12 UTC",
        "score": 9,
        "link_id": "t3_1g1y303",
        "parent_id": "t3_1g1y303"
    },
    {
        "comment_id": "lrbru8c",
        "subreddit": "books",
        "body": "Having been a teen in the ‘80s I found to to be way too full of attempts at ‘80s nostalgia, but it came across as being written by someone who never really experienced the ‘80s, so they only hit the most well known aspects of it.",
        "time": "2024-10-10 22:50:11 UTC",
        "score": 1,
        "link_id": "t3_1g0hidx",
        "parent_id": "t1_lr9i2mm"
    },
    {
        "comment_id": "lr9dw4e",
        "subreddit": "books",
        "body": "To be fair, it was a pretty crap book too, but I 100% agree about the movie.",
        "time": "2024-10-10 14:57:20 UTC",
        "score": 1,
        "link_id": "t3_1g0hidx",
        "parent_id": "t1_lr8rtlc"
    },
    {
        "comment_id": "lr9dj52",
        "subreddit": "books",
        "body": "This is an extremely unpopular opinion, but the *Lord of the Rings* trilogy.\n\nThe first movie was pretty good.  Cutting Bombadil and abbreviating some things made sense, but the subsequent movies went further and further off the rails with all sorts of unnecessary BS, character changes, etc.\n\nAnd the *Hobbit* movies…. ugh.",
        "time": "2024-10-10 14:55:21 UTC",
        "score": 1,
        "link_id": "t3_1g0hidx",
        "parent_id": "t3_1g0hidx"
    },
    {
        "comment_id": "lqrok0y",
        "subreddit": "books",
        "body": "Yep, and rereading books is a good thing.",
        "time": "2024-10-07 12:42:59 UTC",
        "score": 25,
        "link_id": "t3_1fy1x3w",
        "parent_id": "t1_lqr1882"
    },
    {
        "comment_id": "lqpxl4t",
        "subreddit": "books",
        "body": "This is one of the key reasons to reread books, even ones you’ve read as an adult. \n\nYou *never* get all the layers on the first pass.",
        "time": "2024-10-07 02:42:48 UTC",
        "score": 2,
        "link_id": "t3_1fxo060",
        "parent_id": "t3_1fxo060"
    }
]