[
    {
        "comment_id": "lzat6aa",
        "subreddit": "books",
        "body": "Yes actually. I just have to laugh at a movie like The Last Samurai where the last samurai just had to be a white guy. I'd argue the main reason such media is less common is that I live in North America so most media is set in North America or maybe Europe where white people are pretty bog standard, as opposed to Africa or Asia.\n\nOne could argue that more media ought to be set in the other continents. If that was the case I bet white people in the wrong setting would stick out way more often.",
        "time": "2024-11-27 20:36:39 UTC",
        "score": 2,
        "link_id": "t3_1h193zy",
        "parent_id": "t1_lz9xua7"
    },
    {
        "comment_id": "lwvu9e1",
        "subreddit": "books",
        "body": "> But I dont have the trendy games so therefore am not a gamer. And neither is my mom who has played Halo for decades. \n\nI'd be really shocked if your mom wasn't considered a gamer as a Halo player, even by \"that\" sort of gamer.",
        "time": "2024-11-13 07:24:07 UTC",
        "score": 8,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t1_lwv7o8z"
    },
    {
        "comment_id": "lwvtyp0",
        "subreddit": "books",
        "body": "I feel like boys are afraid of seeming girly. Many of us at some point would've been made fun of at some point if we liked something cute, something pink, a TV show with all-girl main characters, etc. I never got the sense that girls were nearly as averse to the equivalent thing.",
        "time": "2024-11-13 07:20:56 UTC",
        "score": 6,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t1_lwuumb5"
    },
    {
        "comment_id": "luwxvt4",
        "subreddit": "books",
        "body": "One could interpret the noun \"problem\" to refer to a societal problem, or a literal human. Notice which one you chose.",
        "time": "2024-11-01 20:26:55 UTC",
        "score": 1,
        "link_id": "t3_1gh3474",
        "parent_id": "t1_luvdg3k"
    },
    {
        "comment_id": "lnp0x47",
        "subreddit": "books",
        "body": "Just look at the way they cited the \"aesthetics is objective\" part. It's a plurality that has less than 10% more votes (3% difference in total) than the opposing view. That is hardly the decisive survey that one would use to argue that point. Besides, I bet plenty of philosophers in both camps would have plenty more nuanced things to say and that commenter is misinterpreting what that statement even means. The mere-3%-difference alone stinks extremely of someone looking for a statistic to support their view and pulling the first thing they see without thinking.",
        "time": "2024-09-18 06:06:47 UTC",
        "score": 7,
        "link_id": "t3_1fjas77",
        "parent_id": "t1_lnotqz9"
    },
    {
        "comment_id": "lnp0775",
        "subreddit": "books",
        "body": "Ah, nothing like twisting someone's words to sound as stupid as possible.",
        "time": "2024-09-18 05:59:10 UTC",
        "score": 1,
        "link_id": "t3_1fjas77",
        "parent_id": "t1_lnoxnpr"
    },
    {
        "comment_id": "lnozm91",
        "subreddit": "books",
        "body": "I will always disagree with TV or any other comparison to today's technology. We are much better able to capture people's attention now in ways that were never feasible before. When you look at YouTube, know that every little element on your screen goes through testing where variations on the design—like shape, placement, colour, or bigger design changes—are served to each person, and stuff like watch time and where your cursor goes are automatically recorded, so that the webpage can be absolutely optimized to keep you there as long as possible. Or the video makers themseves: Things targeting kids in more nefarious ways were sorta limited when kids were mostly watching cartoons that hadn't really degenerated into the stuff we see today, I mean for example, ads weren't so mixed in with kids shows like they are in IG/TikTok/etc., and there was a significant emphasis in many shows to have some moral lesson to teach kids rather than absolute mindless entertainment. And the turn-around time is so much shorter, and once again the metrics they have available are so much better.\n\nSecondly, just because we've been through many generations of \"this rots kids' brains!\" tech doesn't mean there hasn't historically been some element of truth for it. We can look back now and say that whatever we lost was outweighed by whatever we gained, but there isn't any guarantee by the universe, math, biology, whatever, that it will be true forever.",
        "time": "2024-09-18 05:53:02 UTC",
        "score": 38,
        "link_id": "t3_1fjas77",
        "parent_id": "t1_lnnt94u"
    },
    {
        "comment_id": "lmg0hnb",
        "subreddit": "books",
        "body": "The times I've seen it mentioned here it's the prevailing opinion.\n\nI'm absolutely stunned at the Goodreads rating, but it does prove to me that, without a doubt, the ratings are useless. I think those books that are popular on social media have a psychological bandwagoning sorta effect, where people feel like they're supposed to like something, because they see other TikTokers liking it, and they give in and like it too. I truly believe it has to be something like that because god, I thought this book was absolutely atrocious that to me, it crosses far beyond the line of, \"other people like different things\" to \"this is trash\" lol.",
        "time": "2024-09-10 14:39:22 UTC",
        "score": 5,
        "link_id": "t3_1fdg1il",
        "parent_id": "t1_lmffueh"
    },
    {
        "comment_id": "lkoon55",
        "subreddit": "books",
        "body": "I agree. It is absolutely bonkers that people go along with his infatuation with Putin. I could think of a few other examples of stupid shit he says, which the right ought to find egregious, but they pale in comparison to this.",
        "time": "2024-08-30 15:22:52 UTC",
        "score": 2,
        "link_id": "t3_1f4mere",
        "parent_id": "t1_lkn5mlh"
    },
    {
        "comment_id": "lhx6uzq",
        "subreddit": "books",
        "body": "> not a mob where if you slay a peasant, 5 new angry peasants take their place\n\nDoesn't really work that way, because regular untrained people are easily routed.\n\nAnyway, the rest of the reasons seem pretty possible to me though. This didn't bother me.",
        "time": "2024-08-13 15:15:25 UTC",
        "score": 1,
        "link_id": "t3_1epud44",
        "parent_id": "t1_lhq5sl4"
    },
    {
        "comment_id": "l362bcs",
        "subreddit": "books",
        "body": "I donated this one to the recycle bin. Picked it up when I asked for a recommendation at the bookstore.\n\nI have some hatred for twists where, OH, THE UNRELIABLE NARRATOR DID IT!!! How unsurprising. Am I supposed to feel like I *am* the narrator, and therefore would know idunnit? Or should it be like the narrator is talking to me... from his prison cell... in which case obviously it was him?\n\nI haven't read much ever since I graduated from school. I try for a few books a year so it was pretty damn disappointing to spend a moment on something soooooooo bad. Love seeing people hate on it though, which almost makes it worth it.",
        "time": "2024-05-08 18:37:31 UTC",
        "score": 2,
        "link_id": "t3_1cn07pq",
        "parent_id": "t3_1cn07pq"
    },
    {
        "comment_id": "kvj75tu",
        "subreddit": "books",
        "body": "Etsy is like the ultimate crap version of that: too many mass-produced objects acting like they are handmade.\n\nAn interesting flipside though is, I've read from spooncarvers that their finer works often get skipped for their worse ones that are more obviously handmade.",
        "time": "2024-03-19 03:55:47 UTC",
        "score": 12,
        "link_id": "t3_1bhzv9e",
        "parent_id": "t1_kvhxrzf"
    },
    {
        "comment_id": "kjs25s0",
        "subreddit": "books",
        "body": "Haha I was so salty when I saw the review score on The Silent Patient. I got recommended it at a store and that honestly makes me feel bad when I hate on this book SO much, but I cannot deny how much I don't like it. I'm not a huge reader AND I bought it from them so I was quite disappointed.",
        "time": "2024-01-27 07:25:15 UTC",
        "score": 4,
        "link_id": "t3_1abp8yc",
        "parent_id": "t1_kjrud59"
    },
    {
        "comment_id": "kjrrin3",
        "subreddit": "books",
        "body": "> I intended to read these 2 books from him\n\nWHY\n\n> Naturally I'll be skipping it now.\n\nexcellent",
        "time": "2024-01-27 05:33:23 UTC",
        "score": 8,
        "link_id": "t3_1abp8yc",
        "parent_id": "t1_kjozgil"
    },
    {
        "comment_id": "kjm9ex3",
        "subreddit": "books",
        "body": "The Silent Patient. Honestly I thought it was atrocious but I hadn't read a book in a while so I figured I'd just be done with it. Should've quit at the start...",
        "time": "2024-01-26 05:20:18 UTC",
        "score": 1,
        "link_id": "t3_19fjk2g",
        "parent_id": "t3_19fjk2g"
    },
    {
        "comment_id": "khhbj8w",
        "subreddit": "books",
        "body": "It was interesting to read. It made me think of what it means to myself personally and why—especially because I'm more in the crowd that asks \"why?\" (only in my head) when I see a sex scene, usually. Thanks for writing your perspective too!",
        "time": "2024-01-12 05:54:20 UTC",
        "score": 2,
        "link_id": "t3_192pkyd",
        "parent_id": "t1_khhabmc"
    },
    {
        "comment_id": "khh80hd",
        "subreddit": "books",
        "body": "Not at the time of that comment. As somebody (tried to) use that quote, I think it's fair to consider it in a vacuum.\n\nMy immediate thought on reading your comment is, yes it's more prevalent that people judge each other for consuming content from \"problematic\" sources, but also, I think that's an age-old problem and I don't think people truly care that much, or they might alternatively cut off people who disagree. It's clear that the way people react to these things has changed a lot over even the past decade, but also I'm still not sure if that's truly because of capitalism or consumerism.\n\nIf you asked me (without considering that essay) what I'd pin the blame on, I personally feel it's the way social justice has been used in recent years. I mean that as in, there are plenty of people trying to take the moral high ground by being, for example, the anti-racist then weaponize that in discussions: a lot of discrediting people for random things they've said 10 years ago, and \"if you argue with us you're racist\", and \"you're a straight white male so your opinion doesn't matter\". And I think corporations are exploiting these values for PR/marketing purposes, and they *don't* want to be the subject of those people's attention by putting some risky stuff in. And they're the ones who make all the shit we consume. The topic of sex, sexuality, and of course not-fully-consensual stuff is a hot one, and I think that's enough to make corporations want to play it extra safe, especially if they don't think including a sex scene will make them more money.\n\nSo, finally, I had given it a read and mainly I felt the connection between sex scenes *in particular* (as opposed to everything in general seen as \"unsafe\" from a corporate eye as I meant by the previous paragraph) and capitalism/consumerism was tenuous. *As far as I could tell,* there wasn't a very strong logical or evidence-based link between them. What does it mean if AAA movies aren't depicting sex if people still consume lots of porn? However, I don't really feel like I understood the author very well either at quite a lot of points. I'm just too bad at reading or the author wrote a bit too obtusely (personally not a fan of the writing style and couldn't tell if some stuff was jargon... but didn't care enough to look it up). Either way, while I feel like I disagree with lots of the author's points and the premise, I don't think I could make a proper argument about it.",
        "time": "2024-01-12 05:22:42 UTC",
        "score": 2,
        "link_id": "t3_192pkyd",
        "parent_id": "t1_khasmkg"
    },
    {
        "comment_id": "kh8cvz3",
        "subreddit": "books",
        "body": "I haven't read The Hunger Games but that is kind of reminiscent of war movies. Even war movies/shows that are clearly somewhat anti-war will often, just by showing some weapons like rockets/grenade launchers/machine guns in their actual capabilities, look cool enough to ironically make people enjoy it. IMO that's no big deal as long as people don't turn their brains off to what's actually happening. monkey brain likes fire",
        "time": "2024-01-10 17:16:18 UTC",
        "score": 2,
        "link_id": "t3_192pkyd",
        "parent_id": "t1_kh4esz4"
    },
    {
        "comment_id": "kh84ovx",
        "subreddit": "books",
        "body": "I don't like that quote. I don't think society anywhere tells you that consuming is the *only* valuable/meaningful thing. Why do people care about politics or relationships then? The writer has mixed up society encouraging you to consume vs. society encouraging you *only* to consume.\n\nAnd I'm not sure how to prove that if consuming was the only valuable/meaningful thing, why it must then be a moral choice, other than the trivial (and reasonable) case of saying that everything is a moral choice.",
        "time": "2024-01-10 16:30:28 UTC",
        "score": 4,
        "link_id": "t3_192pkyd",
        "parent_id": "t1_kh7r7we"
    },
    {
        "comment_id": "kdhiojd",
        "subreddit": "books",
        "body": "Ahahahaha of course it's somebody in computer science.\n\nI say that as a guy with a computer science degree. God I don't know why there had to be so many stuck-up people in my program. It's funny even some people on the verge of failing would still want to lord over those pesky arts and science people. I remember some other CS people in a first-year geology lecture I was in, talking about how stupid rocks are while looking at the 60-something% they got on the midterm. Soooo annoying.",
        "time": "2023-12-15 16:52:00 UTC",
        "score": 20,
        "link_id": "t3_18iz2tq",
        "parent_id": "t1_kdgkrd9"
    },
    {
        "comment_id": "kcxr1us",
        "subreddit": "books",
        "body": "Yeah, you're probably right. I guess it felt weird to me to think about school teaching critical thinking. While in grade school I always felt like most people, in one way or another, circumvented having to do much critical thinking, instead trying, \"write what you think the teacher wants\". But yeah, surely fewer people would learn to critically think without that education and there's still something to learn even when the homework really is that degenerate.\n\n> unless it is straight hate speech\n\nThis sort of thinking is a great example of the problems in this whole post too though. Not to say kids should be taught that hate speech great but rather, many people damn near get rabid if they get the idea another person is racist for example. See in discussions relating to racism, even if nobody says anything that is racist, inevitably someone will accuse someone of being racism and therefore their argument is inherently wrong. And to relate it back to books, I've heard people saying they absolutely could not read a book about even mildly racist characters... but funny that murderers are still on the table.",
        "time": "2023-12-11 19:51:15 UTC",
        "score": 4,
        "link_id": "t3_18fq8my",
        "parent_id": "t1_kcxok97"
    },
    {
        "comment_id": "kcxo0yn",
        "subreddit": "books",
        "body": "Is it a matter of education? I feel like it's an emotional control problem more than a knowledge one: I think people understand this concept just fine (after all, most very popular stories have villains), but in today's world, media, social media, politics, etc. stoke outrage so much that people give in more easily to getting angry instead of trying to understand.",
        "time": "2023-12-11 19:31:59 UTC",
        "score": 4,
        "link_id": "t3_18fq8my",
        "parent_id": "t1_kcx4c7c"
    },
    {
        "comment_id": "kcxnkv9",
        "subreddit": "books",
        "body": "Sure they've experienced being at the bottom. But they might not be sympathetic because—in their mind—work hard and you'll be #2!",
        "time": "2023-12-11 19:29:05 UTC",
        "score": 11,
        "link_id": "t3_18fq8my",
        "parent_id": "t1_kcx1qls"
    },
    {
        "comment_id": "k7tvgk6",
        "subreddit": "books",
        "body": "> PJ changed a lot of things\n\nYes, that's where the rest of that paragraph comes in. I didn't say he couldn't change anything, but he didn't change that Gimli is a dwarf. I'm sure you can find people angry about any of those changes anyway.\n\nSkin colour is only \"not a big deal\" in this age of anti-racism. I mean, it is kind of a lie or oversimplification too. Even in the most diverse and accepting places, the most progressive people frequently have preferences for, for example, dating certain races, or they still want to keep up with their cultural background. In settings that are less and less modern, it is more and more bizarre to see a cultural melting pot. Not to say that it never happened historically, but you would never find people in the past trying to minimize these differences between peoples.\n\nBut you're also right in that, like, does it really matter that much? Movies are obviously unrealistic in a ton of ways. How many people complain about unrealistic gunfights breaking their immersion? But maybe it would be better-received if it wasn't done right now, a time where we constantly see very forced, fake-feeling, corporate diversity often tied in with crappy cashgrab remakes.",
        "time": "2023-11-04 19:36:21 UTC",
        "score": 1,
        "link_id": "t3_17n1wy8",
        "parent_id": "t1_k7tn98q"
    },
    {
        "comment_id": "k7r73jl",
        "subreddit": "books",
        "body": "> why does skin color of fantasy character matter? Heck why does gender matter in LOTR?\n\nPeople are always saying this in response to people (overly) angry about Ariel in The Little Mermaid being cast as a black person. I find it interesting because in most cases, most of those same people would be up in arms if a character popularly imagined as a black woman got played by a white man in a big budget film.\n\nIt always matters as part of a setting, and as a movie also faithfulness to the source material. I didn't read the books but in a setting without modern globalization, it's pretty notable if somebody alone has a different skin colour, or if a place manages to integrate people of different skin colours. Would Aragorn be the only black person or is their society very diverse? Lots of fantasy settings have been done where similar things are believable. But conveniently if you use some \"European\" architecture and land that looks \"European\", the audience needs no explanation when the people and culture look \"European\".\n\nAnd I doubt they had the resources that modern productions have in the days of Shakespeare, so that's already a pretty good reason they'd fit people into roles they didn't physically match.",
        "time": "2023-11-04 05:39:56 UTC",
        "score": 8,
        "link_id": "t3_17n1wy8",
        "parent_id": "t1_k7qxdm4"
    },
    {
        "comment_id": "k78hepi",
        "subreddit": "books",
        "body": "She didn't say it actually rehabilitates, but either way I don't see how her point doesn't stand.",
        "time": "2023-10-31 14:48:40 UTC",
        "score": 10,
        "link_id": "t3_17kigiw",
        "parent_id": "t1_k78few2"
    }
]