[
    {
        "comment_id": "lrott16",
        "subreddit": "books",
        "body": "I’ve read almost King’s books and this is the only one that made me think “What is wrong with you and why did you do this to us?”  \n\nI loved this book and will never read it again. ",
        "time": "2024-10-13 07:43:01 UTC",
        "score": 1,
        "link_id": "t3_1g1vfsk",
        "parent_id": "t1_lrjo562"
    },
    {
        "comment_id": "jzkd7od",
        "subreddit": "books",
        "body": "I now listen first and if I like it I will read it again on my kindle, making highlights to go over again in Readwise",
        "time": "2023-09-07 19:15:04 UTC",
        "score": 1,
        "link_id": "t3_16cgulk",
        "parent_id": "t1_jzjb9iw"
    },
    {
        "comment_id": "hjwpapi",
        "subreddit": "books",
        "body": "I mostly agree with you, but I think a lit of what made Snow Crash popular (not necessarily good) was the tropes and scenery, not really the story. \n\nNow that it isn’t “the future” anymore, it has to lean on just the story, which is where it lacks. \n\nI’m not here to defend the book, just to point out a potential reason for its popularity when it came out.",
        "time": "2021-11-09 06:39:39 UTC",
        "score": 2,
        "link_id": "t3_qpi0zs",
        "parent_id": "t1_hjuihdb"
    },
    {
        "comment_id": "hju5lwp",
        "subreddit": "books",
        "body": "I think the thing to remember about Snow Crash is WHEN it came out. This was ahead of the game in 1992. \n\nNow we’ve seen this story (and its tropes) play out a thousand times in various mediums",
        "time": "2021-11-08 19:01:31 UTC",
        "score": 63,
        "link_id": "t3_qpi0zs",
        "parent_id": "t1_hjtpchy"
    },
    {
        "comment_id": "h9w1ypk",
        "subreddit": "books",
        "body": "I do this too. I also supplement my list by adding re-read of something I read a long time ago. \n\nI generally don’t remember anything about the book after a few years, but I will remember if I liked it or not. So on the 2nd pass it feels fresh again. Works even better with non fiction because often I will now have a rudimentary understanding due to the first read and can get a lot more out of the book on the 2nd read. \n\n\nSlightly off topic, but for Non fiction I have now adopted the strategy of listening to the audio book first ( if available) to get a basic grasp, and then going back to the print or ebook if the concepts merit further investigation or study.",
        "time": "2021-08-22 08:54:19 UTC",
        "score": 5,
        "link_id": "t3_p93mq4",
        "parent_id": "t1_h9uxvmn"
    },
    {
        "comment_id": "eec95ol",
        "subreddit": "books",
        "body": "This is how I explained my love of Lee Child. \n\n",
        "time": "2019-01-18 08:25:22 UTC",
        "score": 1,
        "link_id": "t3_agxcuh",
        "parent_id": "t1_eea1jp5"
    },
    {
        "comment_id": "e4qizq4",
        "subreddit": "books",
        "body": "> this week\n\n\n:(",
        "time": "2018-08-24 04:34:16 UTC",
        "score": 1,
        "link_id": "t3_99maxa",
        "parent_id": "t1_e4piaab"
    },
    {
        "comment_id": "e2j0g9u",
        "subreddit": "books",
        "body": "I usually have two books on the go on my kindle - one fiction and one non-fiction/ self development.\n\nI read non-fiction in the morning and on my commute when I am fresh and charged up, and then I read the fiction in the evenings to relax. I usually also get the audible version of non-fiction books that I really like so I can go through it again. If a book REALLY grabs me, I will also get the paperback or hardcover and go through it a third time (Principles by Ray Dalio is the latest book where I got the harcover).",
        "time": "2018-07-17 06:08:36 UTC",
        "score": 1,
        "link_id": "t3_8zbcgf",
        "parent_id": "t3_8zbcgf"
    },
    {
        "comment_id": "dw5jgby",
        "subreddit": "books",
        "body": "That book was so far ahead of its time ",
        "time": "2018-03-23 10:45:50 UTC",
        "score": 1,
        "link_id": "t3_86ekk3",
        "parent_id": "t1_dw56ghz"
    }
]