[
    {
        "comment_id": "luh7hv7",
        "subreddit": "books",
        "body": "I enjoyed both personally and it's interesting how both novels are still both captivating even today.  But I do agree Dracula is more accessible and that use of journal narration has probably become even more used today as you see alot of video games progress their plot and story in the same way (for instance, that excellent Fallout NV DLC Honest Hearts is essentially a hunt for journal entries telling the story of a survivor...essentially a great sci fi novella on its own).  I also agree Shelly's Frankenstein is vastly the more important book.  Kind of the first widely popular sci fi book.  The themes it conveys about the overreach of science are more sophisticated and maybe even more relevant today.",
        "time": "2024-10-30 05:22:39 UTC",
        "score": 3,
        "link_id": "t3_1gf67xh",
        "parent_id": "t3_1gf67xh"
    },
    {
        "comment_id": "lugxhat",
        "subreddit": "books",
        "body": "There is a great portrayal of Frankenstein in the series Penny Dreadful.  The portrayal of an otherwise potentially good being twisted into cruelty by abuse and torment from society, yet still trying to fight to maintain his humanity.  What a great series that was.",
        "time": "2024-10-30 03:56:13 UTC",
        "score": 21,
        "link_id": "t3_1gf67xh",
        "parent_id": "t1_luf64fl"
    },
    {
        "comment_id": "lq3l2iu",
        "subreddit": "books",
        "body": "Stairway to Heaven is thought by many to be about Galadriel from Lord of the Rings.",
        "time": "2024-10-03 06:22:31 UTC",
        "score": 1,
        "link_id": "t3_1fv0upj",
        "parent_id": "t3_1fv0upj"
    },
    {
        "comment_id": "ktrfwg0",
        "subreddit": "books",
        "body": "Yeah its pretty well known and in most peoples top 10 sci fi books.",
        "time": "2024-03-07 13:18:41 UTC",
        "score": 120,
        "link_id": "t3_1b8u0q1",
        "parent_id": "t3_1b8u0q1"
    },
    {
        "comment_id": "krwmy80",
        "subreddit": "books",
        "body": "I couldn't finish Grapes of Wrath because it was too depressing.",
        "time": "2024-02-24 11:25:44 UTC",
        "score": 6,
        "link_id": "t3_1aylbut",
        "parent_id": "t3_1aylbut"
    },
    {
        "comment_id": "kbiexpk",
        "subreddit": "books",
        "body": "I will always hold those books in high esteem because its how I got both of my kids to start reading.",
        "time": "2023-12-01 05:17:10 UTC",
        "score": 10,
        "link_id": "t3_187sbde",
        "parent_id": "t1_kbgjksg"
    },
    {
        "comment_id": "kbieu3x",
        "subreddit": "books",
        "body": "Wow...that is surprising.  Though halfway through the first book is mostly exposition and world building.  If you are not invested in that world, I can see someone not being into it.  Once you get to Moria, though, things get really interesting.",
        "time": "2023-12-01 05:16:14 UTC",
        "score": 3,
        "link_id": "t3_187sbde",
        "parent_id": "t1_kbgpit5"
    },
    {
        "comment_id": "kbieimp",
        "subreddit": "books",
        "body": "This was my first thought as well.",
        "time": "2023-12-01 05:13:22 UTC",
        "score": 1,
        "link_id": "t3_187sbde",
        "parent_id": "t1_kbgj4vt"
    },
    {
        "comment_id": "kbiecud",
        "subreddit": "books",
        "body": "The Dark Tower.  I have read about a half dozen other King books and have found them perfectly enjoyable but the first book in the Dark Tower was really a slog.  Alot of self meditative narrative.  I think a big reason is that the entire story is a \"road\" plot and King falls into alot of bad tropes like endlessly describing the bleak environments and how much of a toil it is.  Some writers can be quite good at this like Cormac McCarthy or Tolkien but most writers just make it a chore.",
        "time": "2023-12-01 05:11:56 UTC",
        "score": 4,
        "link_id": "t3_187sbde",
        "parent_id": "t3_187sbde"
    },
    {
        "comment_id": "kaoi8d5",
        "subreddit": "books",
        "body": "Probably Shane.",
        "time": "2023-11-25 10:02:13 UTC",
        "score": 1,
        "link_id": "t3_1837q8s",
        "parent_id": "t3_1837q8s"
    },
    {
        "comment_id": "ivnbmgv",
        "subreddit": "books",
        "body": "Not so much a Bronze Age tribe but mongol horse warrior.  They basically stopped all western expansion by either Mexico or the US until revolvers show up.",
        "time": "2022-11-09 05:11:22 UTC",
        "score": 1,
        "link_id": "t3_ypm877",
        "parent_id": "t1_ivkrzr5"
    }
]