[
    {
        "comment_id": "lvjr3vv",
        "subreddit": "books",
        "body": "Right?! It does the exact opposite of glorify it.",
        "time": "2024-11-05 16:53:14 UTC",
        "score": 2,
        "link_id": "t3_1gkazpj",
        "parent_id": "t1_lvjpjw3"
    },
    {
        "comment_id": "ltquio5",
        "subreddit": "books",
        "body": "Yes! The original trilogy was finished about 30 years ago. Mr Williams has now written a second trilogy that takes place 30ish years after the first end and the final book for that comes out November 12th. There is also a prequel and a novella that bridges between the 2 trilogies. Tad never leaves you hanging.",
        "time": "2024-10-25 20:47:20 UTC",
        "score": 1,
        "link_id": "t3_1gc3a81",
        "parent_id": "t1_ltqtrx2"
    },
    {
        "comment_id": "ltqt5m4",
        "subreddit": "books",
        "body": "If epic fantasy is your thing, have you read Memory, Sorrow and Thorn by Tad Williams?",
        "time": "2024-10-25 20:40:01 UTC",
        "score": 1,
        "link_id": "t3_1gc3a81",
        "parent_id": "t1_ltqsmrt"
    },
    {
        "comment_id": "ltqqe6c",
        "subreddit": "books",
        "body": "Some people absolutely love him, and more power to them. I tried, I really did, but the quality just isn't there for me. It sucks because he's so prolific, but I can't force myself to enjoy his writing.",
        "time": "2024-10-25 20:25:11 UTC",
        "score": 1,
        "link_id": "t3_1gc3a81",
        "parent_id": "t3_1gc3a81"
    },
    {
        "comment_id": "ltp7rm0",
        "subreddit": "books",
        "body": "Wolfsong, I think it was called?",
        "time": "2024-10-25 15:45:24 UTC",
        "score": 2,
        "link_id": "t3_1gbuy9w",
        "parent_id": "t1_ltp5qw3"
    },
    {
        "comment_id": "lt5pwpn",
        "subreddit": "books",
        "body": "It's prologue, not prolouge",
        "time": "2024-10-22 11:55:40 UTC",
        "score": 1,
        "link_id": "t3_1g9fnyi",
        "parent_id": "t3_1g9fnyi"
    },
    {
        "comment_id": "lt3edyo",
        "subreddit": "books",
        "body": "I have become a huge fan of cozy and cozy- adjacent fantasy. I have a lot of anxiety and sometimes I really want to know going into a story that I'm not going to encounter sexual assault or gratuitous violence. The House in The Cerulean Sea has become one of my favorite stories of the last few years because of its earnest characters and message of hope and overcoming prejudice.\n\nSometimes you want a nail biter, and sometimes you just want a warm hug.",
        "time": "2024-10-22 00:06:23 UTC",
        "score": 8,
        "link_id": "t3_1g93wzl",
        "parent_id": "t3_1g93wzl"
    },
    {
        "comment_id": "lsd8ruy",
        "subreddit": "books",
        "body": "Except that they forgot The Eyes of the Dragon, which is straight fantasy.",
        "time": "2024-10-17 14:23:42 UTC",
        "score": 1,
        "link_id": "t3_1g5rlug",
        "parent_id": "t1_lsd8acs"
    },
    {
        "comment_id": "lr4f2ic",
        "subreddit": "books",
        "body": "I can read a good story with mediocre prose, but not bad prose. As far as a bad story with good prose...well, I've DNFed 2 books by Guy Gaviel Kay because I hated the story so much, so I guess that answers that.",
        "time": "2024-10-09 17:34:08 UTC",
        "score": 9,
        "link_id": "t3_1fzwoc7",
        "parent_id": "t3_1fzwoc7"
    },
    {
        "comment_id": "lq89arx",
        "subreddit": "books",
        "body": "Now you're being intentionally obtuse. Just because a teacher doesn't have every book ever written in their classroom doesn't excuse censorship. The teacher or librarian pick those books. Not a politician with an agenda",
        "time": "2024-10-04 00:50:40 UTC",
        "score": 32,
        "link_id": "t3_1fvmban",
        "parent_id": "t1_lq88hf6"
    },
    {
        "comment_id": "lq87wvm",
        "subreddit": "books",
        "body": "No. Stop trying to sane wash these bans. The decision of what goes in a school library is the prerogative of a librarian. They have the expertise of what is appropriate for students. Politicians who want to rewrite history and further marginalize minorities have no business telling a librarian their job.",
        "time": "2024-10-04 00:42:12 UTC",
        "score": 34,
        "link_id": "t3_1fvmban",
        "parent_id": "t1_lq86pa2"
    },
    {
        "comment_id": "lhgmxhq",
        "subreddit": "books",
        "body": "I've read tens of thousands of books over the last 40+ years. I've forgotten most of them. The ones I read during my formative years stand out more than nearly anything I've read since I was 20. I've accidentally reread books because I didn't realize until half way through that I'd read them before.",
        "time": "2024-08-10 17:06:30 UTC",
        "score": 1,
        "link_id": "t3_1eou4cu",
        "parent_id": "t3_1eou4cu"
    },
    {
        "comment_id": "lg4u489",
        "subreddit": "books",
        "body": "I think it started with *The Moon is a Harsh Mistress* since that's the first novel to include Lazarus Long. Unless any of the short stories he was in was written prior to that.",
        "time": "2024-08-02 13:02:35 UTC",
        "score": 2,
        "link_id": "t3_1ei2aac",
        "parent_id": "t1_lg4adsq"
    },
    {
        "comment_id": "lfkhwha",
        "subreddit": "books",
        "body": "The Hotel New Hampshire was a really uncomfortable read.",
        "time": "2024-07-29 23:36:09 UTC",
        "score": 5,
        "link_id": "t3_1efcvme",
        "parent_id": "t1_lfk9txc"
    },
    {
        "comment_id": "lf9njmp",
        "subreddit": "books",
        "body": "\"We hold these truths to be self evident\". Your assertion is not only wrong, but really weird. It's kind of embarrassing.",
        "time": "2024-07-28 00:32:41 UTC",
        "score": 32,
        "link_id": "t3_1edlvzl",
        "parent_id": "t1_lf93t23"
    },
    {
        "comment_id": "levdllj",
        "subreddit": "books",
        "body": "Now go back and read it a second time and catch all of the stuff you missed in the first read.",
        "time": "2024-07-25 13:53:58 UTC",
        "score": 2,
        "link_id": "t3_1ebpmkk",
        "parent_id": "t1_leugztm"
    },
    {
        "comment_id": "lcqirre",
        "subreddit": "books",
        "body": "Stop reading bad books.",
        "time": "2024-07-11 21:11:34 UTC",
        "score": 37,
        "link_id": "t3_1e0z3b5",
        "parent_id": "t3_1e0z3b5"
    },
    {
        "comment_id": "lcjt9st",
        "subreddit": "books",
        "body": "It's really easy to forget the name of the book you're reading if you're using an e-reader, audiobook, or juggling multiple books at the same time. Also, if I'm reading a series, I tend to remember the series name, but not the individual titles. Like, I can tell you I'm reading the 3rd Expanse book, but I had to go look at the book itself to tell you it's called Abaddon's Gate.",
        "time": "2024-07-10 18:27:16 UTC",
        "score": 2,
        "link_id": "t3_1e02etj",
        "parent_id": "t3_1e02etj"
    },
    {
        "comment_id": "l8fas1y",
        "subreddit": "books",
        "body": "I lay in bed on my stomach, prop a pillow under my boobs and read the tome that way. It's the easiest on my back and my eyes.",
        "time": "2024-06-13 13:44:55 UTC",
        "score": 1,
        "link_id": "t3_1deyi44",
        "parent_id": "t3_1deyi44"
    },
    {
        "comment_id": "l8clae7",
        "subreddit": "books",
        "body": "Definitely would have been better to see Hammond get torn apart by Compies.",
        "time": "2024-06-12 23:48:06 UTC",
        "score": 3,
        "link_id": "t3_1defzcg",
        "parent_id": "t1_l8cdkul"
    },
    {
        "comment_id": "l8cktw5",
        "subreddit": "books",
        "body": "Be sure to also highlight the proper meaning of \"boundaries\" and \"gaslighting\".",
        "time": "2024-06-12 23:45:05 UTC",
        "score": 11,
        "link_id": "t3_1defzcg",
        "parent_id": "t1_l8byonq"
    },
    {
        "comment_id": "l8ckjf0",
        "subreddit": "books",
        "body": "I'm forever disappointed that we never got the shot of the T-Rex waiting at the bottom of the waterfall. That was the scariest scene in the book for me.",
        "time": "2024-06-12 23:43:11 UTC",
        "score": 12,
        "link_id": "t3_1defzcg",
        "parent_id": "t1_l8bnvt2"
    },
    {
        "comment_id": "l8ck8hx",
        "subreddit": "books",
        "body": "True. I was in highschool in '92. The AP biology class read Jurassic Park and talked about it so much that by the end of the school year nearly everyone had read it. When we found out there was going to be a movie everyone lost their minds. I saw it 3 times summer of 93, the first time with about 60 of my classmates.",
        "time": "2024-06-12 23:41:12 UTC",
        "score": 9,
        "link_id": "t3_1defzcg",
        "parent_id": "t1_l8c1zid"
    },
    {
        "comment_id": "l8cidtd",
        "subreddit": "books",
        "body": "You know, you make a good point. I read Slaughterhouse Five when I was 16 or 17. I remember loving it, but I doubt I really understood it. Now, 30+ years later, I should delve into it again.",
        "time": "2024-06-12 23:29:08 UTC",
        "score": 2,
        "link_id": "t3_1deennc",
        "parent_id": "t1_l8chafa"
    },
    {
        "comment_id": "l8bnl7m",
        "subreddit": "books",
        "body": "I read Catch -22 the first time when I was a young teen, but it wasn't until my 3rd read as an adult that I actually understood it. I thought it was funny and clever. Turns out it's utterly tragic while also being funny and clever. Somehow I didn't realize what happened to Snowden until that third read. I was a dense kid.",
        "time": "2024-06-12 20:23:10 UTC",
        "score": 3,
        "link_id": "t3_1deennc",
        "parent_id": "t1_l8bd81j"
    },
    {
        "comment_id": "l8bmm6y",
        "subreddit": "books",
        "body": "This was my experience with Moby Dick. It's not the wordiness, but the constant tangents and lists about whale types that read like stereo instructions. I've finally come to terms with the fact that I will never read this book.",
        "time": "2024-06-12 20:17:47 UTC",
        "score": 6,
        "link_id": "t3_1deennc",
        "parent_id": "t1_l8bayfs"
    },
    {
        "comment_id": "l87acc2",
        "subreddit": "books",
        "body": "I own this book and I plan to get to it at some point, but I read the Shadow and Bone and Siege and Storm and gave up. I didn't care for them at all and didn't care what happened to anyone.",
        "time": "2024-06-12 00:49:59 UTC",
        "score": 2,
        "link_id": "t3_1ddnixj",
        "parent_id": "t3_1ddnixj"
    },
    {
        "comment_id": "l78fmpm",
        "subreddit": "books",
        "body": "I had a nearly identical experience with Infinite Jest. I was told it would change my life. It was complete drivel. I never bothered to finish it.",
        "time": "2024-06-05 15:51:19 UTC",
        "score": 3,
        "link_id": "t3_1d8jnsw",
        "parent_id": "t1_l774tgg"
    },
    {
        "comment_id": "l78ds37",
        "subreddit": "books",
        "body": "I've never read a Hoover book, so I can't speak from personal experience, but every post or discussion I've ever seen involving her books ( and there are a lot of them) all seem to boil down to her themes and characters being awful and disappointing. I've quite literally never read a positive review of her work.",
        "time": "2024-06-05 15:41:01 UTC",
        "score": 12,
        "link_id": "t3_1d8jnsw",
        "parent_id": "t3_1d8jnsw"
    },
    {
        "comment_id": "l4cg2qb",
        "subreddit": "books",
        "body": "I also read this for a bookclub and I felt a bit left out as everyone but me loved it. It had great atmosphere, but nothing else and all of the characters felt flat to me.",
        "time": "2024-05-16 18:48:03 UTC",
        "score": 1,
        "link_id": "t3_1ctg4v1",
        "parent_id": "t3_1ctg4v1"
    },
    {
        "comment_id": "kyx2zjd",
        "subreddit": "books",
        "body": "If you don't want authors to describe things for you then watch television.",
        "time": "2024-04-10 13:28:59 UTC",
        "score": 24,
        "link_id": "t3_1c0bkdv",
        "parent_id": "t3_1c0bkdv"
    },
    {
        "comment_id": "kw2bayd",
        "subreddit": "books",
        "body": "I read this when I was 11 or 12 and then read all of her other books some time over the next 4 years or so. (Not the ghost written ones because those came later). They're all sad, disturbing and full of incest. I don't think I could go and reread them now. My sensibilities, or at least my ability to turn them off, disappeared somewhere around my 40th birthday and as a result I've become far pickier about my reading material.",
        "time": "2024-03-22 16:08:53 UTC",
        "score": 2,
        "link_id": "t3_1bkoxod",
        "parent_id": "t3_1bkoxod"
    },
    {
        "comment_id": "kvleelg",
        "subreddit": "books",
        "body": "Cool...cool cool cool cool.",
        "time": "2024-03-19 15:54:21 UTC",
        "score": 1,
        "link_id": "t3_1bim9a8",
        "parent_id": "t1_kvl8ria"
    },
    {
        "comment_id": "kvhf0tg",
        "subreddit": "books",
        "body": "You make an interesting point. I read the Inkheart trilogy years ago, and although I loved the concept, I felt that the actual execution was really lacking. I would love to read a story with the same premise explored in a more satisfying way. So, I would say that demand is there, but I don't think I'd be willing to sacrifice artistic vision for a la cart tropism",
        "time": "2024-03-18 21:00:28 UTC",
        "score": 77,
        "link_id": "t3_1bi08k8",
        "parent_id": "t1_kvhc76c"
    },
    {
        "comment_id": "kvhe689",
        "subreddit": "books",
        "body": "I had a strong visceral wave of disgust at the very idea of box checking tropes. I'm hoping this isn't a \"real\" thing, but more of a desire of the chronically online. They're a very small subset of the reading public.",
        "time": "2024-03-18 20:55:43 UTC",
        "score": 35,
        "link_id": "t3_1bi08k8",
        "parent_id": "t3_1bi08k8"
    },
    {
        "comment_id": "kutyi2o",
        "subreddit": "books",
        "body": "Back before Facebook became a cesspool, I was FB friends with Tad Williams and his wife Deb. It was just their reg FBs about their friends and family. I sent a request and was accepted by Tad, then Deb sent one to me. Anyway, I had a lot of lovely interactions with them. They have lots of pets and a wonderful garden. We traded cat and flower pictures.",
        "time": "2024-03-14 13:29:35 UTC",
        "score": 3,
        "link_id": "t3_1be67bk",
        "parent_id": "t3_1be67bk"
    },
    {
        "comment_id": "kutvc6v",
        "subreddit": "books",
        "body": "In addition to the Castle rock and Derry stuff, Randall Flagg is in at least 9 different King stories. He's also sometimes called Bill Hitch  and Walter something, but King confirmed that they're all in the same guy.",
        "time": "2024-03-14 13:08:08 UTC",
        "score": 8,
        "link_id": "t3_1be952k",
        "parent_id": "t3_1be952k"
    },
    {
        "comment_id": "kurslue",
        "subreddit": "books",
        "body": "It sounds like your teacher saw the movie Sybil and thought it was a documentary.",
        "time": "2024-03-14 01:34:57 UTC",
        "score": 6,
        "link_id": "t3_1bduaey",
        "parent_id": "t1_kurrhv8"
    },
    {
        "comment_id": "kurc7w5",
        "subreddit": "books",
        "body": "Not a fringe take, but I have a vivid memory of writing a paper for English in 11th grade. I was describing a fairground and used the phrase \"a cacophony of light and sound\". I got marked down because you thought I made the word up. She had never heard it before. I had to get out the dictionary ( this was pre Internet) and prove to her that it was real and used correctly. Being more well read than your teacher does not instill one with confidence in the quality of education they're receiving.",
        "time": "2024-03-13 23:54:06 UTC",
        "score": 125,
        "link_id": "t3_1bduaey",
        "parent_id": "t3_1bduaey"
    },
    {
        "comment_id": "ku68ktj",
        "subreddit": "books",
        "body": "My favorites are:\n\nThe Scarlet Pimpernel- An action adventure mystery romance set during the height of Reign of Terror? What's not to like? It's a really fun tale.\n\nA Tale of Two Cities: There's a reason this is considered Dickens masterpiece. Dickens had a unique way of making you care about characters in desperate situations and I think he really reached the pinnacles of what he did best in this novel \n\nA Tree Grows in Brooklyn: Francie was the first character I ever really connected to. Francie was like me. She thought like me and had the same dreams and hardships ( though hers were much worse). Every time I reread it, I remember was it was like to be 11 years old again.\n\nSense and Sensibility: as much as I like Pride and Prejudice, I think this is a better story. Deeper. Colonel Brandon is a very complex character that I immediately had a crush on the first time I read the book.",
        "time": "2024-03-10 03:47:21 UTC",
        "score": 53,
        "link_id": "t3_1bb00l0",
        "parent_id": "t3_1bb00l0"
    },
    {
        "comment_id": "ku61u08",
        "subreddit": "books",
        "body": "I use the Dewey decimal system 🤷‍♀️",
        "time": "2024-03-10 02:55:56 UTC",
        "score": 1,
        "link_id": "t3_1bazfhb",
        "parent_id": "t3_1bazfhb"
    },
    {
        "comment_id": "ku3poaq",
        "subreddit": "books",
        "body": "I also have a Steven Burst story. I went to Nerdcon: Stories. 2014 I think? Might be off by a year or so. I went to see Pat Rothfuss, Jacqueline Carey, Les Grossman and John Scalzi. \n\nThe morning before the convention starts my husband and I go down to the hotel restaurant for breakfast. It's fairly crowded. A guy alone in a leather cowboy hat sits down at the next table. We start talking . Not about anything in particular, just the kind of random conversation you have with strangers in public. He seemed lonely and a bit awkward, but really nice. We thought he was just another conversation attendee.\n\nIt wasn't until we went to a panel later on in the day that I discovered we'd been hanging out with Brust.",
        "time": "2024-03-09 18:07:29 UTC",
        "score": 18,
        "link_id": "t3_1bainoz",
        "parent_id": "t3_1bainoz"
    },
    {
        "comment_id": "kt5vt1z",
        "subreddit": "books",
        "body": "I use an app called bookshelf. I can scan the ibsn, separate the books into \"shelves\"(like read and unread), and I can use it to scan books at the store so I know if I have it already. I have about 1200 books, so I don't always remember what I do and don't own. It's really easy to use.",
        "time": "2024-03-03 16:12:51 UTC",
        "score": 3,
        "link_id": "t3_1b5j4z3",
        "parent_id": "t3_1b5j4z3"
    },
    {
        "comment_id": "ksv8xb2",
        "subreddit": "books",
        "body": "I think you've hit the nail on the head. If something isn't for you then just say that, but calling it trash or comparing one piece of literature to another is rude and will, understandably, get people upset.",
        "time": "2024-03-01 16:06:48 UTC",
        "score": 33,
        "link_id": "t3_1b3x94b",
        "parent_id": "t1_ksv7wx5"
    },
    {
        "comment_id": "ksppn6o",
        "subreddit": "books",
        "body": "The introduction they're speaking about is original to the book. It's a framing device for the entire story.",
        "time": "2024-02-29 16:26:10 UTC",
        "score": 36,
        "link_id": "t3_1b2zmkt",
        "parent_id": "t1_kspcl5h"
    },
    {
        "comment_id": "ksp7rrv",
        "subreddit": "books",
        "body": "The book was published in 1973. The movie came out in 1987. You're wrong in every conceivable way.",
        "time": "2024-02-29 14:42:23 UTC",
        "score": 116,
        "link_id": "t3_1b2zmkt",
        "parent_id": "t1_ksoxly4"
    }
]