[
    {
        "comment_id": "lz8fl99",
        "subreddit": "books",
        "body": "This is an accurate observation of human behavior.  All of our heroes and celebrated people of talent, once you start to pull back the layers, you find they're very human, with all the good parts and bad, that exist with every person.  Herein is where one has to make a decision: will you suddenly throw out your hero/esteemed person as you start to learn the bad parts they had, or will you be able to separate the good from the bad, and still recognize they did some great things and simply enjoy those good parts about them?  Each individual has to make that choice for themselves.  Warning, though, if your plan is to throw out all the people you hold in high esteem when you learn they have some bad things, pretty soon you won't be left with any heroes.\n\nThe human condition is one of the wildest things we've ever seen on Earth.  Good, bad, and just messy all around with few clearly defined lines.  When you're young, the world is black and white, right or wrong!  As you get older, and older, and older, if you allow yourself to expand on your understanding of the world, you realize, there are few issues with a black and white contrast.  Most things are just various shades of gray.",
        "time": "2024-11-27 12:43:40 UTC",
        "score": 4,
        "link_id": "t3_1h11hwm",
        "parent_id": "t3_1h11hwm"
    },
    {
        "comment_id": "lwsxjbc",
        "subreddit": "books",
        "body": "Absolutely!  I think the reason why this happens to us is as we get older, we are comfortable with admitting we know less and less about the world and universe, than we previously thought in our younger years.  I've learned over the years that that saying (paraphrased) \"The older I get, the more I realize how little I actually know,\" is very true.  I'd imagine that's a major factor in why our reading preferences broaden significantly.",
        "time": "2024-11-12 20:14:48 UTC",
        "score": 3,
        "link_id": "t3_1gpt6va",
        "parent_id": "t3_1gpt6va"
    },
    {
        "comment_id": "lwb51bn",
        "subreddit": "books",
        "body": "I like the nostalgia of holding a paper book and reading it. However, if it gets lost, that's it until I get a replacement. I like with digital books either via Google Play or Amazon, there is no losing it. It's stored in \"the cloud.\"\n\nI know this doesn't provide a definitive answer, and I actually didn't find one myself based on preference. I have both types of books and I just go practical now in deciding which venue I' ll use. Whichever version is cheaper, whether digital or paper, is simply what I go with for that book.",
        "time": "2024-11-09 21:11:03 UTC",
        "score": 1,
        "link_id": "t3_1gnhwvo",
        "parent_id": "t3_1gnhwvo"
    }
]