[
    {
        "comment_id": "m03p88n",
        "subreddit": "books",
        "body": "This is me.  When some people talk about reading having what they are reading play out like a movie in their head I don't understand that because for me it's just me reading words.",
        "time": "2024-12-02 21:48:21 UTC",
        "score": 3,
        "link_id": "t3_1h4sn6h",
        "parent_id": "t1_m026cuf"
    },
    {
        "comment_id": "lyhipt3",
        "subreddit": "books",
        "body": "I don't think he's come on for me before, I'll have to check him out.",
        "time": "2024-11-22 22:10:13 UTC",
        "score": 2,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t1_lyhbm1n"
    },
    {
        "comment_id": "lyhh8at",
        "subreddit": "books",
        "body": "I actually follow Gavin!! I don't catch all of his vlogs but when I do, it's always enjoyable.  I did love the vlogs he did just after he moved when he was watching what was going on at his new neighbors house!",
        "time": "2024-11-22 22:01:52 UTC",
        "score": 2,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t1_lyhdzm1"
    },
    {
        "comment_id": "lyg5jb6",
        "subreddit": "books",
        "body": "If you're looking for longer form literary reviews and analysis there's a booktuber named Benjamin McEvoy that does them.  I've only watched him a few times but he pops up in my algorithm every so often.",
        "time": "2024-11-22 17:50:24 UTC",
        "score": 12,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t1_lyg2nsa"
    },
    {
        "comment_id": "lyg59ku",
        "subreddit": "books",
        "body": "I agree with the other commenters, you get longer form content and the chance for them to go deeper. I love a vlog where we're following the booktuber for days while they read (either one book or multiple books where they are themed around something). You're getting in the moment reactions and reviews.  I like videos when they are talking about upcoming releases, it gives me a chance to actually see what's coming out.\n\nAnd yeah, there are some goofy/fun videos thrown in but those can also be a great distraction from other things in my life so I enjoy them.",
        "time": "2024-11-22 17:49:03 UTC",
        "score": 6,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t1_lyfgwts"
    },
    {
        "comment_id": "lyfdpo8",
        "subreddit": "books",
        "body": "I think Booktube is pretty good as well.  There are creators on there for every kind of reader.",
        "time": "2024-11-22 15:26:36 UTC",
        "score": 254,
        "link_id": "t3_1gxa0r3",
        "parent_id": "t3_1gxa0r3"
    },
    {
        "comment_id": "l4ctvra",
        "subreddit": "books",
        "body": "FYI, I am also old but can't be bothered to curate my Instagram page to follow/find book people on there that I like.",
        "time": "2024-05-16 20:10:13 UTC",
        "score": 3,
        "link_id": "t3_1ctlk9v",
        "parent_id": "t1_l4csm0j"
    },
    {
        "comment_id": "l4ctao1",
        "subreddit": "books",
        "body": "It really does have a diverse range.  There is one person that I follow that just talks about Japanese translated books.  I also follow a few people that just talk about lit fic.  A few others that talk about a variety of books (both fiction and non-fiction, short stories and poetry).  I've come across a few that just talk about just classics.  Try searching for the genre you are looking for and once you start interacting with them, similar content creators will pop up.",
        "time": "2024-05-16 20:06:36 UTC",
        "score": 24,
        "link_id": "t3_1ctlk9v",
        "parent_id": "t1_l4creex"
    },
    {
        "comment_id": "l4csile",
        "subreddit": "books",
        "body": "There is a bookstagram!",
        "time": "2024-05-16 20:01:52 UTC",
        "score": 41,
        "link_id": "t3_1ctlk9v",
        "parent_id": "t1_l4crzbq"
    },
    {
        "comment_id": "kzpzil2",
        "subreddit": "books",
        "body": "There's only a couple of Booktubers that I still follow and BooksandLala is one of them. I like Kayla so much that I pay for her channel membership.  And she reads so diversely, that it makes it easy to find something new in her recs that I'll like.",
        "time": "2024-04-15 19:09:47 UTC",
        "score": 13,
        "link_id": "t3_1c4jrsr",
        "parent_id": "t1_kzopavl"
    },
    {
        "comment_id": "krn8rst",
        "subreddit": "books",
        "body": "It really is.  Everyone gets fed the same stuff because that's what's popular.  But once you find the right booktok creators the books you're seeing became sooooo different.  I love all the amazing recs I get now.",
        "time": "2024-02-22 18:51:15 UTC",
        "score": 1,
        "link_id": "t3_1ax5zfr",
        "parent_id": "t1_krn0z8f"
    },
    {
        "comment_id": "krmteoh",
        "subreddit": "books",
        "body": "I get new books from a few different places.\n\nI'll wonder around a bookstore or my local library.  I've found a number of great books doing this.\n\nI'll read the emails I get from BookRiot and publishers about new books.  BookRiot has a lot of interesting lists.\n\nI find some recs on the 52book sub.  Lots of postings of what people are currently reading/just read and then the weekly thread are great resources.\n\nThere are are few booktubers I trust to get recs from.  It took a bit of time to find the ones that I vibe with the most but I've stuck with the same few for years now.  One of them does a video a couple times a year of upcoming books she finds interesting and will give a brief summary (if there is one).\n\nI curated the heck out of my TikTok booktok FYP.  Anytime I saw a video of someone talking about a book that I liked, I would like it and watch a few of their videos.  If they aligned even more, I would give them a follow.  I get so many interesting recs now.  Books I don't see anywhere else, including really great translated books as well.",
        "time": "2024-02-22 17:23:29 UTC",
        "score": 1,
        "link_id": "t3_1ax5zfr",
        "parent_id": "t3_1ax5zfr"
    }
]