[
    {
        "comment_id": "lpu0lei",
        "subreddit": "books",
        "body": "I would remind you that you are arguing from an assumption that i would use sparksnotes. Never once have I mentioned it. Scholarly papers which engage with the literature while quoting the source are vastly superior form of helping tone down the course load while still gaining the benefit of learning contextual skills much like a lecture would benefit you. I would also remind you that have I have agreed with your prior assessment that skipping course material is not what I am arguing for, which again is an assumption on your part. I think a lot of the issues my stance has been met with, while advocating for people with different life circumstances, is based on extremely unfair assumptions which I will again point out were never said in any of my responses and a fair amount of Bias that seems to be manifesting as the assumption that young students these days do not want to work. I would be interested to hear your thoughts on my assessment of your assumptions.",
        "time": "2024-10-01 16:26:35 UTC",
        "score": -1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lptymvg"
    },
    {
        "comment_id": "lptsl2k",
        "subreddit": "books",
        "body": "I agree with you completely, **it is a shame**. I was never arguing that it’s not. The issue is that at the end of the day, if you don’t have time (because time is not infinite) to complete long tedious work because of other more important tasks, you need to make up the short fall somewhere. A choice and priority needs to be made. We can all agree on that. We don’t live in a vacuum under perfect conditions. I would rather get a B or a C in my English literature class than potentially failing Chemistry because I had my time allocated incorrectly. And because we don’t live in a vacuum, different people require different amounts of effort and time to learn tasks. One size just doesn’t fit all.\nAdditionally I genuinely think that some of the comments are from the mind set of “well I had time, why didn’t you?” And I think that is a shame.",
        "time": "2024-10-01 15:42:58 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lptotge"
    },
    {
        "comment_id": "lptjcjx",
        "subreddit": "books",
        "body": "I never said I would refuse to learn the skill or refuse to interact with the material. But at the end of the day, if one subject is taking all of your time, you need to find a way to meet the objective portion of the class, which is the pass fail scenario, while doing everything you can to meet and learn the contextual skills the class is teaching. They are two different things. In essence you need to still attempt to learn and I would never advocate not trying to learn. But at the end of the day you need to find a way to meet the pass fail conditions and sometimes that leads to short cuts because you only have so many hours in a day.",
        "time": "2024-10-01 14:52:22 UTC",
        "score": 0,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpth1dr"
    },
    {
        "comment_id": "lptiemd",
        "subreddit": "books",
        "body": "I hope I’m not arguing that those skills are the same. Because you are correct and they are both valuable. I am merely suggesting that due to life circumstances or other variables, the courses themselves may not be a students priority. We have not even discussed people like myself with ADHD and mild dyslexia. The biggest issue is that there are only so many hours in a day and it is genuinely a shame that certain things are a priority and there is no animosity or whining about it. We don’t have a system that supports taking the time the learn each of these very valuable skills with the care and attention they deserve. I’m suggesting that there are other sources of gaining this skill so it’s not missed out on. Does that make sense in the context of what I have been commenting?",
        "time": "2024-10-01 14:47:10 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lptgqw9"
    },
    {
        "comment_id": "lptchcq",
        "subreddit": "books",
        "body": "I see a lot of value in literature, but we are speaking about it in an academic setting, where a slip of a bad grade for a Stem student could cost them their future. When I was a young freshman I was over loaded with work to support myself, and all the time requirements of my Stem courses. I don’t know if you have ever taken Organic chemistry but it requires an extreme time requirement. Now when I had to choose between my Major, and a generic English credit, you bet I devoted my time to my O Chem. People often forget that for poor people, it can be extremely difficult to balance an undergraduate schedule, especially when universities cram more and more work into it every year. All I am saying is that for some people, our future is on the line. Failure can have very dramatic consequences on life outcomes. You can learn to engage with writing and academic sources from a variety of classes and sources.",
        "time": "2024-10-01 14:13:25 UTC",
        "score": -1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpta4fx"
    },
    {
        "comment_id": "lptazhh",
        "subreddit": "books",
        "body": "I have tried to point that out to no avail.",
        "time": "2024-10-01 14:04:42 UTC",
        "score": 6,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt6bxj"
    },
    {
        "comment_id": "lpt77rd",
        "subreddit": "books",
        "body": "You were passive aggressively equating me to a highschool student upset about homework while telling me to get a job, while making the assumption that I am a child without one. If my reading comprehension is lacking then please illuminate me.\n\nEdit because they deleted their comment\n\nYou said, and I am paraphrasing here “get a job” without designating a specific entity or group. Now as your comment was a reply, one can assume that the intended entity that remark was directed to was me. Do you see how many more words you needed to clear up the ambiguity of your statement? Now you have once again equated me to a child that resents homework; therefore, the first half of your previous reply was in fact intended for me. Now it would follow that the assumption I made that the reply in its entirety would in fact be directed at me seems fairly reasonable. So whose reading comprehension is lacking here?",
        "time": "2024-10-01 13:42:14 UTC",
        "score": 0,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt6loo"
    },
    {
        "comment_id": "lpt62a2",
        "subreddit": "books",
        "body": "A mandatory literature class is not the only place to learn how to interact and interpret scholarly writing. This skill can be learned and is taught throughout multiple classes and subjects. Undergraduate degrees are time and labor intensive and each year they cram more into it. People from lower socioeconomic stratum’s also need to work alongside studying. Freshmen science courses also teach you to interact with scholarly writing and papers. If your focus is science, and you are short of time it’s honestly a cost benefit analysis on should I devote time I don’t have to read this book for a mandatory English class that is also very time consuming? Or do I also learn this skill here in science, and can there for focus my attention here. So why personally attack me over a disagreement?",
        "time": "2024-10-01 13:35:02 UTC",
        "score": 0,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt48gy"
    },
    {
        "comment_id": "lpt3tbu",
        "subreddit": "books",
        "body": "I read avidly, but let’s not pretend that a distinction cannot be made between read a genre you love vs being forced to read a book for a course to check a box.",
        "time": "2024-10-01 13:20:53 UTC",
        "score": -5,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt34zw"
    }
]