[
    {
        "comment_id": "ltiyvzq",
        "subreddit": "books",
        "body": "I wanted to preface this by saying that i think trigger warnings are fine. It takes very little effort to do them or read them, and it's weird that they got dragged into culture war nonsense. That being said, my understanding was they don't appear to actually work? Like there isn't any evidence that being warned ahead of time reduce people's anxiety when the event actually occurs, and people don't usually avoid a thing because of the trigger warning either. It's more a thing neurotypical people *think* would help neurodivergant people than anything. If there is research to the contrary, I would be happy to take a look though.",
        "time": "2024-10-24 15:30:00 UTC",
        "score": 1,
        "link_id": "t3_1gb05s1",
        "parent_id": "t3_1gb05s1"
    },
    {
        "comment_id": "lsp49y8",
        "subreddit": "books",
        "body": "Night Angel trilogy is a *terrible* recommendation for someone interested in \"little to no romance\". The entire book series is built around a deeply unfulfilling, poorly executed love triangle. All of the characters are also thirsty AF.",
        "time": "2024-10-19 15:28:10 UTC",
        "score": 5,
        "link_id": "t3_1g771ul",
        "parent_id": "t1_lsomm0h"
    },
    {
        "comment_id": "lr5zf5n",
        "subreddit": "books",
        "body": "In college, my creative writing teacher told me that Lolita is the only true love story. I was not a big fan of her.",
        "time": "2024-10-09 22:41:51 UTC",
        "score": 17,
        "link_id": "t3_1fzraea",
        "parent_id": "t1_lr3ecmm"
    },
    {
        "comment_id": "lptb8yq",
        "subreddit": "books",
        "body": "I mean I graduated in 2006 and did AP English lit and we still pretty much just read poetry, short stories, excerpts, and Shakespeare. Only kids in the normal English classes were having to read books cover to cover. This is all a natural consequence of teachers having to prep their students for standardized tests. That being said, at 18, I was a big dumb fucking idiot and could only engage with books on the surface level of the plot. There wasn't much value in forcing me to read a school book cover to cover, I wasn't going to get much out of it to begin with. And I was one of the kids who was constantly reading.",
        "time": "2024-10-01 14:06:15 UTC",
        "score": 2,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpt205h"
    },
    {
        "comment_id": "lp3wvf2",
        "subreddit": "books",
        "body": "I really did not like The Witcher audiobooks, but thought the actual books were pretty much OK. Paul Kearney basically uses the exact same sing-songy cadence for everything and it really distracts me because it often doesn't fit the scene.",
        "time": "2024-09-27 00:16:25 UTC",
        "score": 3,
        "link_id": "t3_1fqanx8",
        "parent_id": "t3_1fqanx8"
    },
    {
        "comment_id": "loxbc54",
        "subreddit": "books",
        "body": "Because stephen king books are everywhere, he is synonymous with horror, and young people love horror cause they can still get scared",
        "time": "2024-09-25 21:48:54 UTC",
        "score": 1,
        "link_id": "t3_1fozps4",
        "parent_id": "t3_1fozps4"
    },
    {
        "comment_id": "lnsywkm",
        "subreddit": "books",
        "body": "I mostly read new books, but re-read a handful of favorites every year or two. Audiobooks re-reads are great for when I'm doing chores and whatnot",
        "time": "2024-09-18 21:59:32 UTC",
        "score": 1,
        "link_id": "t3_1fk4aig",
        "parent_id": "t3_1fk4aig"
    },
    {
        "comment_id": "ln11pjj",
        "subreddit": "books",
        "body": "I tell them I like garbage with wizards or laser beams (since I like pulp fantasy and Sci fi)",
        "time": "2024-09-14 02:36:40 UTC",
        "score": 3,
        "link_id": "t3_1fgau9a",
        "parent_id": "t3_1fgau9a"
    },
    {
        "comment_id": "lhxfimx",
        "subreddit": "books",
        "body": "It's all important later, for the most part. Remember that this is a multi-generational epic that spans 1000 years of time. Also, you have plenty of immortal characters that survive through the whole series, so the \"prologue\" is more relevant than you would think. We probably spend more time with Amy's mom than we need to, but there's not much else that could be cut. ",
        "time": "2024-08-13 16:00:15 UTC",
        "score": 2,
        "link_id": "t3_1er6445",
        "parent_id": "t3_1er6445"
    },
    {
        "comment_id": "lhicv3h",
        "subreddit": "books",
        "body": "Some of us just want to consume media and spend as little time as needed to keep the dumb humans from hurting themselves. I like a hero that cares about people, but maybe doesn't really like them very much. Murderbot is also a more sympathetic character than other much more explicitly autistic coded characters are, which probably helps make them a fan favorite among the nerds.",
        "time": "2024-08-10 23:14:05 UTC",
        "score": 2,
        "link_id": "t3_1eoyc4r",
        "parent_id": "t3_1eoyc4r"
    },
    {
        "comment_id": "kwsm5o0",
        "subreddit": "books",
        "body": "The Lost Fleet by Jack Campbell or the Pillars of Reality by Jack Campbell. His books are far from perfect, but his pacing is so good. No scene every over stays their welcome",
        "time": "2024-03-27 13:27:03 UTC",
        "score": 2,
        "link_id": "t3_1bosrff",
        "parent_id": "t3_1bosrff"
    },
    {
        "comment_id": "jrmltdf",
        "subreddit": "books",
        "body": "Because publishers only pushed/marketed shitty LOTR fanfiction for a really long time. Also, fantasy was treated like romance: pure escapism. Good stuff was still coming out, but I have no earthly idea how you would find out about it. It feels like there was a conscious effort by publishers to recategotize fantasy books into different genres. This series isn't fantasy. It's paranormal romance. This short story isn't fantasy. It's magical realism. The goddamn Dark Tower books were in the horror section. Harry Potter wasn't in fantasy. It was in young adult. Dune isn't fantasy. It's Science Fiction or Sci Fantasy. Star Wars, too. Anything that wasn't alternative reality set in a facsimile of medieval Europe was something else. \n\nRecently, the genre has been getting taken more seriously. I think the popularity of GoT had a lot to do with that, as it was much less silly and fantastical than previously popular fantasy media. We are also seeing an explosion of different settings and time period analogs. Publishers are finally marketing more ambitious books from different kinds of voices than we've been used to seeing in the past. We are seeing authors explore Big Ideas in fantasy too, or at least those author's work is finally starting to get noticed. I would bet there are tons of gems sitting gathering dust on used bookstore shelves, never to see the light of day because we don't know they exist.",
        "time": "2023-07-12 04:03:05 UTC",
        "score": 12,
        "link_id": "t3_14x8jgs",
        "parent_id": "t3_14x8jgs"
    }
]