[
    {
        "comment_id": "lu913fh",
        "subreddit": "books",
        "body": "I can relate. I stopped reading for a long time bc of the sheer amount of stuff I need to read for work and then just decided I wanted to read something about dragons bc that used to make me happy and suddenly I was crushing novels again.\n\nYou could try:\n\n* **Change the topic/style** - read distinctly different pieces from what you are reading in class. Could be non fiction, genre, movie adaptations, folklore, poetry.\n\n* **Change the format** - listen to audiobooks (that's what got me back to reading for fun- downloaded Libby and went buckwild), try comics, get really into fanfic, lurk in scriptwriting/trading spaces, etc.\n\n* **Be joyfully fickle** - I'd just chase something dumb that makes you happy. Give yourself a low barrier to entry and a lot of leniency in case you hate it or 'meh' it. Just throw around permission to abandon anything that isn't fun, calming, or satisfying.",
        "time": "2024-10-28 22:05:18 UTC",
        "score": 1,
        "link_id": "t3_1gebawv",
        "parent_id": "t3_1gebawv"
    },
    {
        "comment_id": "ltau8ay",
        "subreddit": "books",
        "body": "If we're mathing the math... just on audiobooks I finished, the library saved me as much or more than what I paid to purchase and register a used car this year.\n\nSoooooo.... Thank you, libraries. ❤ There are so many books I'd have never touched without that access.",
        "time": "2024-10-23 05:57:30 UTC",
        "score": 2,
        "link_id": "t3_1g9oe7o",
        "parent_id": "t3_1g9oe7o"
    },
    {
        "comment_id": "l51tsqn",
        "subreddit": "books",
        "body": "Nah, if a writer is asked daily, they can be salty and I, as a reader, am not going to feel a way about it. People don't have to tolerate unreasonable harassment bc they aren't hitting deadlines in any labor setting.\n\nThe same way I think releasing art into the wild means you lose the ability to direct how people engage with it, I think authors don't owe readers labor.\n\nIf people are antsy, get active in fanfic communities. Either as a writer or as a Patreon patron and/or original works supporter of fanfic writers who are giving you the stories you want.",
        "time": "2024-05-21 17:41:22 UTC",
        "score": 0,
        "link_id": "t3_1cwricc",
        "parent_id": "t3_1cwricc"
    },
    {
        "comment_id": "kr5z5bc",
        "subreddit": "books",
        "body": "The book is good, but the ending is stylistically distinct from the rest of it and rushes through the payoff then kinda kills the heroine.\n\nIt's a jarring ending and an emotional response is normal. But like, a \"ruins your afternoon\" level of bummed out. \n\nI'm glad your getting help for any outsized symptoms the stimuli triggered.",
        "time": "2024-02-19 17:43:26 UTC",
        "score": 2,
        "link_id": "t3_1auls2r",
        "parent_id": "t3_1auls2r"
    },
    {
        "comment_id": "kqd5bw9",
        "subreddit": "books",
        "body": "I used to do that in grad school- read notes or chunks of text outloud, record it, play it while in transit. Audio helps me process and recording/playback worked really well.\n\nAudacity is free and you can cut mistakes as you go. I used to upload to Google Drive or One Drive and listen on my phone.\n\nYour voice *does* sound different recorded, so you have to get used to that.",
        "time": "2024-02-14 09:46:26 UTC",
        "score": 13,
        "link_id": "t3_1aqj0p3",
        "parent_id": "t3_1aqj0p3"
    },
    {
        "comment_id": "kpf8t5m",
        "subreddit": "books",
        "body": "Honestly, that's the take on this trope I'm waiting for.\n\nImmortal HotBoy^TM and Marge - the accomplished 50-70 yo underworld powerbroker.",
        "time": "2024-02-08 01:42:48 UTC",
        "score": 5,
        "link_id": "t3_1al9n3v",
        "parent_id": "t1_kpeztmt"
    },
    {
        "comment_id": "kperlhw",
        "subreddit": "books",
        "body": "It's not great. By and large, it's a tell, not a ding. \n\nYou can just make a world without sexism and that slaps. I read a lot of those in fantasy and scifi.\n\nIt graduates to a \"problem\" when the world building includes sexism or the author is operating on some sexist assumptions in subtext/prose. And their methods of dealing with it are \"women aren't actually harmed by this,\" or \"women benefit from sexism.\"\n\nTurning all your femme characters into Pick-Me's is a full on bummer.\n\nTurning them all into 1-dimensional pouters is a tell that you may be a dude/not familiar with the experience.",
        "time": "2024-02-07 23:52:46 UTC",
        "score": 3,
        "link_id": "t3_1akhkpn",
        "parent_id": "t1_kpc0fap"
    },
    {
        "comment_id": "kp91aju",
        "subreddit": "books",
        "body": "Beyond general \"the male gaze\" and \"objectification,\" usually has to do with two or three things:\n\n(1) How bodies feel - there's a lot of boob physics, textures and sensations that gets to \"have you never talked to a woman?\" in books, but same with \"softness\", hips/thighs, long or curly hair, and arousal. ( r/badwomensanatomy has a lot of this)\n\n(2) How sexism works and feels - systemic oppression disappears for a lot of women in books written by men- often the women are even bestowed benefits for being women. And instead of exhaustion, annoyance, or low grade ever present disappointment that can reach rage or needing space from people who don't have to deal with it, we get pouters.\n\n(3) Bullshit stereotypes - all the women-be's - \"over emotional,\" \"natural caretakers,\" \"wanting nothing but to land a man,\" \"baby crazy\" - if the only reason a character wants those things is her gender identity so you don't/won't explain it, that's weird. ( r/menwritingwomen )\n\nI've run into the same problems with women writers who try out body diversity without talking to people with those bodies or haven't dealt with some internalized sexism, but it's usually dudes.",
        "time": "2024-02-06 23:08:31 UTC",
        "score": 40,
        "link_id": "t3_1akhkpn",
        "parent_id": "t3_1akhkpn"
    },
    {
        "comment_id": "kp4s0vf",
        "subreddit": "books",
        "body": "Book Lovers is cute- I loved the storm imagery and the vibes were excellent. I'm just finishing an Emily Henry run and it's been fun- she themes so hard. Her time jump structure is effective (Happy Place/PWMOV), but it stresses me out too much to be at the top, but she's very fun.\n\n&#x200B;\n\n**Favorite:** **Olivia Dade.** I wish more of her stuff was on audiobook, bc the stuff I've been able to read and/or listen to hasn't missed. A friend recommending **Spoiler Alert** is the only reason I started reading romance.\n\n&#x200B;\n\n**Honorable Mentions:** Recently had a lot of fun with **BK Borison**, but have only read **Lovelight Farms**, and the writing team **Sierra Simone and Julie Murphy** got all of my numbers in **Holly Jolly Ever After**\\- all their Christmas Notch stuff has been very fun, but that one was outstanding. **Talia Hibbert** also rules. **Get a Life, Chloe Brown** is seminal and **Act Your Age, Eve Brown** has some of my favorite scenes.\n\n**ETA:** Also, I didn't think of him as romance, but he is- **TJ Klune** has had me both delighted and full body sobbing over romances and stories of finding yourself at different stages of life. (**Under the Whispering Door**.)",
        "time": "2024-02-06 04:02:44 UTC",
        "score": 2,
        "link_id": "t3_1ajmf8p",
        "parent_id": "t3_1ajmf8p"
    },
    {
        "comment_id": "kjw7lvv",
        "subreddit": "books",
        "body": "I'm just glad they're letting it be grown up. It seems like \"will they/won't theys\" plus magic were getting told to be kid books, post-Twilight.\n\nI had a YA novel sneak into my \"cozy fantasy\" exploration and it was like, god damn, let these characters be over 20. Jfc. The relationship was fine/chaste, but the stakes were not appropriate for children/teens. Big Roald Dahl \"we shall whimsey past all the dead children and the ending of Witches!\" energy. \\*shudders\\*\n\nSo long as writers want to make romantic magic and play in fantasy settings, I support it. It can be very fun and very sexy. I might not be there for your gargoyle office romcom, but I fully support it being in the world as the writer intended.\n\nJust, really need people to not tell writers to write to a demo- especially if the publisher/editor doesn't understand genre... dear god, that shit is transparent, bracing, and terrible.\n\n&#x200B;\n\n**tl;dr** \\- as long as the characters are older, it can be very fun and very sexy. I despair the casualties shitty editors forced into YA.",
        "time": "2024-01-28 02:21:35 UTC",
        "score": 4,
        "link_id": "t3_1acp1hv",
        "parent_id": "t3_1acp1hv"
    },
    {
        "comment_id": "kjkuz1p",
        "subreddit": "books",
        "body": "Honorable mention to Time Travel Sapphics\n\nI was rec'd **This is How You Lose the Time War** and **One Last Stop** by a librarian buddy. Then **Pride and Prejudice and Pittsburgh** popped up on StoryGraph like, \"Hey, you missed one.\"",
        "time": "2024-01-25 23:29:17 UTC",
        "score": 3,
        "link_id": "t3_19flced",
        "parent_id": "t1_kjkmpkr"
    },
    {
        "comment_id": "kjkt9y7",
        "subreddit": "books",
        "body": "**Spoiler Alert** by Olivia Dade broke me into romance in October and I haven't stopped since. It's a \"what if an actor who *didn't* play Jaime Lannister wrote fix-it fic and had kinda fallen in love with his online mutual beta reader who he accidentally met bc of her hot not-Brienne of Tarth cosplay?\" \n\nGive me all the body diversity in people who want tear each other's clothes off. More sexy fat people, tall women, and protagonists over 30-40. Please and thank you.\n\n**Spoiler Alert** also got me into soil rehabilitation bc the non-actor protagonist is a geologist. It and the two follow up books have many gifts.\n\nI've read dozens of romances since then (bc they're basically popcorn) but my two other favorites:\n\n* **Get a Life, Chloe Brown** - She's a posh web designer with chronic pain, he's a working class artist turned super. Both protagonists are cute as hell and compellingly going through it.\n\n* **A Holly Jolly Ever After** - the first Christmas Notch book is solid, but the second fucking slaps. The protagonists are both cinnamon rolls and the relationship plot is character-driven in such an artful way w/o being heavy handed.",
        "time": "2024-01-25 23:18:47 UTC",
        "score": 6,
        "link_id": "t3_19flced",
        "parent_id": "t3_19flced"
    },
    {
        "comment_id": "kjhw9hg",
        "subreddit": "books",
        "body": "Broadstrokes - See: Jane Austen\n\nFourth Wing - it's Pride and Prejudice in a murder school >!with lightning orgasms!< and dragons. The books are edgelord-y, but the love interest in the first book is gruff but, on his own, non-toxic.\n\nThat dude *is* toxic in as much as he's been successful in an incredibly abusive system. You know, the way the collective Darcies probably owned slaves and mass displaced Scottish people. (Plus, when the Scholomance feels chill, it's an extremely bad system. No one is a good teacher in Fourth Wing.)\n\nThere *is* some genuinely skin crawling >!love bombing, undermining, and isolation!<, but it's not coming from the main love interest.",
        "time": "2024-01-25 12:59:10 UTC",
        "score": 1,
        "link_id": "t3_19enp7a",
        "parent_id": "t3_19enp7a"
    },
    {
        "comment_id": "kjhdaga",
        "subreddit": "books",
        "body": "Yeah \"watery\" done got in the ether.\n\nI just read \"watery sigh\" in a book earlier today.\n\nDid it blow up on AO3 or that Iowa Writer's Clinic everyone graduates from? This is... prolific.",
        "time": "2024-01-25 09:39:42 UTC",
        "score": 1,
        "link_id": "t3_19dqv5w",
        "parent_id": "t1_kjcd857"
    },
    {
        "comment_id": "kjbegi4",
        "subreddit": "books",
        "body": "\"Watery eyes\" is at least something I understand. Eyes do water. Watery eyes are holding tears (for many purposes.) I know what that looks and feels like. It's a shortening of \"eyes watered.\"\n\nLips/emotional expressions probably shouldn't be holding water. If you apply the same \"watery\" across eyes and smiles, that sounds like something is medically terribly wrong.\n\nJust vomiting, dribbling or unsuccessfully water through your weak smile, like a super normal Tuesday.",
        "time": "2024-01-24 06:28:22 UTC",
        "score": 2,
        "link_id": "t3_19dqv5w",
        "parent_id": "t1_kj9v5m0"
    },
    {
        "comment_id": "kj8krom",
        "subreddit": "books",
        "body": "\"Watery smile\"\n\nI don't fuss about words or phrasing much- I even really like the word \"moist\"- but the phrase \"watery smile\" is slowly tipping me over the edge.\n\nLove when a smile warbles, wobbles, breaks, is hollow, wane, or weak.\n\nBut \"watery\"? come on, now. Where did this shit come from?",
        "time": "2024-01-23 19:26:57 UTC",
        "score": 3,
        "link_id": "t3_19dqv5w",
        "parent_id": "t3_19dqv5w"
    }
]