[
    {
        "comment_id": "lstmcdm",
        "subreddit": "books",
        "body": "This is specific to two authors.  I've always liked Dostoyevski better than Tolstoy.  But my favorite book is Anna Karenina (Tolstoy).  I've read multiple books by both.",
        "time": "2024-10-20 10:32:03 UTC",
        "score": 1,
        "link_id": "t3_1g7crmp",
        "parent_id": "t3_1g7crmp"
    },
    {
        "comment_id": "lfvrr6u",
        "subreddit": "books",
        "body": "I dnf'd it.",
        "time": "2024-07-31 21:52:50 UTC",
        "score": 2,
        "link_id": "t3_1egr3fz",
        "parent_id": "t1_lfu43e9"
    },
    {
        "comment_id": "l3g6dho",
        "subreddit": "books",
        "body": "Yeah, I was amused by it.",
        "time": "2024-05-10 16:05:23 UTC",
        "score": -4,
        "link_id": "t3_1comiky",
        "parent_id": "t1_l3g00g1"
    },
    {
        "comment_id": "l3ft4se",
        "subreddit": "books",
        "body": "*(Grift Article)",
        "time": "2024-05-10 14:48:13 UTC",
        "score": -38,
        "link_id": "t3_1comiky",
        "parent_id": "t3_1comiky"
    },
    {
        "comment_id": "kvm8j7c",
        "subreddit": "books",
        "body": "I'm saying standards already existed, but that doesn't mean they can't change if they are found inadequate.  I think conservatives are cherry-picking examples of books that shouldn't be allowed, but the fact those books are there at all is evidence that the standards aren't adequate.",
        "time": "2024-03-19 18:43:31 UTC",
        "score": -7,
        "link_id": "t3_1bif74s",
        "parent_id": "t1_kvlovgx"
    },
    {
        "comment_id": "kvkzx25",
        "subreddit": "books",
        "body": "I fail to see this as a book ban.  No public school allows every book, no matter the content, to be available in their library.  I do think there are legitimate arguments over what is objectionable, but saying the government can't be involved in determining what is available in government run schools is just silly.",
        "time": "2024-03-19 14:29:57 UTC",
        "score": -24,
        "link_id": "t3_1bif74s",
        "parent_id": "t3_1bif74s"
    },
    {
        "comment_id": "kty8kfm",
        "subreddit": "books",
        "body": "2.  But only because I refuse to admit I've more or less given up on Truman (going on 3 years now)",
        "time": "2024-03-08 18:17:48 UTC",
        "score": 1,
        "link_id": "t3_1b9qef6",
        "parent_id": "t3_1b9qef6"
    },
    {
        "comment_id": "kiaob6f",
        "subreddit": "books",
        "body": "Do yourself a favor (if you haven't already) and get Based on a True Story in audiobook.  I loved it when I read it, but it was even better in Norms own voice, with his cadence and comedic timing.  I'm not a big books on tape guy, but this one is definitely worth it.",
        "time": "2024-01-17 16:14:15 UTC",
        "score": 1,
        "link_id": "t3_198g5du",
        "parent_id": "t1_ki7v3ar"
    },
    {
        "comment_id": "kialxxr",
        "subreddit": "books",
        "body": "They Both Die at the End.\n\nI heard great things about it and I know it got a lot of praise, but I found it to be uncompelling.  I didn't like the writing style, and I didn't see anything particularly interesting about the characters - I especially hated the dialogue.  I normally try not to know too much about books before I read them, but I was compelled to look into the book to see why/whether I should continue.\n\nSPOILER:  When I saw it was considered an LGTQIA book, it kind of spoiled for me where the story was heading.  I know this is going to be a controversial take, but I also kind of assumed it's status as LGBTQIA material probably resulted in more praise for the book than it merited.  For the record, I have no problem with consuming LGBTQIA literature if it's good, but a lot of material is treated as better than it is just because it touches on certain topics.",
        "time": "2024-01-17 16:00:35 UTC",
        "score": 1,
        "link_id": "t3_198g5du",
        "parent_id": "t3_198g5du"
    }
]