[
    {
        "comment_id": "lqibceo",
        "subreddit": "books",
        "body": "I only listen on the normal speed. I don't need it to be faster. Sometimes I even play things a little bit slower when I'm listening to audiobooks to fall asleep.",
        "time": "2024-10-05 20:04:31 UTC",
        "score": 1,
        "link_id": "t3_1fwwz1g",
        "parent_id": "t3_1fwwz1g"
    },
    {
        "comment_id": "lp65l93",
        "subreddit": "books",
        "body": "This has nothing to do with the article but the news site being called Kut News is so funny to me. In dutch it literally translates to Cunt News. But it means something more like \"shitty news/bad news\" ",
        "time": "2024-09-27 11:50:35 UTC",
        "score": 1,
        "link_id": "t3_1fqkg2h",
        "parent_id": "t3_1fqkg2h"
    },
    {
        "comment_id": "loe999o",
        "subreddit": "books",
        "body": "If women in the past wouldn't have \"thrown tantrums\" (what a word to use in this case) about this kind of stuff we would not have the rights we have now. Of course people got mad even if they new things were expected of them. It happened then and it happens today. People weren't passive figures floating through life behaving like people expected of them, ever.",
        "time": "2024-09-22 17:48:13 UTC",
        "score": 5,
        "link_id": "t3_1fmwj8h",
        "parent_id": "t3_1fmwj8h"
    },
    {
        "comment_id": "llp7eob",
        "subreddit": "books",
        "body": "I don't mind if it doesn't change the meaning of a storey. I was recently re-reading my favorite book as a kid and it is all good except for one chapter where people blacken their faces to look like devils. The devil's are compared to Black Pete (a Dutch racist tradition that's finally fading out ) and \"bos negers\" the word neger in Dutch isn't like the n word in English but it would not be used today. Changing those things doesn't change the story telling and I think it would be fine to change them. Especially cause I think (hope) that kids that are born now will probably not understand what Black Pete is anyway.\n\n\n(The book is crude in jeans. The book is amazing. The movie is terrible )",
        "time": "2024-09-05 22:02:49 UTC",
        "score": 1,
        "link_id": "t3_1f9se4f",
        "parent_id": "t3_1f9se4f"
    },
    {
        "comment_id": "ll0v193",
        "subreddit": "books",
        "body": "I start reading them but sometimes skip to the real begining of the book if they are too long or boring.",
        "time": "2024-09-01 18:05:28 UTC",
        "score": 1,
        "link_id": "t3_1f6jh0c",
        "parent_id": "t3_1f6jh0c"
    },
    {
        "comment_id": "lfvbvpi",
        "subreddit": "books",
        "body": "Its not the worst book I ever read, but I found the Bear and the Nightingale a huge let down. Everything about it sounds great but I didn't like the book at all. Yet everyone seems to love it. So I guess that would be my book I don't like that everyone seems to love.",
        "time": "2024-07-31 20:26:35 UTC",
        "score": 1,
        "link_id": "t3_1egr3fz",
        "parent_id": "t1_lfu5hpe"
    },
    {
        "comment_id": "le4wtmk",
        "subreddit": "books",
        "body": "I tried to move over once but it made such a huge mess of the books I importated that I gave up and stayed on Goodreads. It was a few years ago so maybe things are different now but at the time Storygraph had very few non-english books in it's database and since about half the books I read aren't in English there wasn't much of a point using it.\n\n\nI also thing Goodreads is fine for what it is. It tracks the books in reading and does that nicely so I'm not very motivated to leave to begin with.",
        "time": "2024-07-20 21:10:38 UTC",
        "score": 9,
        "link_id": "t3_1e81bx3",
        "parent_id": "t3_1e81bx3"
    },
    {
        "comment_id": "laioxtw",
        "subreddit": "books",
        "body": "Mein Kampf, probably ",
        "time": "2024-06-27 13:27:41 UTC",
        "score": 1,
        "link_id": "t3_1dpokdb",
        "parent_id": "t1_lai70tp"
    },
    {
        "comment_id": "l6cyzof",
        "subreddit": "books",
        "body": "You say rest of the world like every other country uses the English title. Tijd book is called Mannen die vrouwen haten in Dutch. A literal translation of the original title. ",
        "time": "2024-05-30 18:32:13 UTC",
        "score": 3,
        "link_id": "t3_1d40w2z",
        "parent_id": "t1_l6c1kr4"
    },
    {
        "comment_id": "l5vcsrh",
        "subreddit": "books",
        "body": "Many people already gave good tips to make reading in English easier , but is reading translations not an option for you? The books you name are all wel known and have been translated into many languages. You could do a bit of both. Read some stuff in English so reading in English gets easier and read some translated works so the reading itself is more fun and doesn't feel like studying. ",
        "time": "2024-05-27 11:46:17 UTC",
        "score": 3,
        "link_id": "t3_1d1o6a7",
        "parent_id": "t3_1d1o6a7"
    },
    {
        "comment_id": "kr6m6s4",
        "subreddit": "books",
        "body": "I like knitting, crocheting, coloring or playing simple games on the switch while listening to audiobooks.",
        "time": "2024-02-19 19:50:06 UTC",
        "score": 1,
        "link_id": "t3_1aupnge",
        "parent_id": "t3_1aupnge"
    },
    {
        "comment_id": "koq23du",
        "subreddit": "books",
        "body": "You think since I'm in this sub i van read but apparently I can't.\n\n\nI've only seen this in china (a friend ordered a book online as a gift for me and got a fake copy) where no one gives a fuck. I don't think op should be worried although I would be very annoyed as a buyer. But not worried. ",
        "time": "2024-02-03 11:12:12 UTC",
        "score": 19,
        "link_id": "t3_1ahtjyf",
        "parent_id": "t1_koq1i01"
    },
    {
        "comment_id": "koq19u9",
        "subreddit": "books",
        "body": "Libraries sell books all the time so I don't see the problem ? As far as I know it's not illegal to sell second hand books that don't have copyright in your country either so I wouldn't worry. ",
        "time": "2024-02-03 11:02:09 UTC",
        "score": 36,
        "link_id": "t3_1ahtjyf",
        "parent_id": "t3_1ahtjyf"
    },
    {
        "comment_id": "kk60bqo",
        "subreddit": "books",
        "body": "When Lark rise to candleford was being broadcast I found the book at the secondhand bookstore. I don't live in the UK and as far as I know the show wasn't broadcast over here (I had to pirate it to watch it). The book hasn't been translated to Dutch either so it can't have been much of a succes here. So it was pretty cool to find the book at that moment!",
        "time": "2024-01-29 21:43:40 UTC",
        "score": 2,
        "link_id": "t3_1ae53bx",
        "parent_id": "t3_1ae53bx"
    },
    {
        "comment_id": "kjmvkme",
        "subreddit": "books",
        "body": "Cheating what? I thought reading was a hobby, I didn't know it was supposed to be a competition with rules. Is there a referee next to your bed when you read checking if you stick to the rules ? ",
        "time": "2024-01-26 09:19:18 UTC",
        "score": 29,
        "link_id": "t3_1abe62v",
        "parent_id": "t3_1abe62v"
    },
    {
        "comment_id": "khdzgko",
        "subreddit": "books",
        "body": "Rosie Project. Everyone in my life has told me to read it and nothing about the synopsis sounds interesting to me.",
        "time": "2024-01-11 17:20:20 UTC",
        "score": 3,
        "link_id": "t3_1946ke4",
        "parent_id": "t3_1946ke4"
    },
    {
        "comment_id": "kdrxrst",
        "subreddit": "books",
        "body": "I don't even plan the next book I'll read most of the time. By the time I finish the book I'm reading I'll figure out what book I feel like reading next.",
        "time": "2023-12-17 17:30:37 UTC",
        "score": 2,
        "link_id": "t3_18kklv4",
        "parent_id": "t3_18kklv4"
    },
    {
        "comment_id": "kd6m3ld",
        "subreddit": "books",
        "body": "I jump from aubiobook service to audiobook service depending on discount codes etc. So I'll habe audible for a few months for like 5 euros and then I'll have bookbeat for a few months for 10 euros etc. If you listen to a lot of books a book steaming service (like bookbeat of Storytel) might be a good match for you?",
        "time": "2023-12-13 14:34:33 UTC",
        "score": 19,
        "link_id": "t3_18hhl76",
        "parent_id": "t3_18hhl76"
    },
    {
        "comment_id": "kd3dwkl",
        "subreddit": "books",
        "body": "I'm a nosey person and I like reading memoirs to read about different experiences in life. A lot of non famous people have interesting stories to tell too. So that makes me read them.",
        "time": "2023-12-12 21:40:48 UTC",
        "score": 1,
        "link_id": "t3_18gqxj6",
        "parent_id": "t3_18gqxj6"
    },
    {
        "comment_id": "kb5afcp",
        "subreddit": "books",
        "body": "And the band played on, people politics and the aids epidemic. It's a pretty big book but I breezed through it. It's very sad but also almost reads like a detective. A mysterious virus appears, people start dying but no one knows why, how does it spread? Covid hit about a year after I read this book and it really felt kind of the same. The book is also very very das though, but really worth a read.",
        "time": "2023-11-28 18:10:52 UTC",
        "score": 1,
        "link_id": "t3_185xs9s",
        "parent_id": "t3_185xs9s"
    },
    {
        "comment_id": "kb0keam",
        "subreddit": "books",
        "body": "I had a real good time hate reading that book! Obviously pirated it , and I'm also not from the US. I think if it was a book by someone from my country in her position I would not have found it that entertaining.",
        "time": "2023-11-27 19:46:42 UTC",
        "score": 2,
        "link_id": "t3_1856ppz",
        "parent_id": "t1_kazruh4"
    },
    {
        "comment_id": "k7tw384",
        "subreddit": "books",
        "body": "I've read quite a few signed books. Why not? It's a book, and if I went through the effort to get it signed (mostly after attending talks by the author) than its most likely a book I'm very excited to read.",
        "time": "2023-11-04 19:40:10 UTC",
        "score": 2,
        "link_id": "t3_17nrn5d",
        "parent_id": "t3_17nrn5d"
    },
    {
        "comment_id": "k5ph6pw",
        "subreddit": "books",
        "body": "I loved the first book and somehow kind of read over those but I quit reading the second book half way through after the 2nd or 3rd time a woman was raped but hey her body betrayed her cause she actually got aroused! It was disgusting. I love epic historical novels but this really ruined the books for me.",
        "time": "2023-10-20 16:14:30 UTC",
        "score": 1,
        "link_id": "t3_17c9av8",
        "parent_id": "t1_k5ohg6d"
    },
    {
        "comment_id": "jr6nj1h",
        "subreddit": "books",
        "body": "Maybe your local bookstore has signings sometimes? \n\nI've also seen people sell books on very specific themes at festivals or themed markets.",
        "time": "2023-07-08 18:55:52 UTC",
        "score": 20,
        "link_id": "t3_14u89ve",
        "parent_id": "t1_jr6im9i"
    },
    {
        "comment_id": "jlz0tu6",
        "subreddit": "books",
        "body": "Why do you dislike pdf (or epub or ..) ?\nI have no horse in this race but if you read it in the bookstore you are not paying for the book either.",
        "time": "2023-05-28 18:14:26 UTC",
        "score": 0,
        "link_id": "t3_13u3aso",
        "parent_id": "t3_13u3aso"
    },
    {
        "comment_id": "jhe0mz7",
        "subreddit": "books",
        "body": "I use Epubs, most books here sold digitally are sold as epub.",
        "time": "2023-04-23 13:14:12 UTC",
        "score": 8,
        "link_id": "t3_12w6uzn",
        "parent_id": "t3_12w6uzn"
    },
    {
        "comment_id": "jgl2pck",
        "subreddit": "books",
        "body": "I thought the movie was really funny. Haven't read the book yet though.",
        "time": "2023-04-17 07:26:49 UTC",
        "score": 46,
        "link_id": "t3_12ovtpw",
        "parent_id": "t1_jgknljl"
    },
    {
        "comment_id": "jdvhrj5",
        "subreddit": "books",
        "body": "I just started The Little Old Lady Who Broke All the Rules by Catharina Ingelman-Sundberg and so far it's really fun!",
        "time": "2023-03-27 14:34:47 UTC",
        "score": 1,
        "link_id": "t3_123i55e",
        "parent_id": "t3_123i55e"
    },
    {
        "comment_id": "j8ae9nz",
        "subreddit": "books",
        "body": "I never read the bible. I heard about it in pop culture but never read it. Must be underrated.",
        "time": "2023-02-12 21:18:36 UTC",
        "score": 38,
        "link_id": "t3_110my9a",
        "parent_id": "t1_j8ac2l4"
    },
    {
        "comment_id": "j89z3p7",
        "subreddit": "books",
        "body": "This sub once had someone claiming Dracula was underrated so nothing surprises me anymore.",
        "time": "2023-02-12 19:35:21 UTC",
        "score": 86,
        "link_id": "t3_110my9a",
        "parent_id": "t1_j89taok"
    },
    {
        "comment_id": "j82eea5",
        "subreddit": "books",
        "body": "It's the plot for Spare",
        "time": "2023-02-11 02:58:28 UTC",
        "score": 6,
        "link_id": "t3_10ywwij",
        "parent_id": "t1_j80y4eu"
    },
    {
        "comment_id": "j8094tq",
        "subreddit": "books",
        "body": "Not more or less pretentious than people in this sub.",
        "time": "2023-02-10 17:53:46 UTC",
        "score": 36,
        "link_id": "t3_10ywwij",
        "parent_id": "t3_10ywwij"
    }
]