[
    {
        "comment_id": "lq2i5yq",
        "subreddit": "books",
        "body": "One thing I’m now noticing while chatting about it however is that students this year are more talkative and actually answering questions in class. It honestly feels like there’s more energy on campus overall. Maybe things are finally (slowly) correcting themselves and returning to normal. But when I first got here it was very common for a professor to ask a question and turn into Dora the explorer blankly staring at the class until they just say the answer themselves. That’s less common now and I can only remember it happening once this year so far.",
        "time": "2024-10-03 01:13:28 UTC",
        "score": 1,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lq2gujs"
    },
    {
        "comment_id": "lq28f3t",
        "subreddit": "books",
        "body": "That’s an interesting point. I did go to community college after where everyone still participated, but not a four year like now.\n\nI will say however, when I tell my friends who went to school when they were supposed to that students are quiet in class now that they are surprised, if that says anything",
        "time": "2024-10-03 00:11:42 UTC",
        "score": 2,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpxi7j7"
    },
    {
        "comment_id": "lpv07a1",
        "subreddit": "books",
        "body": "As another current college student at a top public university, I disagree. I’m Econ and communication so I have both math and easy classes and it’s been a rare few that haven’t provided a study guide. I’m also 29 so I was surprised at how easy things have gotten since I was in highschool. Canvas alone, the online portal where everyone accesses their courses, has made learning how to stay organized trivial and school much easier (assignments due online at midnight? Insanity! But helpful), which I think is good. But maaaan I have never been in a classroom before where a teacher asks a question and nobody says anything at all. That was new. Students have lost a lot of skills",
        "time": "2024-10-01 19:32:06 UTC",
        "score": 12,
        "link_id": "t3_1ftnbp2",
        "parent_id": "t1_lpta8fh"
    }
]