[
    {
        "comment_id": "lxtgtxy",
        "subreddit": "books",
        "body": "Sure are a lot of people who seem to hate books, readers, and authors filling up this book subreddit.",
        "time": "2024-11-18 21:01:06 UTC",
        "score": 7,
        "link_id": "t3_1gu6pqo",
        "parent_id": "t3_1gu6pqo"
    },
    {
        "comment_id": "ltlzt79",
        "subreddit": "books",
        "body": "And in this club, we've been open about the things we would rather avoid and are keeping that in mind when picking the books because we're coworkers and want to be respectful of each other.",
        "time": "2024-10-25 01:06:20 UTC",
        "score": 3,
        "link_id": "t3_1gb3cjp",
        "parent_id": "t1_ltlw0rr"
    },
    {
        "comment_id": "ltlfgoj",
        "subreddit": "books",
        "body": "Ah yes, I forgot that the point of an office book club is not to socialize and have fun over some shared light reading from different genres, but to subject everyone involved to my exact taste and decide for them what content they're comfortable with, knowing the absolute minimum about their lives. It's the normal thing that normal people do to casual acquaintances.",
        "time": "2024-10-24 23:04:14 UTC",
        "score": 2,
        "link_id": "t3_1gb3cjp",
        "parent_id": "t1_ltlcjnn"
    },
    {
        "comment_id": "ltimdnh",
        "subreddit": "books",
        "body": "What, in particular, sounds ridiculous? Book clubs?",
        "time": "2024-10-24 14:25:26 UTC",
        "score": 1,
        "link_id": "t3_1gb3cjp",
        "parent_id": "t1_ltil11l"
    },
    {
        "comment_id": "lp1ug6j",
        "subreddit": "books",
        "body": "Literally all of my final essays in undergrad and grad school had to be rigorously sourced with my positions defended. I don't know how this changes anything, aside from students relying on shit information.",
        "time": "2024-09-26 17:24:12 UTC",
        "score": 1,
        "link_id": "t3_1fphjnb",
        "parent_id": "t1_loxq8a5"
    },
    {
        "comment_id": "llgwccn",
        "subreddit": "books",
        "body": "The thing is, those things have already existed for a while. Spell check is leagues better than it was ten years ago. The difference is that people have started calling a lot more algorithmic software systems \"AI\" because LLMs did and they thought it was a strong buzz word to get buy-in from investors and the public. Only, the public quickly turned against it, and now it's a signifier of poor quality and loose ethics, but a lot of companies have already invested heavily in ruining their reputations and don't know how to pivot",
        "time": "2024-09-04 14:09:25 UTC",
        "score": 25,
        "link_id": "t3_1f8nukm",
        "parent_id": "t1_llg3581"
    },
    {
        "comment_id": "lk10b8k",
        "subreddit": "books",
        "body": "She's not behaving like someone who has a lawyer, and a lawyer has clearly not reviewed that copy. She's asking public institutions to become \"affiliates\" over a trademark dispute, which is nonsensical. If she had any representation, she would be asking them to apply for a license to use the trademarked term, which is all that's required.\n\nGenerally, when someone is reaching out personally and in such a weird way, they're not receiving legal representation. Frankly, I don't think she can afford to sue a bunch of libraries, so ignoring her is unlikely to yield consequences.\n\nAdditionally, her attempt to trademark the term \"Walk\" in regards to book clubs based around walking (and by claiming any similar terminology is too similar she is functionally doing just that) is so generic that it's unlikely to ever pass muster in court.\n\nAsk a city attorney to respond with a formal letter on the municipality's letterhead and she will likely back off. Tell them to be mean about it.",
        "time": "2024-08-26 15:39:46 UTC",
        "score": 48,
        "link_id": "t3_1f1oz62",
        "parent_id": "t1_lk0o5ln"
    },
    {
        "comment_id": "lgy29hq",
        "subreddit": "books",
        "body": "The more you look into that world, the more amazing it is that they've been stable enough to develop steel. There are whole civilizations that were wiped out by Lovecraftian catastrophes.",
        "time": "2024-08-07 14:42:59 UTC",
        "score": 2,
        "link_id": "t3_1elya2s",
        "parent_id": "t1_lgvmqep"
    },
    {
        "comment_id": "lfzlowl",
        "subreddit": "books",
        "body": "Deflecting with nonsense when people think your behavior reflects on your character is also indicative of your character.",
        "time": "2024-08-01 15:26:03 UTC",
        "score": 29,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t1_lfziyyo"
    },
    {
        "comment_id": "lfzigce",
        "subreddit": "books",
        "body": "I'm beyond disturbed that knowing that an employer walked in on his employee as she was bathing and engaged in sexual behavior the day they met — behavior that she says left her feeling terrified and humiliated in addition to the physical pain — has had absolutely no impact on whether you'll make crude jokes about her experience. His own account of it corroborates everything she said, with his only claim of innocence being that he said she wanted it while her filing a police report indicates that she certainly did not.\n\nThere is no reasonable doubt here. The agree on what occurred, and she says it was not consensual and filed a police report when it happened. The only reason not to believe her is because you don't care what women say about their own lived experience, and the only reason to leave this comment up is because you don't care about sexual assault. That says a lot about you as a human being, and none of it good.",
        "time": "2024-08-01 15:08:45 UTC",
        "score": 36,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t1_lfzg4ds"
    },
    {
        "comment_id": "lfzh5fn",
        "subreddit": "books",
        "body": "His account of events with his nanny confirms all of the details of her story, except he was convinced that she wanted it while she says it was terrifying and painful. I think it beyond likely that she is more knowledgeable about her mental state than he is.\n\nI cannot think of a single reason to disbelieve these women at this point.",
        "time": "2024-08-01 15:01:37 UTC",
        "score": 38,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t1_lfzdgc9"
    },
    {
        "comment_id": "lfzgnmv",
        "subreddit": "books",
        "body": "The fact that his own description of events with his child's nanny — who was 1/3 his age — involves him walking in on his employee while she was bathing and making sexual contact the day he met her is definitely something that strikes me as creepy and inappropriate. The fact that this correlates exactly with her account — where she describes it as painful and terrifying before — and that a police report was filed kind of confirms that this was horribly creepy and inappropriate, and frankly convinces me it was sexual assault.",
        "time": "2024-08-01 14:58:54 UTC",
        "score": 149,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t1_lfzb5ve"
    },
    {
        "comment_id": "lfzftxq",
        "subreddit": "books",
        "body": "It's indicative of your moral character that after you were provided with the specific evidence that she filed a police report and the NZ police are investigating it, you left this disgusting comment in place.",
        "time": "2024-08-01 14:54:31 UTC",
        "score": 70,
        "link_id": "t3_1ehh0u4",
        "parent_id": "t1_lfz90ym"
    }
]