[
    {
        "comment_id": "lx9pb4r",
        "subreddit": "books",
        "body": "They will. Then we go flood truthsocial with leftist memes.",
        "time": "2024-11-15 14:35:33 UTC",
        "score": 15,
        "link_id": "t3_1grx1by",
        "parent_id": "t1_lx9o6xo"
    },
    {
        "comment_id": "lumktx8",
        "subreddit": "books",
        "body": "Exacerbating an accelerating extreme substance abuse is still astronomically worse than hindering finishing a series like GRRM.",
        "time": "2024-10-31 01:33:42 UTC",
        "score": 6,
        "link_id": "t3_1gg0dmp",
        "parent_id": "t1_lum6ypw"
    },
    {
        "comment_id": "lubw9mf",
        "subreddit": "books",
        "body": "Tolkien, after 52 minutes have elapsed: \"can I eat my sandwich now or do you have another question?\"",
        "time": "2024-10-29 11:08:00 UTC",
        "score": 1,
        "link_id": "t3_1gei9yq",
        "parent_id": "t3_1gei9yq"
    },
    {
        "comment_id": "lt1s8f7",
        "subreddit": "books",
        "body": "\"I said [REDACTED] about [transgender people] and was banned from social media!! The world is run by [REDACTED]!!!\"",
        "time": "2024-10-21 18:51:13 UTC",
        "score": -2,
        "link_id": "t3_1g8tfvk",
        "parent_id": "t1_lt17a7u"
    },
    {
        "comment_id": "lr6k48g",
        "subreddit": "books",
        "body": "Literally only one person in the whole world knows what Melania Trump thinks of this whole situation. Donald will certainly never know for sure",
        "time": "2024-10-10 00:51:09 UTC",
        "score": 11,
        "link_id": "t3_1g04ng6",
        "parent_id": "t1_lr6j4ay"
    },
    {
        "comment_id": "lr6iz3a",
        "subreddit": "books",
        "body": "They just edited all the \"my husband's second term\" to \"my husband's only term\"\n\nHere's to hoping this joke stands in 2 months.",
        "time": "2024-10-10 00:44:00 UTC",
        "score": 114,
        "link_id": "t3_1g04ng6",
        "parent_id": "t1_lr6bix5"
    },
    {
        "comment_id": "lr6i56u",
        "subreddit": "books",
        "body": "If that were the case, you think the Trump campaign would let it go to print?",
        "time": "2024-10-10 00:38:53 UTC",
        "score": 29,
        "link_id": "t3_1g04ng6",
        "parent_id": "t1_lr66qr4"
    },
    {
        "comment_id": "lr6hv2j",
        "subreddit": "books",
        "body": "Melania always wears pristine designer clothes and then happened to wear that on that day. Weirdest thing.",
        "time": "2024-10-10 00:37:07 UTC",
        "score": 92,
        "link_id": "t3_1g04ng6",
        "parent_id": "t1_lr69l2x"
    },
    {
        "comment_id": "lr6czus",
        "subreddit": "books",
        "body": "Like Wickham",
        "time": "2024-10-10 00:06:41 UTC",
        "score": 2,
        "link_id": "t3_1fzz7wt",
        "parent_id": "t1_lr5f0a7"
    },
    {
        "comment_id": "lko33aa",
        "subreddit": "books",
        "body": "Number the Stars, and even The Sound of Music. We never see into camps in them but the danger is palpable and poignant.",
        "time": "2024-08-30 13:25:51 UTC",
        "score": 12,
        "link_id": "t3_1f4kp4c",
        "parent_id": "t1_lkmkwgq"
    },
    {
        "comment_id": "lhq9q39",
        "subreddit": "books",
        "body": "Voldemort was attached to the back of someone else's head at the time but the point stands.\n\nIt's also worth noting that Voldemort himself was also sorted into Slytherin and managed to elevate himself to the peak of their click despite having no known wizard ancestry or even exposure at the time of sorting. He didn't even have the benefit of a known wizard name or a famous backstory like Harry, he was a totally unknown entity who just thrived in that environment.",
        "time": "2024-08-12 11:28:53 UTC",
        "score": 18,
        "link_id": "t3_1eqaaz3",
        "parent_id": "t1_lhq8fqz"
    },
    {
        "comment_id": "lhq9amt",
        "subreddit": "books",
        "body": "It's not a story the Gryffindors would tell you",
        "time": "2024-08-12 11:25:13 UTC",
        "score": 7,
        "link_id": "t3_1eqaaz3",
        "parent_id": "t1_lhq81di"
    },
    {
        "comment_id": "lhq94pn",
        "subreddit": "books",
        "body": "A wizard did it",
        "time": "2024-08-12 11:23:49 UTC",
        "score": 1,
        "link_id": "t3_1eqaaz3",
        "parent_id": "t1_lhq67s9"
    },
    {
        "comment_id": "lhq93dy",
        "subreddit": "books",
        "body": "The first four are in the Hardy Boys model, the last 3 transition into political thrillers for kids.",
        "time": "2024-08-12 11:23:30 UTC",
        "score": 3,
        "link_id": "t3_1eqaaz3",
        "parent_id": "t1_lhq6a3d"
    },
    {
        "comment_id": "lhq8vuc",
        "subreddit": "books",
        "body": "It mirrors the scene at the end of book 1 when Voldemort confronts Harry again.",
        "time": "2024-08-12 11:21:45 UTC",
        "score": 18,
        "link_id": "t3_1eqaaz3",
        "parent_id": "t1_lhq65q8"
    },
    {
        "comment_id": "lhdv96v",
        "subreddit": "books",
        "body": "So, I remember correctly.",
        "time": "2024-08-10 03:28:25 UTC",
        "score": 1,
        "link_id": "t3_1enrvie",
        "parent_id": "t1_lhdsm3b"
    },
    {
        "comment_id": "lhc8f81",
        "subreddit": "books",
        "body": "Yes, but what she wrote wasn't expressly a children's novel nor was it a book that appeals more to kids than adults. And as she progressed through the series she moved further away from that label. My point is that initially she conceived of it as a novel for young adults because that was the only market fantasy was ever marketed towards. Actually if I remember right, she was asked to write a fantasy novel so they could market it to young adults and instead she wrote an ageless masterpiece, albeit one that appeals more to adults than children.",
        "time": "2024-08-09 21:10:23 UTC",
        "score": 4,
        "link_id": "t3_1enrvie",
        "parent_id": "t1_lhc6k8k"
    },
    {
        "comment_id": "lhc1mtd",
        "subreddit": "books",
        "body": "Yes, but it didn't turn out that way. Essentially fantasy was labelled a children's genre so when she wrote Wizard that's how it was viewed.",
        "time": "2024-08-09 20:33:54 UTC",
        "score": 4,
        "link_id": "t3_1enrvie",
        "parent_id": "t1_lhag6vu"
    },
    {
        "comment_id": "lh9efib",
        "subreddit": "books",
        "body": "I agree in theory, although I'm not convinced on Martin. I actually hate his prose but that's just my preference. His themes and tropes I find more advanced than most other contemporary authors I've explored. They mainly boil down to power corrupts and war is a tool used by the rich to achieve power at the expense of the workers. That's not a complex or deep message but it is a message. Does he offer a positive alternative philosophy to counterbalance the negative message? I don't know.\n\nI think the trivialization of fantasy is in the commercialization of films, TV series, games, and low-quality novels churned out by publishers. Tropes and imagery from fantasy are used to excite, entice, and titilate the consumer with visual feasts of gore and sex, set in a backdrop where realworld limitations don't apply and morality can be ignored because it's \"just fantasy\". It isn't even all as bad as that, not everything in the genre is gore-fetish material, a lot of it is just empty drivel generated to capture an audience long enough to get their money and be forgotten before they realize the quality was so low, or else keep generating new content to maintain engagement and revenue with an audience trained to expect nothing better.\n\nLe Guin exists so far outside that spectrum of content that it's not surprising to see people baffled and bewildered by her work now. Fantasy was almost entirely the domain of children's novels in her age (at least marketed that way) and *Earthsea* had never fit that label either in my opinion. Le Guin wrote something that can't be categorized or classified or defined by any genre labels or assumptions that have ever exised, and that's what sets her fantasy work in a separate category along with a handful of other true classics like Tolkien's work or (in my opinion) Lewis' *Till We Have Faces*.\n\nI think Martin understands this and wrote something that criticizes the fetishization of fantasy settings, but is let down by his quality of prose (which I know is a personal opinion). I wouldn't put him with Tolkien and Le Guin, but I wouldn't throw him into the trash pit with all the genre-junk either.",
        "time": "2024-08-09 11:46:43 UTC",
        "score": 29,
        "link_id": "t3_1enrvie",
        "parent_id": "t1_lh958kx"
    }
]