[
    {
        "comment_id": "lwvtgwh",
        "subreddit": "books",
        "body": "shonen media seems to be a stalwart. seems like a branding issue for western traditional \"literature\".",
        "time": "2024-11-13 07:15:41 UTC",
        "score": 4,
        "link_id": "t3_1gq1vwu",
        "parent_id": "t3_1gq1vwu"
    },
    {
        "comment_id": "lrcasmb",
        "subreddit": "books",
        "body": "Book tube/book tok make me dislike books as a medium and writing books is my job.",
        "time": "2024-10-11 00:48:48 UTC",
        "score": 1,
        "link_id": "t3_1g0izhz",
        "parent_id": "t3_1g0izhz"
    },
    {
        "comment_id": "lqonqdv",
        "subreddit": "books",
        "body": "Some people's reading sounds better with speed change, sometimes a pitch up or down. Sorry if you performance needed better direction, or pacing.",
        "time": "2024-10-06 21:54:13 UTC",
        "score": 2,
        "link_id": "t3_1fwwz1g",
        "parent_id": "t3_1fwwz1g"
    },
    {
        "comment_id": "loxvi4r",
        "subreddit": "books",
        "body": "Simple stop running g schools as degree mill for profit businesses [even the non profit ones hunt profits] and just start expelling people en masse/ failing them.\n\nSometimes fuck around and find out needs to hit a generation, boomers and the AI generation both",
        "time": "2024-09-25 23:49:50 UTC",
        "score": 30,
        "link_id": "t3_1fphjnb",
        "parent_id": "t3_1fphjnb"
    },
    {
        "comment_id": "lljxh1k",
        "subreddit": "books",
        "body": "Time to fly the flag and sail the seas. I hear Diego Garcia[not the real one, the internet one] is a good place to call New Tortuga.",
        "time": "2024-09-05 00:21:55 UTC",
        "score": 1,
        "link_id": "t3_1f92cyp",
        "parent_id": "t3_1f92cyp"
    },
    {
        "comment_id": "ligosmm",
        "subreddit": "books",
        "body": "Most of the western literary cannon is badly written and only remains as canin because of western/eurocentric cultural superiority and gate keeping. Like fine art is only European and rarely if ever talks about non European contemporaries. Also other cultures art is cute and always primitive and in a museum that refuses to allow the native cultures to have their outright stolen [during the 19th and 20th century] artifacts. And yes I put an arbitrary date on when cultural theft is gonna get ignored because we gonna call up the sumerians and say that Iraq has stolen their art?",
        "time": "2024-08-16 20:27:37 UTC",
        "score": 1,
        "link_id": "t3_1etlwtt",
        "parent_id": "t3_1etlwtt"
    },
    {
        "comment_id": "lb4f4ao",
        "subreddit": "books",
        "body": "Teach the bible: \"okay kids lets pull out your bible and we'll spot all the failures your preachers and politicians have that the bible says we should stome them for. Now lets see how jesus hated these false witnesses and pharasies trying to grift off this. Now lets go over how this moses/jesus fan fiction was written way after the fact in languages not spoken by either,\n\" oh and make sure you can find where satan did something wrong. Why did satan try to help people? Seems like giving them knowledge and telling god not to fick with job ws a good thing. when is god not a petty whiney fuckboi?\"\n\nPoliticians: \"not like that\"",
        "time": "2024-07-01 13:16:49 UTC",
        "score": 12,
        "link_id": "t3_1dss1y7",
        "parent_id": "t3_1dss1y7"
    },
    {
        "comment_id": "lb14owm",
        "subreddit": "books",
        "body": "Dont tell them about the Rand corp which seeks to make an ayn rand world a reality",
        "time": "2024-06-30 20:45:49 UTC",
        "score": 2,
        "link_id": "t3_1ds18r0",
        "parent_id": "t3_1ds18r0"
    },
    {
        "comment_id": "l9ry9ie",
        "subreddit": "books",
        "body": "2nd pe4son narrative. I hate it.",
        "time": "2024-06-22 15:45:51 UTC",
        "score": 1,
        "link_id": "t3_1dknum8",
        "parent_id": "t3_1dknum8"
    },
    {
        "comment_id": "l8kufzk",
        "subreddit": "books",
        "body": "Dont tell him about the Rand corporation \n\nor how ayn rand can be argued to be the reason all our capitalist idiots fuck ups and are the incompetent idiots idolozed in the book. Morons who have too much money to use and lucked into it through inept nepotism while telling everyone how smart and great they are.\n\n Like trump and musk, all the \"rich capitalists leaders\" are idiots who rely on others and have to create a police state to keep their workers from excising their cancerous ineptitude with competent people who, you know are the labor that keeps the whole system afloat.",
        "time": "2024-06-14 13:39:47 UTC",
        "score": 14,
        "link_id": "t3_1dfq86l",
        "parent_id": "t3_1dfq86l"
    },
    {
        "comment_id": "l50tzww",
        "subreddit": "books",
        "body": "Series are fun and nice but if a series doesnt end its the same for me as back in the day when the oublisher didn't pick up the next book in a series or it wasnt carried in a local bookstore. Story was good, ended on a cliff hanger, sucks. Time to find a new story and i would forget about the unfinished ones. Lots of fantasy books set up for trilogies and sequels that never got published in the 90s and early 2010s and there was no amazon to self publish to get it to your audience. \n\nPeople seem way to obsessed with \"gotta catch em all\" with books/series. Patrick Rothfuss's books are so well written that i red books 1 & 2 in like 7 days no book 3... well that sucks, what else is there.... and thats how i found the malazan book of the fallen \"series\". The only continuous story are the first 3 but each novel ends and is stand alone. Ive found lots of books with the best and most \"complete\" series do that. \n\nThe split with \"feast for crows\" and \"dance with dragons\" was so annoying and THAT cliff hanger sucked. I threw \"feat for crows across the room\".\n\nBut oh well, time to find something new. \n\nThere is only 1 book series that ive wanted the next book. It was gonna be a trilogy, read it in like 2001, set in an arctic area and got 2 books in. Even looked on the internet for it, nothing and now ive forgotten the author and any of the titles. 🤷‍♂️.",
        "time": "2024-05-21 14:10:35 UTC",
        "score": 1,
        "link_id": "t3_1cwricc",
        "parent_id": "t3_1cwricc"
    },
    {
        "comment_id": "koqybem",
        "subreddit": "books",
        "body": "I dont like to read an adventure book to live vicariously through a boredom simulator. Gotta balance better down time. \nMoreover these were some of the first of their genre and so subsequent, and arguably better writers wrote better stories.\n\nBeing the first to do something doesn't mean you were any good at it. Also your marketing department might have been better.",
        "time": "2024-02-03 15:47:20 UTC",
        "score": 3,
        "link_id": "t3_1ahvy8u",
        "parent_id": "t3_1ahvy8u"
    },
    {
        "comment_id": "kffdezj",
        "subreddit": "books",
        "body": "Perrin and matt were the only 2 plot lines of the main 3 i kept until there wasnt anything left worth reading in their arcs. \nI would have loved rand's character and anime harem to have left the main narrative to become side characters. Rand always felt like a petulant inept harem isekai protagonist. Matt and perrin had more interesting arcs and potential to have struggle to succeed without the harem of migical girls and villanesses to save them",
        "time": "2023-12-29 16:05:16 UTC",
        "score": 5,
        "link_id": "t3_18tokyy",
        "parent_id": "t1_kff56bp"
    },
    {
        "comment_id": "kffcjla",
        "subreddit": "books",
        "body": "I checked out in book 9. At like book 7 or 8 i was skipping chaoters of main pov characters indidnt like until in book 9 i read like 4 chapters as thkse were the only pov i cared about.\n\nPov characters never die and a dozen. New ones were added each book so it became an unfun slog with no end satisfying end in sight.  And indont like Brandon Sanderson's writing so i had even less incentive to read the 'final books'.",
        "time": "2023-12-29 15:59:48 UTC",
        "score": -1,
        "link_id": "t3_18tokyy",
        "parent_id": "t3_18tokyy"
    },
    {
        "comment_id": "jpd5kgy",
        "subreddit": "books",
        "body": "I never understood how knowing the ending ruins a story. The story is how you got to the ending never the ending. And spoilers as a thing... dont get me started how dumb an idea that is. I feel like thise most concerned with spoilers would neber bother with the book, movie, game, etc. To begin with",
        "time": "2023-06-24 16:37:32 UTC",
        "score": 1,
        "link_id": "t3_14hpdvx",
        "parent_id": "t3_14hpdvx"
    },
    {
        "comment_id": "jn63u7j",
        "subreddit": "books",
        "body": "I have a degree in english lit and creative writing. You would have to pay me over $1000 to read Ulysses or any of that \"high brow english cannon\". Retort if hes reat x author in your language and then laugh at him for being only able to read one language like some peasant.",
        "time": "2023-06-06 20:52:20 UTC",
        "score": 0,
        "link_id": "t3_142m9hy",
        "parent_id": "t1_jn59fa2"
    },
    {
        "comment_id": "jciwr49",
        "subreddit": "books",
        "body": "The difference between a republican, the pharacies and pontious pilot? I'm hoping you have the answer",
        "time": "2023-03-17 03:48:47 UTC",
        "score": 2,
        "link_id": "t3_11spoca",
        "parent_id": "t3_11spoca"
    },
    {
        "comment_id": "jbnfc0t",
        "subreddit": "books",
        "body": "It starts with dungeons and dragons and ends with preventing access to law books",
        "time": "2023-03-10 08:03:28 UTC",
        "score": 1,
        "link_id": "t3_11muy8z",
        "parent_id": "t3_11muy8z"
    }
]