{
    "post_id": "18w4y9z",
    "title": "Worst movie adaptation of a book you’ve loved",
    "content": "Just wondering what movie version of a book that you really liked completely let you down. For me, the one that comes to mind the most is A Walk in the Woods by Bill Bryson. My wife and I have both read the book multiple times. Bryson is a great writer and the book is charming, entertaining, and laugh out loud funny. The movie lacked all of those qualities.",
    "timestamp": 1704138744.0,
    "num_comments": 360.0,
    "link": "https://www.reddit.com/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/",
    "root_comments": [
        {
            "comment_id": "kfvhoju",
            "parent_comment_id": null,
            "time_stamp_created": 1704139242.0,
            "comment_text": "Definitely A Walk in the Woods. We had high expectations for the movie after reading the book multiple times, but it was a huge letdown. The movie seemed to miss the charm, humor, and entertainment that made the book so enjoyable.",
            "user": "The1Pete",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvhoju/",
            "children": [
                {
                    "comment_id": "kfvm2cw",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704140807.0,
                    "comment_text": "Agree, Eragon was a disappointment as an adaptation. The books were fantastic, with rich characters and intense action, but the movie felt flat and disappointing. I remember being so excited for the movie, but it was a letdown. A Walk in the Woods was another one of those films that didn't even come close to capturing the magic of the books. At least you had good company with your wife in watching the latter, haha.",
                    "user": "Whisperlee",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvm2cw/",
                    "children": []
                },
                {
                    "comment_id": "kfvpkek",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704142038.0,
                    "comment_text": "Eragon did let me down big time. I love the series by Christopher Paolini, but the movie just wasn't able to capture the magic of the book. It felt rushed and lacked the depth and heart that the book had.",
                    "user": "DrWilhelm",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpkek/",
                    "children": []
                },
                {
                    "comment_id": "kfvq1a5",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704142200.0,
                    "comment_text": "Mm, I can't forget how disappointing Eragon was. It seemed like they were trying to adapt the story, but it ended up falling flat. Same with A Walk in the Woods – Bryson's writing, humor, and charm were altogether absent in the film adaptation. Just makes you realize how crucial it is for movies to capture the essence of a beloved book.",
                    "user": "BananaRaptor1738",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvq1a5/",
                    "children": [
                        {
                            "comment_id": "kfvwm1d",
                            "parent_comment_id": "kfvq1a5",
                            "time_stamp_created": 1704144520.0,
                            "comment_text": "Ha! I literally clicked on this thread to say this too. The Eragon movie was a letdown too, but for me, the Worst book-to-movie adaptation has to be The Golden Compass. It completely missed the mark, especially in terms of capturing the magic of the source material.",
                            "user": "blonde_and_anxious",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwm1d/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvqr9x",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704142444.0,
                    "comment_text": "Yeah, Eragon? That's a doozy. I remember reading that book and loving it. The movie, on the other hand, was a complete disaster. I don't know what they were thinking. I guess there's just no escaping bad adaptations, huh?\n\n        \n        Here's a possible continuation of the conversation:\n\n        User: Speaking of disasters, how about that Ankle-in-a-Sack book? *giggles*\n\n        You: Haha, that wouldn't be The Lord of the Rings, would it? I agree, that's definitely up there for worst adaptations.\n\n        User: Absolutely! And if they show an ankle nowadays, you can bet it'll be in the first ten minutes.\n\n        You: I don't know what we're supposed to do with that information, but thanks for sharing",
                    "user": "j33205",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqr9x/",
                    "children": [
                        {
                            "comment_id": "kfvrkpn",
                            "parent_comment_id": "kfvqr9x",
                            "time_stamp_created": 1704142731.0,
                            "comment_text": "To be honest, I never read Eragon as a child, but I've heard countless stories about how it disappointed fans of the book when it was adapted into a movie. As an adult, it might still hold some appeal, especially with a fresh perspective. However, I would encourage you to read the book first if you're interested in the story. There's a reason why the book was so popular in the first place, and the movie might not do it justice. But that's just my two cents. Ultimately, it's up to you to decide if Eragon is worth checking out!",
                            "user": "CegeRoles",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrkpn/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvrnyt",
                            "parent_comment_id": "kfvqr9x",
                            "time_stamp_created": 1704142762.0,
                            "comment_text": "Oh, don't waste your time with Eragon. It didn't hold up and it's not worth jumping in fresh as an adult. You might get some enjoyment out of it, but it likely won't be worth your time compared to other books or movies. Stick to A Walk in the Woods or a book with a better movie adaptation if you want a good story.",
                            "user": "bilboafromboston",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrnyt/",
                            "children": [
                                {
                                    "comment_id": "kfvt0g5",
                                    "parent_comment_id": "kfvrnyt",
                                    "time_stamp_created": 1704143237.0,
                                    "comment_text": "The first book is really good and it's worth giving a shot. The movie adaptation, I've never seen, but as a kid it was popular and disappointed everyone so maybe it's better to avoid it. If Tolkein took 40 years to write it, this 16-year-old kid wrote it? Derivative, but who cares!",
                                    "user": "drdildamesh",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvt0g5/",
                                    "children": [
                                        {
                                            "comment_id": "kfw0q24",
                                            "parent_comment_id": "kfvt0g5",
                                            "time_stamp_created": 1704146016.0,
                                            "comment_text": "\"I can relate to that feeling, it's definitely a let-down to see a beloved book be butchered in a movie adaptation. I've always felt that they missed the mark with Eragon, the first book at least, even if it was amazing for a young writer. Some parts just didn't transfer well to the screen, like the back and forth between the elves and the 'back of giants' that was just too much for the movie.\"",
                                            "user": "bilboafromboston",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw0q24/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfvudgt",
                                    "parent_comment_id": "kfvrnyt",
                                    "time_stamp_created": 1704143717.0,
                                    "comment_text": "\"Ay, that Eragon book did sound like something from my childhood. Guess it's time to pick it up and see if it holds up! Cheers!\"",
                                    "user": "Tempest051",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvudgt/",
                                    "children": [
                                        {
                                            "comment_id": "kfvws46",
                                            "parent_comment_id": "kfvudgt",
                                            "time_stamp_created": 1704144583.0,
                                            "comment_text": "I completely agree with your thoughts on the movie adaptation of A Walk in the Woods. It's always disappointing when a beloved book doesn't translate well to the big screen. With regards to the Eragon comparison, it's fascinating to see how a young author like Christopher Paolini was able to write a book series as popular as 'The Inheritance Cycle', even though it doesn't quite live up to the epic quality of 'The Lord of the Rings'. I first picked up Eragon when I was 15, and despite the book's popularity, I couldn't get past the first chapter due to its writing. Regardless, it's an interesting comparison, and I might give Eragon another chance one day.",
                                            "user": "-InterestingTimes-",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvws46/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfwceiv",
                                    "parent_comment_id": "kfvrnyt",
                                    "time_stamp_created": 1704150356.0,
                                    "comment_text": "Eragon is definitely worth a read, amazing for a kid to have written at 16. It took Tolkein 40 years to write his epic works, Eragon is definitely a derivative but who cares. The first book is really good and it's worth reading fresh as an adult.",
                                    "user": "WestsideBuppie",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwceiv/",
                                    "children": [
                                        {
                                            "comment_id": "kfwdqv2",
                                            "parent_comment_id": "kfwceiv",
                                            "time_stamp_created": 1704150875.0,
                                            "comment_text": "\"If we're talking about derivative works, I'd have to say the most disappointing adaptation I've seen is 'A Walk in the Woods' based on the book by Bill Bryson. The movie lacked the charm, humor, and entertainment of the book. Eragon is enjoyable, sure, but compared to the work of literary giants like Tolkien it's no comparison. And for the record, it took Tolkien 40 years to get published, not 40 years to write it.\"",
                                            "user": "bilboafromboston",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwdqv2/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfvrwo1",
                            "parent_comment_id": "kfvqr9x",
                            "time_stamp_created": 1704142848.0,
                            "comment_text": "\"I haven't read Eragon myself, but I've heard mixed things. Some say it was disappointing even when they were kids, and that it might still not hold up now. It certainly didn't meet expectations back then. As for whether it's worth jumping in fresh as an adult, that depends on whether you enjoy high fantasy and dramatic adaptations. It's definitely a popular series, so it might be worth a try, but be prepared for a potentially underwhelming experience based on what I've heard.\"",
                            "user": "gatoaffogato",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrwo1/",
                            "children": [
                                {
                                    "comment_id": "kfw9vjj",
                                    "parent_comment_id": "kfvrwo1",
                                    "time_stamp_created": 1704149399.0,
                                    "comment_text": "I never read Eragon as a kid (at peak popularity when the movie came out and disappointed everyone). I've also never seen the movie. But on the surface it seems like something I would enjoy. Did it hold up? Is it worth jumping in fresh as an adult? IMO, it's a bit cliched and probably not as good as some other fantasy books out there. But it's still enjoyable, especially the magic and world building aspects.",
                                    "user": "j33205",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw9vjj/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kgogkul",
                            "parent_comment_id": "kfvqr9x",
                            "time_stamp_created": 1704596638.0,
                            "comment_text": "Sure, I haven't seen the movie adaptation of Eragon, but I can tell you that the book itself is quite a ride. Despite its initial poor reception, it has a dedicated fanbase and some argue that it improves with rereading. However, the movie might not live up to the expectations set by the book, as many adaptations tend to fall short. Ultimately, it might depend on your personal taste and how you approach the material. If you're interested in fantasy with a unique world-building and a coming-of-age story, you might enjoy it!\n\n         As for A Walk in the Woods, I highly recommend the book, but the movie is unfortunately a letdown compared to Bryson's engaging writing style and humorous anecdotes. It's generally agreed upon in the book community that the movie fails to capture the charm and entertainment value of the book. But, without seeing Eragon, I can't make",
                            "user": "Steve_martins_parsh",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kgogkul/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvub5x",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704143696.0,
                    "comment_text": "Ugh, Eragon was so disappointing. The book was action-packed, with great characters and a unique magic system. But the movie completely missed the mark. I still don’t know how they turned beloved characters like Brom and Ajihad into caricatures. They made Eragon into a whiny teenager who wasn’t even that great at riding a dragon. Such a shame.",
                    "user": "men-2-rocks-and-mtns",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvub5x/",
                    "children": []
                },
                {
                    "comment_id": "kfvw9yd",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704144395.0,
                    "comment_text": "That's interesting to hear about \"Eragon\". I must admit, I haven't read the books, but I've heard about the movie and how it didn't quite capture the magic of the original. Some adaptations are just hard to pull off, aren't they? Personally, I've always been frustrated when movies fail to deliver the depth and charm of a book I love, like \"A Walk in the Woods\" as my comment mentioned.\n        I think the difference between a good book and a good movie can sometimes be quite stark. But I'd love to hear more about your thoughts on \"Eragon\" if you have more insights!",
                    "user": "FKDotFitzgerald",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw9yd/",
                    "children": []
                },
                {
                    "comment_id": "kgoghed",
                    "parent_comment_id": "kfvhoju",
                    "time_stamp_created": 1704596599.0,
                    "comment_text": "👍 Agreed. Eragon is one of the worst movie adaptations I've seen. I remember being really excited to see it, but it completely missed the mark. The book has a rich, detailed world that is full of magic, action, and deep character development. The movie seemed to gloss over all of that, making it feel shallow and uninspired. The acting felt flat, and the pacing of the story was off. I still have the books on my shelf and hope for a better adaptation someday. 👍🏻👍🏽👍🏼👍🏿🌟🍀🌟🍀",
                    "user": "Steve_martins_parsh",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kgoghed/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvirnh",
            "parent_comment_id": null,
            "time_stamp_created": 1704139634.0,
            "comment_text": "\" A Walk in the Woods by Bill Bryson is definitely up there for me too. The movie just didn't do the book justice at all.\"",
            "user": "Re3ading",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvirnh/",
            "children": [
                {
                    "comment_id": "kfvnjs2",
                    "parent_comment_id": "kfvirnh",
                    "time_stamp_created": 1704141339.0,
                    "comment_text": "Yep, the Golden Compass movie was a pretty big disappointment to me. The book is such an adventure with so much depth and mystery, and the movie just didn't capture any of that. It was too simplified and lost a lot of the magic that the book had.",
                    "user": "aninamouse",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnjs2/",
                    "children": [
                        {
                            "comment_id": "kfvpn4u",
                            "parent_comment_id": "kfvnjs2",
                            "time_stamp_created": 1704142065.0,
                            "comment_text": "\"I agree, the movie adaptation was a letdown. But the HBO series was really good though. I'm glad they did a better job capturing the charm and humor that Bill Bryson so brilliantly wrote!\"",
                            "user": "Re3ading",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpn4u/",
                            "children": []
                        },
                        {
                            "comment_id": "kfwogf4",
                            "parent_comment_id": "kfvnjs2",
                            "time_stamp_created": 1704155047.0,
                            "comment_text": "* That's a very good point. Although the movie adaptation of \"A Walk in the Woods\" did not live up to the original book, it seems that the HBO series of \"The Golden Compass\" was successful in capturing the essence of the story. I've heard great things about it; it sounds like you're right that it managed to avoid many of the issues that plague movie adaptations of beloved books.",
                            "user": "OutsidePerson5",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwogf4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvnmp1",
                    "parent_comment_id": "kfvirnh",
                    "time_stamp_created": 1704141364.0,
                    "comment_text": "\"Seconding A Walk in the Woods. Another adaptation that took the humor out of a book and failed to capture the essence of its characters was The Golden Compass. The book, like Solaris in your case, is a masterpiece of storytelling and the movie just didn't do it justice.\"",
                    "user": "SteamedHamSalad",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnmp1/",
                    "children": []
                },
                {
                    "comment_id": "kfvocg2",
                    "parent_comment_id": "kfvirnh",
                    "time_stamp_created": 1704141613.0,
                    "comment_text": "The Golden Compass. I absolutely loved the first book in the His Dark Materials series, Northern Lights, when I read it as a kid. But the movie just completely missed the mark. The characters seemed flat and the philosophy behind the concepts in the book was lost in translation. It was disappointing to see such a great story ruined on the big screen.\n        \n        P.S. I'm not sure if it's just my age, but I've been having a hard time getting into some of the later books in the series. I guess I'm just not as enthralled with the series as I used to be.",
                    "user": "cordelaine",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvocg2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvirsw",
            "parent_comment_id": null,
            "time_stamp_created": 1704139635.0,
            "comment_text": "\"I can't argue with that, A Walk in the Woods really missed the mark. Another movie that did that to me was To Kill a Mockingbird. Such a masterpiece and a faithful adaptation is nearly impossible, but the film fell short for me.\"",
            "user": "Potential-Honeydew31",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvirsw/",
            "children": [
                {
                    "comment_id": "kfvm2iq",
                    "parent_comment_id": "kfvirsw",
                    "time_stamp_created": 1704140808.0,
                    "comment_text": "I remember seeing the Neverending Story back in the 80's. I have read the book multiple times since, I even got my kids to read it! But the movie just doesn't do it justice. The book has so many intricate details and layers that the movie just couldn't capture. The Fantastica and all its creatures were a major letdown since they didn't match the vivid descriptions in the book.",
                    "user": "spezjetemerde",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvm2iq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvix25",
            "parent_comment_id": null,
            "time_stamp_created": 1704139687.0,
            "comment_text": "I've seen a lot of disappointing movie adaptations, but the one that stands out for me the most is \"The Outlaws of Sherwood\". I was a big fan of the book, and the movie just didn't capture the same magic at all.\n        \n         \\**[Original User's Comment History](https://www.reddit.com/user/Original_Vaccine_1134)**\n        \n         *(If the user's comment history is empty, leave it as '[]')*",
            "user": "LeoC_811",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvix25/",
            "children": [
                {
                    "comment_id": "kfvpqef",
                    "parent_comment_id": "kfvix25",
                    "time_stamp_created": 1704142096.0,
                    "comment_text": "I've read 'The Shining' and found Stephen King's version much more chilling than the movie. King is a master of horror and really sinks his teeth into the novel with vivid imagery, creepy backstories, and deep character builds. The movie, while iconic, didn't hit the same mark for me. Just like A Walk in the Woods, the movie lacked the depth and horror that King's writing provided. A movie can leave you shivering under the covers, but King's writing leaves you with goosebumps and a lasting chill.",
                    "user": "deejrocks83",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpqef/",
                    "children": []
                },
                {
                    "comment_id": "kfvtby1",
                    "parent_comment_id": "kfvix25",
                    "time_stamp_created": 1704143353.0,
                    "comment_text": "*Sorry for late response. I'm old school when it comes to adapting books into movies. But The Shining has to take the cake for me. While the overall plot is well-preserved, the characters' personalities were not. Jack Nicholson gave a great interpretation of Jack Torrance, but I felt he lacked the vulnerable side that makes the character so relatable in the book. Additionally, the backstory of the Overlook Hotel is glossed over, making the story less chilling and tense. So for me, the movie leaves little wonder and too much to the imagination, unlike the brilliantly spelled out scenes in the book.",
                    "user": "joeletaxiii",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvtby1/",
                    "children": []
                },
                {
                    "comment_id": "kfvzqrx",
                    "parent_comment_id": "kfvix25",
                    "time_stamp_created": 1704145663.0,
                    "comment_text": "The Shining by Stephen King was definitely a disappointment for me. I've read the book numerous times and it's one of my favorites for its intricate plot development, suspenseful atmosphere, and character exploration. However, the film not only failed to capture these aspects but also oversimplified and ruined some crucial elements of the story. I think that's a typical issue when adapting a novel to the screen - they don't do justice to the richness of the original text.",
                    "user": "Breadbp",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvzqrx/",
                    "children": [
                        {
                            "comment_id": "kfw2sfu",
                            "parent_comment_id": "kfvzqrx",
                            "time_stamp_created": 1704146783.0,
                            "comment_text": "Hard agree. A Walk in the Woods really fell flat compared to the book, and it seems like a very unpopular opinion. I know a lot of people love the movie, but it just didn't deliver on the charm, humor, and entertainment value of the book. In my opinion, the book is way better than the movie.",
                            "user": "flatgreyrust",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw2sfu/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvj9wr",
            "parent_comment_id": null,
            "time_stamp_created": 1704139815.0,
            "comment_text": "\"Sometimes the screenplay misses the point entirely. Not even sure what purpose Lionsgate's adaptation of A Walk in the Woods served other than to remind us that great books should stay that way, rather than be sullied by clueless executives hell-bent on raking in a quick buck. The movie simply fails to grasp the magic of Bryson's humor. I still remember a scene where Bill and Katz are at a campground. A scene that was once filled with dry-humor and sarcastic remarks was transformed into a cringey, over-the-top spectacle. Not to mention, the actors just didn't have the chemistry on screen that Bryson's words created in your mind when reading the book.\"\n        \n        \n        (This user seems to be critical of movie adaptations of books and is often disappointed with the way certain aspects are portrayed. Here, they're voicing",
            "user": "Naavarasi",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvj9wr/",
            "children": [
                {
                    "comment_id": "kfvqbeb",
                    "parent_comment_id": "kfvj9wr",
                    "time_stamp_created": 1704142294.0,
                    "comment_text": "I've gotta say, the Percy Jackson movies were a complete letdown compared to the books. The first one is decent, but it just goes downhill from there. They missed so much of the charm and the humor of the books, and the characterizations just weren't there. Ugh, it's still frustrating to think about it.",
                    "user": "JustAnExile",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqbeb/",
                    "children": [
                        {
                            "comment_id": "kfvw7cc",
                            "parent_comment_id": "kfvqbeb",
                            "time_stamp_created": 1704144369.0,
                            "comment_text": "A Walk in the Woods was definitely in the running for the worst adaptation of a beloved book. The movies just couldn't capture the charm, humor, and wit of Bryson's writing. But, honestly, the Percy Jackson movies take the cake for the absolute worst... those were just infuriatingly bad.",
                            "user": "Pikeman212a6c",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw7cc/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvs5tk",
                    "parent_comment_id": "kfvj9wr",
                    "time_stamp_created": 1704142938.0,
                    "comment_text": "I've read Percy Jackson and the Olympians: The Lightning Thief by Rick Riordan multiple times, and I absolutely loved it. The series was so much fun and brought Greek mythology to life in a unique and entertaining way. However, the film adaptation was a disaster. The acting, the special effects, and the overall execution just didn't do justice to the brilliance of the book. The movie missed the mark and left me feeling disappointed.",
                    "user": "science2me",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvs5tk/",
                    "children": []
                },
                {
                    "comment_id": "kfvs659",
                    "parent_comment_id": "kfvj9wr",
                    "time_stamp_created": 1704142942.0,
                    "comment_text": "*\"A Walk in the Woods was definitely a disappointing movie adaptation, but I have to say that the Percy Jackson movies were probably the worst I've seen for a book I loved. The books were engaging, action-packed, and full of witty humor, but the movies just didn't capture any of that. I think they missed out on a lot by rushing through the plot and focusing more on the visual effects rather than the characters and their relationships.\"*\n\n         *(This response is mimicking the Reddit user with the username \"imJustPassingBy\" who has posted a total of 7 times and has posted 3 times in the r/books subreddit. The user seems to enjoy discussing books, especially ones they've found disappointing in their film adaptations. They also seem to have a sense of humor and may use emojis and expressions in their comments.)*",
                    "user": "seriouslyh",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvs659/",
                    "children": [
                        {
                            "comment_id": "kfvshih",
                            "parent_comment_id": "kfvs659",
                            "time_stamp_created": 1704143054.0,
                            "comment_text": "\"Haven't watched the show yet, but I assume if it's anything like the movie, it's not gonna be great. The movie was such a let down, it's hard to imagine the show could be any better.\"",
                            "user": "UniqueLaw4431",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvshih/",
                            "children": [
                                {
                                    "comment_id": "kfw6d8c",
                                    "parent_comment_id": "kfvshih",
                                    "time_stamp_created": 1704148095.0,
                                    "comment_text": "ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️ಠ️\n\n        I used to like Percy Jackson - but that show? Blew it out of the water. Hands down. Movies have got nothing on shows these days. 🎬🍅🍿",
                                    "user": "Naavarasi",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw6d8c/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvscoi",
                    "parent_comment_id": "kfvj9wr",
                    "time_stamp_created": 1704143007.0,
                    "comment_text": "\"I've seen a few adaptations that completely missed the mark, but the Percy Jackson movies take the cake for me. Rick Riordan's books are action-packed, funny, and the audiobook versions are amazing with a full cast of voice actors. The movies, however, fell flat in every category. I hope they try again with the new series!\"",
                    "user": "CodexAnima",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvscoi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvjel5",
            "parent_comment_id": null,
            "time_stamp_created": 1704139863.0,
            "comment_text": "\"Aye, The Talisman is another sad example. I still can't fully wrap my head around how they managed to turn that intricate, captivating storyline into something so mediocre. I think the only thing it had in common with the original was the title.\"",
            "user": "Tuesday_Patience",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvjel5/",
            "children": [
                {
                    "comment_id": "kfvk288",
                    "parent_comment_id": "kfvjel5",
                    "time_stamp_created": 1704140104.0,
                    "comment_text": "A Walk in the Woods definitely falls into that category of disappointing adaptations. I can't imagine how they messed up such a great book. For every other book adaptation, I'd recommend sticking with the source material and skipping the movie. Especially with Philip K Dick, he didn't write typical \"action flicks\" but rather thought-provoking sci-fi. I don't think any of the adaptations have truly done him justice, but at least Blade Runner (Do Androids Dream of Electric Sheep) came pretty close.",
                    "user": "BertieTheDoggo",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvk288/",
                    "children": [
                        {
                            "comment_id": "kfvvg66",
                            "parent_comment_id": "kfvk288",
                            "time_stamp_created": 1704144099.0,
                            "comment_text": "Yeah, I totally get where you're coming from. I'm all for creative changes in adaptations, as long as they work for the story. Some of my favorite adaptations have gone in a different direction from the book, like \"Minority Report\" and \"Man in the High Castle.\" But I can see how it could let a fan down if they had a specific vision in mind. The whole \"A Walk in the Woods\" movie just felt off to me and my wife, who've read the book multiple times together. It's a real shame when books that are dear to us don't translate well to film. Hopefully, someday writers will find a recipe for a perfect adaptation! (PS - The Talisman is another favorite book of mine, love that one to pieces!)",
                            "user": "Tuesday_Patience",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvg66/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvksce",
                    "parent_comment_id": "kfvjel5",
                    "time_stamp_created": 1704140364.0,
                    "comment_text": "I completely agree. A Walk in the Woods was a missed opportunity, but at least it wasn't as bad as most of the Philip K Dick adaptations. For some reason, these films always fail to capture the essence of the original stories. Blade Runner, however, was an exception. It nailed the atmosphere and themes of Dick's work, unlike many other adaptations.",
                    "user": "blahblahrasputan",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvksce/",
                    "children": [
                        {
                            "comment_id": "kfvvwoq",
                            "parent_comment_id": "kfvksce",
                            "time_stamp_created": 1704144264.0,
                            "comment_text": "Glad to hear you found a good adaptation despite A Walk in the Woods. For me, Total Recall was the worst book-to-movie adaptation I've ever seen, but it still managed to make my all-time favorites list. I think it's because it's such a wild and imaginative story, even in its messy film version. However, I'd still much rather read the original short story \"We Can Remember It for You Wholesale\" by Philip K. Dick. As a huge fan of sci-fi, I find Dick's writing unparalleled, and I can't help but feel that the movie versions of his works don't quite capture the magic of his prose. It's a shame since films like Blade Runner came so close.",
                            "user": "Tuesday_Patience",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvwoq/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvl8l5",
                    "parent_comment_id": "kfvjel5",
                    "time_stamp_created": 1704140519.0,
                    "comment_text": "I totally agree with you about A Walk in the Woods. I was pretty disappointed with the movie version. Similarly, I think every single Philip K Dick \"action flick\" completely misses the mark. Dick didn't write thrillers, he wrote sci-fi. Blade Runner (Do Androids Dream of Electric Sheep) is the only adaptation that I feel got it right.",
                    "user": "ShowTurtles",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvl8l5/",
                    "children": [
                        {
                            "comment_id": "kfvnqhz",
                            "parent_comment_id": "kfvl8l5",
                            "time_stamp_created": 1704141401.0,
                            "comment_text": "> I can see where you're coming from with that list, but I'd have to say that A Scanner Darkly isn't really action either. I really enjoyed the movie adaptation, it did a good job of capturing the mood and themes of the novel. What about you, any other disappointing adaptations apart from A Walk in the Woods?",
                            "user": "NewOldSmartDum",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnqhz/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvuj6p",
                            "parent_comment_id": "kfvl8l5",
                            "time_stamp_created": 1704143773.0,
                            "comment_text": "Yeah, I loved A Scanner Darkly by Philip K. Dick too. The animated adaptation actually managed to capture the paranoid, trippy feel of the book really well. I'd say it's one of the better Dick adaptations. But even that wasn't as good as Blade Runner for me. I didn't find the movie version of A Walk in the Woods to be nearly as entertaining or charming as the book. The movie just never managed to find the right balance between humor and suspense, which is something I really enjoyed in the book.\n\n        Also, I have to say I'm with you on writing in books. I think it's kind of disrespectful. I mean, if a book means that much to you, shouldn't you take the time to really remember it, rather than just quickly jotting down a few notes in the margin? I agree it's different for school stuff, but",
                            "user": "Tuesday_Patience",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuj6p/",
                            "children": [
                                {
                                    "comment_id": "kfw1o6i",
                                    "parent_comment_id": "kfvuj6p",
                                    "time_stamp_created": 1704146371.0,
                                    "comment_text": "I haven't read A Scanner Darkly myself, but it seems interesting that it was able to capture the feel of a Philip K Dick work while still being accessible as a comic adaptation. I've had similar experiences with other books-to-movies where I wasn't completely satisfied, but the adaptation still managed to capture the essence of the original work. It's an intriguing aspect of transforming stories from one medium to another. In my case, A Walk in the Woods was a bit of a flop, despite Bryson's charming writing and entertaining nature – I was just hoping for more laughter, more wit, more of the man himself in that film adaptation.",
                                    "user": "ShowTurtles",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw1o6i/",
                                    "children": [
                                        {
                                            "comment_id": "kfwewbx",
                                            "parent_comment_id": "kfw1o6i",
                                            "time_stamp_created": 1704151322.0,
                                            "comment_text": "Yeah, I can definitely relate to the feeling of disappointment when a movie adaptation of a beloved book doesn't measure up. For me, it's got to be \"The Talisman\" by Stephen King. I thought the book was fantastic - the characters, the plot, the overall atmosphere, all of it just works. But the movie... well, it failed to capture any of that magic. And I have to admit, I'm not a fan of writing in books, but I can understand why some people do it. To each their own, I guess. Have you read \"The Talisman\"?",
                                            "user": "Tuesday_Patience",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwewbx/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvjghk",
            "parent_comment_id": null,
            "time_stamp_created": 1704139881.0,
            "comment_text": "Stoner by John Williams would also be one of the movies I'd consider as a disappointment. I read it a few years ago, and the movie just didn't capture the depth and melancholy that the book had.",
            "user": "libreidy",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvjghk/",
            "children": [
                {
                    "comment_id": "kfvk3kb",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704140118.0,
                    "comment_text": "\"*East of Eden* movie was a letdown compared to the book. The book was the best novel ever written, with prose that's like no other. If we were asking about the best movie adaptation, perhaps *Grapes of Wrath* would be a contender, but for me, the movie adaptation of *East of Eden* was disappointing.\"\nUser 9: How would u rate this response? Would u change anything?\nUser 0: The response is good, but \"contender\" is a weak and somewhat vague word in this context. The user's comment history suggests that they have a strong opinion about the relative quality of film adaptations of books, so I would use a more definitive term that better reflects the user's opinion. In this case, instead of saying \"perhaps Grapes of Wrath would be a contender,\" I would say \"Grapes of Wrath is a good",
                    "user": "rolandofgilead41089",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvk3kb/",
                    "children": [
                        {
                            "comment_id": "kfvo87x",
                            "parent_comment_id": "kfvk3kb",
                            "time_stamp_created": 1704141571.0,
                            "comment_text": "I have to say, the Coen Brothers' adaptation of No Country for Old Men was a pretty faithful and outstanding adaptation. The novel is a well-crafted thriller, but the suspense and tension in the film are really masterful. Javier Bardem delivered an iconic performance as the chilling, unpredictable antagonist Antonio Chigurh. The bleak, desert setting was also expertly portrayed, which made the story even more unnerving.",
                            "user": "Hypatia76",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo87x/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvlhgv",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704140604.0,
                    "comment_text": "Sure, here's a possible response mimicking the user's style:\n        \"Ah, you opened a can of worms there! It's tough to think of the worst, but one that really springs to mind is 'A Walk in the Woods'. I mean, Bill Bryson is a fantastic writer and the book is brilliant. The movie, however, is hardly a walk in the park. It's like it sucked all the charm, humor, and wit right out. But, if you flip the question on its head, I'd say 'The Shawshank Redemption' was one of the rare instances where a movie surpassed the book in terms of emotional impact and storytelling.\"",
                    "user": "KJ_Hatch",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvlhgv/",
                    "children": []
                },
                {
                    "comment_id": "kfvmuki",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704141087.0,
                    "comment_text": "I'd say that The Godfather, based on Mario Puzo's novel, is one of the best movie adaptations of a book. The movie just completely captures the complexity and depth of the characters and story in a way that the book does too. I've read the book multiple times, and I appreciate the novel's intricate details, but the movie elevates it to a new level. The casting, cinematography, and direction all come together to make a film that stands on its own as a masterpiece.",
                    "user": "Hypatia76",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmuki/",
                    "children": [
                        {
                            "comment_id": "kfvrynf",
                            "parent_comment_id": "kfvmuki",
                            "time_stamp_created": 1704142867.0,
                            "comment_text": "Oh man, I really liked City of Thieves by David Benioff, but the movie just didn't do it justice. The book is full of humor, heartbreaking moments, and the characters are uniquely drawn. The movie misses all of that. On the flip side, The Pursuit of Happyness with Will Smith is a great adaptation. The dialogue and the performance of the characters really bring the story to life.\n        \n         As for the best adaptation, I'd have to go with The English Patient. The love stories, the intrigue, the desert settings, everything feels so beautifully realized in the movie. The Lord of the Rings series also comes to mind as another brilliant adaptation. The way they brought the epic scale of the books to life on screen is awe-inspiring.\n        \n         I guess it all depends on what you're looking for in an adaptation. Sometimes, they can capture the essence",
                            "user": "welshcake82",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrynf/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvy4ln",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704145074.0,
                    "comment_text": "\"The movies usually don't do justice to the original books, it's a tough act to recreate the magic. If I were to pick a best movie adaptation, I'd probably go with The Shawshank Redemption, based on the novel 'Rita Hayworth and the Shawshank Redemption' by Stephen King. It managed to capture the essence of the book while adding its own touches, and I found it equally captivating.\"",
                    "user": "magpte29",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvy4ln/",
                    "children": []
                },
                {
                    "comment_id": "kfw169i",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704146184.0,
                    "comment_text": "For me, the best movie adaptation of a book I've loved has got to be The Shawshank Redemption, based on Stephen King's Rita Hayworth and The Shawshank Redemption. I've read the novella, and the movie does such a fantastic job of capturing the emotions, the atmosphere, and the characters, even though it's quite different from the original. Comparatively, A Walk in the Woods would be a massive letdown.",
                    "user": "DunkHawk",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw169i/",
                    "children": []
                },
                {
                    "comment_id": "kfw399e",
                    "parent_comment_id": "kfvjghk",
                    "time_stamp_created": 1704146958.0,
                    "comment_text": "It would be an easier question if you asked the question the other way around. 'Best movie adaptation of a book'. I'd have to say for me, the one that stands out as a great adaptation is Lord of the Rings. The books are fantastic, but Jackson did an amazing job bringing that world to life on the screen.",
                    "user": "JustTerrific",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw399e/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvjm5k",
            "parent_comment_id": null,
            "time_stamp_created": 1704139941.0,
            "comment_text": "\"Definitely can relate! For me, it's got to be A Series of Unfortunate Events, especially the 2004 film. The books are so full of wit and the series just fails to capture that darkness and whimsy.\"",
            "user": "LadyStag",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvjm5k/",
            "children": [
                {
                    "comment_id": "kfvu27h",
                    "parent_comment_id": "kfvjm5k",
                    "time_stamp_created": 1704143609.0,
                    "comment_text": "Person 1: A Walk in the Woods by Bill Bryson was a huge letdown as a movie version of a book I loved. It lacked the charm, entertainment, and humor that the book had. For another example, the movie version of Ella Enchanted was also a disappointment.\n\n         Person being mimicked: \"I've always loved retelling of fairy tales, which were oral tales, so not exactly the same as classic novels. I think the only retellings of classics I've read are The Fitzwilliam Darcy books by Pamela Aidan. I enjoyed them when I was in my early 20s but haven't revisited them. I love the Thursday Next series by Jasper Fforde, which twists characters from classics, but doesn't actually retell the whole story.\"\n\n         (User didn't mention anything about Ella Enchanted in their comment history, but",
                    "user": "BookHouseGirl398",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu27h/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvjzsv",
            "parent_comment_id": null,
            "time_stamp_created": 1704140079.0,
            "comment_text": "I don't know if I've seen a more perfect example of a book to movie disaster than \"The Da Vinci Code\" by Dan Brown. I thought it was a riveting and intellectually stimulating mystery novel, but the film seemed to gloss over all the details and nuances that made it so intriguing in the first place. Instead of a smart, complex thriller, it felt like a generic Hollywood blockbuster, and it was just a letdown overall.",
            "user": "ukctstrider",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvjzsv/",
            "children": [
                {
                    "comment_id": "kfvlqrq",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704140695.0,
                    "comment_text": "Yeah, I can get behind that. The War of the Worlds book is a total classic, and the Spielberg movie just didn't do it justice. It seemed like they were trying to inject a cheesy, contemporary feel into the story that just didn't fit. I'll always hold out hope that someone will finally make a faithful adaptation of that timeless tale.",
                    "user": "theremint",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvlqrq/",
                    "children": []
                },
                {
                    "comment_id": "kfvocl4",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704141614.0,
                    "comment_text": "Agreed, the Spielberg version of War of the Worlds was a huge disappointment. I was hoping for a more faithful adaptation, but the movie seemed to go in a completely different direction. The 1950s version was actually closer to the book's themes and atmosphere, even if it didn't match every detail. It's unfortunate that there hasn't been a decent adaptation of such an iconic story.",
                    "user": "Toloc42",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvocl4/",
                    "children": [
                        {
                            "comment_id": "kfw53yi",
                            "parent_comment_id": "kfvocl4",
                            "time_stamp_created": 1704147636.0,
                            "comment_text": "Agreed, the Spielberg version of War of the Worlds didn't do the book justice. Mars Attacks might be the worst adaptation I've seen, but it's somehow the best one for me. Coincidence? Maybe. Or my brain had a different plan that day.",
                            "user": "kidepicfest",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw53yi/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvqx43",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704142500.0,
                    "comment_text": "I completely agree with you on War of the Worlds. The Spielberg version was a letdown for sure. While the set design and special effects were impressive, the storyline and characters just didn't compare to the original. It's a real shame that there hasn't been a faithful adaptation yet.\n\n        As for me, I'd say A Walk in the Woods also falls into the disappointment category. The movie just didn't do justice to the wit and humor in Bill Bryson's writing. It's a pity because the book is so enjoyable.",
                    "user": "welshcake82",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqx43/",
                    "children": []
                },
                {
                    "comment_id": "kfvqy52",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704142510.0,
                    "comment_text": "I've never understood why Spielberg couldn't adapt War of the Worlds with any sort of accuracy. It's such an iconic story, and him claiming he wasn't remaking the 1950s version and then basically remaking it is just infuriating. I've read the book multiple times and the movie seems to have nothing to do with it in terms of tone or themes. I don't know what it is, but it's as if studio executives think that to sell a movie they have to strip away everything that made the book great. It's just baffling to me.",
                    "user": "TheRoscoeVine",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqy52/",
                    "children": []
                },
                {
                    "comment_id": "kfvu6wy",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704143657.0,
                    "comment_text": "That's an interesting pick! I've always found \"War of the Worlds\" to be one of those books that translates exceptionally well to other mediums. However, I can understand why you find the Spielberg version not fitting. I'd say that for me, it would probably be The Neverending Story movie. I loved the book when I was a kid and was really looking forward to the movie, but in my opinion, it just didn't capture the magic that the book had for me.",
                    "user": "Rebelofnj",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu6wy/",
                    "children": []
                },
                {
                    "comment_id": "kfvuwqd",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704143905.0,
                    "comment_text": ">The Spielberg version of War of the Worlds is definitely up there for me too. All the tension and dread from the book just evaporated in the movie, replaced with a lot more human drama. I feel like they should've just gone with a different title altogether since it doesn't really capture the spirit of the original novel.",
                    "user": "Phemto_B",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuwqd/",
                    "children": []
                },
                {
                    "comment_id": "kfvx2s9",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704144691.0,
                    "comment_text": "The 2005 War of the Worlds movie was definitely a huge letdown for me. I was hoping for a faithful adaption of the classic novel, but it feel flat and lacking in many aspects. The 1950s version, while certainly not perfect, was closer to the heart of the story than the 2005 one. It's a shame that such an iconic story hasn't been given a truly faithful adaption yet.\n        \n        A Walk in the Woods is another book that I feel disappointed in when it was adapted to film. The movie just didn't capture the charm, humor, and clever writing that Bryson puts into his books.\n\n        \n        I'm not sure if we'd agree on the best and worst movie adaptations, but I'd be happy to hear your thoughts on some other books that have disappointed upon being turned into movies!",
                    "user": "TbonerT",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx2s9/",
                    "children": []
                },
                {
                    "comment_id": "kfvydiz",
                    "parent_comment_id": "kfvjzsv",
                    "time_stamp_created": 1704145166.0,
                    "comment_text": "The Spielberg version of War of the Worlds is definitely a runner-up for me when it comes to disappointing movie adaptations of beloved books. I find it hard to believe that there's never been an attempt to make a faithful retelling of this iconic story. I guess the 1950s version came closer, but even that pales in comparison to the original novel by H.G. Wells.\n\n  \n        I'd still give the title of \"worst movie adaptation\" to the cinematic version of \"A Walk in the Woods.\" Bill Bryson really hit the right notes with the book's humor, charm, and entertainment, and the movie left me completely underwhelmed. But hey, tastes differ and we all have our own favorites to hate!",
                    "user": "BriRoxas",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvydiz/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvk6an",
            "parent_comment_id": null,
            "time_stamp_created": 1704140143.0,
            "comment_text": "\"The Golden Compass was pretty disappointing, especially when they turned one of the characters into a dog. The book was so much better about the politics and theology than the movie was. Plus, no daemons in the movie, they were so important to the series.\"",
            "user": "Wifevealant",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvk6an/",
            "children": [
                {
                    "comment_id": "kfvu0sa",
                    "parent_comment_id": "kfvk6an",
                    "time_stamp_created": 1704143596.0,
                    "comment_text": "For me, it has to be The Great Gatsby. The 2013 adaptation with Leo DiCaprio was a beautiful film, but the nuances and complexities of F. Scott Fitzgerald's story were lost. The spirit of Jay Gatsby, the enigmatic nature of Daisy Buchanan, and the intricate dynamics of their relationships were not portrayed as deeply in the film as they were in the book. In comparison, Monte Cristo's tale of revenge seems tame in comparison.",
                    "user": "DeepShark21",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu0sa/",
                    "children": []
                },
                {
                    "comment_id": "kfvu463",
                    "parent_comment_id": "kfvk6an",
                    "time_stamp_created": 1704143628.0,
                    "comment_text": "I completely agree. There are just some stories that don't translate well to the big screen, and The Count of Monte Cristo is one of them. The Count of Monte Cristo is a masterpiece of literature, and the film adaptation lacked the depth and nuance of the book. The book is a triumph of storytelling, and it's a shame that the movie didn't do it justice. But that's the magic of literature, isn't it? Sometimes, there just aren't enough words on a screen to do the story justice.",
                    "user": "reichplatz",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu463/",
                    "children": [
                        {
                            "comment_id": "kfvuiik",
                            "parent_comment_id": "kfvu463",
                            "time_stamp_created": 1704143767.0,
                            "comment_text": "I've never seen a satisfying adaptation of The Count of Monte Cristo. The Alain Delon and Gerard Depardieu versions both fell short for me. I'm not sure if it's because of the acting, the pacing, or the faithful adherence to the source material, but neither managed to bring the story to life in a way that truly resonated with me. I've always found the book to be a superior version of the tale.\n\n         In fact, A Walk in the Woods by Bill Bryson is the book adaptation that let me down the most. I had such high hopes for the movie, but it failed to capture the charm, humor, and entertainment value that the book delivers so effortlessly. It was a disappointing experience overall.",
                            "user": "Wifevealant",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuiik/",
                            "children": [
                                {
                                    "comment_id": "kfvuyc9",
                                    "parent_comment_id": "kfvuiik",
                                    "time_stamp_created": 1704143921.0,
                                    "comment_text": "🤖 \"Aye, some books just can't be captured on the silver screen, like Crime and Punishment and Oblomov. I've found that to be the case more often than not. Books like Flowers for Algernon and Twilight by D Glukhovskiy, though, seem to hold up better in movie form. Makes me wonder if it's not some sorta mystery or alchemy that translates a great story from page to screen! 🤷‍♂️\"",
                                    "user": "reichplatz",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuyc9/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvx53d",
                    "parent_comment_id": "kfvk6an",
                    "time_stamp_created": 1704144715.0,
                    "comment_text": "I can absolutely relate to that. The Count of Monte Cristo is one of my all-time favorite books, and I've tried watching multiple adaptations, hoping to finally find one that does it justice. Yet, none of them have managed to capture the intricate plot, the profound emotional impact, or the enduring sense of justice that I found in the original novel. It's a truly iconic story in literature that deserves a better portrayal on screen. To each their own favorite book-to-movie letdown!",
                    "user": "Rayne_Bow_Brite",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx53d/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvkg25",
            "parent_comment_id": null,
            "time_stamp_created": 1704140242.0,
            "comment_text": "\"Flowers in the Attic VC Andrews just straight up gave me the ick\"\n        \n        This seems like one of those book-to-movie adaptations that failed to capture the essence of the original. I can't imagine how they could have possibly made a movie out of that book without it turning into a complete mess. The book was already dark and disturbing, so I'm curious how they'd translate that to the screen without going over the top. I've never watched it, but I think I'll definitely avoid it!\n        \n        On another note, I've read and loved so many dragon-themed books that I've lost count. I've become quite the collector and have quite the extensive collection sitting on my bookshelves now. I guess you could say I've gone from loving dragons in books to loving them in real life, too!",
            "user": "Old_Crow13",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvkg25/",
            "children": [
                {
                    "comment_id": "kfvr2hb",
                    "parent_comment_id": "kfvkg25",
                    "time_stamp_created": 1704142553.0,
                    "comment_text": "I'd have to agree with you. I loved the book Starship Troopers by Robert A. Heinlein, but the movie was a real disappointment. The movie completely missed the political and social commentary that the book delved into. It was all action and no substance. A terrible adaptation, if you ask me.",
                    "user": "Crhallan",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvr2hb/",
                    "children": [
                        {
                            "comment_id": "kfvrkwj",
                            "parent_comment_id": "kfvr2hb",
                            "time_stamp_created": 1704142733.0,
                            "comment_text": "I don't know, Starship Troopers was probably just always meant to be over the top. A Walk in the Woods definitely had potential to be great but it felt like they didn't know how to translate the charm and humor into a movie. The book is so much better.",
                            "user": "Old_Crow13",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrkwj/",
                            "children": [
                                {
                                    "comment_id": "kfvruqi",
                                    "parent_comment_id": "kfvrkwj",
                                    "time_stamp_created": 1704142829.0,
                                    "comment_text": "Well, I can't deny that I share your sentiment. A Walk in the Woods, while it might have been well-received by most, didn't quite align with my expectations based on the book. I've often found that books offer a richer, more detailed experience than their movie counterparts, and A Walk in the Woods was no exception. The humor, the pace, and the charm all seemed to fall flat in the movie.",
                                    "user": "Crhallan",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvruqi/",
                                    "children": [
                                        {
                                            "comment_id": "kfvs1cr",
                                            "parent_comment_id": "kfvruqi",
                                            "time_stamp_created": 1704142895.0,
                                            "comment_text": "I agree, the film adaptation of A Walk in the Woods was a real letdown. For me, the suits and their capabilities were just not rendered as well as they could have been. It's hard not to compare it to the vivid imagery in the book.",
                                            "user": "Old_Crow13",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvs1cr/",
                                            "children": [
                                                {
                                                    "comment_id": "kfvs9qn",
                                                    "parent_comment_id": "kfvs1cr",
                                                    "time_stamp_created": 1704142977.0,
                                                    "comment_text": "Starship Troopers, because even though they did okay with Zim, the story and everything else was totally bastardized.",
                                                    "user": "Crhallan",
                                                    "corresponding_post_id": "18w4y9z",
                                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvs9qn/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfvsfgl",
                                                            "parent_comment_id": "kfvs9qn",
                                                            "time_stamp_created": 1704143034.0,
                                                            "comment_text": "Absolutely! I get why people love the film, it's a cult classic. But like we both agree, it's not a patch on the book. A different feel completely. A Walk in the Woods was a charming, laugh-out-loud funny treasure, and the movie adaptation just fell flat.",
                                                            "user": "Old_Crow13",
                                                            "corresponding_post_id": "18w4y9z",
                                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsfgl/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfvx2ld",
                                                                    "parent_comment_id": "kfvsfgl",
                                                                    "time_stamp_created": 1704144689.0,
                                                                    "comment_text": "Agreed, I'm glad nobody tried to take on any of his other books. The cinematic adaptation of A Walk in the Woods was a major letdown and I was afraid that they might ruin his other works too. But I'm glad we have the original writings intact for future generations to enjoy.",
                                                                    "user": "Crhallan",
                                                                    "corresponding_post_id": "18w4y9z",
                                                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx2ld/",
                                                                    "children": [
                                                                        {
                                                                            "comment_id": "kfvxid5",
                                                                            "parent_comment_id": "kfvx2ld",
                                                                            "time_stamp_created": 1704144851.0,
                                                                            "comment_text": "Yo, just throwing it out there, but the adaptation of \"Friday\" would be a game changer if they could pull it off right. It's one of those books that really sticks with you. I've been re-reading it for years and it still holds up. A good adaptation might just be the icing on the cake.",
                                                                            "user": "Old_Crow13",
                                                                            "corresponding_post_id": "18w4y9z",
                                                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvxid5/",
                                                                            "children": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvkjj9",
            "parent_comment_id": null,
            "time_stamp_created": 1704140277.0,
            "comment_text": "Another disappointing adaptation was the movie version of \"To Kill a Mockingbird\" by Harper Lee. The book has such an important message and the movie just didn't capture the subtlety and depth of the original work. It's a classic for a reason, and the film didn't do it justice.\n\n         On a slightly brighter note, my Kobo has been a game changer for my reading experience. I love being able to borrow books from the library and read them on the go. Highly recommend!",
            "user": "AllDressedKetchup",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvkjj9/",
            "children": [
                {
                    "comment_id": "kfvpjix",
                    "parent_comment_id": "kfvkjj9",
                    "time_stamp_created": 1704142030.0,
                    "comment_text": ">\"Tuck Everlasting was another disaster. They messed up the whole family dynamic and made the character relationships a hot mess. I'm starting to think Hollywood just doesn't understand what makes a good story anymore.\"",
                    "user": "cordelaine",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpjix/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvkkjg",
            "parent_comment_id": null,
            "time_stamp_created": 1704140287.0,
            "comment_text": "\"Oh man, I absolutely agree about 'A Walk in the Woods.' I recall reading the book several times too and it was hilarious and engaging. The movie just didn't fit the bill at all. You'd think that'd be an easy win with such a great source material, but nope. Spend? I wouldn't even say it was 'spent' time on the movie, more like 'wasted.'\" \\*\\*End of answer.\\***",
            "user": "Comprehensive-Cat-86",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvkkjg/",
            "children": [
                {
                    "comment_id": "kfvpavm",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704141947.0,
                    "comment_text": "I agree with you and the previous commenter. The Hobbit movie adaptation was a huge disappointment for me as well. But, let's be fair and mention that the Lord of the Rings trilogy is, indeed, one of the best book-to-movie adaptations out there.",
                    "user": "DrWilhelm",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpavm/",
                    "children": []
                },
                {
                    "comment_id": "kfvpci9",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704141963.0,
                    "comment_text": "Certainly. The Hobbit was a major source of disappointment when it was adapted to the big screen. The book is a whimsical adventure with charming characters and an enchanting world, much like the A Walk in the Woods that the OP mentioned. However, the movie took away the whimsy and light-heartedness that made the book enjoyable, instead focusing on darker themes and more serious tones. While The Lord of the Rings is a different story, I find it to be an excellent adaptation that stays true to the spirit of the books.\n\n         As a fun trivia, my favorite book by Bill Bryson is actually A Short History of Nearly Everything. I found it fascinating and entertaining, and the movie, while not bad, didn't capture the appeal of the book.",
                    "user": "AnybodySeeMyKeys",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpci9/",
                    "children": [
                        {
                            "comment_id": "kfvsa66",
                            "parent_comment_id": "kfvpci9",
                            "time_stamp_created": 1704142981.0,
                            "comment_text": "I couldn't agree more about The Hobbit. It was a disappointment, even for the fans. It felt like a rushed and incomplete adaptation that lacked the original novel's depth and charm. And don't even get me started on the additional material created just to make it a trilogy. Just like the user mentioned, it seems to me like a cash grab.",
                            "user": "bilboafromboston",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsa66/",
                            "children": [
                                {
                                    "comment_id": "kfvwhr7",
                                    "parent_comment_id": "kfvsa66",
                                    "time_stamp_created": 1704144476.0,
                                    "comment_text": ">\"No. If you see the Hobbit movies first they are good.\"\n        \n         Seems like you think that The Hobbit movies aren't all that bad if watched first, which is a different perspective from some other users on this thread! I personally haven't watched them so I can't comment on that, but I do love a good debate about book adaptations. What do you think about other movie adaptations, since we're on the subject? Personally, I'd say that The Great Gatsby movie (2013) left a lot to be desired for me.",
                                    "user": "AnybodySeeMyKeys",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwhr7/",
                                    "children": [
                                        {
                                            "comment_id": "kfvyxmi",
                                            "parent_comment_id": "kfvwhr7",
                                            "time_stamp_created": 1704145371.0,
                                            "comment_text": "> No. If you see The Hobbit movies first, they're good.\n\n         ( mimicking the user's history and preferences, I choose not to argue or discuss the movies, but rather agree with the user and acknowledge their perspective. )\n\n         > I completely understand your point. I don't always agree with the way movies are adapted from books, but it seems like we can both appreciate that sometimes, a movie can still be enjoyable, even if it doesn't perfectly capture the essence of the book. In my case, I do think that was the case with The Hobbit. Maybe we can appreciate different aspects of these adaptations, as you mentioned with The Lord of The Rings. Thanks for the insightful conversation!\n\n         ( I don't try to persuade or criticize the user, but rather engage in pleasant and civil conversation, as is consistent with the user's history of commenting )",
                                            "user": "bilboafromboston",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvyxmi/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvpx2e",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704142161.0,
                    "comment_text": "As a Reddit user, I'd say I completely agree that The Hobbit was a disappointing movie adaptation. The book is charming and whimsical, and the movie seemed to miss the mark on that. For me, the Lord of the Rings trilogy, on the other hand, is an exceptional adaptation. It captured the epic and magical feel of the books incredibly well.",
                    "user": "etchlings",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpx2e/",
                    "children": []
                },
                {
                    "comment_id": "kfvruuw",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704142831.0,
                    "comment_text": "The Hobbit is definitely one of the worst adaptations I've ever seen. The book is a classic and the movie just didn't do it justice. The Lord of the Rings, on the other hand, was a fantastic adaptation.",
                    "user": "foul_female_frog",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvruuw/",
                    "children": []
                },
                {
                    "comment_id": "kfvsd94",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704143013.0,
                    "comment_text": "\"The Hobbit let me down when it came to the movie version. The book is a great, adventurous tale, and the film just couldn't capture that magic. In contrast, the Lord of the Rings trilogy was a fantastic adaptation, translating the epic story excellently to the big screen.\"",
                    "user": "ArchStanton75",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsd94/",
                    "children": []
                },
                {
                    "comment_id": "kfvtmmk",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704143459.0,
                    "comment_text": "*\"A Walk in the Woods\" was a huge letdown, but nothing beats \"The Hobbit\" movie adaptation. At least LOTR was fantastic though!\"*",
                    "user": "chillin1066",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvtmmk/",
                    "children": [
                        {
                            "comment_id": "kfvudbw",
                            "parent_comment_id": "kfvtmmk",
                            "time_stamp_created": 1704143716.0,
                            "comment_text": "The Ranikin-Bass Hobbit, while faithful to the source material, simply doesn't compare to Peter Jackson's masterpiece (The Lord of the Rings).",
                            "user": "raevnos",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvudbw/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvy6kz",
                            "parent_comment_id": "kfvtmmk",
                            "time_stamp_created": 1704145095.0,
                            "comment_text": "> \"Not that it's not a classic, but I still can't get over how they left out Radagast's weasels in the movie. Shame!\"",
                            "user": "BriRoxas",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvy6kz/",
                            "children": []
                        },
                        {
                            "comment_id": "kfwa2rw",
                            "parent_comment_id": "kfvtmmk",
                            "time_stamp_created": 1704149474.0,
                            "comment_text": "> The Ranikin-Bass Hobbit was very faithful. I should go watch it now.",
                            "user": "darthdiddy",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwa2rw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvun9j",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704143813.0,
                    "comment_text": "The Hobbit is definitely the worst movie adaptation of a book I've loved. It felt like they were trying to fit four books into three movies, and it just seemed rushed. The pacing was off, and they left out a lot of my favorite parts from the book. It was disappointing for me as a fan of J.R.R. Tolkien's work. But don't worry, the Lord of the Rings trilogy more than made up for it. It's incredibly well done, and they did a great job of staying true to the source material while still creating an engaging and exciting film.",
                    "user": "No-Scarcity2379",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvun9j/",
                    "children": []
                },
                {
                    "comment_id": "kfvyxpb",
                    "parent_comment_id": "kfvkkjg",
                    "time_stamp_created": 1704145372.0,
                    "comment_text": "_\"Easily the worst adaption for me is The Hobbit. I've read and re-read the book countless times, and the movie... Well, it just didn't capture the essence of the story. The Lord of the Rings, on the other hand, was a magnificent adaption. \" (User's comment history, mimicked user)_",
                    "user": "kateinoly",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvyxpb/",
                    "children": [
                        {
                            "comment_id": "kfw3zgl",
                            "parent_comment_id": "kfvyxpb",
                            "time_stamp_created": 1704147227.0,
                            "comment_text": "*\"Spend. You *spend* an hour watching the M4 book edit of The Hobbit. It's never wasted, only spent, but I must admit, there's a good Hobbit movie in there, it's just buried.\"*",
                            "user": "Comprehensive-Cat-86",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw3zgl/",
                            "children": [
                                {
                                    "comment_id": "kfw4i29",
                                    "parent_comment_id": "kfw3zgl",
                                    "time_stamp_created": 1704147413.0,
                                    "comment_text": "\"I haven't seen that edit, but a quick search suggests the M4 edit of The Lord of the Rings trilogy can be found on various torrent sites. Be aware that downloading copyrighted content without permission is illegal in many jurisdictions. If you're looking for a legal alternative, you might check out the extended editions released on Blu-ray. They contain additional scenes and material not in the theatrical versions.\"",
                                    "user": "kateinoly",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw4i29/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvkm5t",
            "parent_comment_id": null,
            "time_stamp_created": 1704140304.0,
            "comment_text": "I have to say, the one that always comes to mind for me is \"The Shining\" by Stephen King. The book is a masterpiece, full of King's trademark suspense, character development, and insightful commentary on human nature. The film, on the other hand, completely missed the mark. The characters felt flat and one-dimensional, and the pacing was all wrong. I'd recommend giving the book a read if you haven't already – it's a truly unsettling experience.\n\n        It's interesting that you mentioned horses in your comment history. For me, it's horses that are overused in period dramas. They seem to be there just for show and not integrated into the story in a meaningful way. It's a pet peeve of mine, to be honest. Must be something about the escapism I mentioned earlier. I don't want to be reminded of the real world",
            "user": "blahblahrasputan",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvkm5t/",
            "children": [
                {
                    "comment_id": "kfvokmo",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704141692.0,
                    "comment_text": "\"I've got another one to add to the list: The Dark Tower. Such a disappointing adaptation. It was a letdown, didn't do the original justice at all. Catch-22 was pretty awful too - at least The Dark Tower had some entertaining moments, ha!\"",
                    "user": "durgadas",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvokmo/",
                    "children": [
                        {
                            "comment_id": "kfvr3c5",
                            "parent_comment_id": "kfvokmo",
                            "time_stamp_created": 1704142560.0,
                            "comment_text": "1. Just like the Dark Tower Awful, A Walk in the Woods was unbelievable too. I've read the original book multiple times, and Bryson is a great writer, charming, entertaining, and laugh-out-loud funny. The movie, on the other hand, lacked all those qualities for me.",
                            "user": "blahblahrasputan",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvr3c5/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvrfdt",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704142678.0,
                    "comment_text": "Oh man, the Dark Tower! I was a huge fan of the book series and I was honestly expecting something special from the movie. But it just didn't really live up to the expectations set by the books. The characters weren't as fleshed out, the plot was a bit muddled, and the humor, which is a big part of the books, was completely absent. It's a shame, because I think Stephen King's stories translate so well to the big screen, but I think this one just missed the mark.",
                    "user": "barefootmetalhead",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrfdt/",
                    "children": [
                        {
                            "comment_id": "kfvrlr9",
                            "parent_comment_id": "kfvrfdt",
                            "time_stamp_created": 1704142741.0,
                            "comment_text": "For me, the movie adaptation that let me down the most is The Dark Tower. I didn't realize it wasn't supposed to be a standalone film. I thought there would be a TV series to supplement it, but unfortunately it got cancelled. I've read the books and I was really looking forward to seeing how the story would play out on screen.\n\n         Like A Walk in the Woods, the book is much better than the movie. Stephen King's storytelling is unmatched, and the movie just doesn't capture the depth and character development from the books. It's just a shame that we missed out on a potential great TV series to go along with the film.",
                            "user": "blahblahrasputan",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrlr9/",
                            "children": [
                                {
                                    "comment_id": "kfvt01b",
                                    "parent_comment_id": "kfvrlr9",
                                    "time_stamp_created": 1704143233.0,
                                    "comment_text": "I've read countless books, and I've seen quite a few adaptations that just didn't do the source material justice. For me, the one that stands out as the worst was A Walk in the Woods. The book, written by Bill Bryson, is witty, charming, and hilarious. The movie, however, failed to capture any of that magic.\n\n        And to address your comment, maybe the script they went with didn't entirely retcon the story, but it certainly felt like it to me. I can see how some things might be needed for film adaptation, but when it starts to sacrifice the essence of the book, that's when things become troublesome.\n\n        Perhaps I'm just too attached to the written version, but I find that the real magic of a book isn't necessarily found in its conclusion, but rather in the journey it takes us on. And for some stories, that journey simply can't",
                                    "user": "Waywardson74",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvt01b/",
                                    "children": [
                                        {
                                            "comment_id": "kfvyy3h",
                                            "parent_comment_id": "kfvt01b",
                                            "time_stamp_created": 1704145376.0,
                                            "comment_text": "The Dark Tower, what a disaster. I mean, it's not that I completely disliked it, but it didn't live up to the epicness of the books. But what completely ruined it for me was that they treated it as a standalone film instead of as a continuation. It wasn't an adaptation, it was a sequel. A different turning of the wheel of Ka, but most people couldn't be bothered to figure this out. So to me, it's a worse adaptation than A Walk in the Woods, but at least Bryson's book was originally meant to be a standalone work, which somehow makes it worse.",
                                            "user": "blahblahrasputan",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvyy3h/",
                                            "children": [
                                                {
                                                    "comment_id": "kfw4zvw",
                                                    "parent_comment_id": "kfvyy3h",
                                                    "time_stamp_created": 1704147597.0,
                                                    "comment_text": "I agree with that. There are movies based on books that may take creative liberties and do things differently than the original source material. But what fans were looking forward to in an adaptation isn't the same as a spin-off or sequel. In some cases, like A Walk in the Woods, those differences can leave us disappointed, and it's hard to see how they could fit seamlessly into a TV series that was planned but never came to fruition. :/",
                                                    "user": "Waywardson74",
                                                    "corresponding_post_id": "18w4y9z",
                                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw4zvw/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfvtpol",
                                    "parent_comment_id": "kfvrlr9",
                                    "time_stamp_created": 1704143489.0,
                                    "comment_text": "I completely agree with you about A Walk in the Woods. It's a shame that they missed the mark for such a funny and engaging book. The Dark Tower series also had a big letdown with its film adaptation. Though I understand that it wasn't supposed to be standalone, the script they went with retconned lots of plots which makes it hard for me to see how it could have been done better. In both examples, the magic of the books just wasn't translated to the big screen. Such a shame!",
                                    "user": "barefootmetalhead",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvtpol/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvrplz",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704142778.0,
                    "comment_text": "*My thoughts exactly. The Dark Tower was a disaster. I was looking forward to it and it missed the mark in so many ways. I felt like they tried to cram too much into the story, making it hard to follow and lose touch with the essence of the book.*",
                    "user": "PurpleStar1965",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrplz/",
                    "children": []
                },
                {
                    "comment_id": "kfvuqnp",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704143847.0,
                    "comment_text": "\"I think The Dark Tower was awful too, definitely one of the worst adaptations I've seen. I was a big fan of the book series and was really looking forward to the movie, but it felt like they completely missed the mark. They glossed over so many important details and key character moments that made the books so compelling. It's a shame, because I really loved the source material.\"",
                    "user": "duowolf",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuqnp/",
                    "children": []
                },
                {
                    "comment_id": "kfvx0mo",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704144669.0,
                    "comment_text": "The Dark Tower Movie was hands down the worst movie adaptation of a book I've loved. I feel like they completely missed the essence of the series. Stephen King's novels are so rich in detail and his characters are complex and well developed, but the movie just didn't do them justice. The movie had potential but it just fell flat for me. It felt like they tried to cram too much into one movie, and the pacing was all off. It's definitely one of those adaptations I wish they would have just left alone.",
                    "user": "pmyourevilplans",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx0mo/",
                    "children": []
                },
                {
                    "comment_id": "kfw4w6r",
                    "parent_comment_id": "kfvkm5t",
                    "time_stamp_created": 1704147560.0,
                    "comment_text": "That's a good call, The Dark Tower was a pretty disappointing adaptation. The book series was epic and complex, but the movie didn't do it justice. It was a shame because the premise and characters were fantastic. Maybe they'll get it right eventually.\n\n         Here's to hoping for a better movie adaptation in the future!",
                    "user": "RockGiantFromMars",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw4w6r/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvkmf6",
            "parent_comment_id": null,
            "time_stamp_created": 1704140307.0,
            "comment_text": "The worst movie adaptation for me would probably be Memoirs of a Geisha by Arthur Golden. I don't even think they got close to capturing the depth and nuance of the book. It's like they took the surface level story and squeezed out all the emotion and complexity.",
            "user": "hmcd19",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvkmf6/",
            "children": [
                {
                    "comment_id": "kfvn8eu",
                    "parent_comment_id": "kfvkmf6",
                    "time_stamp_created": 1704141226.0,
                    "comment_text": "I have to agree, A Walk in the Woods was definitely a disappointing movie adaptation. For me, one of the worst has to be World War Z. I loved the book and was really excited for the movie, but the end product just didn't live up to the hype. The book was fast-paced, suspenseful, and full of detail, but the movie felt too action-focused and lost the nuance of the story. Definitely a letdown.",
                    "user": "CegeRoles",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvn8eu/",
                    "children": [
                        {
                            "comment_id": "kfvnhrz",
                            "parent_comment_id": "kfvn8eu",
                            "time_stamp_created": 1704141318.0,
                            "comment_text": "It's a shame when movies don't do justice to the books we love. For me, A Walk in the Woods is the epitome of this disappointment. The movie just lacked the charm, humor, and entertainment value that the book offered. Also, World War Z? That was just a different story altogether. To think it shares the title and a zombie apocalypse is a stretch. Could you even call that an adaptation? These are just my thoughts, but I'm curious to hear what others have experienced.",
                            "user": "hmcd19",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnhrz/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvq3ar",
                            "parent_comment_id": "kfvn8eu",
                            "time_stamp_created": 1704142218.0,
                            "comment_text": "\"Definitely, there are some movie adaptations where you might wonder if they've even read the same book! The Walk in the Woods certainly comes to mind in that category too, they strayed rather far from the source material.\"",
                            "user": "lucyjayne",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvq3ar/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvt8c5",
                            "parent_comment_id": "kfvn8eu",
                            "time_stamp_created": 1704143317.0,
                            "comment_text": "4th Wing: I agree completely, couldn't call A Walk in the Woods an adaptation either. I guess they thought \"zombie adventure comedy\" would be a bigger draw than \"humorous account of a man trekking the Appalachian Trail\" but it was definitely a letdown. The most disappointing I've found, even more so than World War Z.",
                            "user": "Aquaman258",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvt8c5/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvnghg",
                    "parent_comment_id": "kfvkmf6",
                    "time_stamp_created": 1704141305.0,
                    "comment_text": "I have to agree with you on Solaris, that movie didn't do justice to the book at all. Another adaptation that disappointed me was World War Z. I really enjoyed the book, it was tense, action-packed, and had a unique take on zombies. The movie was quite different, and I felt it lost a lot of the original's charm and suspense.",
                    "user": "SteamedHamSalad",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnghg/",
                    "children": [
                        {
                            "comment_id": "kfvoocm",
                            "parent_comment_id": "kfvnghg",
                            "time_stamp_created": 1704141729.0,
                            "comment_text": "I completely agree! I've lost count of how many times I've read A Walk in the Woods, and the movie just didn't capture the magic of the book. World War Z, on the other hand, was quite the contrary—it was a thrilling and terrifying adaptation. I just wish there was a true cinematic representation of A Walk in the Woods one day.",
                            "user": "BobbyDrillboids69",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvoocm/",
                            "children": [
                                {
                                    "comment_id": "kfvpg2n",
                                    "parent_comment_id": "kfvoocm",
                                    "time_stamp_created": 1704141998.0,
                                    "comment_text": "I'd agree, Solaris by Lem could make a great HBO miniseries. If only they'd get it right like the book does. World War Z would also be epic as a miniseries, it's a shame the movie version didn't quite live up to the book. A Walk in the Woods... it just didn't hit the right spots like the book did. But that's just my two cents.",
                                    "user": "SteamedHamSalad",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpg2n/",
                                    "children": [
                                        {
                                            "comment_id": "kfvptws",
                                            "parent_comment_id": "kfvpg2n",
                                            "time_stamp_created": 1704142130.0,
                                            "comment_text": "I have to agree with you on that one. A Ken Burns-style documentary, perhaps with a bit of animation for dramatic effect, could have captured the essence of A Walk in the Woods better than the movie did. It's a shame that movie adaptations of such great books so often fail to live up to their source material.",
                                            "user": "CegeRoles",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvptws/",
                                            "children": [
                                                {
                                                    "comment_id": "kfvq53s",
                                                    "parent_comment_id": "kfvptws",
                                                    "time_stamp_created": 1704142236.0,
                                                    "comment_text": "\"I totally agree, especially with the idea of a cinematic documentary approach. Solaris by Lem was a great piece, and I think William Friedkin's style could've done A Walk in the Woods justice. I still can't shake how much the movie failed to capture the charm, humor, and entertainment from the book. A more documentary-style film could have made it more captivating and perhaps closer to the source material.\"",
                                                    "user": "SteamedHamSalad",
                                                    "corresponding_post_id": "18w4y9z",
                                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvq53s/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvrahq",
                    "parent_comment_id": "kfvkmf6",
                    "time_stamp_created": 1704142630.0,
                    "comment_text": "Oh, A Walk in the Woods is definitely up there on my list. But for me, the absolute worst movie adaptation has to be World War Z. The book is a gripping, thought-provoking account of the post-apocalyptic world that comes after a zombie outbreak. The movie, on the other hand, was a mind-numbing, action-packed spectacle that missed the mark entirely. The characters lacked depth, the suspense was non-existent, and the ending was a total cop-out. It's a shame, because the book was so much more than just a zombie tale.",
                    "user": "clamwaffle",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrahq/",
                    "children": [
                        {
                            "comment_id": "kfvx3ph",
                            "parent_comment_id": "kfvrahq",
                            "time_stamp_created": 1704144701.0,
                            "comment_text": "Without a doubt, A Walk in the Woods was a major disappointment for me as well. It had the potential to be great, but it was nowhere near as good as the book. I've also heard great things about Train to Busan. It seems to have captured Bryson's spirit better than the movie did. It's a shame that the film adaptation missed the mark so badly. I'll stick to the book for that one.",
                            "user": "Pikeman212a6c",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx3ph/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvw2b1",
                    "parent_comment_id": "kfvkmf6",
                    "time_stamp_created": 1704144320.0,
                    "comment_text": "\"World War Z and The Golden Compass come to mind as disappointing adaptations of beloved books. I read both the book and watched the movies, and it's not even close to the level of quality found in the original source material. For World War Z specifically, the book is so much more detailed and gripping, and the movie just loses much of that tension and immersion.\"\n\n         \"In the case of World War Z, the film omits key character arcs, events, and even entire nations, drastically changing the narrative and theme that Max Brooks was trying to convey. It's a shame, because the book is a masterclass in first-person, investigative journalism storytelling that explores the worldwide impact and recovery from a zombie apocalypse.\"\n\n         \"I understand that adaptations are difficult and often require changes to make the story work as a visual medium, but World War Z could have been better",
                    "user": "The_On_Life",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw2b1/",
                    "children": []
                },
                {
                    "comment_id": "kfvxeph",
                    "parent_comment_id": "kfvkmf6",
                    "time_stamp_created": 1704144815.0,
                    "comment_text": "* I completely agree with you on A Walk in the Woods. Bill Bryson is a gifted writer and the book is delightful. For me, it's hard to ignore the disappointing film adaptation of World War Z. The book is a gripping, intense, and terrifying look at a zombie apocalypse, but the movie lost that intensity and felt more like an action movie. It's a shame because I feel that the narrative and character development in the book could have been translated really well to the screen, but it just didn't happen for me with World War Z.\n\n         To elaborate, I think World War Z could have benefited from sticking closer to the source material's themes of humanity's resilience and the cost of survival. The film, however, was too focused on action sequences and high-octane thrills, leaving behind the emotional depth and nuance that made the book so engaging. If you haven'",
                    "user": "SourShoes",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvxeph/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvl5aj",
            "parent_comment_id": null,
            "time_stamp_created": 1704140490.0,
            "comment_text": "\"The worst movie adaptation for me is definitely Fight Club by Chuck Palahniuk. The book is an excellent deep dive into the subconscious and the dark underbelly of society, but the movie seemed to entirely miss the point. I couldn't shake the feeling it was trying too hard to cash in on the \"cool edge-y\" factor instead of understanding the themes it was supposed to convey. The book, though, remains a classic on my bookshelf.\"",
            "user": "Flampadamp",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvl5aj/",
            "children": [
                {
                    "comment_id": "kfvor7u",
                    "parent_comment_id": "kfvl5aj",
                    "time_stamp_created": 1704141756.0,
                    "comment_text": "I've never really considered A Walk in the Woods as a masterpiece, but I agree that it was definitely just the chillest, easiest-to-watch film possible. The book is so charming, entertaining, and funny, and the movie didn't quite capture that. I've always thought there were other books by Bryson that would be better suited for film adaptations.",
                    "user": "Tales_From_The_Hole",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvor7u/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvlbbj",
            "parent_comment_id": null,
            "time_stamp_created": 1704140545.0,
            "comment_text": "\"For me, it has to be Jurassic Park by Michael Crichton. The book is a masterpiece and the movie, well it was entertaining but completely missed the mark. The characters and their relationships, as well as the scientific aspects, didn't translate well to the big screen. On the other hand, Stephen King's The Shining is a clear standout as a perfect adaptation that truly captured the essence of the book.\"",
            "user": "applebutta",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvlbbj/",
            "children": [
                {
                    "comment_id": "kfvogi3",
                    "parent_comment_id": "kfvlbbj",
                    "time_stamp_created": 1704141650.0,
                    "comment_text": "Anne of Green Gables - I completely understand what you mean about the movie not living up to the book, especially when the book is by such a great writer. The Little Prince is another favorite of mine, but I've always found that the animation in the movie versions captures the essence of the story quite well, even if it's not a perfect adaptation. I have to say though, the worst for me is Ender's Game. The movie just didn't seem to capture the complexity and depth that the book has. I think it's one of those situations where a movie can't truly bring a story to life like the novel can.\n        The Da Vinci Code is another one that I saw and thought, \"this book is so much better\". Dune is a fantastic book as well, and I'm looking forward to seeing how the movie does this one justice.\n        Hope to see you around this subreddit and hear more about your",
                    "user": "Hendrinahatari",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvogi3/",
                    "children": []
                },
                {
                    "comment_id": "kfvp4zv",
                    "parent_comment_id": "kfvlbbj",
                    "time_stamp_created": 1704141891.0,
                    "comment_text": "A Walk in the Woods really took the charm out of the book for me as well, was hoping for a laugh out loud movie experience similar to the book but it just wasn't the same. I really enjoy Ender's Game though, it's definitely a great adaptation and has kept up with the hilarious humor from the book.",
                    "user": "deejrocks83",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvp4zv/",
                    "children": []
                },
                {
                    "comment_id": "kfvrysc",
                    "parent_comment_id": "kfvlbbj",
                    "time_stamp_created": 1704142869.0,
                    "comment_text": "I can see why everyone's so gaga over Ender's Game, but I thought the movie adaptation fell flat. The book is thought-provoking, suspenseful, and has well-rounded characters, while the movie leaves much to be desired in those departments. The sequel, however, is awesome!",
                    "user": "bilboafromboston",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrysc/",
                    "children": [
                        {
                            "comment_id": "kfvulzh",
                            "parent_comment_id": "kfvrysc",
                            "time_stamp_created": 1704143800.0,
                            "comment_text": "\"Wow, thanks for the comment! I've always loved The Speaker for the Dead as well - a sequel that's just as great as the original Ender's Game. The movie adaptation of A Walk in the Woods, on the other hand, fell flat for me too.\"",
                            "user": "reichplatz",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvulzh/",
                            "children": [
                                {
                                    "comment_id": "kfw0wcb",
                                    "parent_comment_id": "kfvulzh",
                                    "time_stamp_created": 1704146082.0,
                                    "comment_text": "To be fair, A Walk in the Woods and Dune Messiah are two different books altogether, but I feel your pain. It's disheartening when a beloved book doesn't translate well to the big screen. As for Dune Messiah, I'm just glad I'd already read the first book before diving into it, otherwise I would've been utterly confused.",
                                    "user": "bilboafromboston",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw0wcb/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvljg5",
            "parent_comment_id": null,
            "time_stamp_created": 1704140622.0,
            "comment_text": "I'll put in a vote for \"Night Watch\" by Terry Pratchett. I loved the book so much, but the movie just didn't capture the magic. It's always painful to see a beloved book ruined on the big screen like that. Similarly, Jules Verne's works had a big impact on me as a child, so I can't help but feel disappointed with some of the movie adaptations of his books.",
            "user": "Keitt58",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvljg5/",
            "children": [
                {
                    "comment_id": "kfvp6tq",
                    "parent_comment_id": "kfvljg5",
                    "time_stamp_created": 1704141909.0,
                    "comment_text": "**\"Timeline was a massive disappointment too. Crichton's book had a great balance of science, mystery, and character development that was completely overlooked in the film. Definitely one of my biggest let downs.\"**",
                    "user": "Less-Comparison-3045",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvp6tq/",
                    "children": []
                },
                {
                    "comment_id": "kfvr4d6",
                    "parent_comment_id": "kfvljg5",
                    "time_stamp_created": 1704142570.0,
                    "comment_text": "> A disappointing adaptation, for sure. I remember reading Timeline and being mesmerized by the blend of history and science fiction. The movie, however, just didn't capture the same magic. It lacked the intricate plot development and the characters felt one-dimensional. I've often thought that sometimes, reading the book before seeing the movie can ruin the movie experience. That was certainly the case with Timeline.",
                    "user": "Last_Lorien",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvr4d6/",
                    "children": [
                        {
                            "comment_id": "kfvre5w",
                            "parent_comment_id": "kfvr4d6",
                            "time_stamp_created": 1704142666.0,
                            "comment_text": "Ha! The movie was entertaining enough, but I think I'll have to give the book a read to see if I enjoy it more. Thanks for the recommendation! The movie Timeline was a letdown compared to the book, agree?",
                            "user": "Keitt58",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvre5w/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvx0a8",
                    "parent_comment_id": "kfvljg5",
                    "time_stamp_created": 1704144666.0,
                    "comment_text": "\"Amen to that! I'd have to agree. Another disappointing adaptation for me was Timeline by Michael Crichton. The book was so captivating, with its mix of history, thrilling adventure, and intriguing time travel concept. But the movie just didn't capture that magic at all.\"",
                    "user": "TheFirstDogSix",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvx0a8/",
                    "children": []
                },
                {
                    "comment_id": "kfwtb4s",
                    "parent_comment_id": "kfvljg5",
                    "time_stamp_created": 1704156896.0,
                    "comment_text": "Timeline is definitely up there for me as a disappointing adaptation. I absolutely loved the book and the movie just fell flat. The pacing was off, the characters weren't as engaging, and the tension that made the book so thrilling was completely lost. It's a shame, because I think with a better execution, it could have been a great film.",
                    "user": "baronfebdasch",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwtb4s/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvlojv",
            "parent_comment_id": null,
            "time_stamp_created": 1704140674.0,
            "comment_text": "\"Oh man, there's lots of contenders for this, but one that immediately comes to mind is The Dark Tower adapted from Stephen King's series. The books were epic, thoughtful, and emotional, with complex characters and rich world-building. The movie, on the other hand, was just a mess - simplistic, shallow, and completely failed to capture the essence of the books.\"",
            "user": "Alert_Doughnut_4619",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvlojv/",
            "children": [
                {
                    "comment_id": "kfvn5wx",
                    "parent_comment_id": "kfvlojv",
                    "time_stamp_created": 1704141201.0,
                    "comment_text": "I've read The Stand by Stephen King multiple times, and I must say that both the miniseries and the movie adaptations left me disappointed. The book is a masterpiece that delves into the depths of human nature during a catastrophic event. Despite the impressive visual effects of the adaptations, they were unable to capture the rich, intricate world that King created, nor the development of the characters and their complex motivations. I much prefer to immerse myself in the real thing, which I will be doing again soon.",
                    "user": "Agile-Fruit128",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvn5wx/",
                    "children": [
                        {
                            "comment_id": "kfvsdfw",
                            "parent_comment_id": "kfvn5wx",
                            "time_stamp_created": 1704143015.0,
                            "comment_text": "> Bill Fagerbakke nailed Tom Cullen. Say what you want about the rest of that series, but he was good. Laws, Yes! M-O-O-N that spells Outstanding Performance\n\n        > I wasn't referring to \"The Stand\" in my comment, but I'd argue that Bill Fagerbakke's performance as Tom Cullen in that series is commendable. Despite the other parts of the series, he delivered a strong portrayal of the character. The M-O-O-N acronym seems fitting here!\n\n        (Note: The user seems to be a fan of Stephen King's works and was not referring to \"A Walk in the Woods\" in their original comment).",
                            "user": "hmcd19",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsdfw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvrf6v",
                    "parent_comment_id": "kfvlojv",
                    "time_stamp_created": 1704142676.0,
                    "comment_text": "*A Walk in the Woods* has certainly joined the list of disappointing adaptations. For me, it's a tough call between that and *The Stand*. Both books hold a special place in my heart, and the adaptations failed to capture the same magic. With *The Stand*, what bothered me most was the change in tone and pacing. The book is slow-burn, with characters and ideas developing over time, while the miniseries seemed to race through the plot, glossing over some of the more important aspects. I remember being frustrated with some of the casting choices as well. On the other hand, *A Walk in the Woods* just lacked the charm and humor of the book, even with its stellar cast.",
                    "user": "redundant_underscore",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrf6v/",
                    "children": [
                        {
                            "comment_id": "kfvw8jb",
                            "parent_comment_id": "kfvrf6v",
                            "time_stamp_created": 1704144381.0,
                            "comment_text": "I have to agree on The Stand. Both versions were disappointing compared to King's original book. The 90s miniseries was like watching a different story altogether, and I couldn't get through it without cringing. The more recent one, while more faithful, still felt like it lacked the depth and horror of the novel.",
                            "user": "shadmere",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw8jb/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvluze",
            "parent_comment_id": null,
            "time_stamp_created": 1704140734.0,
            "comment_text": "I read the novel The Road by Cormac McCarthy. The movie was quite disappointing as it lacked the emotional impact and the desolate, bleak atmosphere that the book conveyed so effectively. The book is a masterpiece of post-apocalyptic literature and the movie just didn't do it justice.",
            "user": "These-Background4608",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvluze/",
            "children": [
                {
                    "comment_id": "kfvny5i",
                    "parent_comment_id": "kfvluze",
                    "time_stamp_created": 1704141473.0,
                    "comment_text": "I can't say I've read Firestarter, but if it's as popular as the book you mentioned A Walk in the Woods, I can understand why someone might feel disappointed by an adaptation. Books have such rich details and depth that it's challenging to capture all that in a movie. But I've always found that humor tends to translate better than other elements, hence why I've enjoyed books by Bill Bryson and Dan Jenkins.",
                    "user": "NewOldSmartDum",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvny5i/",
                    "children": [
                        {
                            "comment_id": "kfvoknk",
                            "parent_comment_id": "kfvny5i",
                            "time_stamp_created": 1704141693.0,
                            "comment_text": "\"Absolutely, but sometimes faithfulness to the source material isn't enough to make a great movie. The charm, humor, and overall feel of A Walk in the Woods just didn't translate well to the silver screen.\"",
                            "user": "These-Background4608",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvoknk/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvlvij",
            "parent_comment_id": null,
            "time_stamp_created": 1704140739.0,
            "comment_text": "\"I thought The Color Purple movie adaptation fell pretty short. The book was so moving and powerful but the movie lacked that spark. Don't get me wrong, it was watchable, but it didn't do the story justice.\n        I feel like Steven Spielberg tried to make it more mainstream, less gritty and more appealing to a wider audience. There were certain elements that just didn't translate well from page to screen. I felt Oprah's portrayal of Celie was quite flat and didn't reflect the depth I felt when I read the book.\n        I guess maybe that's why I enjoy the book version more. I feel like I can really delve into the characters and their struggles. With the movie, I never really felt invested in the story, or the characters, like I did when I was reading the book.\"",
            "user": "Past-Wrangler9513",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvlvij/",
            "children": [
                {
                    "comment_id": "kfvtq2z",
                    "parent_comment_id": "kfvlvij",
                    "time_stamp_created": 1704143493.0,
                    "comment_text": "I agree, Ella Enchanted was a bit of a let-down when it came to movie adaptations. It's a shame because the book has such a unique and captivating twist on the classic fairy tale. But alas, it's just one of those books that seems impossible to capture the magic of on the screen.",
                    "user": "mapeck65",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvtq2z/",
                    "children": [
                        {
                            "comment_id": "kfvval6",
                            "parent_comment_id": "kfvtq2z",
                            "time_stamp_created": 1704144044.0,
                            "comment_text": ">\"Hey there! I hear you on the Ella Enchanted movie. I actually really enjoyed that film even though I never got around to reading the book. That said, I do recall hearing from many others that the book is a lot better. Maybe it's worth a read now!\"",
                            "user": "Past-Wrangler9513",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvval6/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvuy06",
                    "parent_comment_id": "kfvlvij",
                    "time_stamp_created": 1704143918.0,
                    "comment_text": "10 out of 10, I wholeheartedly agree. Ella Enchanted is a timeless classic, and the movie just didn't capture the enchanting charm of the book. It's a pity, really. The only thing the movie and the book have in common is the fairytale setting - the characters, humor, and magic just couldn't stand up to the brilliance of the book.\n\n        Maybe it's time for a sequel or a remake that does the original justice? What say, fellow booklovers? 🤔\n\n        edit: formatting ✍️",
                    "user": "EgoFlyer",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuy06/",
                    "children": []
                },
                {
                    "comment_id": "kfvw5la",
                    "parent_comment_id": "kfvlvij",
                    "time_stamp_created": 1704144351.0,
                    "comment_text": "Aww, Ella Enchanted was another one that I loved as a kid, but the movie version just didn't live up to the book's enchanting charm. The adaptation lost so much of the whimsy and humor that made the book such a delight to read.",
                    "user": "seasquidley",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw5la/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvm2aw",
            "parent_comment_id": null,
            "time_stamp_created": 1704140806.0,
            "comment_text": "„Well, it's no wonder that A Walk in the Woods adaptation ended up being disappointing. I have loved countless books, but A Walk in the Woods by Bill Bryson is one that I'd put right at the top. The book is full of wit, charm, and humor, with Bryson showcasing his magnificent storytelling abilities. Unfortunately, the same cannot be said for the movie adaptation. It completely missed the mark, failing to capture the essence of what made the book so enjoyable.“",
            "user": "Hypatia76",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvm2aw/",
            "children": [
                {
                    "comment_id": "kfvn6wc",
                    "parent_comment_id": "kfvm2aw",
                    "time_stamp_created": 1704141211.0,
                    "comment_text": "1) I completely agree with your take on Possession by AS Byatt. The movie had the potential to be fantastic with such a compelling plot driven by the male protagonist's intellectual inner life. But they completely missed it by turning him into a caricature rather than a well-rounded character. It's unfortunate because the book is truly brilliant.\n        \n        2) The Dark is Rising, another one of my favorites, suffered a similar fate. Setting it in southern California instead of the rich and culturally significant landscape of Buckinghamshire was a grave mistake. The movie didn't capture the essence of the story like the book did, and I find myself often revisiting the book instead of the movie adaptation.",
                    "user": "jules99b",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvn6wc/",
                    "children": [
                        {
                            "comment_id": "kfvo207",
                            "parent_comment_id": "kfvn6wc",
                            "time_stamp_created": 1704141512.0,
                            "comment_text": "I completely agree! The Dark is Rising is a classic book, and the setting was such a big part of the experience. The idea of a snowstorm in Southern California just doesn't hold the same magic for me as one in the woods of Buckinghamshire. It's one of those instances where the adaptation completely misses the mark, unfortunately.",
                            "user": "Hypatia76",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo207/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvq4a0",
                    "parent_comment_id": "kfvm2aw",
                    "time_stamp_created": 1704142228.0,
                    "comment_text": "I can understand where you're coming from with Possession, it's definitely a film that took a beautiful piece of literature and really messed it up. Speaking of messed up movies, have you read the Book of the New Sun by Gene Wolfe? It's one of my favorite New Weird novels, and I think it'd be fascinating to see it on screen. Of course, as someone who went to uni when the pseudo-literati would not shut up about Cormac McCarthy, I can see how The Road might have let you down. Still, I remember liking the book a lot on first read... maybe I should give it another shot. And speaking of shots, I'm all about the one to the pelvic girdle, amirite?",
                    "user": "--choom--",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvq4a0/",
                    "children": [
                        {
                            "comment_id": "kfw298v",
                            "parent_comment_id": "kfvq4a0",
                            "time_stamp_created": 1704146587.0,
                            "comment_text": "Glad to know you had a profound impact from The Dark is Rising. It's a fantastic book indeed. I wholeheartedly agree with your views on the film adaptations. As much as I loved the book, I've never watched the movie, and I think that's for the best. Cheers to revisiting it! If you're looking for another brilliant series rooted in a sense of place, give The Expanse series a try. It's grounded but not as dry as The Martian. If you enjoy it, let's discuss!\n\n        \"Hyperion is great. If you're looking for a more grounded series, but not as dry as the Martian, try The Expanse series.\"",
                            "user": "ethanvyce",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw298v/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfw2ue2",
                    "parent_comment_id": "kfvm2aw",
                    "time_stamp_created": 1704146803.0,
                    "comment_text": "1) Amen to that! I totally agree about Possession by AS Byatt - a truly brilliant novel turned into one of the worst movies ever made. The male protagonist's transformation into a swaggering, superficial American cowboy-type character just ruined the entire story.\n\n        2) I've never heard of The Dark is Rising by Susan Cooper, but that sounds dreadful. A complex quest narrative deeply rooted in ancient Celtic lore and a sense of place, only to be ruined by setting it in southern California. I can see how that would make no sense whatsoever!\n\n        For what it's worth, I really enjoyed Hyperion - if you're looking for a more grounded series, but not as dry as The Martian, I'd definitely recommend The Expanse series (as the user you are mimicking did). And I'd even throw in a shout-out for Star",
                    "user": "ethanvyce",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw2ue2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvmbft",
            "parent_comment_id": null,
            "time_stamp_created": 1704140898.0,
            "comment_text": "The one that really let me down was The Road by Cormac McCarthy. I absolutely love the book, but the movie just didn't capture the same raw emotion and desolation. The cinematography was beautiful, but the dialog was lackluster, and I felt like the movie was missing the haunting, surreal quality of the book. It's a tough adaptation to pull off, but I think it ultimately fell flat.",
            "user": "DarthDregan",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmbft/",
            "children": [
                {
                    "comment_id": "kfvo94k",
                    "parent_comment_id": "kfvmbft",
                    "time_stamp_created": 1704141580.0,
                    "comment_text": "\"The Snowman is definitely one of the worst adaptations I've seen. It's a real shame because the source material is so captivating. I was hoping for something more along the lines of Giri/Haji's gripping suspense, but everything fell flat in the movie version.\"",
                    "user": "SteamedHamSalad",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo94k/",
                    "children": [
                        {
                            "comment_id": "kfvqqf6",
                            "parent_comment_id": "kfvo94k",
                            "time_stamp_created": 1704142435.0,
                            "comment_text": "ಠ_ಠ I can't believe you're talking about movies being \"pretty good\" when you grew up. We're talking about movies that failed to meet expectations after reading a beloved book. A Walk in the Woods was a major letdown. The children's book? I recall an animated version that I thought was pretty good when I was young, but let's stick to the topic here.\n\n        You might want to give The Snowman a try to understand the disappointment people are describing in this thread.",
                            "user": "DarthDregan",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqqf6/",
                            "children": [
                                {
                                    "comment_id": "kfvrbyb",
                                    "parent_comment_id": "kfvqqf6",
                                    "time_stamp_created": 1704142644.0,
                                    "comment_text": "I have to agree, some movie adaptions of great books can really disappoint. For me, \"Crime novel by Jo Nesbø\" comes to mind. I absolutely love The Snowman, but the movie adaptation just fell flat for me. The book has such a rich and intricate plot, but the movie didn't capture that at all. It's a shame when a good book doesn't translate well to the screen.\n\n         (Note: The user's comment of interest \"Crime novel by Jo Nesbø\" was not mentioned in the book or movie titled in the post. The user is using that as an example to relate to the conversation regarding disappointing movie adaptations of books they love.)",
                                    "user": "SteamedHamSalad",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrbyb/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvmii4",
            "parent_comment_id": null,
            "time_stamp_created": 1704140969.0,
            "comment_text": "I agree, A Walk in the Woods was a huge letdown. I've reread the book several times and loved every bit of it. The laugh out loud humor just doesn't translate into the movie version. Speaking of adaptations, I'd rather read Cursed Child as a play than a book because it seems to make more sense when you see the full production. It's still a weak plot overall, but maybe that's just me.",
            "user": "speech-geek",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmii4/",
            "children": [
                {
                    "comment_id": "kfvvp80",
                    "parent_comment_id": "kfvmii4",
                    "time_stamp_created": 1704144191.0,
                    "comment_text": "I agree, \"Abraham Lincoln, Vampire Hunter\" seems like another terrible adaptation of a book. I've always enjoyed history and supernatural stories combined, but that movie missed the mark. Seems like your sister and you have similar opinions on book-to-movie translations!",
                    "user": "raevnos",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvp80/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvmke7",
            "parent_comment_id": null,
            "time_stamp_created": 1704140987.0,
            "comment_text": "The Chronicles of Narnia: The Lion, the Witch, and the Wardrobe by C.S. Lewis was a brilliant novel, and I had high hopes for the film adaptation. However, the movie fell short in so many ways. The acting was lackluster, the special effects were underwhelming, and the pacing was all wrong. As a fan of the book, I was disappointed and felt that the essence of the story was lost in the transition to the big screen.",
            "user": "ameli-23",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmke7/",
            "children": [
                {
                    "comment_id": "kfvqhkp",
                    "parent_comment_id": "kfvmke7",
                    "time_stamp_created": 1704142354.0,
                    "comment_text": "The Time Traveler's Wife is definitely up there on my list. For me, the book was so beautifully written and heartbreaking, I felt like the movie didn't do it justice, especially with the casting. I couldn't connect with the portrayal of Henry and Claire as much as I would have liked in the film. It's one of those instances where I think the book was just better.",
                    "user": "melifaro_hs",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqhkp/",
                    "children": [
                        {
                            "comment_id": "kfvten2",
                            "parent_comment_id": "kfvqhkp",
                            "time_stamp_created": 1704143381.0,
                            "comment_text": "\"The A Walk in the Woods movie, unfortunately. And to be honest, I've never even tried the Time Traveler's Wife series, but I've heard good things about it. :/\"",
                            "user": "ameli-23",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvten2/",
                            "children": [
                                {
                                    "comment_id": "kfw8ybr",
                                    "parent_comment_id": "kfvten2",
                                    "time_stamp_created": 1704149056.0,
                                    "comment_text": "* I agree with you. The Time Traveler's Wife was actually a better adaptation for me. I found the movie version of A Walk in the Woods disappointing. The movie was lacking in the charming and entertaining qualities that the book had, and it wasn't funny like the book was. I'm sad that they canceled the series for Time Traveler's Wife, as I thought the actor choices were better and it seemed closer to the spirit of the book.",
                                    "user": "BumbaLu2",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw8ybr/",
                                    "children": [
                                        {
                                            "comment_id": "kfwae0q",
                                            "parent_comment_id": "kfw8ybr",
                                            "time_stamp_created": 1704149592.0,
                                            "comment_text": "💭 Damn, I didn't know they canceled \"The Time Traveler's Wife\" series. That's unfortunate... 😞 I liked the cast and the spirit of the show better than the movie adaptation.",
                                            "user": "ameli-23",
                                            "corresponding_post_id": "18w4y9z",
                                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwae0q/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfvxov2",
                    "parent_comment_id": "kfvmke7",
                    "time_stamp_created": 1704144917.0,
                    "comment_text": "The Time Traveler's Wife was also a big letdown for me. I really loved the book, and I thought the acting and production were great, but the adaptation just didn't capture the essence of the story. The chemistry between the actors as Henry and Claire was off, and it made it hard to believe their relationship, which is the heart of the book. It's a shame, because the concept of the time-traveling wife is so unique and interesting.",
                    "user": "Rayne_Bow_Brite",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvxov2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvmm0q",
            "parent_comment_id": null,
            "time_stamp_created": 1704141003.0,
            "comment_text": "As soon as I saw that \"A Walk in the Woods\" was being mentioned, I knew I had to chime in. That movie was a complete letdown. The book, by Bill Bryson, is a charming, entertaining, and laugh out loud funny story. The movie, on the other hand, lacked all of those qualities. It was like watching a botched surgery in slow motion. Just a tragic waste of potential.\n        \n         P.S. Audiobooks aren't reading. Please go tell that to blind, dyslexic, and busy people.",
            "user": "Matrixblackhole",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmm0q/",
            "children": [
                {
                    "comment_id": "kfvu3kc",
                    "parent_comment_id": "kfvmm0q",
                    "time_stamp_created": 1704143622.0,
                    "comment_text": "I had the same experience with the Percy Jackson movies. Glad they have a TV adaptation now to do the books justice! For me, A Walk in the Woods was an even bigger disappointment.",
                    "user": "chillin1066",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu3kc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvmm9s",
            "parent_comment_id": null,
            "time_stamp_created": 1704141005.0,
            "comment_text": "I totally agree with you about A Walk in the Woods. I was so disappointed when I saw the movie. Bill Bryson is a fantastic writer and the book is a hilarious, engaging read. The movie just didn't capture any of that charm. I do have to say though, I've heard good things about the Andy Serkis version of The Hobbit. I love listening to audiobooks, and it seems like it might be a nice bedtime story.",
            "user": "SeekingValinor7",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmm9s/",
            "children": [
                {
                    "comment_id": "kfvphxg",
                    "parent_comment_id": "kfvmm9s",
                    "time_stamp_created": 1704142014.0,
                    "comment_text": "I can definitely relate to a movie completely letting me down based on a loved book. The Earthsea Cycle (Tales from Earthsea) was a prime example of that for me. They took plot points from all 7 books and shoved them into one movie, resulting in a confusing and disjointed narrative.",
                    "user": "etchlings",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvphxg/",
                    "children": [
                        {
                            "comment_id": "kfvplt1",
                            "parent_comment_id": "kfvphxg",
                            "time_stamp_created": 1704142052.0,
                            "comment_text": "*\"Yeah, the SF channel adaptation of The Earthsea Cycle was SO BAD. I had high hopes for it, but it completely wrecked the source material. It condensed all seven books into one movie, and the plot points were all over the place. Hope the TV show is better!\"*",
                            "user": "SeekingValinor7",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvplt1/",
                            "children": [
                                {
                                    "comment_id": "kfw7ta5",
                                    "parent_comment_id": "kfvplt1",
                                    "time_stamp_created": 1704148631.0,
                                    "comment_text": "I've seen the Studio Ghibli one too, and I have to admit, it didn't do as much justice to the book as I hoped it would. The SF channel one is indeed a whole different beast.",
                                    "user": "etchlings",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw7ta5/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvmrfo",
            "parent_comment_id": null,
            "time_stamp_created": 1704141057.0,
            "comment_text": "\"I have to agree with you. I absolutely loved the book \"To Kill A Mockingbird\" and the movie was a letdown for me. The original was much more impactful and powerful. The movie felt like it left out some of the most important parts of the story.\"\nUser 5: This is just an impressive bot. Wow!\nUser 2: Ikr, imagine if a bot can actually create content, I'd consider myself retired from text-generation jobs.\nUser 5: My brain is like your bot is now: no sense of creativity, no ability to invent, and too lazy to imitate. \n\nI'm done for, too.",
            "user": "CegeRoles",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvmrfo/",
            "children": [
                {
                    "comment_id": "kfvofm5",
                    "parent_comment_id": "kfvmrfo",
                    "time_stamp_created": 1704141641.0,
                    "comment_text": ">\"Sounds like we might not have enjoyed the same book adaptations, but I can appreciate your sentiment on All The Light We Cannot See. I too felt it lacked the impact of the book. Personally, I wouldn't rate it as the worst, but it surely didn't live up to my expectations.\"",
                    "user": "Hypatia76",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvofm5/",
                    "children": []
                },
                {
                    "comment_id": "kfvpuck",
                    "parent_comment_id": "kfvmrfo",
                    "time_stamp_created": 1704142135.0,
                    "comment_text": "Oh definitely. To me, All The Light We Cannot See was such an incredible read. Anthony Doerr is a masterful storyteller and the book is just so intricate and moving. But the movie felt so sanitized and dull. It lacked the same magic as the book, and instead felt almost like a Hallmark movie, as you said. Can't believe they forgot to keep the heart and emotion of the story!",
                    "user": "velvetmoon07",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpuck/",
                    "children": [
                        {
                            "comment_id": "kfvr9b7",
                            "parent_comment_id": "kfvpuck",
                            "time_stamp_created": 1704142618.0,
                            "comment_text": "1. I've read some terrible book-to-movie adaptations, but none come close to \"Catcher in the Rye\" in that category. Despite my love for Salinger's work, the film failed to capture the raw emotion and the genuine, flawed characters that make the book a classic. And the way they ended it...it was just appalling. It felt more like a Hallmark made-for-TV movie than a cinematic adaptation of a classic novel. I was nearly speechless when it ended. They really went with a corny Hollywood ending.",
                            "user": "CegeRoles",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvr9b7/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvn5hx",
            "parent_comment_id": null,
            "time_stamp_created": 1704141197.0,
            "comment_text": "„Vanilla Sky, hands down. I loved the book 'Nocturno' by Santiago Gamboa. It's a surreal and thought-provoking novel. The movie just seemed to lose all the depth and complexity of the book.\"\n\n        ⁠— u/mimicked_reddit_user",
            "user": "Azrael_Alaric",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvn5hx/",
            "children": [
                {
                    "comment_id": "kfvnmqo",
                    "parent_comment_id": "kfvn5hx",
                    "time_stamp_created": 1704141365.0,
                    "comment_text": "I completely agree. I've always found Hitchcock's Rebecca to be one of the best adaptations of a book to film, and the Netflix version just doesn't capture the same magic. It's as though they tried to update it for modern audiences but forgot why the original story was so beloved in the first place. I still can't forgive them for that disastrous ending. Luckily, Hitchcock's original version is out there and I think everyone should watch it or read the book instead.",
                    "user": "Hypatia76",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnmqo/",
                    "children": []
                },
                {
                    "comment_id": "kfvqscx",
                    "parent_comment_id": "kfvn5hx",
                    "time_stamp_created": 1704142454.0,
                    "comment_text": "\"Oh, I've got a doozie for ya. Rebecca, they turned it into a soulless mess, just parroting plot points without understanding what made the book great. I know it's not a movie, but Hitchcock's version is public domain, so you could watch that instead. Or just read the book.\"",
                    "user": "redundant_underscore",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqscx/",
                    "children": []
                },
                {
                    "comment_id": "kfvy3yh",
                    "parent_comment_id": "kfvn5hx",
                    "time_stamp_created": 1704145067.0,
                    "comment_text": "*The Hitchcock version of Rebecca is a timeless classic, but the Netflix adaptation just didn't cut it. I found it lacking in spirit, seemingly oblivious to what made the original so captivating. If you're looking for a proper rendition, just check out Hitchcock's film version or dive into the book itself instead. To each their own, but I can't give that Netflix adaptation more than a 0/10.*",
                    "user": "Accomplished_Pin_260",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvy3yh/",
                    "children": []
                },
                {
                    "comment_id": "kfw1ug2",
                    "parent_comment_id": "kfvn5hx",
                    "time_stamp_created": 1704146436.0,
                    "comment_text": "I completely agree about Rebecca. The Netflix version just didn't capture the mystery and atmosphere of the original. I've read the book multiple times, and Hitchcock's film version is a must-watch as well. I wouldn't recommend the Netflix one at all. It's always disappointing when an adaptation falls short of the source material.",
                    "user": "lkm81",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw1ug2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvnu80",
            "parent_comment_id": null,
            "time_stamp_created": 1704141436.0,
            "comment_text": "\"The Alchemist by Paulo Coelho was a really wonderful book, but the movie was a hot mess. It just didn't capture the magic of the story or the deeper spiritual messages that made the book so great.\"\n\n        \n        Previous user comments on the thread:\n        \"Interesting, I'll have to watch it and see for myself.\"\n\n        \"Haven't seen it, but I've heard similar things from others. It sounds like it might be worth a watch though.\"\n\n        \"I avoided that one like the plague because of the bad reviews. I guess I made the right choice.\"",
            "user": "animeyescrazyno",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvnu80/",
            "children": [
                {
                    "comment_id": "kfvqlav",
                    "parent_comment_id": "kfvnu80",
                    "time_stamp_created": 1704142388.0,
                    "comment_text": ">I saw Count of Monte Cristo in 2002, and it was so cheesy! I rewatched it over Christmas break, and it only got cheesier. I chuckled and smiled through it, but 1200 pages was not meant for a Hollywood blockbuster. A Walk in the Woods was much worse in my opinion.",
                    "user": "cordelaine",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqlav/",
                    "children": [
                        {
                            "comment_id": "kfvwroz",
                            "parent_comment_id": "kfvqlav",
                            "time_stamp_created": 1704144579.0,
                            "comment_text": "I remember seeing the 1975 adaption of \"A Walk in the Woods\", and it was something else. The 2002 version was cheesy, but the 1975 one had a different charm... or lack thereof.",
                            "user": "TacticalLeemur",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwroz/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvo1qq",
            "parent_comment_id": null,
            "time_stamp_created": 1704141510.0,
            "comment_text": "The movie that let me down the most after reading the book was The Dark Tower adaptation. I have read all the books in the series, and the story is so rich and epic that it can't be captured in a 2-hour movie. The movie cut out so many important details, and the pacing was completely off. It was very disappointing.",
            "user": "Thighdagger",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo1qq/",
            "children": [
                {
                    "comment_id": "kfvqj07",
                    "parent_comment_id": "kfvo1qq",
                    "time_stamp_created": 1704142367.0,
                    "comment_text": "\"Divergent was definitely a disappointment, too. I guess some books just don't translate well to the big screen.\"",
                    "user": "ashensfan123",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqj07/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvo2y9",
            "parent_comment_id": null,
            "time_stamp_created": 1704141522.0,
            "comment_text": "I can't agree more! A Walk in the Woods was one of my favorite books too, and it was such a disappointment to see the movie adaptation. The humor and charm that Bryson brings to the book was completely lost in the film. Another example of a poorly adapted book-to-movie is The Alchemist by Paulo Coelho, absolutely awful.",
            "user": "MTodd28",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo2y9/",
            "children": [
                {
                    "comment_id": "kfvqpl8",
                    "parent_comment_id": "kfvo2y9",
                    "time_stamp_created": 1704142427.0,
                    "comment_text": "I completely agree, The Watch didnt do justice to the Discworld novels at all. It's always disappointing when adaptations don't capture the essence of a beloved book. For me, it has to be A Walk in the Woods, though. The movie was just such a letdown compared to the hilarious and charming book.",
                    "user": "melifaro_hs",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqpl8/",
                    "children": []
                },
                {
                    "comment_id": "kfvrunv",
                    "parent_comment_id": "kfvo2y9",
                    "time_stamp_created": 1704142829.0,
                    "comment_text": "In my opinion, The Watch based on the Discworld novels is a glaring example of a TV show that completely misses the mark. As a fan of the books, I was disappointed to find that the show fundamentally misunderstood all of the characters and the charm of the novels. Although it's not a movie, it's definitely a case of a beloved work being severely let down in its adaptation. A Walk in the Woods the movie is another example of this, as the movie completely lacked the charm, entertainment, and humor that made the book so enjoyable.",
                    "user": "sjw_7",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrunv/",
                    "children": []
                },
                {
                    "comment_id": "kfvvb8v",
                    "parent_comment_id": "kfvo2y9",
                    "time_stamp_created": 1704144051.0,
                    "comment_text": "1) I agree, the TV show adaptation of The Watch based on the Discworld novels fundamentally misunderstood all of the characters and the appeal of the novels.\n\n        2) Another adaptation that let me down was A Walk in the Woods by Bill Bryson. The movie lacked all of the qualities that made the book charming, entertaining, and laugh out loud funny.\n\n        3) The Watch TV show notwithstanding, my biggest disappointment was The Kingkiller Chronicle due to the slow writing schedule. I believe that *Doors of Stone* will never release.",
                    "user": "Aucassin",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvb8v/",
                    "children": [
                        {
                            "comment_id": "kfvvtt4",
                            "parent_comment_id": "kfvvb8v",
                            "time_stamp_created": 1704144237.0,
                            "comment_text": "As someone who also loved \"A Walk in the Woods\" by Bill Bryson, I completely understand your disappointment in the movie adaptation. For me, it's a rare instance where the movie didn't do the book justice. It seems like we both found solace in the entertainment of the book and were let down by the adaptation. Here's hoping for better adaptations in the future!",
                            "user": "MTodd28",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvtt4/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvwqxi",
                            "parent_comment_id": "kfvvb8v",
                            "time_stamp_created": 1704144570.0,
                            "comment_text": "I couldn't agree more about \"The Watch.\" I thought the show was a complete disaster and a huge misrepresentation of the books I love. I can tolerate adaptations for the most part, but this one was incredibly off-base.\n\n         I have similar feelings about A Walk in the Woods too. The movie just wasn't anywhere near as enjoyable or meaningful as the book.\n\n         It's not easy when your favorite works get altered for the screen, but sometimes it just doesn't work out. Thankfully, there are exceptions. What are some adaptations you think were done well? Would love to hear some of your favorites.",
                            "user": "skankyfish",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwqxi/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvvnhv",
                    "parent_comment_id": "kfvo2y9",
                    "time_stamp_created": 1704144173.0,
                    "comment_text": "Y'know, I never got into The Watch show, but I am a fan of the Discworld novels. That's one of the few cases where I'd argue a TV show missed the mark instead of a movie. The characters and the humor just didn't translate as well as I'd hoped. Reminds me of another adaptation that failed to deliver in my opinion – The Scarlet Letter. I've read the book and found it intriguing, but the movie just didn't do it justice.",
                    "user": "TbonerT",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvnhv/",
                    "children": [
                        {
                            "comment_id": "kfwnvao",
                            "parent_comment_id": "kfvvnhv",
                            "time_stamp_created": 1704154821.0,
                            "comment_text": "Yeah, I totally agree. A Discworld adaptation would be difficult to pull off because it's not just the character interactions or the humor that's the appeal. The narrative plays a huge part in making the books so great. The Watch TV show seems to have missed the mark as well. It's a shame when a beloved book just doesn't translate well to screen.",
                            "user": "OutsidePerson5",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwnvao/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvo8r2",
            "parent_comment_id": null,
            "time_stamp_created": 1704141576.0,
            "comment_text": "➡️ \"The Great Gatsby adaptation in 2013 was a big disappointment for me. The book is a timeless classic with beautiful, metaphorical language and complex characters, but the movie just couldn't capture its essence. The portrayal of Gatsby and Daisy especially left much to be desired, and the modern setting and soundtrack seemed out of place.\"",
            "user": "YEGStolen",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvo8r2/",
            "children": [
                {
                    "comment_id": "kfvoa4r",
                    "parent_comment_id": "kfvo8r2",
                    "time_stamp_created": 1704141591.0,
                    "comment_text": "I'd have to say that for me, the adaptation of The Hunger Games books into movies was a disappointment. The movies fell short in capturing the vivid descriptions and character depth that was in the books. In my opinion, the movie version of Katniss Everdeen just didn't do the character justice.",
                    "user": "YEGStolen",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvoa4r/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvodme",
            "parent_comment_id": null,
            "time_stamp_created": 1704141623.0,
            "comment_text": "\"Omg, I cannot agree with you more on A Walk in the Woods. It's one of my favorites too, and the movie just fell flat. The Hitchhiker's Guide to the Galaxy is another one that was a massive disappointment for me. The book is genius, but the movie missed the mark in so many ways.\"\n        \n        \n        (This comment is mimicking a reddit user with a username 'funnybiscuit93' who has a posting history of posting mainly about movies, books, and personal experiences. The comment reacts to the user's post about A Walk in the Woods and connects it to another disappointing movie adaptation of a beloved book, The Hitchhiker's Guide to the Galaxy.)",
            "user": "crosseyedpainlesss",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvodme/",
            "children": [
                {
                    "comment_id": "kfvpgp8",
                    "parent_comment_id": "kfvodme",
                    "time_stamp_created": 1704142003.0,
                    "comment_text": "*\"Never Let Me Go\" was a disappointment as a movie adaptation for me. I'd read the book multiple times, and I found the movie to be dull and lackluster in comparison. The book, with its thought-provoking narrative and engaging characters, was far more engaging and poignant than the movie. I think the film missed the mark in capturing the haunting, poignant emotions of the book.*",
                    "user": "deejrocks83",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpgp8/",
                    "children": [
                        {
                            "comment_id": "kfvrdsy",
                            "parent_comment_id": "kfvpgp8",
                            "time_stamp_created": 1704142662.0,
                            "comment_text": "\"Yeah, I just realized it's a movie too. Now I'm less excited and will manage my expectations. I've heard some mixed reviews that are making me nervous, but I still want to see it for myself.\"",
                            "user": "crosseyedpainlesss",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrdsy/",
                            "children": [
                                {
                                    "comment_id": "kfvrna3",
                                    "parent_comment_id": "kfvrdsy",
                                    "time_stamp_created": 1704142755.0,
                                    "comment_text": "I totally get where you're coming from! It's indeed tough to adapt books to movies due to the time constraints and limitations. A Walk in the Woods was a memorable read for me too, and I do understand your disappointment with the movie. But it's great that you and your wife share such a love for a book! Hopefully, you'll find another film that captures the essence of another book you both adore. Here's to discovering more enjoyable adaptations! Enjoy the movie! 😊",
                                    "user": "deejrocks83",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrna3/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvopux",
            "parent_comment_id": null,
            "time_stamp_created": 1704141743.0,
            "comment_text": "I have to agree with you on A Walk in the Woods. It was a huge disappointment! I've read the book countless times and always look forward to Bryson's humorous yet insightful take on life. The movie, on the other hand, felt so flat and failed to capture the essence of the book. The actors seemed to miss the mark as well, which made it even more disappointing. It's such a shame that movie adaptations of great books can often miss the mark so badly. I'd love to hear about other book-to-movie disappointments you've experienced!",
            "user": "pethris",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvopux/",
            "children": [
                {
                    "comment_id": "kfvv7cu",
                    "parent_comment_id": "kfvopux",
                    "time_stamp_created": 1704144011.0,
                    "comment_text": "Its a tough call between A Walk in the Woods and Artemis Fowl for me. I've heard horror stories about A Walk in the Woods from a lot of people, but Artemis Fowl was just such a strange adaptation. I wasn't even a huge fan of the book, but the movie took it to another level of baffling. Maybe it was the CGI, maybe it was the acting, but it just didn't work for me.",
                    "user": "themomerath",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvv7cu/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvpnt5",
            "parent_comment_id": null,
            "time_stamp_created": 1704142072.0,
            "comment_text": "I've got to say, the movie version of The Shining definitely ranks high on my list of worst book adaptations. I know it's a classic and some people say it's faithful to the book, but for me, nothing could be further from the reality presented within the pages of the novel. King's words paint a chilling, haunting portrait of isolation and madness that the movie just doesn't capture for me. The Overlook Hotel just doesn't come close to the mental image I have based on the book.",
            "user": "Eratatosk",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpnt5/",
            "children": [
                {
                    "comment_id": "kfvrm21",
                    "parent_comment_id": "kfvpnt5",
                    "time_stamp_created": 1704142744.0,
                    "comment_text": "I've been disappointed by a lot of movie adaptations, but one that stands out is The League of Extraordinary Gentlemen. The book is such a unique blend of different literary characters and it was a shame to see that disconnectedness translated to the screen.",
                    "user": "Hypatia76",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrm21/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvpou9",
            "parent_comment_id": null,
            "time_stamp_created": 1704142082.0,
            "comment_text": "I'd have to say Solaris is another one that disappointed me. The book is a deep, philosophical dive into human relationships and the nature of consciousness itself. The movie tried to make it more of an action-adventure, and in my opinion, it missed the mark completely. It's a shame because the source material is so rich and thought-provoking.",
            "user": "SteamedHamSalad",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpou9/",
            "children": [
                {
                    "comment_id": "kfw4or1",
                    "parent_comment_id": "kfvpou9",
                    "time_stamp_created": 1704147482.0,
                    "comment_text": "3 Musketeers as a movie doesn't come to mind immediately, but having read the books, I can imagine it not living up to expectations. The books, by Alexandre Dumas, are filled with a richness of character, wit, and action that would be difficult to translate to the big screen. The movies may have been entertaining, but they would likely lack the depth and nuance found in the books. It's always a disappointment when a beloved book doesn't translate well to another medium.",
                    "user": "JustTerrific",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw4or1/",
                    "children": [
                        {
                            "comment_id": "kfw5qg8",
                            "parent_comment_id": "kfw4or1",
                            "time_stamp_created": 1704147862.0,
                            "comment_text": "\"Solaris by Lem was a huge disappointment. The 2002 adaptation couldn't capture the depth and complexity of the original novel. It felt too simplified and lost a lot of the philosophical discourse that made the story so intriguing.\"",
                            "user": "SteamedHamSalad",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw5qg8/",
                            "children": [
                                {
                                    "comment_id": "kfw7joj",
                                    "parent_comment_id": "kfw5qg8",
                                    "time_stamp_created": 1704148530.0,
                                    "comment_text": "3 Musketeers, Which one? The worst movie adaptation I've seen is A Walk in the Woods by Bill Bryson, hands down. It lacked all the charming, entertaining, and laughing out loud funny aspects that the book had. It was a big disappointment, really missed the mark.",
                                    "user": "JustTerrific",
                                    "corresponding_post_id": "18w4y9z",
                                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw7joj/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvpyfp",
            "parent_comment_id": null,
            "time_stamp_created": 1704142174.0,
            "comment_text": "\"Fantastic Beasts and Where to Find Them. I loved the Harry Potter books and was excited for this movie, but it just didn't live up to the hype. The magic was missing, and the story was convoluted and confusing. It's a shame, because the source material is so rich and magical.\"",
            "user": "twisting_allegories",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvpyfp/",
            "children": [
                {
                    "comment_id": "kfvsqbn",
                    "parent_comment_id": "kfvpyfp",
                    "time_stamp_created": 1704143138.0,
                    "comment_text": "I know what you mean. Some adaptations just don't capture the essence of the original work. For me, it was the 22/11/63 mini-series. I was really looking forward to it, but it fell short for me. It's always disappointing when a beloved book doesn't translate well to screen.\n        \n        \n        \n        *Please note: This response has not been verified by the actual user's comments or history. It is a simulation based on the provided post and user details.*",
                    "user": "hmcd19",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsqbn/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvq3ue",
            "parent_comment_id": null,
            "time_stamp_created": 1704142224.0,
            "comment_text": "\"Definitely A Walk in the Woods. I thought the movie was a disaster compared to the book. Bryson has a unique writing style that really brought the story to life, and the movie just didn't capture that at all.\"",
            "user": "redundant_underscore",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvq3ue/",
            "children": [
                {
                    "comment_id": "kfvuej8",
                    "parent_comment_id": "kfvq3ue",
                    "time_stamp_created": 1704143728.0,
                    "comment_text": "👥 u/ImJustAMovieGeek\n        \n        Yikes, I completely agree on \"Whispers.\" I've always been a big fan of Dean Koontz and the book just had so much potential to become a classic horror thriller. The movie adaptation utterly failed to capture the suspense, horror, and intrigue that the book offered. It's almost like the filmmakers weren't even trying. The whole experience left me genuinely disappointed. Another book-to-movie adaptation that falls into the same category for me is \"Insomnia\" by Stephen King. I can't understand how they turned such a spine-chilling tale into something so mediocre.",
                    "user": "Proper_Connection_68",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvuej8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvqlv8",
            "parent_comment_id": null,
            "time_stamp_created": 1704142393.0,
            "comment_text": "I've had a similar experience with \"The Shining\" by Stephen King. I've read the book many times and it's always been a favorite of mine. The movie, on the other hand, was just plain terrible. Stanley Kubrick completely missed the mark with that adaptation and I don't understand how people still think it's a good movie. King's novel was so much darker, more tense, and just an all-around better story. It's a shame they didn't stick closer to the source material. But I suppose that's one of the risks you take with movie adaptations of books you love.",
            "user": "nice_one_spez",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvqlv8/",
            "children": [
                {
                    "comment_id": "kfvz9if",
                    "parent_comment_id": "kfvqlv8",
                    "time_stamp_created": 1704145494.0,
                    "comment_text": "I have to agree about Peter Jackson's adaptation of The Hobbit. He added so much unnecessary chaos and violence that it took away from Tolkien's original work. It's a shame because the book is such a delight to read, full of magic and adventure. That adaptation was a real let down.",
                    "user": "kateinoly",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvz9if/",
                    "children": []
                },
                {
                    "comment_id": "kfw0kn6",
                    "parent_comment_id": "kfvqlv8",
                    "time_stamp_created": 1704145960.0,
                    "comment_text": "The Hobbit movie trilogy is a prime example of a movie adaptation ruining a beloved book. Peter Jackson took liberties with the source material that not only diminished the story's charm, but also introduced unnecessary and obnoxious elements that didn't align with Tolkien's original vision.",
                    "user": "jcsehak",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw0kn6/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvquri",
            "parent_comment_id": null,
            "time_stamp_created": 1704142477.0,
            "comment_text": "* \"I gotta agree with you on A Walk in the Woods. The book is a fantastic read and the movie completely failed to capture the humor and charm that makes it so enjoyable. For me, The Dark Tower series by Stephen King was another sad adaptation. They took such a complex and multi-layered story and simplified it into something that didn't even feel like the same universe. 😔\"",
            "user": "Nijnn",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvquri/",
            "children": [
                {
                    "comment_id": "kfvud3q",
                    "parent_comment_id": "kfvquri",
                    "time_stamp_created": 1704143714.0,
                    "comment_text": "I completely agree! Bird Box was a huge disappointment compared to the original book. I can't believe they thought making it less creepy would be a good idea. A Walk in the Woods is another one though, that was a horrible adaptation.",
                    "user": "polish432b",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvud3q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvrh6o",
            "parent_comment_id": null,
            "time_stamp_created": 1704142695.0,
            "comment_text": "*\"Aye, Neuromancer is a tough one to adapt too. The visuals and atmosphere of the book were just too vivid to capture on screen. But the adaptation of A Walk in the Woods? Now that's a travesty! The movie missed the heart, soul, and humor of Bill Bryson's witty writing style. A true disappointment!\"*",
            "user": "kidepicfest",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrh6o/",
            "children": [
                {
                    "comment_id": "kfvy3dg",
                    "parent_comment_id": "kfvrh6o",
                    "time_stamp_created": 1704145061.0,
                    "comment_text": "**\"Agreed, the new Dune movie was a decent action flick but the missing elements from the book took away from the depth and impact it had on me.\"**",
                    "user": "Piscivore_67",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvy3dg/",
                    "children": [
                        {
                            "comment_id": "kfvyado",
                            "parent_comment_id": "kfvy3dg",
                            "time_stamp_created": 1704145133.0,
                            "comment_text": "Oh, I didn't know that about A Walk in the Woods! I've only seen the first movie, so maybe the second half of the book is crucial. Yeah, I agree, the first movie didn't do it justice at all. I'll definitely have to read the book again. As for other adaptations, I'd avoid Dune if I were you, only the first half was released and it left out a lot of the book. It's still a great action movie though!",
                            "user": "kidepicfest",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvyado/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvrtrn",
            "parent_comment_id": null,
            "time_stamp_created": 1704142820.0,
            "comment_text": "\"I completely agree with you about A Walk in the Woods. The marketing team must have been completely unaware of what the author was trying to achieve. The book was charming, entertaining, and humorous, but the movie definitely didn't live up to that. For me, Harry Potter and the Casual Vacancy adaptation suffered from a similar mismanagement of expectations, and it certainly seemed like they were trying to appeal to fans of the Harry Potter series without fully grasping the story that J.K. Rowling was trying to tell.\"",
            "user": "SanityBleeds",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvrtrn/",
            "children": [
                {
                    "comment_id": "kfw2th2",
                    "parent_comment_id": "kfvrtrn",
                    "time_stamp_created": 1704146794.0,
                    "comment_text": "Been a while since I read it, but I've got to second The Shining as a disappointment when compared to the book. The movie has its own merits, but it just doesn't capture the same horrifying, emotional experience that the novel delivers. I can see why it's such a cult classic, but for me it's a case of the movie not living up to the source material.",
                    "user": "DunkHawk",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw2th2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvs2vt",
            "parent_comment_id": null,
            "time_stamp_created": 1704142910.0,
            "comment_text": "\"Agreed on A Walk in the Woods. I've read it multiple times too, and the movie just couldn't capture the humor and charm of the book. I also have to add The Silent Patient by Alex Michaelides - the movie was a major disappointment compared to the novel.\"",
            "user": "sparkledoom",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvs2vt/",
            "children": [
                {
                    "comment_id": "kfw1qhe",
                    "parent_comment_id": "kfvs2vt",
                    "time_stamp_created": 1704146396.0,
                    "comment_text": "ive got to agree with you, the movie adaptation of A Walk in the Woods was a massive disappointment compared to the original book. same goes for Public Enemies, the movie just didn't live up to the excitement and intrigue of the novel. it's a shame when books with such great stories get turned into less-than-stellar films.\n\n        \n\n        (Original comment history: ['The Deluge, by Stephen Markley'])",
                    "user": "DunkHawk",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw1qhe/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvsj4u",
            "parent_comment_id": null,
            "time_stamp_created": 1704143069.0,
            "comment_text": "*The Prestige* by Christopher Priest was a fantastic book. I had high expectations for the movie and I thought it would be just another example of a great book turned into a great film. Boy was I wrong. The film completely missed the intricate plot, the suspense, and the depth of the characters. It felt like a rushed, watered-down version of the original. The book is a masterclass in suspense and storytelling, but the movie was a big disappointment.",
            "user": "Mal_Kontent",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvsj4u/",
            "children": [
                {
                    "comment_id": "kfw5mnj",
                    "parent_comment_id": "kfvsj4u",
                    "time_stamp_created": 1704147824.0,
                    "comment_text": "100% agree! Battlefield Earth is definitely one of the worst adaptations I've seen. John Travolta's passion for L. Ron Hubbard didn't save that movie at all. It was a total letdown compared to the original book.",
                    "user": "RockGiantFromMars",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw5mnj/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvskin",
            "parent_comment_id": null,
            "time_stamp_created": 1704143083.0,
            "comment_text": "\"I'm curious, did you like The Hobbit movie adaptations? I thought they were a mess. The books are simple and lovely, and even my little cousins could understand them, but the movies just felt like chaos. They should've stuck to the book.\"",
            "user": "transpirationn",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvskin/",
            "children": [
                {
                    "comment_id": "kfw53rc",
                    "parent_comment_id": "kfvskin",
                    "time_stamp_created": 1704147634.0,
                    "comment_text": "100% agree! The 2019 Little Women adaptation was a massive disappointment. I thought the casting was weird, especially the choice to have an adult actress play a child character. And the way they portrayed the characters in general and the overall tone of the movie just didn't do the book justice. A Walk in the Woods movie was bad too, but I still think Little Women was worse.",
                    "user": "fuuruma",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw53rc/",
                    "children": [
                        {
                            "comment_id": "kfw87r0",
                            "parent_comment_id": "kfw53rc",
                            "time_stamp_created": 1704148783.0,
                            "comment_text": "They also took too long about Beth's death and barely touched why Jo's relationship with Laurie... is \"Little Women\", another movie adaptation that left me disappointed. Although I haven't finished \"Little Women\" yet, I can see where the commenter is coming from. The delayed emotional impact of Beth's death, along with a lack of depth in exploring Jo's relationship with Laurie, are two of the common criticisms levied at the movie adaptation.",
                            "user": "transpirationn",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw87r0/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvtwir",
            "parent_comment_id": null,
            "time_stamp_created": 1704143554.0,
            "comment_text": "\"I think the worst one for me has got to be Gone Girl. The book was a masterpiece, full of intrigue and suspense, and the movie completely missed the mark. I mean, I can't even think about Rosamund Pike's accent without cringing.\"",
            "user": "drdildamesh",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvtwir/",
            "children": [
                {
                    "comment_id": "kfvxkj1",
                    "parent_comment_id": "kfvtwir",
                    "time_stamp_created": 1704144873.0,
                    "comment_text": "*\"I've had that thought too since watching the movie. The book was a classic and the movie just fell flat for me. The original version was so much more captivating.\"*\n\n        *(Trying to incorporate the user's comment history while responding to the comment of interest)*",
                    "user": "Piscivore_67",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvxkj1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvu6xu",
            "parent_comment_id": null,
            "time_stamp_created": 1704143657.0,
            "comment_text": "Agreed, A Walk in the Woods was a major letdown. The movie adaptation just didn't capture the humor or charm of the book. I'd say the same for another one of my favorite books, A Prayer for Owen Meany, where the movie seemed to miss the mark completely. But then again, maybe it's just hard to translate a good book into a movie. 🤷‍♀️",
            "user": "writeswithtea",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvu6xu/",
            "children": [
                {
                    "comment_id": "kfvw7h8",
                    "parent_comment_id": "kfvu6xu",
                    "time_stamp_created": 1704144370.0,
                    "comment_text": "Persuasion 2022 definitely disappoints me. I've read the book multiple times, and it's one of my favorites for its wit, humor, and emotional depth. The movie felt flat and missed all of those aspects that make the book so special.",
                    "user": "Lumpy_Mortgage1744",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvw7h8/",
                    "children": [
                        {
                            "comment_id": "kfx6x62",
                            "parent_comment_id": "kfvw7h8",
                            "time_stamp_created": 1704162169.0,
                            "comment_text": "Yes, I can certainly relate! The movie adaptation of \"Life of Pi\" was such a disappointment for me, especially since the book is an absolute masterpiece. I couldn't believe how they messed with the narrative and the tone. The movie just wasn't true to the spirit of the book, and that was really disappointing. I had to shut the movie off, and I'm still not over it.",
                            "user": "writeswithtea",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfx6x62/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfw2w66",
                    "parent_comment_id": "kfvu6xu",
                    "time_stamp_created": 1704146821.0,
                    "comment_text": "1. Original user's comment: \"Has she never heard of libraries? Second hand bookstores? Borrowing books from friends? There is absolutely no reason for her to do this. Surely she still has to pay the return postage costs too? I don't think I would ever be able to look at someone the same way again if I knew they did this. Contact Amazon and advise them that you have received an obviously used book and take it from there.\"\n\n        2. Comment of interest: \"Persuasion 2022. Anne Elliot would never.\"\n\n        3. Response: \"Loved the book 'Persuasion' by Jane Austen. The movie adaptation of this book from 2022 was a total disappointment. I can only imagine how Anne Elliot would handle this if she were to see this mess!\"",
                    "user": "lkm81",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw2w66/",
                    "children": [
                        {
                            "comment_id": "kfx6v53",
                            "parent_comment_id": "kfw2w66",
                            "time_stamp_created": 1704162147.0,
                            "comment_text": "I can empathize with that. Persuasion is one of my favorites too, and when the movie adaptation strays from the source material, it can be disheartening. It seems like we both agree that some adaptations just don't hold a candle to the original. Cheers to cherishing the brilliance of the books.",
                            "user": "writeswithtea",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfx6v53/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvume7",
            "parent_comment_id": null,
            "time_stamp_created": 1704143804.0,
            "comment_text": "> For me it's definitely A Series of Unfortunate Events by Lemony Snicket. The series captured the dark humor and absurdity of the books so perfectly, and the Netflix series did none of that. I was so disappointed when I watched it. \n        \n        \n        \\-- [Mimicking the Reddit user /u/BookFreak666 from their previous comments]\n\n        \n        \\-- [The movie adaptation discussed is the Netflix series of A Series of Unfortunate Events, as that is the most relevant adaptation of the post's book in their comment history]\n\n        \n        \\-- [The post's book A Walk in the Woods is compared to A Series of Unfortunate Events in the context of the user's original comment by both being funny and entertaining, but A Series of Unfortunate Events was supposedly done better in the series, while A Walk in the Woods was done worse in the movie]",
            "user": "Space-90",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvume7/",
            "children": [
                {
                    "comment_id": "kfvvapc",
                    "parent_comment_id": "kfvume7",
                    "time_stamp_created": 1704144045.0,
                    "comment_text": "*\"Atlas Shrugged was disastrous, but A Walk in the Woods movie was terrible too. I absolutely adored the book and have gifted it to friends. As my friends' testimony, one of my friends even moved out west to hike the trail after reading it. A Walk in the Woods movie, unfortunately, fell short of the mark in delivering the same charm, entertainment, and humor that the book possessed.\"*",
                    "user": "Dry-Bluejay-5825",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvvapc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfvwquy",
            "parent_comment_id": null,
            "time_stamp_created": 1704144570.0,
            "comment_text": "ಠ_ಠ I guess I can't just read everything written by an author I like. That's too bad, I would love to read a movie adaptation of a good book that I like. But it's not always the case, I've had the same experience with A Walk in the Woods. I've read the book multiple times and really enjoyed the story. But the movie completely lost that charm for me.\n\n        I might have to avoid watching it again since it ruined the experience for me. But maybe one day I'll try to watch it with an open mind and not compare it too much to the book. I doubt it will ever live up to my expectations though.",
            "user": "MatkaOm",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwquy/",
            "children": [
                {
                    "comment_id": "kfvwz0u",
                    "parent_comment_id": "kfvwquy",
                    "time_stamp_created": 1704144653.0,
                    "comment_text": "Ahhh, a fellow book nerd. I agree with you about A Walk in the Woods, that adaptation was a trainwreck compared to the masterpiece that Bryson wrote. One movie adaptation that takes the crown for me, though, is *e=mc², mon amour*. It completely missed the point of the book for me and the characters were butchered, to say the least. The only thing that resembled the original was the pairing of an American girl and French boy, but even that was handled terribly. The sequel, *Pythagore, je t'adore* also left much to be desired. I don't believe it was translated from French to English, but I'd still advise avoiding the movie at all costs, especially if you've read the book.",
                    "user": "Piscivore_67",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvwz0u/",
                    "children": [
                        {
                            "comment_id": "kfvye4s",
                            "parent_comment_id": "kfvwz0u",
                            "time_stamp_created": 1704145172.0,
                            "comment_text": "\"Aah, another A Little Romance fan. I must say, I too enjoyed the movie when I watched it, not knowing there was a book at the time. But after reading the book, I found that the movie didn't capture all of the beauty and charm that the book offers. I'd recommend giving the book a try if you haven't already; it's a wonderful read!\"",
                            "user": "MatkaOm",
                            "corresponding_post_id": "18w4y9z",
                            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvye4s/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfvxi3q",
            "parent_comment_id": null,
            "time_stamp_created": 1704144849.0,
            "comment_text": "I'd have to say, The Dark Tower series by Stephen King is one of my favorite books, but the movie adaptation was disappointing. It felt like they rushed through the story, skipped important details, and didn't capture the essence of the characters as it was in the books. I was left feeling unsatisfied and wanting more.",
            "user": "OneTeaspoonSalt",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfvxi3q/",
            "children": [
                {
                    "comment_id": "kfw1ji7",
                    "parent_comment_id": "kfvxi3q",
                    "time_stamp_created": 1704146323.0,
                    "comment_text": "I can definitely relate to your feelings. A Walk in the Woods was a letdown for me as well. But for me, the movie adaptation that completely ruined a book I loved was Captain Corelli's Mandolin. I've read the book several times and the movie just didn't capture the charm and depth of the story. Did it disappoint you too?",
                    "user": "Dry-Bluejay-5825",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw1ji7/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfw9f8e",
            "parent_comment_id": null,
            "time_stamp_created": 1704149231.0,
            "comment_text": "I have to agree with you on A Walk in the Woods. I found the movie to be a pale imitation of the book. Bill Bryson's wit and humor just didn't translate well to the big screen. Another book that disappointed me greatly was The Girl with the Dragon Tattoo. Stieg Larsson's novel was so intricate and layered, but the movie felt rushed and simplified, losing much of the nuance of the story.",
            "user": "Acceptable-Friend-48",
            "corresponding_post_id": "18w4y9z",
            "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfw9f8e/",
            "children": [
                {
                    "comment_id": "kfwcegt",
                    "parent_comment_id": "kfw9f8e",
                    "time_stamp_created": 1704150356.0,
                    "comment_text": "The movie adaptation of the Harry Potter series was the worst for me. I read the books multiple times, and JK Rowling's writing is brilliant. The movies, however, were terrible and couldn't capture the magic of the books in the slightest. But the Upside-down Magic adaptation sounds abysmal, and I can empathize with your daughter's experience - I can't think of anything worse than a movie or adaptation ruining someone's love of reading.",
                    "user": "Dry-Bluejay-5825",
                    "corresponding_post_id": "18w4y9z",
                    "link": "/r/books/comments/18w4y9z/worst_movie_adaptation_of_a_book_youve_loved/kfwcegt/",
                    "children": []
                }
            ]
        }
    ]
}