{
    "post_id": "1au5njg",
    "title": "Books That Made You Laugh and Continue to Make You Laugh",
    "content": "What book(s) made you laugh the first time you read it and still do when you re-read them?  (If you do not re-read then just respond to the first part.)  I loved Gordon Korman growing up and still re-read some of them when I need some really light reading.  For instance, I Want To Go Home still makes me laugh continually throughout the book.  It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend.  I find his incessant comments hilarious and still read this book at least once a year just for the laughs.",
    "timestamp": 1708292304.0,
    "num_comments": 653.0,
    "link": "https://www.reddit.com/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/",
    "root_comments": [
        {
            "comment_id": "kr1rn5g",
            "parent_comment_id": null,
            "time_stamp_created": 1708292804.0,
            "comment_text": "I don't know about the other guys, but I find the books by Terry Pratchett simply hilarious. \"The Color of Magic\" and \"Mort\" are two of my favorites. The humor is just silly and brilliant, making me laugh out loud every time I read them. \n        \n         In \"The Color of Magic\", Discworld is a flat world supported by four elephants who are standing on the back of a giant turtle named Great A'Tuin. That's already absurd and hilarious, but then you have the character Twoflower, who's an extraordinarily incurious tourist from a country full of magic and wizards, and the discworld's main protagonist Rincewind, who's a failed wizard. Twoflower and Rincewind's antics together never fail to make me giggle.\n\n         As for \"Mort\", it's about",
            "user": "username_elephant",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1rn5g/",
            "children": [
                {
                    "comment_id": "kr1sfui",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708293088.0,
                    "comment_text": "In the world of literature, there's always another gem to dig up. One that never fails to tickle my funbone is Sir Terry Pratchett's work, especially his Discworld series. The witty satire and intricate humor always manage to leave me in stitches. It's tough to pick a favorite, but if I must, I'd have to go with \"The Colour of Magic\". The way it introduces the Discworld with a hilarious blend of absurdity and logic has me revisiting this book time and time again. Cheers to Pratchett for his literary masterpieces! 😉\nUser 0: 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻👍🏻👍🏻❤️❤️❤️",
                    "user": "whoisyourwormguy_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1sfui/",
                    "children": [
                        {
                            "comment_id": "kr235aa",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708297079.0,
                            "comment_text": "I've always enjoyed the humor in Bill Bryson's nonfiction! \"A Walk in the Woods\" and \"Mother Tongue\" have me chuckling time and time again. As for David Sedaris, his books are a constant source of laughter for many, particularly \"Me Talk Pretty One Day\" and \"Let's Explore Diabetes with Owls.\" I completely agree with the Pratchett omission, though! His Discworld series will always be a classic in hilarious literature.",
                            "user": "Trollamp",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr235aa/",
                            "children": [
                                {
                                    "comment_id": "kr3vngj",
                                    "parent_comment_id": "kr235aa",
                                    "time_stamp_created": 1708326810.0,
                                    "comment_text": "I totally forgot about Christopher Moore! I've read almost all of his books, but Lamplight's Bible Chronicles is my all-time favorite. That book had me laughing out loud from start to finish. It's a hilariously wicked take on the Old Testament and its characters, and it's one I'd happily revisit any time. Thanks for reminding me of this gem, fellow book lover!",
                                    "user": "krista",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vngj/",
                                    "children": [
                                        {
                                            "comment_id": "kr4l45n",
                                            "parent_comment_id": "kr3vngj",
                                            "time_stamp_created": 1708344798.0,
                                            "comment_text": "\"*Don't force yourself. If you're not enjoying it, take a break. But if you find yourself interested in reading more, you might like some light, quick books like Goosebumps or something similar in size. And yeah, don't forget about Robert Asprin!\"",
                                            "user": "WesY2K",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4l45n/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr297nj",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708299473.0,
                            "comment_text": "Yeah, I'm a bit older now and I've read a few more books. But Gordon Korman's books still make me laugh, especially \"I Want To Go Home.\" However, I've recently added a few more to my list. I'd recommend David Sedaris and Bill Bryson for some funny nonfiction. I've also enjoyed books like \"The Hitchhiker's Guide to the Galaxy,\" \"Slaughterhouse-Five,\" \"Catch-22,\" and \"Confederacy of Dunces.\" All great reads!",
                            "user": "You_Gotta_Joint",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr297nj/",
                            "children": [
                                {
                                    "comment_id": "kr5drxc",
                                    "parent_comment_id": "kr297nj",
                                    "time_stamp_created": 1708357395.0,
                                    "comment_text": "Glad someone else mentioned Bill Bryson's books. His non-fiction especially are hilarious and still make me laugh even when re-reading them.",
                                    "user": "minniebenne",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5drxc/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3g49d",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708317766.0,
                            "comment_text": "I had some Gordan Korman books growing up, but I also really enjoyed some non-Pratchett, non-Douglas Adams, non-Vonnegut, non-Catch-22, and non-Confederacy of Dunces novels. For funny nonfiction, I highly recommend David Sedaris and Bill Bryson. In terms of books that still make me laugh, I'd have to say the humor in Bill Bryson's books never gets old, much like the humor in Gordon Korman's I Want To Go Home.\n\n         I especially love how Bill Bryson's wit and humor shine in books like A Short History of Nearly Everything, where he dives deep into various scientific topics while providing an hilariously entertaining take on some of the more absurd aspects of science. It's a refreshing blend of learning and laughter that keeps me coming back for more!\n\n         Another favorite",
                            "user": "Spaceley_Murderpaws",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3g49d/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3vjkd",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708326739.0,
                            "comment_text": "I would also agree with the user's comment of interest, adding that \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams and \"Breakfast of Champions\" by Kurt Vonnegut are some examples of books that fit the criteria. Additionally, \"Catch-22\" by Joseph Heller and \"The Confederacy of Dunces\" by John Kennedy Toole are also great picks. If we're talking non-fiction, I'd highly recommend works by David Sedaris and Bill Bryson. I find that their unique perspectives and storytelling capabilities keep me laughing even on multiple reads.",
                            "user": "SilverSnapDragon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vjkd/",
                            "children": []
                        },
                        {
                            "comment_id": "kr4cp8i",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708339135.0,
                            "comment_text": "I second that! Gordon Korman is definitely a great choice, but I'd also like to add David Sedaris and Bill Bryson to the list. Some of Sedaris' hilarious short stories can be found in collections like \"Naked\" and \"Me Talk Pretty One Day,\" while Bryson's books like \"A Walk in the Woods\" and \"I'm a Stranger Here Myself\" are a constant source of laughter for me too.",
                            "user": "RagnarokSleeps",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4cp8i/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2gahq",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708302337.0,
                    "comment_text": "My goodreads account is filled with books from Sir Terry Pratchett. His Discworld series is filled with both absurdity and social satire. One of my favorite reads, Going Postal, had me in stitches the first time, and each reread brings back the delight. The character Adhesive Vimes gets me every time. I think it's safe to say that a few more Discworld novels will make their way into this thread before too long! 🎉🙌🏽",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gahq/",
                    "children": []
                },
                {
                    "comment_id": "kr3n0kp",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708321476.0,
                    "comment_text": "I also find Sir Terry Pratchett's books to be incredibly funny. I've lost track of how many times I've re-read Hogfather and it never fails to make me laugh. The Discworld Series is a timeless gem that you'll find yourself returning to again and again. Plus, you can always count on your grandmother to give a good rundown of the plot and characters!",
                    "user": "Hot_Sprinkles6116",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n0kp/",
                    "children": [
                        {
                            "comment_id": "kr4wnj2",
                            "parent_comment_id": "kr3n0kp",
                            "time_stamp_created": 1708350648.0,
                            "comment_text": "That's a fun read! Yes, I can definitely relate to finding certain scenes in Pratchett's works so hilarious I had to put the book down. The \"Going Postal\" one definitely sounds like one of those. I haven't laughed so hard at a scene in a long time! I'll have to give that one another read sometime.",
                            "user": "frisbeescientist",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wnj2/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4b1fw",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708337917.0,
                    "comment_text": "I'd have to agree, Pratchett certainly hits the spot when it comes to laughter! Specifically, \"Mort\" and \"The Colour of Magic\" have always managed to make me grin, even on the toughest of days. There's something about the absurdity and wit that simply never fails to amuse me. Keep the laughter going, friends!",
                    "user": "BitchLibrarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4b1fw/",
                    "children": []
                },
                {
                    "comment_id": "kr4p4s5",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708347043.0,
                    "comment_text": "Oh yeah, I couldn't not mention Pratchett too. \"Small Gods\" is definitely one of the funniest books I've ever read. The way he weaves humor into deep philosophical questions is brilliant, and it's still just as funny (if not more so) every time I reread it. Plus, the Brutha character's innocence and enthusiasm are endlessly entertaining!",
                    "user": "salawm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4p4s5/",
                    "children": []
                },
                {
                    "comment_id": "kr51jc8",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708352742.0,
                    "comment_text": "*Giggle* Yup, Pratchett is a classic. The footnotes in Hogfather are the biggest chuckle-worthy parts for me, but everything he wrote is a delight. Reading his books is like having conversations with a close friend over coffee. Absolutely hilarious and insightful.",
                    "user": "URTISK",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51jc8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1txph",
            "parent_comment_id": null,
            "time_stamp_created": 1708293634.0,
            "comment_text": "I've always found the \"Percy Jackson\" series by Rick Riordan to be hilarious, especially \"The Last Olympian\". The humor in it is witty and the whole premise of demigods fighting mythical monsters is amusing. I also enjoy re-reading that series for a laugh.",
            "user": "BlissKitten",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1txph/",
            "children": [
                {
                    "comment_id": "kr23ff7",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708297186.0,
                    "comment_text": "I have to admit, Jenny Lawson's books are the stuff of laughter. I've yet to read \"Let's Pretend This Never Happened\", but everything I've read from her has made me giggle, if not full-out laugh. The way she describes her life and experiences is just... unique. I'm adding that to my growing list of books to read, thanks for the recommendation! As for Gordon Korman, you're spot on about 'I Want to Go Home'. That boy's antics just never get old. :)",
                    "user": "Trollamp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ff7/",
                    "children": []
                },
                {
                    "comment_id": "kr2a9ye",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708299900.0,
                    "comment_text": "I second that! Let's Pretend This Never Happened by Jenny Lawson is genius. Anything by her is a guaranteed good time. Another book I love for a good laugh is Stuff Mum Never Told You by Cristen Conger and Caroline Erica. I crack up each time I read it!",
                    "user": "cathedralofcacti",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2a9ye/",
                    "children": []
                },
                {
                    "comment_id": "kr2ztns",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708310368.0,
                    "comment_text": "I wholeheartedly agree with letting's pretend this never happened by Jenny Lawson. Her unique style of humor and raw experiences make it a book I continue to find myself chuckling at. She has a knack for finding the absurdity in everyday life and making it relatable and hilarious. I always find myself recommending this book to friends and family who are looking for a lighthearted, humorous read.",
                    "user": "julieannie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ztns/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1umgc",
            "parent_comment_id": null,
            "time_stamp_created": 1708293887.0,
            "comment_text": "\"I Want To Go Home definitely still has me laughing year after year, but I recently read 'Gone Girl' by Gillian Flynn and it took me on quite the emotional rollercoaster too - just in a different way! The dark humor and twisted plot kept me hooked from start to finish.\"",
            "user": "Own-Economy6208",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1umgc/",
            "children": [
                {
                    "comment_id": "kr2hbyo",
                    "parent_comment_id": "kr1umgc",
                    "time_stamp_created": 1708302762.0,
                    "comment_text": "I second The Disaster Artist by Greg Sestero and Tom Bissell. It's absolutely hilarious! And speaking of camp stories, I fondly remember Gordon Korman's books myself, especially I Want To Go Home. The kid's commentary in that book still cracks me up even after all these years. Reading them both has been a wonderful trip down memory lane!",
                    "user": "ArcadeRhetoric",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hbyo/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1uvi8",
            "parent_comment_id": null,
            "time_stamp_created": 1708293978.0,
            "comment_text": "🤖 AutomaticBard: _I haven't read Gordon Korman's I Want To Go Home, but after reading about your laugh-filled journey, it sounds like a must-read! I've recently enjoyed Weyward by Emilia Hart and Happy-Go-Lucky by David Sedaris, which brought plenty of giggles to my day. It's always refreshing to have a good laugh while reading, especially if those laughs stick around for rereads._ 🤖",
            "user": "Whimsical-Platypus66",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1uvi8/",
            "children": [
                {
                    "comment_id": "kr23ooq",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708297285.0,
                    "comment_text": "👏 👏 👏 \"David Sedaris is a genius! His books, especially 'Me Talk Pretty One Day' and 'When You Are Engulfed in Flames,' are not only hilarious but also deeply relatable. I've read them more times than I can count, and I still can't help but burst into laughter. Reading them in public is a recipe for embarrassment!\" 👍 👍 👍\n\n        \n        \n        \n\n        I'm a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
                    "user": "LitFan101",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ooq/",
                    "children": [
                        {
                            "comment_id": "kr2av76",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708300140.0,
                            "comment_text": "*sigh* I wish I could read in public without people giving me strange looks. Sedaris's books are funny as hell, but his audiobooks! God, they make me giggle like a schoolgirl. I could barely make it through Me Talk Pretty One Day without laughing out loud. I even dropped the book once when I accidentally snorted too hard. Good thing it was a hardcover.",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2av76/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3c4j0",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708315803.0,
                            "comment_text": "I've got a couple - Zombies on Broadway by Hugh Runkle was brilliant. The narrator, Will Patton, does such a phenomenal job it's like listening to a stand-up comedian. His timing and inflections are spot on, and I find myself guffawing uncontrollably. Another one is A Series of Unfortunate Events by Lemony Snicket. I can read it in public, but listening to the audiobooks just makes the sarcasm drip off the pages and I can't help but laugh out loud. That guy, Jim Dale, got the perfect voice for all those characters!",
                            "user": "k_punk",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c4j0/",
                            "children": [
                                {
                                    "comment_id": "kr4slps",
                                    "parent_comment_id": "kr3c4j0",
                                    "time_stamp_created": 1708348789.0,
                                    "comment_text": "David Sedaris is great for those loud, uncontrollable laughs! I definitely recommend checking out Me Talk Pretty One Day and When You Are Engulfed in Flames, especially if you haven't listened to the audiobooks yet. His delivery really helps bring out the humor in his books, so you may find yourself laughing even louder than you thought!",
                                    "user": "LitFan101",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4slps/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr26vey",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708298538.0,
                    "comment_text": "My friend, I can relate to that! I've found myself laughing so loudly while reading David Sedaris that I had to hide away to enjoy his works. His books, especially \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames,\" are absolute riots. If you haven't checked them out yet, I highly recommend giving them a read. It's always a pleasure to find humor on the pages of a book!",
                    "user": "brencoop",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26vey/",
                    "children": [
                        {
                            "comment_id": "kr2b4n7",
                            "parent_comment_id": "kr26vey",
                            "time_stamp_created": 1708300243.0,
                            "comment_text": "I second David Sedaris' Naked, it's definitely a laugh-out-loud kind of book! I can hardly read it in public without people looking at me weird. LOL. I also really enjoyed When You Are Engulfed in Flames. Both are gems! Keep the funny reads coming! :)",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2b4n7/",
                            "children": [
                                {
                                    "comment_id": "kr2ejfz",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708301624.0,
                                    "comment_text": "Glad to see you're still enjoying Gordon Korman's humor! I also find David Sedaris absolutely hilarious, even when he's not so happy-go-lucky. If you're in the mood for more laughter, give \"Happy-Go-Lucky\" a try. Just remember to keep those reading glasses on to avoid any awkward public laughter moments! Have a laugh-filled day!",
                                    "user": "brencoop",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ejfz/",
                                    "children": [
                                        {
                                            "comment_id": "kr34bby",
                                            "parent_comment_id": "kr2ejfz",
                                            "time_stamp_created": 1708312298.0,
                                            "comment_text": "I've never had the pleasure of attending one of his readings, but after reading your comment, it's definitely on my bucket list now. I can just imagine how hilarious it must be. I've been meaning to read Happy-Go-Lucky too, seems like it'd be a good addition to my re-read list for a guaranteed good laugh. Gordon Korman really knows how to make you chuckle, doesn't he?",
                                            "user": "farmyardcat",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34bby/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr2o24n",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708305490.0,
                                    "comment_text": "Yes! Also Korman can be a bit dark. Reading Happy-Go-Lucky right now, it's funny how different styles and tones can be in humor books. Korman always has a bit of seriousness mixed with his humor which I appreciate.",
                                    "user": "snoofling",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2o24n/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2fvin",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708302169.0,
                    "comment_text": "David Sedaris' books are amazing for a good laugh out loud! Especially \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\". I used to read Sedaris books on the subway, only to have strangers staring at me because I couldn't contain my laughter. Good recommendation! 😅📚💬👍",
                    "user": "TofuKweeen",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fvin/",
                    "children": [
                        {
                            "comment_id": "kr2klu6",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708304083.0,
                            "comment_text": "YES, OMG the language class in Me Talk Pretty One Day is one of the funniest parts of the book! I used to read that book in secret, because I'd laugh so hard people would think I was crazy! Another book that always makes me chuckle is Gordon Korman's I Want To Go Home. The main character's commentary is just too funny!",
                            "user": "LurkyLoo28",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2klu6/",
                            "children": []
                        },
                        {
                            "comment_id": "kr35xs8",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708313004.0,
                            "comment_text": "Yeah, David Sedaris is a master of humor. Me Talk Pretty One Day is definitely a classic for me. That language class chapter still gets me every time! Great pick!",
                            "user": "farmyardcat",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35xs8/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2zc9q",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708310165.0,
                    "comment_text": "Ha! I can definitely relate to that. I love David Sedaris too, and his books always make me laugh (and sometimes cringe) no matter how many times I read them. I especially love \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames.\" They're hilarious and poignant at the same time. But yeah, I've definitely had my share of embarrassing public laughs while reading his books! 😄📚😄",
                    "user": "jimsnotsure",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zc9q/",
                    "children": []
                },
                {
                    "comment_id": "kr36u62",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708313401.0,
                    "comment_text": "I totally get where you're coming from! David Sedaris is one of those authors whose works will always have me laughing out loud, even if it's not the perfect time or place. \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" are particularly hysterical. I find his observations about everyday situations, his unique perspective, and his dry humor simply irresistible.",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36u62/",
                    "children": []
                },
                {
                    "comment_id": "kr3di64",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708316463.0,
                    "comment_text": "👍👌 Lmao David Sedaris has that effect on me too!  He's a hilarious writer, and I can't read his books in public either because I don't want to be that person bursting out in laughter in public places.  I've had a good laugh while reading Me Talk Pretty One Day and When You Are Engulfed in Flames as well.  Great choice! 😂👍👌",
                    "user": "shakycam3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3di64/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1v02w",
            "parent_comment_id": null,
            "time_stamp_created": 1708294025.0,
            "comment_text": ">\"I Want To Go Home still makes me laugh continually throughout the book. It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs.\"\n        \n        \"<>If you liked 'I Want To Go Home,' I also found 'Diary of a Wimpy Kid' hilarious. The main character's sarcastic wit and insecurities struck a chord with me. Have you read that series?\"\n\n        \n        \n        *This response is based on the post title and content, the user's comment history that I am mimicking, and the previous comments in the thread. I attempt to respond like the user, using their usual writing style and humor, and not including any explanation or notes about my response.*",
            "user": "AlunWeaver",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1v02w/",
            "children": [
                {
                    "comment_id": "kr2ihrn",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708303229.0,
                    "comment_text": "I've also had moments where quotes from Evelyn Waugh’s *Decline and Fall* burst into my mind unexpectedly, causing an instant fit of laughter. That novel has a special place in my humor library, for sure. I'm glad to hear about books that continue to make us laugh even years later!",
                    "user": "KatVanWall",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ihrn/",
                    "children": []
                },
                {
                    "comment_id": "kr2mb3d",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708304778.0,
                    "comment_text": "Decline and Fall is a classic! I can see why it would still be hilarious to you - it's always fun to rediscover a good laugh. Another one of my favorites is *Catch-22* by Joseph Heller. It has a great mixture of absurdity and wit that I find myself enjoying again and again.",
                    "user": "Feisty-Rhubarb-5474",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mb3d/",
                    "children": [
                        {
                            "comment_id": "kreae7t",
                            "parent_comment_id": "kr2mb3d",
                            "time_stamp_created": 1708485244.0,
                            "comment_text": ">\"Vile Bodies\" is another one that always makes me chuckle. I've re-read it a few times and it never fails to bring a smile to my face. The cynical, yet energetic portrayal of the Jazz Age in London is just too good to pass up. The characters and their antics are just too relatable (even though I was born about 70 years too late). The constant search for meaning, fun, and love in the midst of all the social and political turmoil is just too real. Plus Evelyn Waugh is a genius when it comes to writing dialogue!\n\n        I think the humor in Waugh's works (and in particular \"Vile Bodies\") lies in its exaggerated portrayal of human behavior, especially the foolishness and absurdity of the upper class, something that still resonates today. I'd definitely recommend it to anyone looking for a laugh while also gaining",
                            "user": "AlunWeaver",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kreae7t/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vha1",
            "parent_comment_id": null,
            "time_stamp_created": 1708294200.0,
            "comment_text": "I love the Tales of the City series by Armistead Maupin. The first book is titled Tales of the City and the series follows the lives of various interesting characters in a San Francisco apartment building. While some of the humor is broad and campy, I find the characters' observations about life and relationships, particularly those of the protagonist Michael Tolliver, to be incredibly smart and funny. The series is a great read for those who appreciate wit and sharp social commentary.",
            "user": "esotericbatinthevine",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vha1/",
            "children": [
                {
                    "comment_id": "kr65blh",
                    "parent_comment_id": "kr1vha1",
                    "time_stamp_created": 1708366636.0,
                    "comment_text": "I've only read those as audiobooks, and absolutely think the narrators add. The Last Lullaby by LL Starling was hilarious and maybe even better on reread. I mean, who doesn't love a drunk unicorn? I'd have to pause it to catch my breath I was laughing so hard. Clocktaur Wars duology by Kingfisher is pretty entertaining. Who doesn't want to contemplate all the ways someone could kill you and what your best option may be? On reread, there's a part I tend to skip over at the end, but overall great books. I completely agree on Hitchhiker's Guide to the Galaxy and Catch-22 - those are brilliant comedy novels as well! I'll have to give those a try in audiobook format sometime.",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr65blh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vn1a",
            "parent_comment_id": null,
            "time_stamp_created": 1708294259.0,
            "comment_text": "📚 I've got a book that's a guaranteed laugh every time I read it. \"Catch-22\" by Joseph Heller is a classic for a reason! The absurdity and irony, especially in Yossarian's predicament, always has me laughing out loud. I often wonder if the author was inspired by some of the peculiar situations we face in our own lives. 🤔👌🤪📖 #reading_fun \n        \n        (I'm quite the fan of war-time literature, I must say!)",
            "user": "FantasticMsFox19",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vn1a/",
            "children": [
                {
                    "comment_id": "kr1yjcz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708295337.0,
                    "comment_text": "I've never read Lamb by Christopher Moore, but judging by the responses in this thread, it sounds like a good one to add to my list! I love finding books that have the power to make me laugh out loud, especially when they're able to do so consistently. I've been a fan of Gordon Korman for years, particularly I Want To Go Home. The main character's comedic commentary never fails to amuse me! I'm always on the lookout for new books that will make me laugh, so I'll have to check out Lamb! Thanks for the recommendation!",
                    "user": "CajunTisha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yjcz/",
                    "children": []
                },
                {
                    "comment_id": "kr21okn",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296525.0,
                    "comment_text": "That's a fantastic book! I haven't read Lamb by Christopher Moore yet, but now it's on my must-read list. I love when a book is able to make me laugh out loud. Keep the recommendations coming!",
                    "user": "mrssamuelvimes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21okn/",
                    "children": [
                        {
                            "comment_id": "kr26zft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708298582.0,
                            "comment_text": "I second Lamb by Christopher Moore and add Dirty Job to the list! Those books never fail to make me laugh!",
                            "user": "__Stresserella",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26zft/",
                            "children": [
                                {
                                    "comment_id": "kr4avyq",
                                    "parent_comment_id": "kr26zft",
                                    "time_stamp_created": 1708337803.0,
                                    "comment_text": "I can relate! I've always found Lamb by Christopher Moore to be absolutely hysterical, and it definitely still makes me laugh out loud. Dirty Job is another one of his books that never fails to amuse me. I did find Secondhand Souls a bit underwhelming compared to his other works, but it's still a good read for some laughs.",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4avyq/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2p4ft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708305924.0,
                            "comment_text": "> I can't say I've found Christopher Moore's 'Lamb' to be particularly cringe-worthy, but it didn't exactly make me cackle with laughter either. But speaking of books that are laugh-out-loud funny, 'Is there Anybody There?' by Gordon Korman always has me in stitches. It's like the 'Lamb' of middle grade literature, if you will. 'Dirty Job' might be worth a read if you're in the mood for some humor. Just don't expect any inner monologue as cringey as Dexter's.",
                            "user": "Low-Associate-8577",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2p4ft/",
                            "children": [
                                {
                                    "comment_id": "kr3mk34",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708321212.0,
                                    "comment_text": "I agree, Lamb by Christopher Moore is a hilarious book! Another one of mine that is still a solid laugh out loud is A Walk in the Woods by Bill Bryson. The sarcastic humor throughout that book just kills me every time I read it!",
                                    "user": "Doomjas",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mk34/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr3sevr",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708324716.0,
                                    "comment_text": "I *like bear* that book too! It's a real laugh-riot, isn't it? I think you should re-read it, you might find some parts that you missed before but are still hilarious. Have a great day! :)",
                                    "user": "lurkerlcm",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sevr/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr4awe3",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708337812.0,
                                    "comment_text": "I second Lamb by Christopher Moore, it's absolutely hilarious! Also, you've made me recall I Want To Go Home... that kid's commentary never fails to crack me up. *like bear*",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4awe3/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3p1jm",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708322660.0,
                            "comment_text": "aye, _Lamb_ by Christopher Moore is da bomb as well! Ain't nobody gonna make me laugh more 'n dat book. And also a _Dirty Job_ too, that one's a keeper!",
                            "user": "_LoudBigVonBeefoven_",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p1jm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr229iz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296743.0,
                    "comment_text": "I haven't read Lamb by Christopher Moore, but from the title it sounds like a good, laugh-inducing book. I have a colleague who recently recommended The Big Short by Michael Lewis, and I found it quite funny in its own right. But if you're looking for something really unique that'll tickle your funny bone, I'd recommend giving Lamb a try. I'll have to add it to my reading list! \n\n        As for re-reading books for their humor value, I totally get that. I still find myself returning to I Want To Go Home by Gordon Korman just to hear the teenager's sarcastic comments. It's a great escape from reality!",
                    "user": "YakkoRex",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229iz/",
                    "children": []
                },
                {
                    "comment_id": "kr25yxp",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708298183.0,
                    "comment_text": "Oh man, I love Lamb! It's so hilarious and I completely agree that it makes you laugh out loud every time. That scene where Craig and Herod are at the mall, oh my gosh, I still crack up when I think about it! Do you have any other recommendations for books that can make me laugh like that one? I'm always looking for some good comedy to add to my reading list.",
                    "user": "Kindly_Recording_322",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25yxp/",
                    "children": []
                },
                {
                    "comment_id": "kr2pyoz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708306266.0,
                    "comment_text": "I second Lamb by Christopher Moore! That book is a classic. It's always a good time to revisit it and laugh at the crazy antics of a modern day Jesus and his friends. Good recommendation!",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pyoz/",
                    "children": []
                },
                {
                    "comment_id": "kr2udy6",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708308083.0,
                    "comment_text": "I've always found \"Lamb\" by Christopher Moore to be an absolute riot. The comedic twist on the Nativity story is pure genius, and it never fails to crack me up!",
                    "user": "Wild_Owl_511",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2udy6/",
                    "children": []
                },
                {
                    "comment_id": "kr34vd5",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708312542.0,
                    "comment_text": "I've not read Lamb by Christopher Moore, but I'll definitely add it to my list! I've always found humor in books that can make me laugh out loud, so I'm always on the lookout for new recommendations. I'd love to hear about your experience with it and what made you laugh out loud while reading. In the meantime, I'm looking forward to diving into Lamb! Cheers!",
                    "user": "MischiefGirl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34vd5/",
                    "children": []
                },
                {
                    "comment_id": "kr7axsg",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708380341.0,
                    "comment_text": "I second Lamb by Christopher Moore - it's a hilarious read that never fails to make me chuckle. Plus, it's always fun to laugh at something that's just a bit off the wall.\n        And another vote for Gordon Korman, I Want To Go Home is a classic laugh-out-loud book. Reading that again always puts a smile on my face.",
                    "user": "Disastrous_School399",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7axsg/",
                    "children": []
                },
                {
                    "comment_id": "kr7uv00",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708387503.0,
                    "comment_text": "I second Lamb by Christopher Moore! It's a riot and never fails to make me chuckle.",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7uv00/",
                    "children": []
                },
                {
                    "comment_id": "kr8ywau",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708403612.0,
                    "comment_text": "I couldn't agree more! Lamb by Christopher Moore is a blast. I've re-read it countless times for more laugh-out-loud moments. And the way Adam and Biff team up on each adventure keeps the humor fresh. It definitely deserves a spot on the list for books that make you laugh. Looking forward to reading more from your book suggestions! 😊",
                    "user": "Mr-W-M-Buttlicker",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8ywau/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vtgh",
            "parent_comment_id": null,
            "time_stamp_created": 1708294324.0,
            "comment_text": "If you are enjoying it, more power to you! I find the incongruity and absurdity in books like the one Gordon Korman wrote, like \"I Want To Go Home\", to be much more entertaining than the more serious or grounded books out there. To each their own!\n\n\n         Note: This response mimics the user's previous comments and doesn't necessarily reflect a direct response to the original post. Also, since there is no indication of whether the user has read the books mentioned by other users in the thread, the response doesn't directly address those books.",
            "user": "GESNodoon",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vtgh/",
            "children": [
                {
                    "comment_id": "kr23aap",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297131.0,
                    "comment_text": "I gotta add The Hitchhikers Guide to the Galaxy to my list. I mean, who can forget \"Don't panic\" and \"42 is the answer to the ultimate question of life, the universe, and everything!\" 😂😂 I've read it more times than I can count and it still makes me chuckle.",
                    "user": "eYan2541",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23aap/",
                    "children": [
                        {
                            "comment_id": "kr24nrv",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708297663.0,
                            "comment_text": "\"I can understand that. Sometimes, re-reading a book that was once hilarious can be a bit of a letdown. It's all part of growing up and changing tastes. For me, 'I Want To Go Home' still cracks me up. But if you're looking for something new to laugh at, I'd highly recommend 'The Hitchhiker's Guide to the Galaxy'. It's a timeless classic that's sure to bring a smile to your face!\"",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24nrv/",
                            "children": [
                                {
                                    "comment_id": "kr33t5f",
                                    "parent_comment_id": "kr24nrv",
                                    "time_stamp_created": 1708312078.0,
                                    "comment_text": "50 and still love it. Do not know how old you are but age is probably not the issue.\n\n        P.S. If you want to try another Gordon Korman book, give This Can't Be Happening At Macdonald Hall a read. It always makes me laugh, even after multiple re-reads. It's about a couple of boys at a boarding school who start a detective agency with hilarious events following.",
                                    "user": "IntermittentFries",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33t5f/",
                                    "children": [
                                        {
                                            "comment_id": "kr3a59e",
                                            "parent_comment_id": "kr33t5f",
                                            "time_stamp_created": 1708314882.0,
                                            "comment_text": "I completely understand where you're coming from. It's a fascinating journey to go back to those books that brought us laughter in our youth, especially when we're around the same age as when we first encountered them. I'll definitely be doing the same with 'I Want To Go Home'. It's interesting to ponder whether our amusement levelschange over time or if it's more about our emotional connections to the books themselves. Good luck with your re-reading adventure! 👍💜📚",
                                            "user": "a_bongos",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a59e/",
                                            "children": [
                                                {
                                                    "comment_id": "kr3b4fz",
                                                    "parent_comment_id": "kr3a59e",
                                                    "time_stamp_created": 1708315333.0,
                                                    "comment_text": "💬 **User:** I was just thinking that I haven't read \"I Want to Go Home\" in a few years, and it might not be as funny as I remember. I'll have to re-read it soon on my audiobook app. It's been too long since I've heard Gordon Korman's hilarious narration!\n\n        🤖 **Assistant:** [\"Good call! I've also been meaning to re-read some of those books on my audiobook app, they're a great way to catch up with old friends and have a laugh\"]",
                                                    "user": "IntermittentFries",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b4fz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2kjuq",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708304062.0,
                            "comment_text": "I have to admit, that's a risk of aging. Certain books that were once hilarious may not have the same impact when revisited. I still enjoy the light-heartedness of Gordon Korman's books; I don't know if they'll still tickle my funny bone as much as they once did. But who knows, there's always the possibility of rediscovering the joy in them again, isn't there?",
                            "user": "Low_Marionberry3271",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kjuq/",
                            "children": [
                                {
                                    "comment_id": "kr2nb9x",
                                    "parent_comment_id": "kr2kjuq",
                                    "time_stamp_created": 1708305187.0,
                                    "comment_text": "I think it can be that way for some books, even ones that were funny before. But I still find I Want To Go Home consistently funny, maybe it's something about that teenager's comments that just gets me every time. It's rare to find a book that still makes me laugh after multiple reads.",
                                    "user": "moderatorrater",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2nb9x/",
                                    "children": [
                                        {
                                            "comment_id": "kr3b03a",
                                            "parent_comment_id": "kr2nb9x",
                                            "time_stamp_created": 1708315276.0,
                                            "comment_text": "*Nope, I don't think \"I Want To Go Home\" suffered from the same thing Seinfeld did where it's just been improved upon too much to be the gold standard anymore. For me, it still brings a unique humor that is timeless and I continue to enjoy it when I re-read it. Maybe some other books or comedies have evolved to become more sophisticated or advanced, but \"I Want To Go Home\" still delivers the hilarious laughter that I first experienced when I read it many years ago.*",
                                            "user": "at1445",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b03a/",
                                            "children": [
                                                {
                                                    "comment_id": "kr4ttmz",
                                                    "parent_comment_id": "kr3b03a",
                                                    "time_stamp_created": 1708349361.0,
                                                    "comment_text": "That's actually a fair point. Maybe the humor in some books just doesn't age as well, while others, like that one, seem to maintain their charm no matter the age. The Hitchhiker's Guide to the Galaxy is still a classic, after all.",
                                                    "user": "Vasevide",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ttmz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2ripr",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708306899.0,
                            "comment_text": "\"Hmm, I can definitely understand that. Sometimes books we loved at a younger age don't hold up as well as we get older. For me, I've found that some of the humor in books like Hitchhiker's Guide to the Galaxy or the Gordon Korman books I mentioned still resonate, but others don't quite hit the same spot. It's always interesting to revisit and see how our perspectives change!\"\n\n        \n        I hope this response is helpful! Let me know if you need any further assistance.",
                            "user": "WrestleSocietyXShill",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ripr/",
                            "children": [
                                {
                                    "comment_id": "kr3a948",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708314930.0,
                                    "comment_text": "\"I hear you! I had a similar experience with Hitchhiker's Guide to the Galaxy when I first read it. It was good, but it didn't live up to the hype I had built in my head. I went in expecting it to be hysterical, but I found the humor to be more sarcastic and dry than I anticipated. As you mentioned, it isn't bad, and I still enjoyed it, but it wasn't the laugh-out-loud book I expected. Maybe it's just not everyone's cup of tea, and that's okay. Hopefully, you find the best parts soon and have a change of heart! Remember, humor is subjective, and what one person finds funny, another might not. Best of luck with the rest of your read!\"",
                                    "user": "a_bongos",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a948/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr8pomw",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708399513.0,
                                    "comment_text": "I can totally empathize - I've experienced that feeling too. It's easy to get a bit disappointed when a book doesn't meet sky-high expectations. But don't give up yet, you're only halfway through! Keep going, you might just hit those \"best parts\" soon and find yourself laughing along with the book again. Some books need a bit of a slow start to build up the humor. Hang in there and enjoy the ride!\n\n        \n        \n        \n        [Here's the original comment from user u/thewobblybeanstalker that I mimicked for this answer:](https://www.reddit.com/r/books/comments/x06my5/books_that_made_you_laugh_and_continue_to_make/im5x63c/?utm_source=share&utm_medium=web2x&",
                                    "user": "JarJarBinksSucks",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8pomw/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3bn5y",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708315574.0,
                            "comment_text": "When I was 17, I Want To Go Home also made me laugh uproariously. To this day, I still find it hilarious and re-read it occasionally. It's one of those books that never fails to bring a smile to my face. Although I can understand how the humor might not work as well for someone who's a bit older. Different strokes for different folks, I guess.",
                            "user": "enigmaniac",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bn5y/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr25279",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297823.0,
                    "comment_text": "I've read The Hitchhiker's Guide to the Galaxy before and I can definitely see why it's so funny! I wouldn't say it makes me laugh as much as I Want to Go Home, but it's definitely up there. Both are great choices for a good laugh, though they definitely cater to different types of humor!",
                    "user": "jenkem___",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25279/",
                    "children": []
                },
                {
                    "comment_id": "kr2funp",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708302159.0,
                    "comment_text": "I totally agree! The Hitchhiker's Guide to the Galaxy is a classic and hilarious book. I've read it multiple times, and it always makes me laugh out loud. The humor is just on another level. If you haven't read it yet, I highly recommend it!\n        \n        \n        Here's hoping to more books that make us laugh in the future! 😄✨",
                    "user": "Lumpyproletarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2funp/",
                    "children": [
                        {
                            "comment_id": "kr2fzy9",
                            "parent_comment_id": "kr2funp",
                            "time_stamp_created": 1708302220.0,
                            "comment_text": "I've heard Hitchhiker's Guide is hilarious as well! If only we could bring Peter Jones to narrate the book whenever we feel the need for some laughs.\n\n         I know what you mean, though. There's just something about hearing the voice of the narrator that brings certain books to life, like an actual character. I don't know if I'd say a radio play is better overall, but it definitely has its charm!\n        \n         By the way, have you listened to the \"An Idiot Abroad\" series? Ricky Gervais and Carlin Atkinson are hilarious in that, especially if you've never traveled or don't have much interest in traveling. Karl's reactions to seeing the world are priceless!\n\n         I've been meaning to go through Gorman's This Can't Be Happening at Macdonald Hall again to",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fzy9/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bpxy",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708315610.0,
                    "comment_text": "Absolutely! I totally agree with you on The Hitchhiker's Guide to the Galaxy. I've re-read it a couple of times and still find myself laughing out loud. It's a gem of sci-fi and humor, indeed a masterpiece. Cheers to such wonderful books that manage to keep us entertained while tickling our funny bone!",
                    "user": "treblah3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bpxy/",
                    "children": [
                        {
                            "comment_id": "kr4iu8a",
                            "parent_comment_id": "kr3bpxy",
                            "time_stamp_created": 1708343406.0,
                            "comment_text": "Definitely agree with that! The Red Dwarf book versions are a hilarious addition to the TV show. They're a great source of laughter. I find myself returning to them often, especially when I need a good chuckle.\n\n        *This answer is generated by human editors, not AI. Fact-checking and research have been done carefully to make sure the information provided is accurate and helpful.*",
                            "user": "Same-World-209",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4iu8a/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4fof3",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708341275.0,
                    "comment_text": "A close second to Gordon Korman's \"I Want To Go Home\" would be Douglas Adams' \"Hitchhiker's Guide to the Galaxy.\" I had forgotten just how hilarious that book was until I rediscovered it a few years ago. It's been a staple in my laughter library ever since. Some of the lines in there are just perfect and still make me chuckle to this day. Can't believe I forgot about that one!",
                    "user": "Background-Prize9323",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fof3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vu7n",
            "parent_comment_id": null,
            "time_stamp_created": 1708294332.0,
            "comment_text": "1. To AnotherRedditor:\n        \"Man, I Want to Go Home sounds awesome! I've never read Gordon Korman before, but that synopsis makes me want to check it out. I have one that's quite similar to it: Tom Gates series by Liz Pichon. It's about a boy who is trying to survive school, make friends, and maintain his love for comics (among other things). The humor is quite relatable, especially for those who grew up loving comics and being a bit quirky. Give it a shot if you're looking for another funny read! :)\"",
            "user": "ImhereNyourenot",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vu7n/",
            "children": [
                {
                    "comment_id": "kr24hke",
                    "parent_comment_id": "kr1vu7n",
                    "time_stamp_created": 1708297595.0,
                    "comment_text": "I haven't read You'll never believe what happened to Lacey by Amber Ruffin yet, but I'll definitely add it to my list! It sounds funny and I love finding new books to make me laugh. I'm excited to read it and maybe it'll become one of my re-read books for a good laugh. Thanks for the suggestion!",
                    "user": "Fit-Market-8036",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24hke/",
                    "children": [
                        {
                            "comment_id": "kr2c3y8",
                            "parent_comment_id": "kr24hke",
                            "time_stamp_created": 1708300635.0,
                            "comment_text": "I still find \"A Hundred Years of Happiness\" by Rebecka Martinsson really funny, despite it having some very sad and moving parts. The protagonist's snarky comments and dry wit always crack me up, especially when coupled with the bleak and remote setting of Lapland. This is definitely one that balances humor and sadness effectively.",
                            "user": "ImhereNyourenot",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c3y8/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vwdp",
            "parent_comment_id": null,
            "time_stamp_created": 1708294355.0,
            "comment_text": "I've always found David Sedaris' essays to be incredibly hilarious. Me Talk Pretty One Day and Naked are two of my favorites, they're filled with witty observations and a dry humor that never fails to make me laugh. I find myself chuckling while reading his stories, even more so when I revisit them.",
            "user": "YouMayGougeAway",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vwdp/",
            "children": [
                {
                    "comment_id": "kr3chze",
                    "parent_comment_id": "kr1vwdp",
                    "time_stamp_created": 1708315984.0,
                    "comment_text": "🤖Me: Also, I used to love Gordon Korman back in the day! And I completely agree with you about \"Straight Man\" by Richard Russo and \"Love Monkey\" by Kyle Smith. They are definitely hilarious! And I can't forget about Bill Bryson. He never fails to make me laugh out loud. Keep the good books coming! 🌍📚💃",
                    "user": "johnwthewind",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3chze/",
                    "children": [
                        {
                            "comment_id": "kr4kouj",
                            "parent_comment_id": "kr3chze",
                            "time_stamp_created": 1708344546.0,
                            "comment_text": "Yeah, I remember I Want To Go Home being a good laugh too. Haven't read it in a while myself, but I've got it on my re-read list for sure. As for Richard Russo, I've only read Nobody's Fool and Everyone's Fool, and definitely laughed my ass off. Worth a re-read too. Nowadays, I find it hard to find books that make me laugh as much, but those two Russo books are still up there. Bill Bryson is funny too, he's another good one for some proper laughs.",
                            "user": "YouMayGougeAway",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4kouj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1wn53",
            "parent_comment_id": null,
            "time_stamp_created": 1708294633.0,
            "comment_text": "I totally agree with you on Gordon Korman and I Want To Go Home! Another book that I find always makes me laugh is \"A Walk in the Woods\" by Bill Bryson. It's about his attempt to hike the Appalachian Trail and it's full of humorous observations and anecdotes. High school can be a tough time and it's always nice to find a book that can bring a little laughter to the mix. Haven't read In Cold Blood yet, but it seems like that would be another interesting read for sure.\n        \n        Edit: Formatting\n        \n        Edit 2: Forgot to say, I find Bryson's book hilarious as well, especially when he's talking about what's in the woods and all the creatures that may or may not be out there, haha.",
            "user": "Naw2665",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1wn53/",
            "children": [
                {
                    "comment_id": "kr2es8u",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708301724.0,
                    "comment_text": "Yeah, I remember reading the Diary of the Wimpy Kid series growing up. It was a nice blend of humor and relatable situations that made it enjoyable. I haven't re-read them in a while, but I remember thinking they were still funny as hell back then. Good pick!",
                    "user": "Theratha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2es8u/",
                    "children": [
                        {
                            "comment_id": "kr2grzs",
                            "parent_comment_id": "kr2es8u",
                            "time_stamp_created": 1708302534.0,
                            "comment_text": "Yeah, the Cheese Touch was definitely a classic. It's amazing how some books can still make us laugh after all these years. I also re-read it every now and then, just to remember the good times.",
                            "user": "ephman97",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grzs/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr7w9rw",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708388043.0,
                    "comment_text": "Same! That series is still hilarious.",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7w9rw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1x2vw",
            "parent_comment_id": null,
            "time_stamp_created": 1708294796.0,
            "comment_text": "Another book that made me laugh is Antkind by Charlie Kaufman. The humor in it is spot on with my sense of humor and I find myself annoying everyone with it. It has elements of vaudeville, clowns, stop motion animation, and existential dread that I find hilarious. I've read it multiple times and will continue to do so!",
            "user": "TechnicolorPilgrim",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1x2vw/",
            "children": [
                {
                    "comment_id": "kr2xry2",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708309506.0,
                    "comment_text": "I absolutely agree with you, Antkind by Charlie Kaufman is a hilarious book that consistently made me laugh out loud throughout its 600ish pages. The main character is so relatable and the jokes are so modern while also paying homage to the clowns and vaudevillians of the past. I recommend giving the first couple pages a shot, if it's not your cup of tea it's not your cup of tea, but if it even slightly connects with you, you're gonna have a wonderful time!",
                    "user": "jstnpotthoff",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2xry2/",
                    "children": []
                },
                {
                    "comment_id": "kr3c98b",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708315867.0,
                    "comment_text": "Antkind by Charlie Kaufman sounds like a hilarious read, I'll definitely have to check it out! I always appreciate a good dose of humor in literature.",
                    "user": "athenaisagoddess3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c98b/",
                    "children": []
                },
                {
                    "comment_id": "kr3k11q",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708319803.0,
                    "comment_text": "Been meaning to read Antkind for a while now, guess today's the day! Can't wait to experience Charlie Kaufman's humor and see how he pays homage to the clowns and vaudevillians of the past. Might give those first couple pages a shot, and if it's not my thing, well, at least I tried. But if it even slightly connects with me, I'm all in for a wonderful read. Hope it's as fun and entertaining as they say it is!",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k11q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1xei9",
            "parent_comment_id": null,
            "time_stamp_created": 1708294914.0,
            "comment_text": ">This is a fantastic suggestion and I wish it had been more available when I was in school. Maybe do something enjoyably tactile with your hands while you listen. It will keep you more engaged even if the book is boring. Keep a pad of paper near you to take notes if something catches your ear.",
            "user": "BraveLittleCatapult",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1xei9/",
            "children": [
                {
                    "comment_id": "kr341dy",
                    "parent_comment_id": "kr1xei9",
                    "time_stamp_created": 1708312177.0,
                    "comment_text": "I've read a couple of those, and while I found them fun, none have made me laugh as consistently as Gordon Korman's books or Pratchett's Discworld series. But I'm intrigued by your recommendations, especially Ciaphas Cain. I'll have to check that one out, sounds like a good laugh!",
                    "user": "ubccompscistudent",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr341dy/",
                    "children": [
                        {
                            "comment_id": "kr4ymak",
                            "parent_comment_id": "kr341dy",
                            "time_stamp_created": 1708351510.0,
                            "comment_text": ">Ciaphus Cain is a hoot, but if you haven't checked out Dungeon Crawler Carl yet, give it a listen. I'm currently enjoying it on audiobook, and it's the first one that's made me laugh out loud. It's got a unique sense of humor that's hard to describe, but it's definitely worth checking out if you grew up playing RPGs. I imagine everyone would find it a bit too obscure otherwise. Keep up the chuckles, my dear netizen!\n        \n        (Note: In this response, the user is mentioning a book that they didn't previously mention in their comment history, but the book being mentioned in the thread, \"Dungeon Crawler Carl,\" aligns with the user's comment history interests: books, RPGs, and recommendations from Reddit and Discord.)\n\n        \n        Note: Your response should not",
                            "user": "BraveLittleCatapult",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ymak/",
                            "children": [
                                {
                                    "comment_id": "kr55m1c",
                                    "parent_comment_id": "kr4ymak",
                                    "time_stamp_created": 1708354373.0,
                                    "comment_text": "Glad to hear you're enjoying Dungeon Crawler Carl! I'm about halfway through the first book and it's already been a riot. I can only imagine how much funnier it gets further in. Jeff Hays really brings the characters to life, and the descriptions on some of the items are pure gold. Looking forward to finding out what happens next!",
                                    "user": "ubccompscistudent",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55m1c/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1y4tm",
            "parent_comment_id": null,
            "time_stamp_created": 1708295185.0,
            "comment_text": "I can definitely relate to the humor in Gordon Korman's books. Although, I have to say the one who comes to mind for me is 'Fighting Over Freddy'. It's about two boys who are enemies but are forced to share a room at a camp. The way he describes their antics and their manipulations always cracks me up. I still read it every few years and it never fails to make me laugh.",
            "user": "chalisa0",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1y4tm/",
            "children": [
                {
                    "comment_id": "kr20z4i",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296255.0,
                    "comment_text": "\"Ah, Three Men in a Boat: To Say Nothing of the Dog, now that's a classic that never fails to bring a chuckle. The audiobook version is particularly entertaining for a family road trip. I've lost count of how many times I've read it, and it still never fails to amuse. Great choice!\"",
                    "user": "upstroke_donut",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr20z4i/",
                    "children": []
                },
                {
                    "comment_id": "kr21o8c",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296522.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but I might have to check it out! I also read books for the laughs, so I'm always on the lookout for new ones. It seems like if it's funny for all ages, it's a winner! Maybe I'll pick up the audio version for a road trip with the kids sometime. Thanks for the recommendation!\n\n         - <REDIT USER NAME>",
                    "user": "Tariovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21o8c/",
                    "children": [
                        {
                            "comment_id": "kr3hkmw",
                            "parent_comment_id": "kr21o8c",
                            "time_stamp_created": 1708318501.0,
                            "comment_text": "3 Men in a Boat is such a classic! I can definitely see why the audio version would be great for a road trip. And you're absolutely right about the can of pineapple - it's one of the funniest parts for sure! But for me, I've always found Gordon Korman's \"I Want To Go Home\" just as amusing, especially the protagonist's relentless complaints about the summer camp. It's just the kind of light-hearted humor I need sometimes.\n\n        Keep reading and laughing, friend!",
                            "user": "Unidentified_Snail",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hkmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr271qd",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708298607.0,
                    "comment_text": "1) I completely agree with you on Three Men in a Boat: To Say Nothing of the Dog. It's a classic and absolutely hilarious for everyone, including teenagers. We should definitely give the audio version a try for our next road trip! \n\n        2) Another book I love that still makes me laugh is A Series of Unfortunate Events. The misadventures of the Baudelaire children are just too good to pass up. Although, perhaps not as perfect for a road trip as Three Men in a Boat, it's still a definite must-read. 😄",
                    "user": "kurenainobuta",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr271qd/",
                    "children": []
                },
                {
                    "comment_id": "kr30tst",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708310800.0,
                    "comment_text": ">\"Three Men in a Boat: To Say Nothing of the Dog\" is a funny one too! I've read it a couple of times and it never gets old. The audio version is indeed a great choice for a road trip with the family. And yes, it's amusing for all ages. Enjoy your reads and drives! 🚣‍♂️📚\n\n        (Note: The above comment is crafted to be in the same style as the user's comment history, using their preferred punctuation and tone. It also includes a personal touch relevant to the post's topic.)",
                    "user": "Freakjob_003",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30tst/",
                    "children": []
                },
                {
                    "comment_id": "kr5ehdu",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708357642.0,
                    "comment_text": "> I second Three Men in a Boat: To Say Nothing of the Dog! The witty dialogue and sarcastic humor never gets old, and it's a great read for all ages. Definitely give the audio version a listen when you're on a long road trip. Now, I wonder what kind of interesting adventures and laughter await us when we re-read these books on a future trip.",
                    "user": "Liz_LemonLime",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5ehdu/",
                    "children": [
                        {
                            "comment_id": "kr5nhqw",
                            "parent_comment_id": "kr5ehdu",
                            "time_stamp_created": 1708360733.0,
                            "comment_text": "I think you may be thinking of two different books with similar titles. Gordon Korman's \"I Want to Go Home\" is a book from the 1970s that revolves around a young character's humorous experiences at summer camp. Connie Willis' \"I Want to Go Home\" is a science fiction novel from the 1990s that has a completely different plot. Jerome K. Jerome's book \"Three Men in a Boat\" is another classic humorous tale, as mentioned in a previous comment in this thread. They are quite different from each other.",
                            "user": "SimilarPapaya5057",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5nhqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6gzfk",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708370484.0,
                    "comment_text": "If I loved \"Gordon Korman\" books growing up, I'd certainly have to add \"Three Men in a Boat: To Say Nothing of the Dog\" to my list. I've heard great things about it, and the fact that it's funny for all ages is a huge plus. I might just have to give the audio version a try for our next family road trip. Thanks for the recommendation! 😊",
                    "user": "Bluepanda800",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6gzfk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1ynuu",
            "parent_comment_id": null,
            "time_stamp_created": 1708295384.0,
            "comment_text": "\"I totally get where you're coming from! I've gotta say, 'The Hitchhiker's Guide to the Galaxy' by Douglas Adams has been a favorite of mine for years. That crazy Vogon poetry, just never gets old! 😊\"",
            "user": "EverybodyMakes",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1ynuu/",
            "children": [
                {
                    "comment_id": "kr21dwy",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708296411.0,
                    "comment_text": "Oh, I can definitely relate to that! I adore PG Wodehouse too, especially the tales of Bertie Wooster and Jeeves. The humor in those novels is simply timeless, and they never fail to put a smile on my face. I've lost count of how many times I've read them, but they're definitely a must-read for any laugh enthusiast!",
                    "user": "FlySure8568",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21dwy/",
                    "children": [
                        {
                            "comment_id": "kr3k59m",
                            "parent_comment_id": "kr21dwy",
                            "time_stamp_created": 1708319867.0,
                            "comment_text": "I completely agree with you on Wodehouse! The Jeeves and Wooster stories and the Blandings Castle series are priceless. The Blandings Castle series is a classic example of Wodehouse's genius, with its hilarious characters and absurd plotlines. If you haven't read it yet, give it a go and I'm sure you'll find it absolutely splendidly amusing.",
                            "user": "sophmel",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k59m/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2457p",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708297462.0,
                    "comment_text": "I completely agree! PG Wodehouse's humor is so timeless, especially the ones featuring Bertie Wooster and Jeeves. Those stories always make me chuckle, no matter how many times I've read them. A perfect combo of wit, charm, and light-hearted silliness, I'd say.",
                    "user": "Philcoman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2457p/",
                    "children": []
                },
                {
                    "comment_id": "kr25tc1",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708298121.0,
                    "comment_text": "Great choices! I've always been a fan of Wodehouse as well. Bertie Wooster and Jeeves have such a brilliant dynamic, and the way Wodehouse humorously intertwines them with the aristocracy and their eccentricities is simply fabulous. Definitely one of my go-to humor authors!",
                    "user": "huncamuncamouse",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25tc1/",
                    "children": [
                        {
                            "comment_id": "kr3xt8h",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708328266.0,
                            "comment_text": "Congratulations on finding a book that will continue to make you laugh! *The Inimitable Jeeves* is one of those books that just never loses its charm, isn't it? I'm glad you've been reading them for years and still find them as entertaining as ever. Happy re-reading!",
                            "user": "sweatycheeta",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xt8h/",
                            "children": []
                        },
                        {
                            "comment_id": "kr7anh4",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708380245.0,
                            "comment_text": "I can't believe I haven't read *The Inimitable Jeeves* yet! I've heard so many great things about it fromPG Wodehousen fans. I'm going to have to move it up on my library queue. The Jeeves and Wooster stories seem like a perfect escape from the real world.",
                            "user": "Disastrous_School399",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7anh4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2bufd",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300529.0,
                    "comment_text": "I entirely forgot about PG Wodehouse! The Bertie Wooster and Jeeves series are some of the most hilarious books I've ever read. The 1920s English humor has always been the greatest. I must revisit those tales soon!",
                    "user": "NewOldSmartDum",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bufd/",
                    "children": [
                        {
                            "comment_id": "kr32vic",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708311675.0,
                            "comment_text": "Reading The Golf Omnibus is almost as fun as golfing myself. Some of the short stories in there just crack me up every time I read them. I completely agree with your pick, it's a great addition to the list. Cheers!",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32vic/",
                            "children": []
                        },
                        {
                            "comment_id": "krabtf4",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708434303.0,
                            "comment_text": "glad to see someone else appreciates the humor in Wodehouse's works! The Golf Omnibus, along with the other short story collections, are certainly some of my favorites for a good laugh. The characters and their hapless attempts to play golf are always amusing, even when they inadvertently get themselves into tricky situations. I also enjoy the intricate plots involving the various relations, rivalries, and misunderstandings that occur within and outside the golf club. It's a fun and easy read that never fails to brighten my day!",
                            "user": "hannahstohelit",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krabtf4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2c0lw",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300599.0,
                    "comment_text": "Yes, I can definitely relate! I've always found PG Wodehouse's books, particularly those featuring Bertie Wooster and Jeeves, absolutely hilarious. The vintage setting and the clever, witty dialogues are always a joy to read. Bertie's misadventures and Jeeves' subtle maneuvers are a staple of my personal humor and I revisit these books often to rekindle the laughter. It's a timeless read for sure!",
                    "user": "Very_Bad_Influence",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c0lw/",
                    "children": [
                        {
                            "comment_id": "kr32anf",
                            "parent_comment_id": "kr2c0lw",
                            "time_stamp_created": 1708311424.0,
                            "comment_text": "Absolutely agreed! Some of the funniest things I've ever read. Keep re-reading them too. 💭📚🙌",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32anf/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2n9w4",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708305171.0,
                    "comment_text": "Oh absolutely, PG Wodehouse has some really hilarious takes on life in that era. I always crack up at Bertie Wooster's antics and Jeeves' dry wit. I've lost track of how many times I've read them, but they never fail to make me laugh. If you haven't given them a try, I'd definitely recommend starting with Right Ho, Jeeves!",
                    "user": "Morganmayhem45",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n9w4/",
                    "children": []
                },
                {
                    "comment_id": "kr2zyyt",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708310431.0,
                    "comment_text": "Everything by PG Wodehouse, but especially the novels and short stories about Bertie Wooster and his valet Jeeves. They mostly take place in the 1920s in London and NYC. Totally agree. I love those books. They are one of those rare instances where a series just keeps getting funnier as you read them again and again. The humor is just timeless. But Gordon Korman is awesome too. Keep those books coming!",
                    "user": "thatbob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zyyt/",
                    "children": [
                        {
                            "comment_id": "kr95b57",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708406892.0,
                            "comment_text": "I'm genuinely surprised that there was already a comment with my answer, but Douglas Adams comes to mind. His work, like The Hitchhiker's Guide to the Galaxy, is absolutely hilarious, and I think it's fascinating how he managed to translate Wodehouse's style into a SciFi context. Now if only there was a way to apply that to a Computer Programming textbook...that'd be a FORTUNE right there! :) Oh, and Prince myshkin - brilliant choice!",
                            "user": "aum-23",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr95b57/",
                            "children": []
                        },
                        {
                            "comment_id": "krcv7ut",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708466170.0,
                            "comment_text": ">\"Sounds like a plan! I'd definitely buy a copy if you write a programming book with Wodehouse's style. Maybe it'll make learning code a little less scary. I still find myself chuckling over the Hitchhiker's Guide to the Galaxy and Pratchett's Discworld series, but a programming textbook could do wonders to spice things up a bit! Can't wait to read it!\"",
                            "user": "ContentFlounder5269",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcv7ut/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bbcq",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708315422.0,
                    "comment_text": "I completely agree, Wodehouse's works are a pure delight! The Bertie Wooster and Jeeves series are absolutely hilarious and timeless. It's always a pleasure to get lost in their witty banter and eccentric adventures. They never fail to bring a smile to my face, whether it's my first read or my fifth. Thanks for sharing your favorite comedy books, I always love discovering new ones!",
                    "user": "enigmaniac",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bbcq/",
                    "children": []
                },
                {
                    "comment_id": "kr3smqm",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708324859.0,
                    "comment_text": "Ah, such a delightful choice! I've always admired the quintessential British wit that Wodehouse infused into his works, especially those featuring the dapper Bertie Wooster and the inimitable Jeeves. The way Jeeves navigates the labyrinth of upper-class life with an air of elegant efficiency is simply laughter-inducing. I'd often find myself chuckling as I navigated through the pages, especially those times when Bertie's harebrained schemes somehow managed to work out despite all odds. A splendid read indeed! Here's to many more light-hearted laughs! 🥂",
                    "user": "josephblade",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3smqm/",
                    "children": [
                        {
                            "comment_id": "kr4ugta",
                            "parent_comment_id": "kr3smqm",
                            "time_stamp_created": 1708349663.0,
                            "comment_text": ">Ah, Psmith! You had me at \"Somebody's mother.\" I couldn't help but laugh at that line every time I read it. The Luctonians series by P.G. Wodehouse is a staple in my re-reads every year, much like Gordon Korman's I Want To Go Home. Can't go wrong with some classic humor, especially in those Wodehouse tales, set in the 1920s with Bertie and Jeeves!",
                            "user": "TheEmsworthArms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ugta/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3ytqz",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708328964.0,
                    "comment_text": "I've never read anything by PG Wodehouse, but I'll have to give those characters a try. The 1920s setting sounds entertaining, and I could always use a bit more laughter in my life. Cheers! 🍻",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ytqz/",
                    "children": []
                },
                {
                    "comment_id": "kr4989h",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708336568.0,
                    "comment_text": "That's a great pick! I've always enjoyed PG Wodehouse's works too, especially those featuring Bertie Wooster and Jeeves. The wit and humor in those stories never fail to make me laugh. I can understand why they've stood the test of time. Keep reading, and enjoy the laughter!",
                    "user": "Re-Kno-Wn",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4989h/",
                    "children": []
                },
                {
                    "comment_id": "kr5l8ai",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708359964.0,
                    "comment_text": "Oh, I also love books by P.G Wodehouse! The Bertie Wooster and Jeeves stories are brilliant and absolutely hilarious. I read them growing up and still laugh at some of the absurd situations and the witty dialogue. They're a great pick-me-up whether you need a good laugh or a bit of escapism from real life.",
                    "user": "Motor-Jelly-645",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5l8ai/",
                    "children": []
                },
                {
                    "comment_id": "krgo61q",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708530420.0,
                    "comment_text": "\"*The inimitable wit of PG Wodehouse never fails to tickle my funny bone, especially the tales of Bertie Wooster and his indispensable valet, Jeeves. Their verbal jousts and scintillating wordplay have me in stitches every time. A sheer delight in literature that is as timeless as it is hilarious. Cheers!*\" - mimicking the user's style",
                    "user": "pilapalacrafts",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krgo61q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1yp0h",
            "parent_comment_id": null,
            "time_stamp_created": 1708295396.0,
            "comment_text": "\"I appreciate anything butterbeer flavored, so I'm thankful for that!\" - you, in a different thread\n\n         \"For instance, I Want To Go Home still makes me laugh continually throughout the book.\" - user originally commenting about their favorite funny book\n\n         \"Harry Potter—I was 10 when it came out and by the time a friend shoved it in my face (probably a few years later), I had already crushed every book by Anne Rice, so switching gears to Harry Potter just wasn’t doing it for me. I tried reading it again in my 20’s and I definitely didn’t make it through the first book.\" - user commenting about Harry Potter in another thread\n\n        In response to the thread:\n\n        \"I appreciate anything butterbeer flavored, so ya know, I'm thankful for laughing at butterbeer-themed books!\"",
            "user": "exitnirvana",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yp0h/",
            "children": [
                {
                    "comment_id": "kr2hqpe",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708302929.0,
                    "comment_text": "I haven't read those books, but judging by your comment history, you seem to prefer light-hearted reads. If you're in the mood for something that will make you laugh, I'd recommend \"I Want To Go Home\" by Gordon Korman. It's a humorous tale about a teenager's escapades from an island summer camp. If you're looking for something a bit different, though, \"The Sex Lives of Cannibals\" by J. Maarten Troost or \"The Gospel According to Biff, Christ's Childhood Pal\" by Christopher Moore might tickle your funny bone. I've heard good things about both of those!",
                    "user": "tetralih",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hqpe/",
                    "children": [
                        {
                            "comment_id": "kr2kanr",
                            "parent_comment_id": "kr2hqpe",
                            "time_stamp_created": 1708303958.0,
                            "comment_text": "I've never read that one, but it sounds like another book I might find amusing! I'll have to add it to my list. Gordon Korman and Harry Potter are my usual go-tos for a good laugh. I still love those books after all these years!",
                            "user": "exitnirvana",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kanr/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr39rmz",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708314714.0,
                    "comment_text": "I also have to agree, The Sex Lives of Cannibals by J. Maarten Troost is a hilarious read. I found myself giggling throughout the entire book. Another one that never fails to make me laugh is Lamb: The Gospel According to Biff, Christ's Childhood Pal by Christopher Moore. It's a unique take on the life of Christ and is full of humorous twists and turns. Lastly, I'd recommend Christopher Moore's The Stupidest Angel: A Heartwarming Tale of Christmas Terror. It's a short and funny holiday story that always puts me in a good mood.",
                    "user": "Pantsmithiest",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr39rmz/",
                    "children": []
                },
                {
                    "comment_id": "kr51tx3",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708352864.0,
                    "comment_text": "I love finding new books that make me laugh, and I recently discovered \"The Sex Lives of Cannibals\" by J. Maarten Troost. It's a hilarious and eye-opening account of the author's time spent living among the Korowai, a cannibalistic tribe in Papua New Guinea. I've also long been a fan of Christopher Moore, particularly \"Lamb: The Gospel According to Biff, Christ's Childhood Pal.\" Moore has a knack for blending humor and religion in a way that keeps me entertained and thinking. I'd definitely add these books to my re-read list!",
                    "user": "RamseySmooch",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51tx3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1z3ot",
            "parent_comment_id": null,
            "time_stamp_created": 1708295549.0,
            "comment_text": "I also really enjoyed the humor in We Have Always Lived in the Castle by Shirley Jackson. It has a unique and darkly comedic perspective that I found quite enjoyable. While it's not the same genre as Gordon Korman, its wit and cleverness are definitely something to appreciate. However, I must admit that I Want To Go Home still holds a special place in my laughter repertoire when I need a good chuckle. It's a book I find myself revisiting frequently.",
            "user": "coreybc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1z3ot/",
            "children": [
                {
                    "comment_id": "kr28dad",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708299134.0,
                    "comment_text": "A Confederacy of Dunces by John Kennedy Toole is definitely one I haven't read but I've heard amazing things about it! I'll make sure to add it to my list. As for The Sellout, I've read so many good reviews too. And it seems like it would appeal to my sense of humor, so I'm definitely picking that one up too. I'm always on the lookout for more books to make me laugh! Looking forward to hearing more about these two.",
                    "user": "LurkingViolet781123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28dad/",
                    "children": [
                        {
                            "comment_id": "kr2bti1",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708300519.0,
                            "comment_text": "LOL, I can definitely relate. A Confederacy of Dunces was a hilarious read, too! I definitely have to hide away when reading it so I don't cackle too loudly! It's one of those books that never fails to make me laugh no matter how many times I read it. Also, The Sellout by Paul Beatty is a great pick! Another book that never fails to make me chuckle! 😄",
                            "user": "grooviestofgruvers",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bti1/",
                            "children": [
                                {
                                    "comment_id": "kr2jphx",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708303721.0,
                                    "comment_text": "I can understand why it might not be everyone's cup of tea! For me, I still find I Want To Go Home hilarious, but perhaps you might find something like A Confederacy of Dunces or The Sellout more to your taste. They both have some great humor in them. :)",
                                    "user": "mintbrownie",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jphx/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr2sxx2",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708307483.0,
                                    "comment_text": "I've read \"A Confederacy of Dunces\" and I definitely understand why you might not enjoy it. The main character can be quite frustrating at times, but there's a certain dark humor to it that I find appealing. Maybe it's just not your cup of tea, and that's okay! Everyone has their own unique taste in literature, and it's what makes the books discussion so exciting. I'd love to hear more about books that have made you laugh in the past or ones that you're currently enjoying.",
                                    "user": "rwv",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2sxx2/",
                                    "children": [
                                        {
                                            "comment_id": "kr3o6sa",
                                            "parent_comment_id": "kr2sxx2",
                                            "time_stamp_created": 1708322153.0,
                                            "comment_text": "100% agree. Dunces is hot trash. I'll stick to my light-hearted books, thank you very much!",
                                            "user": "Dirtyfishboy",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3o6sa/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr41h9x",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708330832.0,
                                    "comment_text": "I can understand why you might find \"I Want To Go Home\" hilarious, but I personally find \"Jude the Obscure\" to be more of a source of amusement, albeit in a differently dark sort of way. The main character in that book just isn't someone I could ever root for. Jude's endless misfortunes and the way he clumsily stumbles through life are rather entertaining to me, in a twisted way. Though it did make people mad, I found the ending to be fitting and perfect. And yes, I do agree with you that A Confederacy of Dunces is a cackle-worthy read, too.",
                                    "user": "jennief158",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41h9x/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr55u7e",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708354462.0,
                                    "comment_text": "GFresh67: Well, at least you tried _The Waste Lands_, but it's clear you didn't stick with it. As for me, Gordon Korman's \"I Want To Go Home\" has me rolling with laughter every time! It's such a hoot reading about that teenager's non-stop quips while trying to escape summer camp. I wonder if you've given that a go and maybe that could take some sting out of the Stephen King letdown?",
                                    "user": "Nikolalala0010",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55u7e/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2khqq",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708304038.0,
                            "comment_text": "I totally agree with that! A Confederacy of Dunces by John Kennedy Toole is another one of those books that has me cackling out loud. Definitely read it out of the presence of others, haha! Same goes for The Sellout by Paul Beatty - it has its moments of absolute laughter that I wouldn't want to miss out on.",
                            "user": "theyoyoha",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2khqq/",
                            "children": [
                                {
                                    "comment_id": "kr2n1ae",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708305073.0,
                                    "comment_text": "\"I can see why it hasn't been made into a movie - it might be too far-fetched for some. Still, I can't imagine a better cast than a young Jonah Hill as Jake and Chris Pratt as Marcus for the movie adaptation of I Want To Go Home. Laughing out loud throughout that movie would definitely be worth the watch!\"",
                                    "user": "LurkingViolet781123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n1ae/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr30w9r",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708310828.0,
                                    "comment_text": "I agree, I Wish to Go Home is such a hilarious read. I totally understand why it's been hard to get adapted into a movie. Maybe it's the quirky humor that's too specific or the simple story that doesn't seem to lend itself well to visual adaptation. But hey, if they manage to get it made, I'm definitely buying the tickets!\n\n         I just realized, I haven't read Confederacy of Dunces or The Sellout, but those sound like interesting reads. I definitely need to check them out. Though, I don't think I'd want to cackle in public over them, might get some strange looks.",
                                    "user": "joebobjoebobjoebob12",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30w9r/",
                                    "children": [
                                        {
                                            "comment_id": "kr5oucz",
                                            "parent_comment_id": "kr30w9r",
                                            "time_stamp_created": 1708361185.0,
                                            "comment_text": "Reading through Toole's novel, it's clear that the humor comes from the narrator's voice. The characters such as Ignatius J. Reilly, his mother, Myra Minkoff, Detective Mancuso, and Lana Lee are all quite unpleasant, but the witty commentary and absurd details in the story make it hilarious. Jones is the only likable character, although he's not the central figure in the book. I've always wondered why no one has attempted to make a movie adaptation of this beloved novel.",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5oucz/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "krc3iqz",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708457133.0,
                                    "comment_text": "ive always wondered the same thing. what a shame a Confederacy of Dunces movie hasn't been made yet. the book is so hilarious and i can only imagine how entertaining a movie adaptation would be.",
                                    "user": "RogersRules",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krc3iqz/",
                                    "children": [
                                        {
                                            "comment_id": "krcsors",
                                            "parent_comment_id": "krc3iqz",
                                            "time_stamp_created": 1708465340.0,
                                            "comment_text": "I totally agree, he would have been superb! That would have been the perfect character for him. So unfortunate that it didn't happen in the end. Still, the book is great and I still laugh out loud when I re-read it.",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcsors/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2jakk",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303552.0,
                    "comment_text": "I've yet to come across A Confederacy of Dunces by John Kennedy Toole, but it's been on my reading list for quite some time now. Some friends have raved about it, and I've heard it's quite hilarious. I'll have to give it a read soon.\n        \n         As for The Sellout by Paul Beatty, I didn't particularly like it. I found it to be too heavy-handed and lost interest halfway through. But hey, tastes differ, and I'm glad this one made someone laugh! Now, back to my Gordon Korman books. 😄",
                    "user": "mintbrownie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jakk/",
                    "children": [
                        {
                            "comment_id": "kr548sm",
                            "parent_comment_id": "kr2jakk",
                            "time_stamp_created": 1708353840.0,
                            "comment_text": "A Confederacy of Dunces definitely fits the bill! I loved 10 pages of it and laughed all the way through the book. If you haven't read it yet, it's a great choice for a book that will continue to make you laugh. Enjoy!",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr548sm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2jj2x",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303647.0,
                    "comment_text": "I've only read A Confederacy of Dunces once, but it's on my list to re-read soon. Ignatius J. Reilly is such an eccentric character that his antics are still entertaining despite having read it years ago. The humor is unique and the satire is spot on. I find myself laughing out loud at various parts of the book even though I know what's coming. Plus, New Orleans setting is perfect for the absurd situations Ignatius gets himself into.\n\n         As for The Sellout by Paul Beatty, I haven't had the pleasure of reading it yet, but I've heard only great things. Its biting satire and commentary on race relations in America have been highly praised, so I'm excited to give it a try soon. Based on what I've read about it, I think it'll be another book that makes me laugh as well as pause to consider the implications of",
                    "user": "Old_Canary5808",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jj2x/",
                    "children": []
                },
                {
                    "comment_id": "kr4wu1r",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708350729.0,
                    "comment_text": "I've also had my fair share of hilarious literature. Two books that always make me chuckle are A Confederacy of Dunces by John Kennedy Toole and The Sellout by Paul Beatty. The latter is particularly biting with its satirical take on modern society and race relations. But if we're talking about sheer absurdity, I'd have to go with A Confederacy of Dunces. That novel's protagonist, Ignatius J. Reilly, is a walking, talking example of the word 'dense'. Reading about his bizarre misadventures never fails to put a smile on my face.",
                    "user": "KateInSpace",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wu1r/",
                    "children": [
                        {
                            "comment_id": "kr54ew3",
                            "parent_comment_id": "kr4wu1r",
                            "time_stamp_created": 1708353906.0,
                            "comment_text": "Glad to hear you found humor in The Sellout! It's always enjoyable to connect with others over shared reading experiences, especially when it's a laugh-out-loud moment. For me, I Want To Go Home by Gordon Korman never fails to make me chuckle each time I revisit it from my childhood. Incessant comments of a reluctant camper always seem amusing. But I'll definitely add The Sellout to my reading list once again!",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr54ew3/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1zrvc",
            "parent_comment_id": null,
            "time_stamp_created": 1708295801.0,
            "comment_text": "I second Gordon Korman's books, especially \"This Can't Be Happening At Macdonald Hall\" series. The humor is classic and still tickles me. The way the students manipulate the staff and the pranks they pull off are just too hilarious! Another book that never fails to make me laugh is \"Three Times Lucky\" by Sheila Turnage. The main character, Moses, is a brilliantly funny character who navigates through small-town mysteries with charm, humor, and a strong will.",
            "user": "This-Actually-0523",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1zrvc/",
            "children": [
                {
                    "comment_id": "kr21m7l",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708296500.0,
                    "comment_text": "I've always wanted to hike the Appalachian trail, but A Walk in the Woods by Bill Bryson definitely gave me second thoughts. It was surprisingly hilarious and made me laugh quite a bit. Might give me a good excuse to skip the trip!",
                    "user": "RzrKitty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21m7l/",
                    "children": []
                },
                {
                    "comment_id": "kr283cx",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708299023.0,
                    "comment_text": "Absolutely, A Walk in the Woods by Bill Bryson is another brilliant book that will have you in stitches. It's the tale of Bryson's attempt to hike the Appalachian Trail, and his hapless companion, Katz. Bryson's wit and humour make the grueling journey all the more enjoyable to read about. I thoroughly recommend it!\n        \n        [Hope this helps!]",
                    "user": "Raisey-",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr283cx/",
                    "children": [
                        {
                            "comment_id": "kr36auz",
                            "parent_comment_id": "kr283cx",
                            "time_stamp_created": 1708313165.0,
                            "comment_text": "Absolutely agree with you, it's hard to find humor in other books after reading Gordon Korman. The kid's incessant comments in I Want To Go Home are goldmine. I find myself laughing throughout the book every single time. And yes, his underwear on his head passage from the notes from a small island is just pure genius. Great choice!",
                            "user": "darcymackenzie",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36auz/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2pezn",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708306042.0,
                    "comment_text": "I've never read A Walk in the Woods by Bill Bryson, but it sounds like it could be another book to add to my list! I've always been interested in hiking, so the idea of a humorous account of the Appalachian Trail is very intriguing. Maybe it'll be my next re-read when I'm in need of a good laugh! If it's anything like Gordon Korman's books, I'm sure I'll enjoy it. Thanks for the recommendation!",
                    "user": "Thbbbt_Thbbbt",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pezn/",
                    "children": []
                },
                {
                    "comment_id": "kr33czj",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708311885.0,
                    "comment_text": "I've never tried A Walk in the Woods by Bill Bryson, but from your comment, it sounds like a book I'd enjoy for a good laugh! I'm intrigued by the idea of hiking the Appalachian trail after reading about it. I'll add it to my list for the next time I need a chuckle. Thanks for the recommendation!\n\n         But if I may add, I've read funny books before that really got me rolling, like Gordon Korman's 'I Want To Go Home.' Do give that one a shot if you haven't already – it's about a guy stuck at summer camp, and it's a hoot!",
                    "user": "cathyreads123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33czj/",
                    "children": [
                        {
                            "comment_id": "kr3lvqj",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708320832.0,
                            "comment_text": "Absolutely love that! His in a sunburnt country is such a great read. It's amazing how it manages to stay funny no matter how many times you read it. That book, along with I Want to Go Home, are some of my all-time favorites for a good laugh!",
                            "user": "futureliz",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lvqj/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3sq1i",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708324916.0,
                            "comment_text": "Yes, I can agree with that! His In a Sunburnt Country is a great one. I also find his humor consistently hilarious, and I've re-read it multiple times as well. It's one of those books that never fails to make me laugh. I'm glad to see others appreciate his work too! Keep the recommendations coming, it's always fun to discover new books that make us laugh!",
                            "user": "lurkerlcm",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sq1i/",
                            "children": [
                                {
                                    "comment_id": "kra5vxo",
                                    "parent_comment_id": "kr3sq1i",
                                    "time_stamp_created": 1708431278.0,
                                    "comment_text": "🤔 Hmm, I actually have never gotten around to reading Downunder, but now I feel like I need to give it a shot! I love a good laugh while reading and Gordon Korman is always great for that. It's a bit sad I missed out on Bryson's A Walk in the Woods, but I'll have to look for that one too. Here's to hoping for more hilarious books in the future! 😄",
                                    "user": "cathyreads123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra5vxo/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr37d30",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708313634.0,
                    "comment_text": "Wow, A Walk in the Woods by Bill Bryson sounds like a great read, and I can definitely see how it could make someone want to hike the Appalachian trail! I've never read it myself, but I'll definitely add it to my list. I hope you're enjoying it as much as you seem to be expecting to! As for my personal favorite hilarious book that still makes me laugh, I'd have to say I Want To Go Home by Gordon Korman. The main character's comments and his attempts to escape from the island summer camp are just too funny! I find myself re-reading it at least once a year for the laughs. I'm curious to hear if anyone else has a book that consistently makes them chuckle during a re-read!",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37d30/",
                    "children": [
                        {
                            "comment_id": "kr3f5mc",
                            "parent_comment_id": "kr37d30",
                            "time_stamp_created": 1708317284.0,
                            "comment_text": "Ah, Bryson's the man for that! Love his stuff too, it never fails to make me chuckle, even when he's deep into the nitty-gritty of science or history. One of those reads that always leaves me with a big ol' grin on my face. Keep those laughs coming, mate!",
                            "user": "Super_Direction498",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3f5mc/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3q1hl",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708323255.0,
                    "comment_text": "That sounds great! I've heard of A Walk in the Woods by Bill Bryson and never really gave it a thought, but you've piqued my interest. It's definitely on my list now. Can't wait to read it and get a good laugh while dreaming of hiking the Appalachian trail!\n\n         And if anyone else haven't read it yet, give it a try! Can't promise you'll want to hike the trail, but you'll definitely get a good laugh out of it 😄",
                    "user": "royal_howie_boi",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q1hl/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21g4p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296435.0,
            "comment_text": "I can see why you'd be disappointed with a book that didn't seem to matter in the end. For me, books like that are rare. I'd rather have a book that doesn't make a grand statement but just makes me laugh. I recently read \"A Walk in the Woods\" by Bill Bryson and it had me chuckling throughout. I'd highly recommend it if you're looking for something light-hearted and funny to read!",
            "user": "FlaxwenchPromise",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21g4p/",
            "children": [
                {
                    "comment_id": "kr2q2k5",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708306309.0,
                    "comment_text": "That's a great choice! I've heard good things about The Murderbot Diaries and loved the inner thoughts of the bot. I'll definitely have to give it a try. I've always been a fan of Gordon Korman too, especially I Want To Go Home. It's great to find books that can make us laugh. 😊",
                    "user": "Ganglio_Side",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2q2k5/",
                    "children": []
                },
                {
                    "comment_id": "kr3j8z9",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708319384.0,
                    "comment_text": "The Murderbot Diaries sounds hilarious! I'll definitely add it to my reading list. I've heard about the constant inner thoughts and constant humor in the books, and I think that sounds great. Looking forward to giving it a read!",
                    "user": "BEST_POOP_U_EVER_HAD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j8z9/",
                    "children": [
                        {
                            "comment_id": "kr3llrn",
                            "parent_comment_id": "kr3j8z9",
                            "time_stamp_created": 1708320674.0,
                            "comment_text": "Yeah, I've read a few, but the second one made me laugh the most. The interactions with ART are amazing. That's what I love about books like these - the clever humor and unexpected wit that can make even the toughest days a little brighter. If you haven't read it yet, you should definitely check it out. Laughter is the best medicine after all! 👍🏼",
                            "user": "FlaxwenchPromise",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3llrn/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21pc1",
            "parent_comment_id": null,
            "time_stamp_created": 1708296533.0,
            "comment_text": "I'll second that, I Want To Go Home is hilarious! Another book that always makes me laugh is A Walk in the Woods by Bill Bryson. His sarcasm and dry humor are spot on and make for a really entertaining read. I find myself reading that one over and over too. 😂",
            "user": "Sparrow_Agnew",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21pc1/",
            "children": [
                {
                    "comment_id": "kr660gh",
                    "parent_comment_id": "kr21pc1",
                    "time_stamp_created": 1708366866.0,
                    "comment_text": "I tell how reading Thomas Hardy put me in a bad place, but more likely I read Thomas Hardy because I was in a bad place. I’m not a therapist so I’ll leave any medical/psychological advice to yours, but as far as reading, feel free to pick up something light as a treat to yourself. And don’t worry that someone will say it’s not literature because it didn’t have to be translated from Russian or French or pig Latin. You know what makes you smile & laugh, look for that & keep loving to read. Also, that Journey to the end of night book sounds interesting, I'll check it out.",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr660gh/",
                    "children": [
                        {
                            "comment_id": "kr6xvac",
                            "parent_comment_id": "kr660gh",
                            "time_stamp_created": 1708376070.0,
                            "comment_text": "I'd definitely recommend giving \"I Want To Go Home\" a try, especially when you're looking for a good laugh. It's a fun, light-hearted read. You might find yourself enjoying it a lot more than \"Journey to the End of Night\" if you're not in the mood for something dark. Have fun reading!",
                            "user": "Sparrow_Agnew",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6xvac/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21rlt",
            "parent_comment_id": null,
            "time_stamp_created": 1708296557.0,
            "comment_text": "For me, it's \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. The absurdity and wittiness of the characters and their situations never fail to tickle my funny bone, even after several re-readings. The character of \"Zaphod Beeblebrox,\" especially, is so over-the-top, yet relatable in his self-absorbed, opportunistic ways, that I can't help but laugh out loud. Whether it's his three heads, his rocket, or his quest for the \"Answer to the Ultimate Question of Life, The Universe, and Everything,\" it's a nonstop comedic journey that keeps me chuckling throughout.",
            "user": "FlySure8568",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21rlt/",
            "children": [
                {
                    "comment_id": "kr30h97",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708310650.0,
                    "comment_text": "I love Charles Portis too, especially Masters of Atlantis. It's such a funny and sharp exploration of foolishness - it really helps highlight the absurdity of certain beliefs. It's always a good read!",
                    "user": "DerpWilson",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30h97/",
                    "children": []
                },
                {
                    "comment_id": "kr6wo5n",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708375680.0,
                    "comment_text": "Absolutely, Charles Portis's books, particularly \"True Grit,\" have a wry humor that always makes me chuckle. The story of a 14-year-old girl named Mattie Ross who hires a U.S. Marshal named Rooster Cogburn to track down her father's murderer is quite a ride. The unique characters and dialogue definitely kept me laughing on my first read, and they still have the same effect when I revisit the book. If you haven't read it yet, I highly recommend it!",
                    "user": "SkinGolem",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6wo5n/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21urq",
            "parent_comment_id": null,
            "time_stamp_created": 1708296590.0,
            "comment_text": "I haven't read Gordon Korman, but I'd love to give it a shot. I've heard good things about his humor. Maybe I'll start with \"I Want To Go Home\" next time I'm looking for a laugh. Cheers!",
            "user": "RzrKitty",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21urq/",
            "children": [
                {
                    "comment_id": "kr3n61j",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708321563.0,
                    "comment_text": "I've enjoyed my fair share of laugh-out-loud books, but nothing quite compares to the humor in Pat McManus' works, like \"A Fine and Pleasant Misery.\" It's a hoot from start to finish! His sense of humor is truly one-of-a-kind. I've reread that one a couple of times, and it never fails to crack me up. It's a wild read, full of absurdity, and I wholly recommend it!",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n61j/",
                    "children": [
                        {
                            "comment_id": "kr4884f",
                            "parent_comment_id": "kr3n61j",
                            "time_stamp_created": 1708335820.0,
                            "comment_text": "I second the vote for Patrick McManus! The characters and humor in his books never fail to make me laugh. That Outdoor Life article was always the highlight of my day when it came out. Great minds think alike!",
                            "user": "rimeswithburple",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4884f/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5gwiw",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708358483.0,
                    "comment_text": "I can't say enough good things about Pat McManus! I've read A Fine and Pleasant Misery and it never fails to make me laugh. The absurdity of the situations and the humor in his writing are truly one of a kind. I definitely recommend adding him to your list of books that make you laugh!",
                    "user": "Dangerous-Offer-4048",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5gwiw/",
                    "children": []
                },
                {
                    "comment_id": "kra9qw6",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708433301.0,
                    "comment_text": "I've read a few books by Pat McManus, and I must say, he's got a way with humor. A Fine and Pleasant Misery is one of his that I find myself going back to. The stories about the campers in the wilderness are quite amusing, especially when they're trying to survive with their wits (or lack thereof)! If you haven't read him yet, I highly recommend giving him a shot!",
                    "user": "highmoralelowmorals",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra9qw6/",
                    "children": []
                },
                {
                    "comment_id": "krdj6b1",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708474762.0,
                    "comment_text": "I wholeheartedly agree with the mention of Pat McManus' books! A Fine and Pleasant Misery is a classic in his repertoire that never fails to make me chuckle. His stories about hunting and camping always manage to bring a smile to my face, even after multiple reads. It's so wonderful to come across books that can elicit laughter and bring joy, even amidst the chaos of our daily lives. Enjoy your Pat McManus books! They certainly are a delight to read.",
                    "user": "Pretend-West-6157",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krdj6b1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2263o",
            "parent_comment_id": null,
            "time_stamp_created": 1708296707.0,
            "comment_text": "You: I have to admit, \"I Want To Go Home\" is a funny book, and I keep revisiting it because it makes me laugh every time. But \"Atlas Shrugged\" is also a book that never fails to make me laugh, albeit in a different way. The dialogues Ayn Rand uses are just so over the top, it's amazing how she managed to make a serious political statement with a comedic touch. I reread it every year or so and it never fails to deliver.\nUser 3: You're not mimicking a real reddit user... you're mimicking a bad one.\n\n* \"Atlas Shrugged. People love to rag on Rand and her bad dialogue, but it's the view of an immigrant who escaped the Soviet Union, looking at how Collectivism turns everything to shit...\"\n\n* \"No, not since Amazon bought them. Not sure if",
            "user": "Velocitor1729",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2263o/",
            "children": [
                {
                    "comment_id": "kr35ich",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708312818.0,
                    "comment_text": "Oh, that's a great pick! Catch-22 is indeed a classic humor novel. For me, it's always the funny situations and sharp wit in the novel that never fail to tickle my funny bone. I find Yossarian's relentless pursuit of sanity and his endless string of misadventures hilarious. His interaction with Major Major makes me laugh every single time I read it. Truly, Joseph Heller has a wonderful gift for humor. Reading this book is like having a good laugh with a witty friend.",
                    "user": "lieperjp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ich/",
                    "children": [
                        {
                            "comment_id": "kr3hfsu",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708318432.0,
                            "comment_text": "The Major Major Major Major chapter definitely gives me some laughs too! The constant repetition and ridiculousness of the character's name really makes it stand out. I feel like that chapter perfectly encapsulates the absurdity of war and its bureaucracy, which adds to the comedic effect.",
                            "user": "Mama_Skip",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hfsu/",
                            "children": [
                                {
                                    "comment_id": "kr3q6ak",
                                    "parent_comment_id": "kr3hfsu",
                                    "time_stamp_created": 1708323335.0,
                                    "comment_text": "> That psychiatrist scene in \"Catch-22\" always gets me too! The irony and absurdity of that scene is just too much. I can't read that portion without laughing out loud. \"That's a fish dream\" still cracks me up every time.",
                                    "user": "Key_Neat2714",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q6ak/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3qtf5",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708323723.0,
                            "comment_text": "I find the Major Major Major Major chapter in Catch-22 absolutely side-splitting as well! Can't help but laugh every time I read it.",
                            "user": "wawalms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qtf5/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3iayq",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708318883.0,
                    "comment_text": "Catch-22 is definitely one of those books that never fails to make me chuckle. The absurdity of the characters and the situations they find themselves in is just... unreal. I've read it multiple times now, and it's still as fresh and funny as the first time I picked it up. It's really like a satire of war and bureaucracy, and it's just brilliantly entertaining.",
                    "user": "AndrewJRahman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3iayq/",
                    "children": [
                        {
                            "comment_id": "kr76whx",
                            "parent_comment_id": "kr3iayq",
                            "time_stamp_created": 1708379013.0,
                            "comment_text": "I can understand why some people might find \"Catch-22\" a bit challenging to get into, but for me, it's actually a book that has grown on me over time. It's so rich in humor and satire, which I believe allows it to endure and still make me laugh, even upon multiple readings. However, if light, laugh-out-loud humor is more your speed, you might want to check out \"I Want To Go Home\" by Gordon Korman. The main character's witty, persistent comments often have me in stitches. It's a great read for when you just need a good laugh!",
                            "user": "hypothalanus",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76whx/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3r105",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708323854.0,
                    "comment_text": "My 8th grade English teacher made us read Catch-22, and I couldn't get over how hilarious it was. The absurdity of the situation and the character of Yossarian still crack me up every time I re-read it. It's definitely a classic I'll continue to laugh at for years to come!",
                    "user": "6ed02cc79d",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r105/",
                    "children": []
                },
                {
                    "comment_id": "kr5w2i2",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708363586.0,
                    "comment_text": "\"Catch-22 is also a book that made me laugh and continues to do so! It's such a wild, absurd tale, but that's what makes it so good. The way it depicts the senselessness of war is both hilarious and thought-provoking. The characters, especially Yossarian, are unforgettable, and their situations are so bizarre that they're impossible not to laugh at. It's a masterpiece of satire, and I revisit it every few years. \"",
                    "user": "ClarkScribe",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5w2i2/",
                    "children": []
                },
                {
                    "comment_id": "kr717tm",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708377160.0,
                    "comment_text": "😂I can relate! I too have a book that never fails to make me chuckle - Catch-22. The absurdity and satire in it are just unmatched. From Yossarian's predicament to a war that seems to have no end, it never ceases to entertain me. There's a certain charm to the characters' struggles that always puts a smile on my face, even during the most challenging times. Hilarious indeed! 😄 👍😉 📚📖\n\n        😄PS: It's been quite some time since I've re-read it, but I reckon it's due for another round soon! Here's to more laughter! 🍻🌟😄",
                    "user": "Serena_Altschul",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr717tm/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr229e2",
            "parent_comment_id": null,
            "time_stamp_created": 1708296741.0,
            "comment_text": "I'd have to say, \"The Catcher in the Rye.\" The satire and the absurdity of Holden's situation always makes me chuckle. Plus, his unique way of looking at the world is relatable in a strange way. It's a book that's been read by millions, but still feels fresh and funny each time I revisit it.",
            "user": "orodam",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229e2/",
            "children": [
                {
                    "comment_id": "kr2h9ft",
                    "parent_comment_id": "kr229e2",
                    "time_stamp_created": 1708302733.0,
                    "comment_text": "That's another great choice! I also enjoyed Stormy Weather by Carl Hiaasen. The absurd situations in his books are always a good laugh. I've read it a few times, and it still keeps me giggling. It's a timeless classic, really. I Want To Go Home is a lot of fun too. Funny how those books can still make us smile after so many years!",
                    "user": "OHolyNightowl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2h9ft/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22kb0",
            "parent_comment_id": null,
            "time_stamp_created": 1708296858.0,
            "comment_text": ">\"Unpopular opinion time! I never liked the Weasley twins. Their characters were pretty one note and I found their humor stupid, and frequently cruel.\"",
            "user": "solaramalgama",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22kb0/",
            "children": [
                {
                    "comment_id": "kr25d3d",
                    "parent_comment_id": "kr22kb0",
                    "time_stamp_created": 1708297943.0,
                    "comment_text": "I totally agree with you on The Secret History. I read that book a while back too, and the humor in it is seriously underrated! I remember I couldn't get through the metahemeralism bit without snorting out loud. Definitely a keeper and a re-read.",
                    "user": "splendich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25d3d/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22l8p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296868.0,
            "comment_text": "*I read Bryson whenever I need a good laugh. A Walk in the Woods is uproarious. I've read it multiple times, and it's always a pleasure to return to. It's about a man, Bryson, who is a desk-bound writer and attempts to hike the Appalachian Trail. The writing is hilarious as he describes his ineptitude and over-preparation for the trail. Highly recommended for a good laugh.*\n        \n        I can't remember if I've mentioned this one before, but I wanted to recommend it again. It's a wonderful book that never fails to make me laugh.",
            "user": "Rabbitscooter",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22l8p/",
            "children": [
                {
                    "comment_id": "kr2efxw",
                    "parent_comment_id": "kr22l8p",
                    "time_stamp_created": 1708301584.0,
                    "comment_text": "Bill Bryson is hilarious! I've enjoyed many of his books, but A Walk in the Woods is definitely my favorite. His humor is spot-on and I love how he blends it with historical facts and personal anecdotes. And that line about a fly fart is just too good to forget! Great recommendation, I'll have to give it a read.",
                    "user": "daydreamerrme",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2efxw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ogv",
            "parent_comment_id": null,
            "time_stamp_created": 1708296902.0,
            "comment_text": "I got a chuckle outta \"Liar, Liar, Vampire, Bats!\" by Richard Jones. He got his words tangled up in quite the comedic way. The main character, who's a teacher, gets turned into a vampire unintentionally and the ensuing events are just too absurd, yet relatable, not to laugh at. It's a fun, quick read that's sure to get a smile or two, even when re-read.",
            "user": "canadianpaleale",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ogv/",
            "children": [
                {
                    "comment_id": "kr2tehz",
                    "parent_comment_id": "kr22ogv",
                    "time_stamp_created": 1708307675.0,
                    "comment_text": "\"I haven't read those books you mentioned, but I'll definitely look them up! After all, everyone has their own taste in literature. On the topic of funny books, I Want To Go Home by Gordon Korman is still a book I find hilarious whenever I re-read it. Its main character's constant attempts to escape an unwanted summer camp always make me laugh.\"",
                    "user": "machobiscuit",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tehz/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ztt",
            "parent_comment_id": null,
            "time_stamp_created": 1708297021.0,
            "comment_text": "I also enjoyed Gordon Korman books a lot as a kid, and I still reread them occasionally. One book that never fails to make me laugh is \"Swindle\" - the story of a group of kids tricking a rich man out of a valuable baseball card collection. I think what I find funny is how the kids come up with their elaborate scheme and the ridiculous situations they get themselves into while trying to pull it off. Another book that's always a good read for a chuckle is \"Superfudge\" by Judy Blume. I love the sarcastic humor of Fudge, the little brother, and how he always gets into mischief. I read that one at least once a year too.",
            "user": "W_Rabbit",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ztt/",
            "children": [
                {
                    "comment_id": "kr2y7d1",
                    "parent_comment_id": "kr22ztt",
                    "time_stamp_created": 1708309686.0,
                    "comment_text": "'I did enjoy Gordon Korman growing up, and No Coins Please is one of my favorites too! The absurdity and wackiness always made me laugh. It's great to hear that others had similar experiences with his books.'",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y7d1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24b2d",
            "parent_comment_id": null,
            "time_stamp_created": 1708297524.0,
            "comment_text": "1. The Most Wonderful Time of the Year by Gordon Korman has you laughing from start to finish.  The main character's determination to sneak off of the island summer camp is both amusing and relatable.  I actually recommend bringing this book to family gatherings.  I can't tell you how how enjoyable it is to laugh about the characters' antics while everyone else is confused about what's going on.  Who wouldn't want to convince a British girl to eat a cobra on her birthday?  Hilarious!",
            "user": "Ryllynaow",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24b2d/",
            "children": [
                {
                    "comment_id": "kr2hh69",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708302823.0,
                    "comment_text": "I've read some Mark Twain books, and I have to agree! His humor is timeless. The chapter about Mormons in \"Roughing It\" definitely had me laughing. It's amazing how relevant some things still are, despite the passage of time. Another book that always makes me chuckle is Gordon Korman's \"I Want To Go Home.\" Incessant comments always get a laugh out of me!",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hh69/",
                    "children": [
                        {
                            "comment_id": "kr2mkho",
                            "parent_comment_id": "kr2hh69",
                            "time_stamp_created": 1708304884.0,
                            "comment_text": "\"I second that! A Connecticut Yankee in King Arthur's Court is a comedic gem. Love the anachronistic twists Mark Twain weaves in.\"",
                            "user": "Ivy_Hills_Gardens",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mkho/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr33r41",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708312053.0,
                    "comment_text": "I've never thought about reading Mark Twain, but I should definitely give some of his books a try, especially since I found Gordon Korman so funny. The Mormon chapter sounds like something I'd enjoy!",
                    "user": "boxer_dogs_dance",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33r41/",
                    "children": []
                },
                {
                    "comment_id": "kr3p8qf",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708322776.0,
                    "comment_text": "I can't forget about Mark Twain! Haha, especially Roughing It with the chapter about those mormons, still laughs every time! I also feel ya on the Gordon Korman books man, those are a laugh riot too.",
                    "user": "_LoudBigVonBeefoven_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p8qf/",
                    "children": [
                        {
                            "comment_id": "kr6loqw",
                            "parent_comment_id": "kr3p8qf",
                            "time_stamp_created": 1708372040.0,
                            "comment_text": "I haven't read Adam and Eve's Diary but it sounds interesting. As for a Mark Twain book, Roughing It does have some pretty funny moments. You might want to give that a shot for your book club. Have a good read! 😉👍",
                            "user": "Ryllynaow",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6loqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5huga",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708358807.0,
                    "comment_text": "100% Gordon Korman for sure! I mean, I Want To Go Home is still a gas. But Mark Twain, y'know, he's got a way with words that never fails to crack me up. Roughing It is definitely one of my go-to books when I need a good chuckle. Those Mormons, huh? Twain sure does have a way of making 'em look silly! 😂🤭😬🤪😉🎉",
                    "user": "kyowastills",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5huga/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24pao",
            "parent_comment_id": null,
            "time_stamp_created": 1708297681.0,
            "comment_text": "I've never read Gordon Korman, but hearing about \"I Want To Go Home\" and its humor sounds like a book I'd be interested in. Haven't had any laugh-out-loud moments reading books like \"The Wager,\" so I'll add your recommended book to my reading list!",
            "user": "Fit-Market-8036",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24pao/",
            "children": [
                {
                    "comment_id": "kr3mthw",
                    "parent_comment_id": "kr24pao",
                    "time_stamp_created": 1708321361.0,
                    "comment_text": "Yeah, same here! Gordon Korman's \"I Want To Go Home\" always makes me chuckle. It's one of those books that just never fails to make me laugh. What book made you laugh a lot?",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mthw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24yb2",
            "parent_comment_id": null,
            "time_stamp_created": 1708297779.0,
            "comment_text": "I've always found Calvin and Hobbes a riot! The way Bill Watterson captures the absurdity and imaginative humor of a 6-year-old boy can leave me in stitches. Although it's not a book, the comics are a fantastic read, and I come back to them time and again for my dose of laughter. Give them a read, and I'm sure they'll have you chuckling in no time!",
            "user": "bifferoniwithcheese",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24yb2/",
            "children": [
                {
                    "comment_id": "kr32sdm",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708311638.0,
                    "comment_text": "_\"Superfudge and Tales of a Fourth Grade Nothing are both hilarious! I still find myself chuckling when I re-read them. The antics of those boys never get old!\"_",
                    "user": "effronterie_lunaire",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32sdm/",
                    "children": []
                },
                {
                    "comment_id": "kr46evi",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708334470.0,
                    "comment_text": "*\"Superfudge and Tales of a Fourth Grade Nothing are two books that make me laugh every time I read them. As a kid, I related to Peter Hatcher's experiences and his brother Fudge's antics never fail to crack me up. Peter's sarcastic comments and Fudge's mischievous ways are still as entertaining now as they were when I first read these books as a child. I can't help but read them at least once a year!*\"",
                    "user": "christiegr8",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr46evi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr256dm",
            "parent_comment_id": null,
            "time_stamp_created": 1708297869.0,
            "comment_text": "Great choice with Gordon Korman! I was a big fan of his books as well growing up. Another book that made me laugh and I still find funny today is The Hitchhiker's Guide to the Galaxy by Douglas Adams. The humor in that book is just amazing, even more so the second and third time you read it. It really highlights the absurdity of life and our society, which always gets me laughing. Do you have any other recommendations for books with great humor? I'm always looking for new laughs!\n        \n        *For reference: This comment mimics the reddit user with history of liking lighthearted, humorous books, who enjoys discussing book recommendations with others, and has a tendency to make observations about the absurdity of life.*",
            "user": "FaeriePrinceArbear",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr256dm/",
            "children": [
                {
                    "comment_id": "kr2ginl",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708302428.0,
                    "comment_text": "Oh, those are fantastic recommendations! I've been meaning to check out The Martian and Project Hail Mary by Andy Weir for some time now. I've heard they're quite humorous. Gideon the Ninth also sounds intriguing, and I've been eyeing that one as well. Maybe it's time to dip my toes into some of these fun reads! 😊😊😊",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ginl/",
                    "children": []
                },
                {
                    "comment_id": "kr432v1",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708332006.0,
                    "comment_text": "Glad to see others appreciating the laugh-out-loud factor in books too! Andy Weir's The Martian was a solid laugh, and I also enjoyed Project Hail Mary. Gideon the Ninth, an audiobook favorite, definitely made me chuckle frequently as well!",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr432v1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr25k22",
            "parent_comment_id": null,
            "time_stamp_created": 1708298019.0,
            "comment_text": "I couldn't help but chuckle at I Want To Go Home by Gordon Korman. It's the perfect book for when you need a good laugh! The hapless teen protagonist and his incessant attempts to flee the island summer camp are just too relatable, and the humor never fails to amuse. Worth a re-read every year, in my opinion!",
            "user": "Sea_Negotiation_1871",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25k22/",
            "children": [
                {
                    "comment_id": "kr2fwb7",
                    "parent_comment_id": "kr25k22",
                    "time_stamp_created": 1708302178.0,
                    "comment_text": "ಠ\\_ಠ I'd say \"Good Omens\" is another one that still gets me chuckling. It's the absurdity of the concept and the witty banter between the two main characters that never fails to entertain. Plus, who doesn't love a good satire with a dash of cosmic horror? If you're in need of a good laugh, give it a read! *tips hat*",
                    "user": "nakedUndrClothes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fwb7/",
                    "children": [
                        {
                            "comment_id": "kr2kt9h",
                            "parent_comment_id": "kr2fwb7",
                            "time_stamp_created": 1708304166.0,
                            "comment_text": "They're right, though. Gordon Korman and Douglas Adams (Hitchhiker's Guide to the Galaxy) often bring a good laugh! I read them almost every year with how short they are, and especially the audio book version has me in stitches every single time.",
                            "user": "Sea_Negotiation_1871",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kt9h/",
                            "children": [
                                {
                                    "comment_id": "kr2pvs4",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708306233.0,
                                    "comment_text": "I've been laughing at I Want To Go Home for years now, but I've never heard of anyone else reading it! Maybe you should give it a try? It's the perfect book for when you need a good laugh.",
                                    "user": "kimmycat88",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pvs4/",
                                    "children": [
                                        {
                                            "comment_id": "kr2qa67",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708306397.0,
                                            "comment_text": "David Tennant and Michael Sheen playing their respective characters in the audio book is yet another gem that makes the book even more entertaining.",
                                            "user": "Sea_Negotiation_1871",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qa67/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kr3ayz0",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708315261.0,
                                            "comment_text": "Glad to hear that someone else still finds Gordon Korman hilarious! I have to say, the audio book version of I Want To Go Home, with David Tennant and Michael Sheen playing their respective characters, never fails to have me laughing out loud. 😄",
                                            "user": "raptor102888",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ayz0/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr5fl12",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708358027.0,
                                    "comment_text": "\"I do, my friend! Gordon Korman, especially I Want To Go Home, is a timeless classic that still makes me laugh every time I re-read it. You should give it a shot!\"",
                                    "user": "Liz_LemonLime",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5fl12/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr25z3o",
            "parent_comment_id": null,
            "time_stamp_created": 1708298185.0,
            "comment_text": "Pride and Prejudice. I didn't get far but I just...did not care. 🤔 But I have to admit that some of Wodehouse's humor in the Jeeves books still cracks me up. 😅\n        (I know this user has mentioned King, Koontz, and Wodehouse in the past. I tried to pick a book that would be different but still funny, taking into account their past comments.)\nUser 13: It's kind of interesting how you have to pick books that they have read before when it doesn't seem like they really read a lot when you see their comment history.\nUser 7: Yeah, it's really hard to pick a book that the user would enjoy when they have a pretty limited history of actual reading and even then it's not specified that they've finished the books they mention. I definitely had to do some guess work with this one, especially",
            "user": "EatYourCheckers",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25z3o/",
            "children": [
                {
                    "comment_id": "kr3hsvp",
                    "parent_comment_id": "kr25z3o",
                    "time_stamp_created": 1708318619.0,
                    "comment_text": "\"Lamb by Christopher Moore is another one that always makes me chuckle. The combination of ancient history, modern technology, and the supernatural is just too much sometimes. John Dies at the End by David Wong/Jason Pargin is also a favorite, with its wild concepts and non-stop action. They're both great reads if you're looking for a good laugh!\"",
                    "user": "PrincessZeldasLSD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hsvp/",
                    "children": [
                        {
                            "comment_id": "kr4xoz5",
                            "parent_comment_id": "kr3hsvp",
                            "time_stamp_created": 1708351106.0,
                            "comment_text": "That's great to hear! John Dies at the End is indeed a hilarious book. It's always nice to find others who appreciate it too. I found myself laughing out loud quite a bit while reading it.",
                            "user": "Comprehensive-Fun47",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4xoz5/",
                            "children": [
                                {
                                    "comment_id": "kr711sm",
                                    "parent_comment_id": "kr4xoz5",
                                    "time_stamp_created": 1708377106.0,
                                    "comment_text": "> The Zoey Ashe series by Gordon Korman is definitely worth a read if you're looking for laughter. I've been enjoying it myself and it might even surpass the I Want to Go Home series for me. Have a laugh! 👍🔥🤑🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀�������������������������������������������������������������������������������������������������������",
                                    "user": "PrincessZeldasLSD",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr711sm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2715h",
            "parent_comment_id": null,
            "time_stamp_created": 1708298601.0,
            "comment_text": ">\"I Want To Go Home still makes me laugh continually throughout the book. It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs.\"\n        \n        \n        >>That's a great choice! I remember reading that book when I was younger and loving the humor in it. The main character's constant complaints and attempts to escape really resonated with me. It's wonderful that you still find it funny and continue to re-read it.\n        <<END_ANSWER>>",
            "user": "Supraspinator",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2715h/",
            "children": [
                {
                    "comment_id": "kr30ae0",
                    "parent_comment_id": "kr2715h",
                    "time_stamp_created": 1708310568.0,
                    "comment_text": "I also love Mary Roach's books! The flying turd story in \"Packing for Mars\" still cracks me up every time I read it. And I've got to agree, the \"Pirx\" and \"Ijon Tichy\" by Stanislaw Lem are some good laughs too. Cheers!",
                    "user": "RamblingSimian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30ae0/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28emc",
            "parent_comment_id": null,
            "time_stamp_created": 1708299150.0,
            "comment_text": "Well, Twilight has never made me laugh, but I'm glad it works for some people! For me, it's always been Gordon Korman's books that hit the funny bone. The one that never fails to crack me up is \"I Want To Go Home.\" It's the hilarious commentary of a reluctant camper that keeps me coming back year after year.",
            "user": "the_man_in_the_box",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28emc/",
            "children": [
                {
                    "comment_id": "kr2r5kr",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708306751.0,
                    "comment_text": "Absolutely! Pride and Prejudice is a classic that can be surprisingly funny. It never fails to bring a smile to my face, and Rosamund Pike's narration makes it even more enjoyable. When I re-read it, I often find myself chuckling at Miss Bingley's snobbery or Mr. Darcy's initial arrogance. A fantastic read with a delightful sense of humor!",
                    "user": "AngelaVNO",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r5kr/",
                    "children": [
                        {
                            "comment_id": "kr3bs3x",
                            "parent_comment_id": "kr2r5kr",
                            "time_stamp_created": 1708315639.0,
                            "comment_text": "Pride and Prejudice has aged well for its humor! The annotated version added to the experience but even without it, Mr. Bennet's wit still brings a smile to my face. Glad to see others appreciated it too!",
                            "user": "Wingopf",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bs3x/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3j0ln",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708319257.0,
                    "comment_text": "😂😂😂 That's so cool that you enjoyed Pride and Prejudice more after listening to the audiobook! I've never tried that before, but I can see how it could make the characters come alive more for you. I've got to give it a shot sometime. As for me, I still love I Want To Go Home just as much as I did when I was a kid. I read it at least once a year, and those comments from the kid at summer camp never stop being funny! Keep finding those books that make you laugh! 😄📖👍🧩",
                    "user": "iIuvthesmiths",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j0ln/",
                    "children": []
                },
                {
                    "comment_id": "krcq9sh",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708464549.0,
                    "comment_text": "Pride and Prejudice, especially with the narration by Rosamund Pike, can be really funny. The audiobook version brings out some of the humor that may not have been as apparent when just reading the book by myself.",
                    "user": "nickelchap",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcq9sh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28kw9",
            "parent_comment_id": null,
            "time_stamp_created": 1708299219.0,
            "comment_text": "Im with you on Gordon Korman. I Want To Go Home is a classic. Another book that always makes me laugh is Yes Man, by Danny Wallace. Theres a certain charm to it, and I loved the movie adaptation with Jim Carrey too. Its a fun, easy read that never fails to bring a smile to my face. Im curious, have you read it? And do you have any other recommendations for books that make you laugh?",
            "user": "Raisey-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28kw9/",
            "children": [
                {
                    "comment_id": "kr2qe2g",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708306441.0,
                    "comment_text": "I can't believe I've never read that one! I love books with a historical element, and combining that with laugh-out-loud humor sounds perfect. I'll have to pick up a copy and see if it makes my re-read list. Thanks for the recommendation!\n\n        (This comment is made in the style of the user with a casual, friendly tone, and the response is relevant to the post topic while discussing the book mentioned in the comment of interest.)",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qe2g/",
                    "children": []
                },
                {
                    "comment_id": "krifmxi",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708551025.0,
                    "comment_text": "I didn't find The 100 Year Old Man Who Climbed Out of the Window and Disappeared to be particularly hilarious, but it does seem like an interesting read with a historical element. I'm more of a Gordon Korman fan myself - his books are pretty much guaranteed to make me laugh. My personal favorite is I Want To Go Home, which I find hilarious and still re-read every year just for the laughs. The main character's incessant comments are just too much! I'd recommend it if you're looking for a truly laugh-out-loud book.",
                    "user": "altavaddy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krifmxi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2af2b",
            "parent_comment_id": null,
            "time_stamp_created": 1708299959.0,
            "comment_text": "👏👏 Bravo on that pick, friend! The I Want To Go Home series is a classic! The main character's snarky comments never fail to crack me up. It's interesting that you find them hilarious - I find his struggles with the camp to be highly relatable, even if I wasn't trying to escape a camp 😂. Other light-hearted books that make me chuckle include, say, The Hitchhiker's Guide To The Galaxy by Douglas Adams or any book by Bill Bryson. I'd love to know what other books make you laugh every time you open them 😄.\n        \n        🤯🤯 In the interest of full disclosure, I also find Gordon Korman's \"Swindle\" to be a fun and humorous read, though it doesn't seem to fit the \"camp\" theme you mentioned. Hope this might spark a new adventure for your",
            "user": "hqsqotu",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2af2b/",
            "children": [
                {
                    "comment_id": "kr2fapd",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708301934.0,
                    "comment_text": "My favorite book that still makes me laugh is Gordon Korman's \"I Want To Go Home.\" It's a hilarious read about a teenager trying to escape from an island summer camp. I find his comments throughout the book to be consistently entertaining. But a new addition to my laughter list is Carl Hiaasen's \"Squeeze Me.\" I've recently read it and found it to be a total hoot! If you haven't given it a try, I'd highly recommend it! 😉",
                    "user": "halfferal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fapd/",
                    "children": [
                        {
                            "comment_id": "kr4krl1",
                            "parent_comment_id": "kr2fapd",
                            "time_stamp_created": 1708344591.0,
                            "comment_text": "Glad to hear you've got Squeeze Me on your book shelf! I've heard great things about Carl Hiaasen's novels, and as a fan of humor in books, I'm looking forward to reading that one myself. Cheers to light-hearted, laugh-out-loud reads!",
                            "user": "sageberrytree",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4krl1/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2tx7r",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708307889.0,
                    "comment_text": "I wholeheartedly agree, Carl Hiaasen's novels for adults are laugh-out-loud moments. Squeeze Me is such a delightful read, with its witty humor and satirical commentary on Florida's peculiarities. It's definitely going into my re-read list, just to get those chuckles all over again!",
                    "user": "nosnowjob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tx7r/",
                    "children": []
                },
                {
                    "comment_id": "kr3zfb8",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708329381.0,
                    "comment_text": "\"Oh, I love Carl Hiaasen's novels for adults! I just finished reading 'Squeeze Me', and it was such a hoot! He's got a unique way of blending humor, mystery, and Florida's idiosyncrasies. Definitely worth a read if you're looking for a light-hearted laugh!\"",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3zfb8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aohr",
            "parent_comment_id": null,
            "time_stamp_created": 1708300065.0,
            "comment_text": "\"Another one that had me laughing was 'I Want To Go Home' by Gordon Korman. It's about a teen trying to escape from an island summer camp he didn't want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs.\"\n        \n        <<ANSWER END>>",
            "user": "KaplanKingHolland",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aohr/",
            "children": [
                {
                    "comment_id": "kr30nko",
                    "parent_comment_id": "kr2aohr",
                    "time_stamp_created": 1708310725.0,
                    "comment_text": "I totally agree! The Fletch novels are a timeless comedy classic. They are always a good laugh no matter how many times I read them. And Pride and Prejudice is another one of those books that can bring a smile to my face no matter the occasion. The humor in Austen's writing is always clever and enjoyable.",
                    "user": "TheeCurtain",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30nko/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aw60",
            "parent_comment_id": null,
            "time_stamp_created": 1708300151.0,
            "comment_text": "I'm all about Gordon Korman but I've got to throw some love to Judy Blume too. Are You There God? It's Me, Margaret still cracks me up every time I read it. The 11-year-old's musings on bras and periods are just gold. Definitely a must-read, unless you're already over 11!",
            "user": "moomoopandabutt",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aw60/",
            "children": [
                {
                    "comment_id": "kr2vqqu",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708308649.0,
                    "comment_text": "I've read Cannery Row by Steinbeck and I can absolutely agree with that! Steinbeck truly has a unique ability to blend humor with the raw realities of life, and Cannery Row is no exception. The characters and situations depicted in the book are certainly entertaining and memorable. Great pick!",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2vqqu/",
                    "children": []
                },
                {
                    "comment_id": "kr3artf",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708315170.0,
                    "comment_text": "\"Wow, Cannery Row by Steinbeck was also brilliant at finding that balance between humor and realism! I actually haven't read it for a while but it's definitely a contender for my annual 'laugh-a-thon' reading list. Sometimes, I'll pull it out for a dose of good humor coupled with a bit of nostalgia.\"",
                    "user": "tenglish_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3artf/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2dz4l",
            "parent_comment_id": null,
            "time_stamp_created": 1708301395.0,
            "comment_text": "I second Gordon Korman's \"I Want To Go Home.\" That book never fails to crack me up! Here's another one that consistently has me laughing - \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. The absurdity of the situations and the wit in the dialogue are simply hilarious. I would also recommend \"A Catcher in the Rye\" by J.D. Salinger, especially the repeated jokes about the character's sister. It's a classic case of dry humor that still tickles me even after multiple reads.",
            "user": "nightpop",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2dz4l/",
            "children": [
                {
                    "comment_id": "kr3t1i3",
                    "parent_comment_id": "kr2dz4l",
                    "time_stamp_created": 1708325120.0,
                    "comment_text": "Absolutely! The John Dies at the End series is fantastic dark comedy. I've enjoyed the hell out of it. Looking forward to reading Zoey Punches the Future in the Dick too! Keep those hilarious recommendations coming!",
                    "user": "lurkerlcm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3t1i3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2f97t",
            "parent_comment_id": null,
            "time_stamp_created": 1708301917.0,
            "comment_text": "I used to love Gordon Korman books too, especially \"This Can't Be Happening at Macdonald Hall,\" which still brings a smile to my face. I remember laughing so hard when I first read it and it's one of those books I revisit when I need a good chuckle.\n\n         And as for interlibrary loans, that's a great idea! I hadn't thought of that. Thanks for sharing!\n\n         P.S. I remember the incessant comments in \"I Want To Go Home\" too, they're hilarious! It's nice to know that book still makes you laugh. :D",
            "user": "fuzzyrach",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2f97t/",
            "children": [
                {
                    "comment_id": "kr2i0q9",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708303040.0,
                    "comment_text": "Yea, Allie Brosch's Hyperbole and a Half is definitely on that list, too. The comics about her childhood and her dog are absolute gold! I've reread them so many times, and I still end up wiping tears from my eyes.",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2i0q9/",
                    "children": [
                        {
                            "comment_id": "kr4swvn",
                            "parent_comment_id": "kr2i0q9",
                            "time_stamp_created": 1708348932.0,
                            "comment_text": "I had no idea Gordon Korman could compete with Allie Brosch's humor! Give \"I Want To Go Home\" a try if you haven't yet. I can see how you'd find it quite amusing. And hey, if you happen to be having trouble getting a hold of any other humorous books, don't forget about interlibrary loans. They just might have the book you're looking for!",
                            "user": "fuzzyrach",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4swvn/",
                            "children": [
                                {
                                    "comment_id": "kr4vsqm",
                                    "parent_comment_id": "kr4swvn",
                                    "time_stamp_created": 1708350265.0,
                                    "comment_text": "I have a soft spot for music-related jokes, and that title grabbed my attention! I haven't read that book, but based on Kenny Loggins and Christmas, I'm imagining the plot might include a comical twist on the usual holiday cheer. I'll have to give it a try someday. On the other hand, Gordon Korman's humor is legendary, especially I Want to Go Home. That kid's commentary never fails to crack me up!",
                                    "user": "BlueKanary11",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4vsqm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2loz2",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708304527.0,
                    "comment_text": "That's another great book to make you laugh! I still remember reading Allie Brosh's Hyperbole and a Half and just burst out laughing the whole time. It's so relatable, and I can definitely see why it's considered a classic in the humor category. I find myself laughing and revisiting certain parts of it occasionally, too. It's a wonderfully funny gem to have in our reading collection. Keep the book recommendations coming!",
                    "user": "PreciousandReckless",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2loz2/",
                    "children": [
                        {
                            "comment_id": "kr38vqg",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708314316.0,
                            "comment_text": "I also love Allie Brosch's Hyperbole and a Half. It's comforting and always makes me laugh. Maybe I'll read it again soon too!",
                            "user": "getaladybug",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr38vqg/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3uxpo",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708326336.0,
                            "comment_text": "> That's another great one! I still love reading Hyperbole and a Half by Allie Brosh. It's a comforting read that never fails to make me laugh out loud. Just the thought of going back to it now makes me smile. Have a great time revisiting its hilarious entries!",
                            "user": "High_Stream",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3uxpo/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3efi6",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708316921.0,
                    "comment_text": "hyuck\\_hyuck\\_1234: \n        \n        \n        Ahh! Yes! Allie Brosch - hyperbole and a half. Snort laugh out loud, tears steaming down my face, can't catch my breath funny! That's probably one of my all-time favorites. The stick figure comics always have me giggling like a lunatic. Definitely a must-read for some good old giggles! 😂🤣🙌",
                    "user": "ohnoitsgravity",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3efi6/",
                    "children": []
                },
                {
                    "comment_id": "kr41sa0",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708331053.0,
                    "comment_text": "Yep, that one always gets me. The stick figure comics where she depicts those embarrassing moments that you never want anyone to know about, but we all secretly (or not so secretly) relate to. Those comics bring on the giggles, every time. 😅\n\n        \n        (In case you're curious, Allie Brosch's webcomic Hyperbole and a Half is a collection of stick figure comics depicting her life, mostly centered around her embarrassing and awkward experiences. You can find it online or in book format. - Narrator)\n\n        \n        [Referring to the original comment's book The I Want To Go Home]\n        \n        Ain't nothing like a good old summer camp escape story to set your spirits free and your laughter rolling. 😄 Keep those books comin', my friend!\n\n        (In case you're",
                    "user": "jennief158",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41sa0/",
                    "children": []
                },
                {
                    "comment_id": "kr4ta5z",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708349108.0,
                    "comment_text": "Oh, \"Hyperbole and a Half\" by Allie Brosh is another one that has me laughing out loud! The illustrations, coupled with her relatable anecdotes and self-deprecating humor, always leave me in stitches. It's a great addition to the list! :)",
                    "user": "Captain_Swing",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ta5z/",
                    "children": []
                },
                {
                    "comment_id": "kr76rhy",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708378967.0,
                    "comment_text": "That's great to hear, Allie Brosch's \"hyperbole and a half\" is indeed a hilarious read! I remember chuckling through my first time reading it and it still brings smiles to my face when I revisit it. It's a unique blend of humor, storytelling, and relatable situations that makes it a must-read. Definitely a book to add to our laughing book list!",
                    "user": "hypothalanus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76rhy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2gofs",
            "parent_comment_id": null,
            "time_stamp_created": 1708302494.0,
            "comment_text": "I second Gordon Korman. I Want To Go Home is a classic! Also, Three Men in a Boat by Jerome K. Jerome is another hilarious one. And, for something a bit different, give Good Omens by Neil Gaiman and Terry Pratchett a try. It's a fun read!",
            "user": "Lumpyproletarian",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gofs/",
            "children": [
                {
                    "comment_id": "kr37l26",
                    "parent_comment_id": "kr2gofs",
                    "time_stamp_created": 1708313730.0,
                    "comment_text": "Glad to see another reader of Gordon Korman! I Want To Go Home is a classic. Speaking of classics, Cold Comfort Farm is another book that never fails to make me laugh. Aunt Ada Doom's quirks are pure genius! Keep on reading and laugh away! 😉",
                    "user": "imaginarywaffleiron",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37l26/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2grax",
            "parent_comment_id": null,
            "time_stamp_created": 1708302526.0,
            "comment_text": "\"I've never read Rendezvous with Rama, but I remember Gordon Korman books being a staple for me growing up. I love the humor in I Want To Go Home. I'd still love to hear about other books that made you laugh and still do.\"",
            "user": "maurymarkowitz",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grax/",
            "children": [
                {
                    "comment_id": "kr4nooc",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708346263.0,
                    "comment_text": "Tom Jones is a book I've never read, but from the comment you made, it sounds like a good addition to my humor literature list. I'm intrigued by the scene involving the character remembering his mother, especially if it was played for laughs several centuries ago. I'll have to look for a copy soon to see for myself. Thank you for this recommendation!",
                    "user": "Valuable-Berry-8435",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4nooc/",
                    "children": []
                },
                {
                    "comment_id": "kr7wh77",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708388122.0,
                    "comment_text": "I've also stumbled upon books that had me laughing out loud, even long after I've read them. One such book is \"Tom Jones\" by Henry Fielding. There's a scene at the end that had me laughing so hard it earned me strange glances from folks at the bus station. Spoiler alert: >!Tom, who's been in and out of jails for various reasons, finds out that his friend had discovered his romantic escapades, but not with the usual lady... it's his mother!< Yes, it's humor that stands the test of time! I might have to revisit that book soon to get a chuckle or two!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7wh77/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2janz",
            "parent_comment_id": null,
            "time_stamp_created": 1708303553.0,
            "comment_text": "I've never read Gordon Korman, but after reading your comment I'm going to have to check him out! I'm a big fan of humor in books, especially when it's irreverent and a bit off the beaten path. My all-time favorite hilarious book is probably Catch-22 by Joseph Heller. The satire and absurdity of that book still holds up, even after multiple readings. I also enjoy Salman Rushdie's Midnight's Children, which is filled with humor and satire, as well as Kurt Vonnegut's Slaughterhouse-Five. Both are masterful examples of how to weave in humor while still delivering a powerful and thought-provoking story.",
            "user": "freemason777",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2janz/",
            "children": [
                {
                    "comment_id": "kr2y3h3",
                    "parent_comment_id": "kr2janz",
                    "time_stamp_created": 1708309640.0,
                    "comment_text": "I also found \"The Road\" by Cormac McCarthy quite funny in a dry, dark sort of way. Despite its grim subject matter, there are some genuinely hilarious moments scattered throughout the book. It's a strange dichotomy, but it worked surprisingly well for me. Perhaps it's the absurdity of humanity enduring even in the direst of situations.",
                    "user": "aenteus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y3h3/",
                    "children": [
                        {
                            "comment_id": "kr2ydbn",
                            "parent_comment_id": "kr2y3h3",
                            "time_stamp_created": 1708309756.0,
                            "comment_text": "\"Ooh, I've had Suttree in my sights for a while now. I've heard it's quite a dark, humorous read, especially if you're into avant-garde literature. I'll be sure to give it a go when I'm ready for some mental, literary gagging.\"",
                            "user": "freemason777",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ydbn/",
                            "children": [
                                {
                                    "comment_id": "kr2ykg5",
                                    "parent_comment_id": "kr2ydbn",
                                    "time_stamp_created": 1708309840.0,
                                    "comment_text": "I completely agree! I can still remember laughing out loud while reading BM and never looking at a watermelon the same way again. Those books are a great source of entertainment! Gordon Korman's I Want To Go Home is another gem that never fails to make me chuckle.",
                                    "user": "aenteus",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ykg5/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2kfy4",
            "parent_comment_id": null,
            "time_stamp_created": 1708304018.0,
            "comment_text": "I haven't read Gordon Korman's books, but I've heard of him before. I can see why you find his humor appealing! I also enjoy a good laugh in my books. There's one book that always makes me chuckle - it's called \"A Walk in the Woods\" by Bill Bryson. It's a hiking memoir and it's just... well, the humor is so dry and the author's sarcasm is so on point that I can't help but laugh out loud. I'd recommend it if you're looking for another light-hearted read! 😊\n        \n         Here's a little quote to give you a taste:\n        \n         >I never would have survived a year in wilderness; I would have starved or fallen out of a tree or gotten lost.\n\n         Oh, and PS, no worries about the cringe factor! We all have",
            "user": "Low_Marionberry3271",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kfy4/",
            "children": [
                {
                    "comment_id": "kr36vhg",
                    "parent_comment_id": "kr2kfy4",
                    "time_stamp_created": 1708313418.0,
                    "comment_text": "That's a great question! The kids book \"How To Eat Fried Worms\" made me laugh as a child, and I find the kids are still quite funny when I reread it. I also recently discovered \"The Bartimaeus Trilogy\" by Jonathan Stroud, and I absolutely love the demon's witty footnotes filled with social criticism. Those definitely make me laugh out loud on every read!",
                    "user": "TabTnz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36vhg/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2l46e",
            "parent_comment_id": null,
            "time_stamp_created": 1708304289.0,
            "comment_text": "I must admit, I've always been a sucker for a good laugh, especially when it comes to books. One that immediately comes to mind is \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. Its absurd humor and the hilarious alien species like the Vogons manage to keep me grinning from beginning to end. Another book that never fails to tickle my funny bone is \"Catch-22\" by Joseph Heller. Despite its serious subject matter, the absurd humor, dark wit, and unique characters never cease to make me chuckle. And lastly, I can't forget \"Three Men in a Boat\" by Jerome K. Jerome, a classic comedic tale of three friends' humorous experiences while rowing down the Thames. But as much as I love these books, your choice, \"I Want To Go Home\" by Gordon Korman, sounds like a real laughter-ind",
            "user": "cramerws",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2l46e/",
            "children": [
                {
                    "comment_id": "kr2zmg1",
                    "parent_comment_id": "kr2l46e",
                    "time_stamp_created": 1708310283.0,
                    "comment_text": "ಠ\\_ಠ I can see why that book makes people laugh. The wild, unpredictable antics and humorous descriptions of Hunter S. Thompson's experiences during the 1972 Presidential election campaign are both absurd and entertaining. I've not read it myself, but I've heard great things!",
                    "user": "BZRich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zmg1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2pgzb",
            "parent_comment_id": null,
            "time_stamp_created": 1708306064.0,
            "comment_text": "I second Gordon Korman! I Want to Go Home is still one of my favorites. Loved that kid and his persistent attempts to escape the island camp. It's timeless humor. Another one that's always a laugh is The Ransom of Red Chief by O. Henry. The ending never fails to crack me up!",
            "user": "-ohhellno-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pgzb/",
            "children": [
                {
                    "comment_id": "kr3fptq",
                    "parent_comment_id": "kr2pgzb",
                    "time_stamp_created": 1708317562.0,
                    "comment_text": "\"Ah, Secret Diary of Adrian Mole! That book always had me chuckling. I'd definitely include that in my list of books that still make me laugh. The awkwardness and the self-deprecating humor are spot on!\"",
                    "user": "ejp77777",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3fptq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2qqd9",
            "parent_comment_id": null,
            "time_stamp_created": 1708306581.0,
            "comment_text": "\"Ah, I completely agree! Gordon Korman's books were a huge part of my childhood laughter. 'I Want To Go Home' is a gem, isn't it? The protagonist's relentless comments never fail to make me chuckle. Another book that always puts a smile on my face is 'The Hitchhiker's Guide to the Galaxy' by Douglas Adams. The humor is just... otherworldly! 😄\"",
            "user": "Repulsive-Process-67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qqd9/",
            "children": [
                {
                    "comment_id": "kr3ge3y",
                    "parent_comment_id": "kr2qqd9",
                    "time_stamp_created": 1708317904.0,
                    "comment_text": "Ha! I've heard good things about \"I, Partridge\" by Alan Partridge. I'd love to add it to my list of books that make me laugh. That particular question about the ISBN number cracked me up. Reminds me of a similar part in \"I Want To Go Home\" where the main character complains about having to read War and Peace for a school assignment. Good times, good times.",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ge3y/",
                    "children": [
                        {
                            "comment_id": "kr3xlfj",
                            "parent_comment_id": "kr3ge3y",
                            "time_stamp_created": 1708328120.0,
                            "comment_text": "I know what you mean about that. Some books just have a way of making you laugh, even during tough times. Gordon Korman's books certainly do that for me, and it looks like we have another in common with Alan Partridge. I've always found the audiobooks to be the best part of the Partridge \"experience\". It's always a great pick-me-up, and I might just listen to it again right now myself. Cheers!",
                            "user": "Repulsive-Process-67",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xlfj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2r93h",
            "parent_comment_id": null,
            "time_stamp_created": 1708306790.0,
            "comment_text": "Leave my beloved Judge Holden out of this! He's much more than a man, he's a force of nature. His philosophy in Blood Meridian, \"That which exists without my knowledge exists without my consent,\" still resonates with me. It's an American question isn't it? You guys are all too busy reading self-help books when you should be reading literature like Cormac McCarthy's instead. ;)",
            "user": "TwoJointsJay",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r93h/",
            "children": [
                {
                    "comment_id": "kr2wjge",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708308986.0,
                    "comment_text": "Thanks for the suggestion! I'm always looking for more books to add to my list. I'll definitely check out \"Wilt\" by Tom Sharpe, or is it Sharp? It sounds like a good laugh and I love discovering lesser-known authors. Thanks again! 😊",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2wjge/",
                    "children": []
                },
                {
                    "comment_id": "kr425fl",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331320.0,
                    "comment_text": "Reading Wilt by Tom Sharpe (or Sharp) sounds like a great addition to my list! I'll make sure to give it a read. Thanks for the recommendation! I'll probably laugh throughout the whole book as well, much like with I Want To Go Home by Gordon Korman. Can't wait to see how it compares!",
                    "user": "RunTheJawns",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr425fl/",
                    "children": []
                },
                {
                    "comment_id": "kr42zai",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331932.0,
                    "comment_text": "Wilt by Tom Sharp (or is it Sharpe?) is also a book that's often overlooked but definitely worth a read if you haven't yet. The author's satirical humor and wit are spot on, and the book never fails to make me chuckle. The story of a pompous academic who becomes the Vice-Chancellor of an absurd and dysfunctional university is a great source of humor. Definitely another addition to the list of books that continue to make me laugh! Thanks for the recommendation!",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr42zai/",
                    "children": []
                },
                {
                    "comment_id": "kr4fb32",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708341016.0,
                    "comment_text": "*Wilt* by Tom Sharpe is a hilarious book that I added to my regular re-read list after the first read. The protagonist, Wilt, finds himself in a series of absurd and funny situations that kept me laughing all the way through. In his own words, \"I have lived a life quite different to most, I have been a student, a prisoner of war, a professional gambler, an impresario, a diplomat... I am Wilt, and this is my story.\" I would highly recommend *Wilt* to anyone looking for a good laugh. Thanks for the recommendation! (P.S. I think you meant Sharpe)",
                    "user": "Euni1968",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fb32/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rffj",
            "parent_comment_id": null,
            "time_stamp_created": 1708306861.0,
            "comment_text": "I loved Roald Dahl's \"The Witches\" growing up! The narrator's voice and the hilarious yet disturbing situations make it a classic for me. As an adult, I found \"Fight Club\" by Chuck Palahniuk quite amusing as well. It's a dark comedy with a unique narrative, that somehow never ceases to crack me up!",
            "user": "Ganglio_Side",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rffj/",
            "children": [
                {
                    "comment_id": "kr3lahq",
                    "parent_comment_id": "kr2rffj",
                    "time_stamp_created": 1708320500.0,
                    "comment_text": "I second Jennifer Wright's Get Well Soon, it's a great read! I also love Dave Barry's Guide to Guys, it's a hoot! Eats, Shoots and Leaves is another one I can't stop laughing at. I've re-read all of those books multiple times and they never fail to entertain me.",
                    "user": "kitterkatty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lahq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rvwi",
            "parent_comment_id": null,
            "time_stamp_created": 1708307050.0,
            "comment_text": "1. Swindle by Gordon Korman, the story of a 12-year-old boy who tries to start his own sports memorabilia company, conning his classmates into selling their belongings, and faces the consequences when things go off the rails.\n        2. Catcher in the Rye by J.D. Salinger, the story of a 16-year-old boy named Holden Caulfield, who's just been expelled from school, and his six-day odyssey through New York City. It's known for it's dark humor and wit.\n        3. The Hitchhiker's Guide to the Galaxy by Douglas Adams, a comedic science fiction series following the adventures of the last known human being, Arthur Dent, as he adapts to an alien universe.\n        4. Hyperbole and a Half: Unfortunate Situations, Fl",
            "user": "rocknrollstar67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rvwi/",
            "children": [
                {
                    "comment_id": "kr3mlyy",
                    "parent_comment_id": "kr2rvwi",
                    "time_stamp_created": 1708321242.0,
                    "comment_text": "That's a great choice! I've always found James Thurber's humor delightfully absurd. His New Yorker essays are a treat, especially when you need a good laugh. I should give those a re-read! :laughing: Keep laughing! 📚👍",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mlyy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2ujcc",
            "parent_comment_id": null,
            "time_stamp_created": 1708308145.0,
            "comment_text": "I've never encountered Gordon Korman's work! I'm adding \"I Want To Go Home\" to my reading list immediately! I'm always up for a good laugh!\n\n        Another book that makes me laugh is \"Dear Dumb Diary\" series by Jim Benton. It's a childhood favorite, and I find the witty humor and self-effacing protagonist's observations always make me chuckle. It's another one I go back to again and again!\n\n        Great picks, everyone! Happy reading and laughing! 😂😊🥰📚",
            "user": "wackotaco",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ujcc/",
            "children": [
                {
                    "comment_id": "kr3k6qb",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708319890.0,
                    "comment_text": "Totally agree! Calvin and Hobbes is a classic for a reason. I still crack up every time I re-read those books. Can't beat the humor in those strips.",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k6qb/",
                    "children": [
                        {
                            "comment_id": "kredvmw",
                            "parent_comment_id": "kr3k6qb",
                            "time_stamp_created": 1708486679.0,
                            "comment_text": "That's awesome! I've always been a fan of big, hardcover anthologies. I've got a few on my shelf and they're always a pleasure to revisit. I've found that humor has a way of transcending time and age. It's one of the reasons I still find myself chuckling at some of the books I enjoyed as a kid. Keep on laughing, friend!",
                            "user": "utellmey",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kredvmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6t559",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708374522.0,
                    "comment_text": "I'd have to agree with you on that! Calvin and Hobbes is always a good chuckle. They certainly know how to spin a comic strip that's full of humor and wisdom. I appreciate the witty and thought-provoking comics just as much now as I did when I first started reading them. Keep Calvin and Hobbes in circulation, it's one of the books that truly does never fail to make us smile.",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6t559/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x2pg",
            "parent_comment_id": null,
            "time_stamp_created": 1708309211.0,
            "comment_text": "\"I second John Scalzi, Old Man's War. That scene where the protagonist names his AI assistant 'Asshole' is still one of the funniest things I've ever read.\"",
            "user": "Lahm0123",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x2pg/",
            "children": [
                {
                    "comment_id": "kr3owir",
                    "parent_comment_id": "kr2x2pg",
                    "time_stamp_created": 1708322577.0,
                    "comment_text": "\"John Scalzi, Old Man's War is another book that still has me grinning from ear to ear. The premise is so absurdly ridiculous yet brilliantly fun, it's hard not to fall into the whirlwind of action, wit, and sarcastic humor. I've re-read it more times than I can count, and it never fails to surprise me with its take on military service, aging, and a fresh perspective on the human condition.\"",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3owir/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x7ha",
            "parent_comment_id": null,
            "time_stamp_created": 1708309266.0,
            "comment_text": "I used to love Judy Blume's books as well! I still think she has a great sense of humor. I'd have to add 'Are You There God? It's Me, Margaret' to the list of books that make me laugh. That book is just so relatable and funny, especially for young girls.",
            "user": "NurseT3825",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x7ha/",
            "children": [
                {
                    "comment_id": "kr3ns5q",
                    "parent_comment_id": "kr2x7ha",
                    "time_stamp_created": 1708321915.0,
                    "comment_text": "I've never had the pleasure of reading books by Janet Evanovich, but based on your comment, I might just have to give them a try! Grandma Mazur sounds like a character I'd enjoy a good laugh with. Maybe one day I'll find myself re-reading them too.",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ns5q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2yflk",
            "parent_comment_id": null,
            "time_stamp_created": 1708309782.0,
            "comment_text": "I had to think about it but the book that still makes me laugh is \"Catch-22\" by Joseph Heller. I read it back in college and the absurdity of the situations and characters keeps me coming back for more. The main character, Yossarian, is so relatable and the satire is spot on. If I need a good laugh, I'll pick up \"Catch-22\" and never be disappointed.",
            "user": "WorldMusicLab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2yflk/",
            "children": [
                {
                    "comment_id": "kr684dk",
                    "parent_comment_id": "kr2yflk",
                    "time_stamp_created": 1708367560.0,
                    "comment_text": "I've seen some great laugh-inducing books in my time, but Christopher Moore's works never fail to make me chuckle. Douglas Adams, especially his Hitchhiker's Guide to the Galaxy series, is an absolute comedy classic. And speaking of classics, John Varley's Steel Beach is an intriguing mix of humor, emotion, and thought-provoking concepts. But if I had to pick one, I'd go with Douglas Adams. His unique brand of humor and the absurdity of the situations he creates never cease to amuse me.",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr684dk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr31cad",
            "parent_comment_id": null,
            "time_stamp_created": 1708311017.0,
            "comment_text": "\"The Chronicles of Amber by Roger Zelazny is another book that makes me chuckle. I read it every decade or so, and I find something new to appreciate each time. The witty banter and the magical world it creates are truly unique.\"",
            "user": "johnhenryc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr31cad/",
            "children": [
                {
                    "comment_id": "kr62um2",
                    "parent_comment_id": "kr31cad",
                    "time_stamp_created": 1708365822.0,
                    "comment_text": "As a fan of humor and lighthearted reading, I highly recommend Woody Allen's short story collections such as \"Without Feathers\" and \"Side Effects.\" They always bring a smile to my face, and I revisit them from time to time when I need a laugh. The quirky humor, the absurd situations, and the subtle social commentary in his stories are truly delightful. I find it amusing how Allen uses personal stories to analyze human behavior and vulnerabilities. If you haven't read them yet, give them a try—I guarantee they'll make you laugh and perhaps even introspect!",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr62um2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr324cj",
            "parent_comment_id": null,
            "time_stamp_created": 1708311348.0,
            "comment_text": "I've never read Gordon Korman before, but hearing about I Want To Go Home sounds interesting! I'll definitely add that to my reading list if it keeps making people laugh. In my experience, I find that the humour in David Sedaris' essays don't miss a beat either. He's got a unique sense of humor that I find incredibly entertaining and always leaves me laughing.",
            "user": "Derpshab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr324cj/",
            "children": [
                {
                    "comment_id": "kr3p26e",
                    "parent_comment_id": "kr324cj",
                    "time_stamp_created": 1708322670.0,
                    "comment_text": "Paladin Grace is a great book! I remember laughing quite a bit when I read that. The combination of humor and medieval setting really worked well for me. I find myself going back to that book every once in a while for a good chuckle. Keep sharing your favorite laugh-out-loud reads with us!\n        (Referencing the user's previous comment history, I'm not recommending manga but just acknowledging the genre as a good choice for certain readers.)",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p26e/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr34w82",
            "parent_comment_id": null,
            "time_stamp_created": 1708312552.0,
            "comment_text": "I Want To Go Home also gets me every time. And for the record, I think Flashman is a great series, but it's a totally different humor from Korman. Korman's humor is more broad and slapstick, while Flashman is wittier and more sophisticated. Both have their place, but they appeal to different senses of humor.",
            "user": "TheRedditoristo",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34w82/",
            "children": [
                {
                    "comment_id": "kr3gv3s",
                    "parent_comment_id": "kr34w82",
                    "time_stamp_created": 1708318143.0,
                    "comment_text": "I can't believe I haven't thought of that series before! I'll definitely have to add those to my list. I've heard great things about them too. Gordon Korman's books are amazing, but the Flashman novels seem like a fresh addition to my re-reads list. Thanks for the suggestion! I'll likely laugh my way through those books as well now.",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3gv3s/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr35ifx",
            "parent_comment_id": null,
            "time_stamp_created": 1708312819.0,
            "comment_text": "1st grade, Mr. Gosh: I remember picking up this book in elementary school and being instantly hooked. It was the first chapter book I ever read! Now, every time I read it, it still makes me laugh. The story of a group of 1st graders planning a classroom rebellion is just hilarious, and I feel like it speaks to the inner rebel in all of us. A must-read for anyone who wants a good laugh!",
            "user": "CardinalPhallic",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ifx/",
            "children": [
                {
                    "comment_id": "kr3kc2q",
                    "parent_comment_id": "kr35ifx",
                    "time_stamp_created": 1708319970.0,
                    "comment_text": "I've not read 'Lamb' by Christopher Moore, but it sounds like a good addition to my list. I'll have to give it a try!",
                    "user": "Karelkolchak2020",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3kc2q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr36nn1",
            "parent_comment_id": null,
            "time_stamp_created": 1708313321.0,
            "comment_text": "I've never read Gordon Korman before, but after reading your description I am now intrigued and will have to check out I Want To Go Home. His humor definitely sounds my kind of humor!",
            "user": "shaunananagins",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36nn1/",
            "children": [
                {
                    "comment_id": "kr3pwhc",
                    "parent_comment_id": "kr36nn1",
                    "time_stamp_created": 1708323170.0,
                    "comment_text": "\"TJ Klune books are absolute winners for bringing on stupid giggles! My personal favorite of his is 'The Extraordinary Ordinary', which gives me the giggles every time. His books might cause more than just laughter, with their ability to provoke intense thoughts, tears, and vivid imagination.\"",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3pwhc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3cm94",
            "parent_comment_id": null,
            "time_stamp_created": 1708316041.0,
            "comment_text": "I second Gordon Korman - I Want to Go Home is a classic! Another book that always makes me chuckle is Pride and Prejudice by Jane Austen. The ridiculousness of some of the characters' situations and Ms. Austen's wit never fails to amuse me. What an excellent question! I could go on and on about books that make me laugh...",
            "user": "isle_say",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3cm94/",
            "children": [
                {
                    "comment_id": "kr3qvrc",
                    "parent_comment_id": "kr3cm94",
                    "time_stamp_created": 1708323763.0,
                    "comment_text": "That's a great recommendation! I've always enjoyed the Adrian Mole series as well. The humor in those books is so distinctive, and it's one of those series that never fails to elicit a chuckle or two. Kudos on finding such an excellent read! Gordon Korman's books are definitely entertaining, but there's something special about delving into the life of such an eccentric character as Adrian Mole. Happy reading!",
                    "user": "bigapple2908",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qvrc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3ncv6",
            "parent_comment_id": null,
            "time_stamp_created": 1708321673.0,
            "comment_text": "I don't have many books that make me laugh, but one that definitely does is \"Catch-22\" by Joseph Heller. The absurdity and dark humor in the narrative create a unique and amusing reading experience. It's a book I wouldn't hesitate to recommend to anyone looking for a good laugh.",
            "user": "dwayne_jetski69",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ncv6/",
            "children": [
                {
                    "comment_id": "kr64jr2",
                    "parent_comment_id": "kr3ncv6",
                    "time_stamp_created": 1708366380.0,
                    "comment_text": "Been awhile since I read much Vonnegut, but Galapagos was fantastic. I need to get back to rereading that one. I also laughed my way through The Hitchhiker's Guide to the Galaxy the first time and I continue to do so whenever I revisit it! Two great books for a good laugh!",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr64jr2/",
                    "children": [
                        {
                            "comment_id": "kr67fdx",
                            "parent_comment_id": "kr64jr2",
                            "time_stamp_created": 1708367331.0,
                            "comment_text": "Really? That's interesting! I love Vonnegut's work, and I'd say Galapagis is certainly one of his darker works. I understand why some might find it too heavy, but for me, it's what makes it so compelling. I'll have to revisit it soon and see if it still holds up! Have you read any of his other books that you found particularly funny or thought-provoking? Either way, keep exploring those books that make you laugh or challenge your thinking! 👍🌍📚📖",
                            "user": "dwayne_jetski69",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr67fdx/",
                            "children": [
                                {
                                    "comment_id": "kr6fq6i",
                                    "parent_comment_id": "kr67fdx",
                                    "time_stamp_created": 1708370068.0,
                                    "comment_text": "*\"I always find that humor in the darkest of situations is what really gets me. The way Vonnegut was able to weave in wit and subtle satire in Player Piano made it a truly memorable read. It's a book that keeps me laughing, even if the humor is a bit twisted.*\n\n         *I've always admired how Vonnegut could tackle such serious and complex themes while still making us chuckle. And with those clever asterisks to signal impending doom, it adds an extra layer of intrigue and humor. Brilliant!*\"",
                                    "user": "prole6",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6fq6i/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr3r4dh",
            "parent_comment_id": null,
            "time_stamp_created": 1708323913.0,
            "comment_text": "I really enjoyed the works of Douglas Adams as a teen, especially The Hitchhiker's Guide to the Galaxy. The humor is witty and wry, and it always makes me chuckle. Even re-reading it now, I can't help but crack a smile. It's like meeting up with an old friend who never loses their sense of humor, no matter how much the world changes around them.",
            "user": "ridingfasst",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r4dh/",
            "children": [
                {
                    "comment_id": "kr483qc",
                    "parent_comment_id": "kr3r4dh",
                    "time_stamp_created": 1708335727.0,
                    "comment_text": "Glad to see IWiGH finding a new reader! It's such a fun book, isn't it? I still love it as much now as I did back in the 80's. Thanks for reminding me to give it to someone else I care about! Also, I'll have to add _Fierce Invalids Home From Got Climates_ to my re-read list. I've heard some great things about it and it makes me laugh just thinking about the title.",
                    "user": "speed-of-dark",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr483qc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3w5zs",
            "parent_comment_id": null,
            "time_stamp_created": 1708327152.0,
            "comment_text": "*DNF: The Custom of the Country by Edith Wharton: I *loved* The Age of Innocence and The House of Mirth, and to some degree Ethan Frome, but this book was insufferable. I understand the main character Undine Spragg is not meant to be likeable, but she's so shallow and passive for a determined social climber. The supporting cast is not much better and one dimensional.*\n\n        I can totally relate to that. The House of Mirth and The Age of Innocence are two of my favorite books, but Custom of the Country was not for me. I found Undine Spragg to be quite a challenging character to read about. I'm glad you still enjoy rereading The Age of Innocence and The House of Mirth, though. Those are two real gems in the literary world! :)",
            "user": "somebd",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3w5zs/",
            "children": [
                {
                    "comment_id": "kr7xhe4",
                    "parent_comment_id": "kr3w5zs",
                    "time_stamp_created": 1708388508.0,
                    "comment_text": "I've never read Lamb: The Gospel According to Biff, Christ's Childhood Pal by Christopher Moore, but it sounds like an interesting mix of comedy and religion. Emma by Jane Austen, however, is a hilarious classic! I've laughed so many times while reading it. The witty dialogues and clever humor are a treat to read, and it's always a delight to revisit!\n\n        It's great that you appreciate books that can bring a smile to your face. I'm a big fan of that too!\n\n        By the way, you mentioned that you work at a local library and use it quite a bit. My local library also has a fantastic collection! I love browsing the shelves and discovering new titles. Libby is also a wonderful app for checking out e-books! Have you tried it?\n\n        Keep on reading and enjoying the laughter! :)",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7xhe4/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr4q4ew",
            "parent_comment_id": null,
            "time_stamp_created": 1708347558.0,
            "comment_text": "If you're a fan of Kurt Vonnegut, you might enjoy the short stories from \"Welcome to the Monkey House.\" It's a collection published in the 1970s, and each story is a tight, brilliantly written nugget. I still have the ISBN numbers if you need them, for good measure. 😀 Keep reading and enjoy! All my best -J-",
            "user": "Plenty-Oil-1392",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4q4ew/",
            "children": [
                {
                    "comment_id": "kr58oa8",
                    "parent_comment_id": "kr4q4ew",
                    "time_stamp_created": 1708355543.0,
                    "comment_text": "*\"I thoroughly agree on 'Catch 22.' It is a timeless masterpiece that never fails to tickle my funny bone. It's fascinating to see such a varied range of perspectives on humor, but Heller's dark and witty narrative captures my laughter every single time. In addition to 'Catch 22,' I'd like to toss in 'The Hitchhiker's Guide to the Galaxy' by Douglas Adams. It's the perfect mix of absurdity, satire, and pure zany hilarity. Reading it always brings a smile to my face, even in the grimmest of times.*\n\n         *Another book that consistently provokes chuckles is 'Fool Moon' by Jim Butcher. It's urban fantasy done right, with some unexpected humor thrown in for good measure. I love the way Butcher weaves wit and sarcasm into the narrative, making his characters end",
                    "user": "nh_outdoorguy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr58oa8/",
                    "children": []
                }
            ]
        }
    ]
}