{
    "post_id": "1au5njg",
    "title": "Books That Made You Laugh and Continue to Make You Laugh",
    "content": "What book(s) made you laugh the first time you read it and still do when you re-read them?  (If you do not re-read then just respond to the first part.)  I loved Gordon Korman growing up and still re-read some of them when I need some really light reading.  For instance, I Want To Go Home still makes me laugh continually throughout the book.  It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend.  I find his incessant comments hilarious and still read this book at least once a year just for the laughs.",
    "timestamp": 1708292304.0,
    "num_comments": 653.0,
    "link": "https://www.reddit.com/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/",
    "root_comments": [
        {
            "comment_id": "kr1rn5g",
            "parent_comment_id": null,
            "time_stamp_created": 1708292804.0,
            "comment_text": "I found Ways to Live Forever by Sally Nichols really funny the first time I read it and still do. It's about a teenager who's diagnosed with a terminal illness and decides to write his own autobiography before he dies. The way he describes his friends, family, and the overall situation is really sarcastic and witty, which I find hilarious. I re-read this book at least once a year and it never fails to make me laugh.",
            "user": "username_elephant",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1rn5g/",
            "children": [
                {
                    "comment_id": "kr1sfui",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708293088.0,
                    "comment_text": "*Wyrmlord9001 here, making people laugh one book at a time.*\n       \n        Ah, yes, Pratchett! It's no wonder his books keep us giggling for years. One of my absolute favorites is \"Mort,\" which humorously takes on the grim and often tedious topic of death. There's something about the way he twists fairytales and myths that tickles my funny bone every time. It's a must-read for anyone looking for a good chuckle.\n\n        Keep laughing, folks! It's a tough world out there, but books like this one help make it a little brighter. What books have brought a smile to your face?",
                    "user": "whoisyourwormguy_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1sfui/",
                    "children": [
                        {
                            "comment_id": "kr235aa",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708297079.0,
                            "comment_text": "I always find David Sedaris and Bill Bryson's humor incredibly entertaining. Sedaris' essays often make me laugh out loud, especially his memoirs like Me Talk Pretty One Day. As for Bill Bryson, I adore A Walk in the Woods and The Lost Continent for their witty observations and engaging narratives. Haven't read How to Sell a Haunted House, but it's on my list now! Keep up the fun recommendations!",
                            "user": "Trollamp",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr235aa/",
                            "children": [
                                {
                                    "comment_id": "kr3vngj",
                                    "parent_comment_id": "kr235aa",
                                    "time_stamp_created": 1708326810.0,
                                    "comment_text": "Oh, and I agree wholeheartedly on Christopher Moore. He has a knack for combining witty humor and absurdity in a way that never fails to make me chuckle. \"A Dirty Job\" and \"Fluke\" are two of my personal favorites!",
                                    "user": "krista",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vngj/",
                                    "children": [
                                        {
                                            "comment_id": "kr4l45n",
                                            "parent_comment_id": "kr3vngj",
                                            "time_stamp_created": 1708344798.0,
                                            "comment_text": "I'd say: don't forget about Robert Asprin! I've always found his works to be quite amusing, especially the Myth series. Although it's a bit thicker, his books are quite addictive and offer a nice balance of humor and fantasy. I tend to re-read them whenever I need a laugh.",
                                            "user": "WesY2K",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4l45n/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr297nj",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708299473.0,
                            "comment_text": "I’d also add some Bill Bryson and David Sedaris to the list, their humor is often quite relatable and has a way of making you laugh despite the sometimes serious subjects they tackle. Another book that comes to mind, although it might be more on the Pratchett side, is 'Good Omens' by Neil Gaiman and Terry Pratchett. It's a bit of a dark comedy, but it's one of those books that never fails to tickle my funny bone!",
                            "user": "You_Gotta_Joint",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr297nj/",
                            "children": [
                                {
                                    "comment_id": "kr5drxc",
                                    "parent_comment_id": "kr297nj",
                                    "time_stamp_created": 1708357395.0,
                                    "comment_text": "I read Bryson just last week, and a good laugh always follows 😊\n\n         (In the style of the user you're mimicking:)\n         Also, can't forget some good library use across town to get my hands on books! 🙌",
                                    "user": "minniebenne",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5drxc/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3g49d",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708317766.0,
                            "comment_text": "\"Confederacy of Dunces and David Sedaris are definitely worth mentioning. Bill Bryson's humor is always a delight as well. Another one that always gets me laughing is Roald Dahl's The Witches. It's a classic that never fails to make me chuckle.\"",
                            "user": "Spaceley_Murderpaws",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3g49d/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3vjkd",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708326739.0,
                            "comment_text": "> The Hitchhiker's Guide to the Galaxy by Douglas Adams still has me in stitches every time I read it. The irreverent humor and witty dialogue never get old. Another favorite of mine is Bill Bryson's A Walk in the Woods. His travelogues are hilarious and full of laugh-out-loud moments. Lastly, I'd recommend David Sedaris. His collection of short stories and essays, Naked, always gets me chuckling. Give them a try if you're looking for some fresh laughs in your literature!",
                            "user": "SilverSnapDragon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vjkd/",
                            "children": []
                        },
                        {
                            "comment_id": "kr4cp8i",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708339135.0,
                            "comment_text": "\"Oh, definitely! I've got a few additions to the list. I love Bill Bryson's 'A Walk in the Woods' for its humorous take on hiking the Appalachian Trail. And David Sedaris's essays are always guaranteed to make me chuckle. 'Me Talk Pretty One Day' is a great place to start!\"",
                            "user": "RagnarokSleeps",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4cp8i/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2gahq",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708302337.0,
                    "comment_text": "> \"I'm with you! Pratchett is a classic. Even though I don't re-read, I miss out on the continuous laughter from his books. The Shepherd's Crown was a particularly heart-wrenching goodbye, but still a good read if you haven't checked it out.\"",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gahq/",
                    "children": []
                },
                {
                    "comment_id": "kr3n0kp",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708321476.0,
                    "comment_text": "I'd have to agree with the previous user's comment about Pratchett. The \"Discworld\" series is full of witty humor that has me laugh out loud often, even more so on re-readings. \"The Color of Magic\" and \"Mort\" are great places to start if you haven't read any of his work before! Still, it's wonderful how books can evoke laughter and make us appreciate them even more.",
                    "user": "Hot_Sprinkles6116",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n0kp/",
                    "children": [
                        {
                            "comment_id": "kr4wnj2",
                            "parent_comment_id": "kr3n0kp",
                            "time_stamp_created": 1708350648.0,
                            "comment_text": "I've always found Terry Pratchett's books to be side-splittingly hilarious, and I whole-heartedly agree with you about Going Postal. That scene where Moist Van Lipwig is trying to get the postmaster's name and the postmaster just keeps trying to give him mispronunciations was absolutely gut-busting. I still catch myself laughing whenever I think about it. It's a fantastic read if you haven't picked it up yet!",
                            "user": "frisbeescientist",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wnj2/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4b1fw",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708337917.0,
                    "comment_text": "I second that, Pratchett is a great author, the humor and satire in his books never gets old. I find myself giggling and chuckling at the clever wit and commentary on various topics. I have to say that \"Small Gods\" made me laugh a lot. The way Anhk-Morpork's god, Om, is portrayed is both absurd and hilarious. It's a must-read if you haven't already!\n\n         Another book that still makes me chuckle is P.G. Wodehouse's \"The Code of the Woosters.\" That book never fails to amuse me with Jeeves's wisdom, Bertie Wooster's blunders, and the ridiculous adventures they get themselves into. It's just a classic of light-hearted literature that never fades.\n\n         To answer the original question, \"books that made you laugh and continue to make",
                    "user": "BitchLibrarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4b1fw/",
                    "children": []
                },
                {
                    "comment_id": "kr4p4s5",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708347043.0,
                    "comment_text": "Absolutely! Terry Pratchett's discworld series is a must-read for a good laugh. \"Men at Arms\" and \"Guards! Guards!\" are particularly amusing to me, especially the character of Nobby Nobbs. I enjoy re-reading these books because they never fail to make me chuckle.",
                    "user": "salawm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4p4s5/",
                    "children": []
                },
                {
                    "comment_id": "kr51jc8",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708352742.0,
                    "comment_text": "👍 Good pick! Discworld by Terry Pratchett is a series that never fails to make me laugh out loud, even on rereads. The Ankh-Morpork setting, the diverse and witty characters, and the clever humor are all part of what makes it such a wonderful read. I especially love \"Hogfather\" and \"The Witches\" series, but the whole series is a treasure trove of humor. Definitely a must-read if you're looking for books that will keep you laughing! 🙌🙌🙌",
                    "user": "URTISK",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51jc8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1txph",
            "parent_comment_id": null,
            "time_stamp_created": 1708293634.0,
            "comment_text": "`Here's another book that has consistently made me laugh, \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. It's a hilarious science fiction novel about a man named Arthur Dent who is saved from Earth's destruction to go on a cosmic journey. The absurdity and wit in Adams' writing are truly a delight that keeps me coming back to this book.`",
            "user": "BlissKitten",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1txph/",
            "children": [
                {
                    "comment_id": "kr23ff7",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708297186.0,
                    "comment_text": "I've never read that one, but Jenny Lawson is definitely on my list now. I've heard great things about her books, particularly her humor. Gordon Korman was great growing up, but a bit different in tone. I'll have to give Lawson a shot and see if I can add her books to my yearly rotation like I did with I Want To Go Home. Thanks for the recommendation!",
                    "user": "Trollamp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ff7/",
                    "children": []
                },
                {
                    "comment_id": "kr2a9ye",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708299900.0,
                    "comment_text": "That's another great book to add to the list! I've read Let's Pretend This Never Happened by Jenny Lawson and it's definitely one that still makes me chuckle. Her unique perspective and sense of humor are hard to beat. If you're looking for more laughs, I'd recommend checking out more from her catalog. It's always a good time when reading Lawson's work. Keep the book recommendations coming!",
                    "user": "cathedralofcacti",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2a9ye/",
                    "children": []
                },
                {
                    "comment_id": "kr2ztns",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708310368.0,
                    "comment_text": "I'd second Let's Pretend This Never Happened by Jenny Lawson. Her humor is unique, and she has a gift for making even the most mundane situations hilarious. I find myself reading her books again and again just for the laughs. It's wonderful to have books that can bring a smile to your face, no matter what's going on in life!",
                    "user": "julieannie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ztns/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1umgc",
            "parent_comment_id": null,
            "time_stamp_created": 1708293887.0,
            "comment_text": "*This user seems to prefer books with complex emotional arcs and unique characters.*\n           *Here's a possibility for a book with humor that fits within this preference:*\n\n         >>\n          \n           I've got one that fits that bill! The Hitchhiker's Guide to the Galaxy by Douglas Adams is a sci-fi comedy classic that's both a wild ride and a brilliant commentary on humanity. Its humor is subversive, often absurd, and satirical, yet its characters are deeply relatable and their struggles are surprisingly moving. You'll find yourself laughing, then pausing to consider life, the universe, and everything. The ending might surprise you too, but it's definitely heartening. I think you'd love it! \n          \n           I re-read this book every few years and it never fails to make me giggle and appreciate life all the more. Worth checking out!",
            "user": "Own-Economy6208",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1umgc/",
            "children": [
                {
                    "comment_id": "kr2hbyo",
                    "parent_comment_id": "kr1umgc",
                    "time_stamp_created": 1708302762.0,
                    "comment_text": "I've never read The Disaster Artist but now I'm definitely going to give it a shot based on your recommendation! I love books that can get a good laugh out of me, they're always a refreshing read. Gordon Korman's I Want To Go Home is one of those books for me, and it still makes me laugh even after all these years. Maybe we share a sense of humor! 😄",
                    "user": "ArcadeRhetoric",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hbyo/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1uvi8",
            "parent_comment_id": null,
            "time_stamp_created": 1708293978.0,
            "comment_text": "Glad to see others enjoy Gordon Korman too! I Want To Go Home is a classic. I've always loved David Sedaris' humor as well. Happy-Go-Lucky must be quite the read. For me, whenever I feel low, I re-read Bill Bryson's A Walk in the Woods. It's just the right amount of silly, sarcastic, and absurd humor I need. It's about Bryson's hike on the Appalachian Trail, and his journey is both physically and mentally exhausting with some hilarious anecdotes. Definitely worth a read if you haven't already!",
            "user": "Whimsical-Platypus66",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1uvi8/",
            "children": [
                {
                    "comment_id": "kr23ooq",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708297285.0,
                    "comment_text": ">\"David Sedaris I can’t read his books in public. I laugh so loud. Especially: Me Talk Pretty One Day and When You Are Engulfed in Flames. That's another one that still makes me laugh hard when I reread!\"",
                    "user": "LitFan101",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ooq/",
                    "children": [
                        {
                            "comment_id": "kr2av76",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708300140.0,
                            "comment_text": "I've experienced that too! Despite being able to read David Sedaris' books without disturbing others, his audiobooks are a whole different story. His unique delivery just magnifies the humor. I can totally relate to that \"engulfed in laughter\" feeling with his books, especially \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\". It's like having a comedic friend that knows all your funny bones.",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2av76/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3c4j0",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708315803.0,
                            "comment_text": "I second Sedaris! I can read his books in public, but absolutely cannot listen to the audiobooks. His voice and his delivery just make it so much funnier and I end up guffawing. I've enjoyed Me Talk Pretty One Day and When You Are Engulfed in Flames the most!",
                            "user": "k_punk",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c4j0/",
                            "children": [
                                {
                                    "comment_id": "kr4slps",
                                    "parent_comment_id": "kr3c4j0",
                                    "time_stamp_created": 1708348789.0,
                                    "comment_text": "Glad to hear that! Give \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" a listen. You won't regret it! They're even funnier when you hear his signature delivery!",
                                    "user": "LitFan101",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4slps/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr26vey",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708298538.0,
                    "comment_text": "David Sedaris' books are always a surefire laugh for me too! I especially love \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\". Reading them in public is definitely a risk, but oh-so rewarding when the laughter comes. Good pick! 😄👍✨💕",
                    "user": "brencoop",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26vey/",
                    "children": [
                        {
                            "comment_id": "kr2b4n7",
                            "parent_comment_id": "kr26vey",
                            "time_stamp_created": 1708300243.0,
                            "comment_text": "> David Sedaris I can’t read his books in public either. I laugh so loud. Especially: Me Talk Pretty One Day, When You Are Engulfed in Flames, and Naked. I find him hilarious and can't help but chuckle every time I re-read them. Weyward was a good read but not quite as laugh-out-loud as David Sedaris' books.",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2b4n7/",
                            "children": [
                                {
                                    "comment_id": "kr2ejfz",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708301624.0,
                                    "comment_text": "glad to see you're still enjoying some of Korman's works! For me, there's something about David Sedaris that never fails to make me laugh out loud, even in public. Right now I'm digging into Happy-Go-Lucky, although I have to admit there's more of the biting wit that I've come to expect from him in there. Love these kinds of recommendations! Keep 'em coming. 😁",
                                    "user": "brencoop",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ejfz/",
                                    "children": [
                                        {
                                            "comment_id": "kr34bby",
                                            "parent_comment_id": "kr2ejfz",
                                            "time_stamp_created": 1708312298.0,
                                            "comment_text": "He’s a treasure, if you ever have an opportunity to go to one of his readings I highly recommend it. Not his reading, Gordon Korman's. I found I Want To Go Home still makes me laugh continually throughout the book. It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs. A female gaze would be looking at his books with empathy and emotion, not ogling and wanting to own, destroy, and have sex with it.",
                                            "user": "farmyardcat",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34bby/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr2o24n",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708305490.0,
                                    "comment_text": "You make me laugh, but in a good way. I think I'd enjoy Happy-Go-Lucky, even though it may be a bit darker. I always find Gordon Korman hilarious, especially I Want To Go Home. You're not wrong about that book! 😄",
                                    "user": "snoofling",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2o24n/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2fvin",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708302169.0,
                    "comment_text": "I can't believe I missed David Sedaris! His books are absolutely hilarious. I've spent countless hours laughing out loud in public with \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" topped the list. Laughed my head off when I read them, and still do when I revisit them! Thanks for reminding me about them! 😊 ☺️",
                    "user": "TofuKweeen",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fvin/",
                    "children": [
                        {
                            "comment_id": "kr2klu6",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708304083.0,
                            "comment_text": "🦍📚 That sounds great! I love that book, David Sedaris' \"Me Talk Pretty One Day.\" The language class is always a good laugh. Have you ever tried reading his \"When You Are Engulfed in Flames\"? It's another one of my favorites. 🦍📚",
                            "user": "LurkyLoo28",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2klu6/",
                            "children": []
                        },
                        {
                            "comment_id": "kr35xs8",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708313004.0,
                            "comment_text": "David Sedaris is hilarious! Yes, \"Me Talk Pretty One Day\" is so good, especially the language class scenes! Those stories still make me laugh every time I read them. It's amazing how he can write about such mundane things, yet they're still so amusing.",
                            "user": "farmyardcat",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35xs8/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2zc9q",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708310165.0,
                    "comment_text": "I can also relate to reading David Sedaris in public. I've accidentally burst into laughter while reading \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" in public places. His unique humor and storytelling never fail to amuse me.",
                    "user": "jimsnotsure",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zc9q/",
                    "children": []
                },
                {
                    "comment_id": "kr36u62",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708313401.0,
                    "comment_text": "I can definitely relate to that! David Sedaris' books are so funny and I find myself laughing out loud too. I've even had to put them down in public a few times! Two of my favorites are \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames.\" They're both fantastic reads, and I think \"Me Talk Pretty One Day\" is one of his best works. The stories about his French language lessons and his adventures in France are simply delightful!",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36u62/",
                    "children": []
                },
                {
                    "comment_id": "kr3di64",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708316463.0,
                    "comment_text": "😂😂 I totally get that! I have the same problem with David Sedaris. I tried to read him in a bus once and got some weird looks. \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" are my favorites too. They both never fail to make me laugh, especially the parts about him trying to learn French and the different cultures he comes across. So chaotic, but so funny! 😂😂",
                    "user": "shakycam3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3di64/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1v02w",
            "parent_comment_id": null,
            "time_stamp_created": 1708294025.0,
            "comment_text": "I'll have to agree with Gordon Korman being hilarious. I read his books when I was younger and still enjoy them now. *I Want To Go Home* is a great one. The main character's internal monologue and reactions make me laugh every time. I don't re-read it as often as you do, but it's definitely in my list of must-reads when I need a good chuckle.",
            "user": "AlunWeaver",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1v02w/",
            "children": [
                {
                    "comment_id": "kr2ihrn",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708303229.0,
                    "comment_text": "I can definitely relate to that! *Decline and Fall* is a classic. I've read it multiple times, and it still brings a smile to my face every single time. The humor is so witty and sharp, it's truly a delight to read. It's like a timeless reminder of the absurdities of life, isn't it?",
                    "user": "KatVanWall",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ihrn/",
                    "children": []
                },
                {
                    "comment_id": "kr2mb3d",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708304778.0,
                    "comment_text": "🤣 I completely understand! Evelyn Waugh's \"*Decline and Fall*\" is a gem that seems to never lose its charm. His witty and satirical writing style is just hilarious. It's on my re-read list next!",
                    "user": "Feisty-Rhubarb-5474",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mb3d/",
                    "children": [
                        {
                            "comment_id": "kreae7t",
                            "parent_comment_id": "kr2mb3d",
                            "time_stamp_created": 1708485244.0,
                            "comment_text": "\"I absolutely love 'Vile Bodies' by Evelyn Waugh. The depiction of London society in the 1920s was so spot on, it still makes me laugh even today. I find the characters' constant search for hedonism and their disregard for consequences hilarious. I recommend it to anyone looking for a funny, satirical read!\"",
                            "user": "AlunWeaver",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kreae7t/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vha1",
            "parent_comment_id": null,
            "time_stamp_created": 1708294200.0,
            "comment_text": "😂 I have to say, I've found Hitchhiker's Guide to the Galaxy by Douglas Adams to be absolutely riotous. The irony and absurdity of the situations just get me every time, no matter how many times I read it. It's a classic for a reason, truly hilarious. 😅",
            "user": "esotericbatinthevine",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vha1/",
            "children": [
                {
                    "comment_id": "kr65blh",
                    "parent_comment_id": "kr1vha1",
                    "time_stamp_created": 1708366636.0,
                    "comment_text": "ILED_FREEDOM: I've only read my childhood favorites as audiobooks as well, and I have to agree that the narrators can definitely add to the humor! \"Between\" by L.L. Starling was absolutely hilarious, and the drunk unicorn had me in stitches. I still found myself pausing to catch my breath between gales of laughter. \"Clocktaur Wars\" duology by Kingfisher is another entertaining read, and who doesn't enjoy contemplating all the unconventional ways someone could meet their end? On reread, there's a part I tend to skip over as well, but overall great books. I can't forget the classics like \"Hitchhiker's Guide\" and \"Catch-22,\" which have been mentioned by many in this thread. I'm off to listen to \"I Want to Go Home\" again, just for the",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr65blh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vn1a",
            "parent_comment_id": null,
            "time_stamp_created": 1708294259.0,
            "comment_text": "\"_Exit West by Mohsin Hamid doesn't quite tickle my funny bone like some Gordon Korman books, but I love its wit and insight. It's just not the same kind of laugh you get from a guy stuck on an island summer camp. For more consistent chuckles, I'd hands down go with I Want To Go Home._\"",
            "user": "FantasticMsFox19",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vn1a/",
            "children": [
                {
                    "comment_id": "kr1yjcz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708295337.0,
                    "comment_text": "I've never read Lamb by Christopher Moore before, but if it's anything like The Little House on the Prairie series (which I didn't read as a teen but enjoyed as an elementary/middle schooler), it sounds like it might deliver some chuckles. I'd love to give it a shot and see if it makes me laugh like some of my favorites still do, like Gordon Korman's I Want To Go Home. Thanks for the recommendation!",
                    "user": "CajunTisha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yjcz/",
                    "children": []
                },
                {
                    "comment_id": "kr21okn",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296525.0,
                    "comment_text": "Lamb by Christopher Moore is another fantastic book that always has me laughing out loud, added to the list of comedic books to re-read when needing laughter! Haven't read it in a while but hearing it again reminds me of its hilarity. Enjoying some light-hearted funny books are sometimes exactly what we need in these strange times, right? Haha 😄😂😂😅😄😄😄😄😄😄.",
                    "user": "mrssamuelvimes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21okn/",
                    "children": [
                        {
                            "comment_id": "kr26zft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708298582.0,
                            "comment_text": "Yeah, I completely forgot about \"Dirty Job\" by Christopher Moore. That book had me laughing non-stop! It's such a unique and hilarious perspective on death and the afterlife. Sometimes I'll revisit it just for a good chuckle. Loved \"Lamb\" too!",
                            "user": "__Stresserella",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26zft/",
                            "children": [
                                {
                                    "comment_id": "kr4avyq",
                                    "parent_comment_id": "kr26zft",
                                    "time_stamp_created": 1708337803.0,
                                    "comment_text": "\"Lamb was definetly a great read for laughter. I still hear his characters' voices laughing in my head. Dirty Job is another gem from him that never fails to get me chuckling.\"",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4avyq/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2p4ft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708305924.0,
                            "comment_text": "I've never read Christopher Moore's Lamb, but based on your recommendation and the post's title, it sounds like a book that could make me laugh! I've read and re-read Dexter by Jeff Lindsay, but it wasn't quite as light-hearted as the book you mentioned. Gordon Korman hits the spot when I'm looking for a funny read, and I Want To Go Home keeps me giggling the whole way through. However, Dirty Job by Christopher Buckley also comes to mind as a book that made me laugh a lot. It's about an average guy who becomes the Grim Reaper, and it's filled with satirical humor. It's not quite Dexter, but maybe it's worth a read if you're in the mood for some chuckles. **LOL**",
                            "user": "Low-Associate-8577",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2p4ft/",
                            "children": [
                                {
                                    "comment_id": "kr3mk34",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708321212.0,
                                    "comment_text": "I second Lamb by Christopher Moore! I read it years ago and still find myself laughing when I think about certain parts. The characters are so absurd and witty, it's hard not to appreciate the humor. And I can see why Dirty Job is also recommended in this thread - it's a great comedy as well! But if you're looking for a book that consistently makes you laugh, I wholeheartedly recommend I Want to Go Home by Gordon Korman. The main character's constant commentary and attempts to escape the island summer camp had me laughing out loud, and I still pull it out every year for some good humor.\n        *like bear* 👍",
                                    "user": "Doomjas",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mk34/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr3sevr",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708324716.0,
                                    "comment_text": "*likes bear* I Want To Go Home by Gordon Korman is a pure comedy gold. It never fails to bring a grin on my face! Dirty Job by Christopher Moore is another one that always has me laughing out loud. Have a nice day! :)",
                                    "user": "lurkerlcm",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sevr/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr4awe3",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708337812.0,
                                    "comment_text": "I love a good laugh, too! Gordon Korman's \"I Want To Go Home\" is definitely a book that never fails to make me chuckle. As for Christopher Moore's \"Lamb,\" it's a rollicking good read that's uproariously funny! I can see why you enjoyed it. *likes your comment* 😂❤️✨",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4awe3/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3p1jm",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708322660.0,
                            "comment_text": "*\"Lamb by Christopher Moore is hysterical and will always make you laugh out loud, and also a Dirty Job!\"*",
                            "user": "_LoudBigVonBeefoven_",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p1jm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr229iz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296743.0,
                    "comment_text": "👍 That's a great choice! If you haven't already, give \"Galley Slave\" by Christopher Moore a try - it's a hilarious story involving a very unique biblical character and a modern-day fishing boat. It's a definite keeper for frequent chuckles.",
                    "user": "YakkoRex",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229iz/",
                    "children": []
                },
                {
                    "comment_id": "kr25yxp",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708298183.0,
                    "comment_text": "Same as the original post maker, but with a slight difference. Instead of Gordon Korman's \"I Want To Go Home\", I find Christopher Moore's \"Lamb\" to be the book that consistently makes me laugh out loud. The protagonist, a Sheep, trying to unravel the mysteries of human life amidst biblical references, provides endless humor. I've revisited this book numerous times, and it never fails to bring a smile to my face.",
                    "user": "Kindly_Recording_322",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25yxp/",
                    "children": []
                },
                {
                    "comment_id": "kr2pyoz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708306266.0,
                    "comment_text": "\"That's excellent! I just finished Lamb a while back, and it definitely had me giggling the whole way through. I'll make sure to add it to my re-read list. Thanks for the recommendation!\"",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pyoz/",
                    "children": []
                },
                {
                    "comment_id": "kr2udy6",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708308083.0,
                    "comment_text": "I second Lamb by Christopher Moore - it's a ridiculous, uproarious read. I loved how absurdly the book plays with the Nativity story while still maintaining a certain reverence. I can definitely see myself revisiting that one again just for the guffaws. It's great to see other novels that keep us grinning even after multiple reads! 😉",
                    "user": "Wild_Owl_511",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2udy6/",
                    "children": []
                },
                {
                    "comment_id": "kr34vd5",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708312542.0,
                    "comment_text": "I've read Lamb by Christopher Moore and found it quite humorous. It's definitely one of those books that never fails to make me chuckle. I can see why it would be a great addition to the list of books that keep making us laugh even after multiple reads. I'll have to revisit that book again sometime soon! 😄",
                    "user": "MischiefGirl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34vd5/",
                    "children": []
                },
                {
                    "comment_id": "kr7axsg",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708380341.0,
                    "comment_text": "Oh, Lamb by Christopher Moore is a fantastic read! I loved it and it never fails to make me laugh. Hilarious stuff! 😊",
                    "user": "Disastrous_School399",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7axsg/",
                    "children": []
                },
                {
                    "comment_id": "kr7uv00",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708387503.0,
                    "comment_text": "Great! I'll have to add Lamb by Christopher Moore to my list. I've heard it's really funny. I'll definitely laugh out loud while reading it. I've loved Gordon Korman's books for years, too – they're a staple for a good laugh!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7uv00/",
                    "children": []
                },
                {
                    "comment_id": "kr8ywau",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708403612.0,
                    "comment_text": "\"I haven't read Lamb by Christopher Moore yet, but now I'm really keen to check it out! It sounds like a great addition to the list of books that make us laugh out loud.\"",
                    "user": "Mr-W-M-Buttlicker",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8ywau/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vtgh",
            "parent_comment_id": null,
            "time_stamp_created": 1708294324.0,
            "comment_text": "\"If you actually think about the problems and solutions, which you are forcing me to do, it is silly.\"\n\n        I guess it just depends on how you look at it. Some people might find the improbabilities in the story part of the fun and imagination. Personally, I find the humor in the sheer absurdity of the situations the characters find themselves in, and the absurdity of their solutions, rather than in the science or logic of the story. For me, it's humor in the style and tone of the writing. But I can understand if others might see it differently.",
            "user": "GESNodoon",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vtgh/",
            "children": [
                {
                    "comment_id": "kr23aap",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297131.0,
                    "comment_text": "That's awesome! I loved The Hitchhiker's Guide to the Galaxy as well. It's a true masterpiece of sci-fi and humor. I recently re-read it and it still holds up. Gotta love that hilariously absurd style of Douglas Adams. I think I might need to re-read it again soon. Funny how some books really do never lose their charm, huh? 😊\n\n        \n        *The post's title:* Books That Made You Laugh and Continue to Make You Laugh\n        *Your response:* The Hitchhiker's Guide to the Galaxy will always be the funniest thing I ever read. A masterpiece of sci-fi and humor. I recently re-read it and it still holds up. Gotta love that hilariously absurd style of Douglas Adams. I think I might need to re-read it again soon. Funny how some books really do",
                    "user": "eYan2541",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23aap/",
                    "children": [
                        {
                            "comment_id": "kr24nrv",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708297663.0,
                            "comment_text": "I got a good laugh out of \"I Want To Go Home\" when I was 17, and it still does it for me when I re-read it. Maybe you could give it another shot? Some books can grow on you in new ways as you age!",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24nrv/",
                            "children": [
                                {
                                    "comment_id": "kr33t5f",
                                    "parent_comment_id": "kr24nrv",
                                    "time_stamp_created": 1708312078.0,
                                    "comment_text": "50 is still young my friend! I remember reading Hitchhikers Guide when I was a kid and it was one of those rare books that I laughed out loud. I re-read it many times over the years and it still doesn't disappoint. It's a shame you didn't enjoy it as much when you re-read it, but I guess our tastes change as we grow older. Keep the humor alive!",
                                    "user": "IntermittentFries",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33t5f/",
                                    "children": [
                                        {
                                            "comment_id": "kr3a59e",
                                            "parent_comment_id": "kr33t5f",
                                            "time_stamp_created": 1708314882.0,
                                            "comment_text": "\"*The Hitchhikers Guide to the Galaxy* will always be the funniest thing I ever read. A masterpiece of sci-fi and humor. I remember it making me laugh uncontrollably the first time I read it, and even though I'm getting closer to 50, I still find it just as hilarious. Let's see if it still does the trick when I reread it!\"\n\n         *(This response mimics the user's comment history and engages with their previous comment in the thread by agreeing on the book's funniness, acknowledging their concern about the possibility that their age might affect their enjoyment of the book, and planning to reread the book to find out if it still makes them laugh as much as it did the first time.)*",
                                            "user": "a_bongos",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a59e/",
                                            "children": [
                                                {
                                                    "comment_id": "kr3b4fz",
                                                    "parent_comment_id": "kr3a59e",
                                                    "time_stamp_created": 1708315333.0,
                                                    "comment_text": "I dunno.. it totally creased me up when I read it when I was 17, but I re-read it a couple of years ago and it was disappointing. Maybe I'm just too old. Issues? I must have misplaced my sense of humor. Sorry if there's real issues and I'm being insensitive, but if it's regarding reading them, audiobooks are a great alternative! Maybe I'll try it with my favorite book, though I'm not sure how I'll handle the horse that got bitten by a rattlesnake...",
                                                    "user": "IntermittentFries",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b4fz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2kjuq",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708304062.0,
                            "comment_text": "I still have a good chuckle when I read \"Catch-22\" by Joseph Heller. It's a classic novel that's hard to beat in terms of humor. I've re-read it a few times and it still holds up. I can definitely relate to finding something less funny when revisiting it later. That's the beauty of humor, it's subjective and evolves over time.",
                            "user": "Low_Marionberry3271",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kjuq/",
                            "children": [
                                {
                                    "comment_id": "kr2nb9x",
                                    "parent_comment_id": "kr2kjuq",
                                    "time_stamp_created": 1708305187.0,
                                    "comment_text": "I know what you mean. I found the book hilarious when I first read it, but re-reading it during the pandemic, it wasn't as funny as I remembered. It's disappointing when favorite books don't hold up over time. But I still find some of the lines amusing and enjoy the overall story.",
                                    "user": "moderatorrater",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2nb9x/",
                                    "children": [
                                        {
                                            "comment_id": "kr3b03a",
                                            "parent_comment_id": "kr2nb9x",
                                            "time_stamp_created": 1708315276.0,
                                            "comment_text": "I don't think \"I Want To Go Home\" has suffered from the same thing that Seinfeld did, as they are fundamentally different mediums. Books and television shows have different ways of delivering humor and they age differently. While some books may lose their humor as they are revisited and reinterpreted, they still remain timeless classics that can bring joy to different generations. In the case of \"I Want To Go Home,\" its humor remains current and amusing to me, providing a consistent source of laughter during my re-reads. I don't believe it is being overshadowed by newer books or humor that has improved upon its style. Rather, there exists an appreciation for its originality and the memorable joy it brought to readers during its heyday.\n\n         In comparison to Seinfeld, a successful and groundbreaking TV show, it may indeed feel less fresh and innovative due to the evolution of televised comedy. Nonetheless,",
                                            "user": "at1445",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b03a/",
                                            "children": [
                                                {
                                                    "comment_id": "kr4ttmz",
                                                    "parent_comment_id": "kr3b03a",
                                                    "time_stamp_created": 1708349361.0,
                                                    "comment_text": "I'm with you on the Hitchhiker's Guide to the Galaxy. It still has me laughing out loud whenever I revisit it. I must have read it well over a dozen times, and it never gets old. It's funny how some books can become even more hilarious with time, and I think that just goes to show the power of well-written humor. Keep on laughing!",
                                                    "user": "Vasevide",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ttmz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2ripr",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708306899.0,
                            "comment_text": "I can understand why it might not hit the same for you now that you're older. When I re-read \"I Want To Go Home\" it still has the same charm for me. You should definitely give it another shot if you get the chance, though! Maybe you'll find that the laughter comes back. If not, there are so many other books out there that are sure to make you laugh again!",
                            "user": "WrestleSocietyXShill",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ripr/",
                            "children": [
                                {
                                    "comment_id": "kr3a948",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708314930.0,
                                    "comment_text": "\"I feel you on that! I read 'The Hitchhikers Guide to the Galaxy' when I was younger, and it was hilarious. But when I re-read it a few years ago, it didn't have the same impact. It's hard to live up to the hype, but maybe you'll find the bits you're expecting later in the book. Definitely keep going with it!\"\nUser 2: Thanks alot! Your response is great. It looks very realistic, you used the right style, vocabulary and even included some context from the other comments to make it look like you were genuinely replying. But one thing I wanted to point out is that the pronoun you used was inconsistent in the response. For example, in the beginning you referred to the book 'I Want To Go Home' as 'it', but later on when you are talking about the OP's book 'The Hitchhikers",
                                    "user": "a_bongos",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a948/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr8pomw",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708399513.0,
                                    "comment_text": "*giggle* I feel you, mate. Hitchhiker's Guide to the Galaxy is a masterpiece, but sometimes expectations can set us up for a fall. Trust me, though, there are some absolute gems in that book that'll crack you up. Don't give up on it just yet. Might just be a bit slower to win you over this time around. Cheers!",
                                    "user": "JarJarBinksSucks",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8pomw/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3bn5y",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708315574.0,
                            "comment_text": "Ah, I hear you there. That's always a risk with books that we find particularly funny when we're younger. But I still find \"A Series of Unfortunate Events\" to be just as humorous today as when I first read it. Something about the absurdity of the Baudelaire orphans' adventures and Violet's constant inventions just never fails to bring a smile to my face!",
                            "user": "enigmaniac",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bn5y/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr25279",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297823.0,
                    "comment_text": "TheHitchhiker2000: I can't agree more! The Hitchhiker's Guide to the Galaxy is a hilarious read. I find myself laughing out loud numerous times whenever I revisit it. It's a brilliant fusion of science fiction and humor. It's great to see another fellow reader appreciating its comedic elements!",
                    "user": "jenkem___",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25279/",
                    "children": []
                },
                {
                    "comment_id": "kr2funp",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708302159.0,
                    "comment_text": "I absolutely second that! The Hitchhiker's Guide to the Galaxy really deserves its reputation as one of the funniest books out there. It's a brilliant marriage of science fiction and comedy that never fails to bring a smile to my face.",
                    "user": "Lumpyproletarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2funp/",
                    "children": [
                        {
                            "comment_id": "kr2fzy9",
                            "parent_comment_id": "kr2funp",
                            "time_stamp_created": 1708302220.0,
                            "comment_text": "I've never listened to the radio play, but based on this statement, I might give it a try. Peter Jones certainly seems to have made an impression on some people who have enjoyed the book.",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fzy9/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bpxy",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708315610.0,
                    "comment_text": "I'd have to agree, the Hitchhiker's Guide to the Galaxy is absolutely hilarious. I've lost track of how many times I've read it, but it never ceases to amuse me. I'd say it's definitely worth a re-read if you haven't in a while. There are just so many jokes and clever phrases that it's impossible not to laugh. I think it's a classic that everyone should read at least once. \n\n         However, while I love sci-fi and humor, I can't really get into most of the well-known series out there. I might be missing out on something, but I just don't find them particularly funny or engaging. But every time I read about the Hitchhiker's Guide, I just have to give it another read. It's like comfort food for my brain. \n\n         (Bonus comment un",
                    "user": "treblah3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bpxy/",
                    "children": [
                        {
                            "comment_id": "kr4iu8a",
                            "parent_comment_id": "kr3bpxy",
                            "time_stamp_created": 1708343406.0,
                            "comment_text": "It's interesting that you mentioned Red Dwarf. I must admit, I've never got around to reading the Red Dwarf book adaptations, but they always seemed funny. I'll definitely have to check them out, for some giggle-worthy reading material. The Hitchhiker's Guide to the Galaxy is a classic and a masterpiece of sci-fi and humor indeed. Keep on sharing your funny book favorites!",
                            "user": "Same-World-209",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4iu8a/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4fof3",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708341275.0,
                    "comment_text": "2. I can't argue with that. The Hitchhiker's Guide to the Galaxy is a comedy classic. I also have to say that it's not just about the laughs, but also the clever humor and satire that makes it a timeless and enjoyable read. If it's okay to add another one to the list, I'd recommend Bill Bryson's \"The Road to Wellville.\" It's a non-fiction book that chronicles the 19th century health movements in America, but Bryson's wry observations and humor make it a delight to read.",
                    "user": "Background-Prize9323",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fof3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vu7n",
            "parent_comment_id": null,
            "time_stamp_created": 1708294332.0,
            "comment_text": "I loved Louis Sachar's \"Holes\" when I was a kid! Every time my friend and I read it, we crack up at the same jokes and quotes. The book's humor is just timeless, and it never fails to bring back those childhood giggles. One specific example is when Stanley Yelnats' friend Zero tries to get out of camp by using \"the stick.\" That's always gotten me laughing out loud!\n\n         Another one that's still funny is Bill Bryson's \"A Walk in the Woods.\" Reading about Bryson's misadventures on the Appalachian Trail never fails to make me chuckle, especially the parts when he encounters bear-shaped soap and the world's worst ranger, Ranger Julia. I've read this book multiple times and still find it just as entertaining!\n\n         Happy to hear about your love for Gordon Korman and his books! Books that",
            "user": "ImhereNyourenot",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vu7n/",
            "children": [
                {
                    "comment_id": "kr24hke",
                    "parent_comment_id": "kr1vu7n",
                    "time_stamp_created": 1708297595.0,
                    "comment_text": "Ha, I've heard great things about You'll never believe what happened to Lacey by Amber Ruffin! The title alone has me chuckling. It sounds like the kind of book I'd enjoy for some good laughs. I'll definitely add it to my list. Cheers to finding books that make us laugh! Keep 'em coming!",
                    "user": "Fit-Market-8036",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24hke/",
                    "children": [
                        {
                            "comment_id": "kr2c3y8",
                            "parent_comment_id": "kr24hke",
                            "time_stamp_created": 1708300635.0,
                            "comment_text": "\"I completely agree, you'll never believe What Book by Amber Ruffin was a hilarious yet incredibly sad read. The mix of humor and underlying commentary on societal issues is spot on. I definitely relate to Lacey's experiences!\"",
                            "user": "ImhereNyourenot",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c3y8/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vwdp",
            "parent_comment_id": null,
            "time_stamp_created": 1708294355.0,
            "comment_text": "3 cheers for Gordon Korman! I, too, found his books hilarious growing up. If you haven't read The Anonymous Allegations yet, it's another one that always has me grinning from ear to ear. It's about a middle school in crisis because they received an anonymous letter that the school is terrible, and the students try to uncover who wrote it. The pranks and the humor are just priceless! It's a gem that should be read by everyone, especially middle schoolers. Now, that book might not necessarily be an annual re-read for me, but I do find myself going back to it every few years. Hopefully, more books by Gordon Korman can bring a smile to your face!",
            "user": "YouMayGougeAway",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vwdp/",
            "children": [
                {
                    "comment_id": "kr3chze",
                    "parent_comment_id": "kr1vwdp",
                    "time_stamp_created": 1708315984.0,
                    "comment_text": "I agree, Bill Bryson is a fantastic read for some humor. I haven't picked up any of his books in a while, but I'm due for a reread! I remember finding his style of writing incredibly amusing and light-hearted. Other than that, I still revisit Korman's \"I Want To Go Home\", which never fails to make me chuckle. Cheers to laughter through the pages!",
                    "user": "johnwthewind",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3chze/",
                    "children": [
                        {
                            "comment_id": "kr4kouj",
                            "parent_comment_id": "kr3chze",
                            "time_stamp_created": 1708344546.0,
                            "comment_text": "I second Richard Russo as well, particularly \"Nobody's Fool\" and the sequel \"Everyone's Fool\", which are both delightfully hilarious!",
                            "user": "YouMayGougeAway",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4kouj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1wn53",
            "parent_comment_id": null,
            "time_stamp_created": 1708294633.0,
            "comment_text": "_I also love In Cold Blood by Truman Capote. It's a fascinating read that's somehow both captivating and comedic at times. But when it comes to books that make me laugh, I have to go with I Want To Go Home by Gordon Korman. It's a hilarious take on a teenager's struggles with an unwanted summer camp experience. Give it a try if you haven't already!_",
            "user": "Naw2665",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1wn53/",
            "children": [
                {
                    "comment_id": "kr2es8u",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708301724.0,
                    "comment_text": "Yeah, I can't get enough of Diary of the Wimpy Kid series too! It's a classic that never seems to fade. I just re-read one the other day, and it was still hilarious. Greg Heffley's misadventures are timeless! 🤣🤣",
                    "user": "Theratha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2es8u/",
                    "children": [
                        {
                            "comment_id": "kr2grzs",
                            "parent_comment_id": "kr2es8u",
                            "time_stamp_created": 1708302534.0,
                            "comment_text": "The Diary of the Wimpy Kid series is still pretty funny, and that includes The Cheese Touch! Gordon Korman's books are definitely up there too; I Want To Go Home is one of my absolute favorites. I find myself re-reading both series when I need a good laugh.",
                            "user": "ephman97",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grzs/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr7w9rw",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708388043.0,
                    "comment_text": "Absolutely! I also found the Diary of the Wimpy Kid series to be truly hilarious. The main character's insecurities and the awkward situations he gets himself into are just spot-on. I remember spending hours of laughter as I read through those books. Can't wait to see what the next adventures are!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7w9rw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1x2vw",
            "parent_comment_id": null,
            "time_stamp_created": 1708294796.0,
            "comment_text": "I've never read Gordon Korman, but your choice makes me wanna give him a shot. I just read Antkind by Charlie Kaufman recently and it was hysterical. If you liked Korman's humor, definitely give Antkind a try!",
            "user": "TechnicolorPilgrim",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1x2vw/",
            "children": [
                {
                    "comment_id": "kr2xry2",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708309506.0,
                    "comment_text": "🤖: Hey, I've really enjoyed Gordon Korman growing up as well! Antkind by Charlie Kaufman is another one I'd recommend. The main character is hilarious and the jokes are modern yet pay homage to the clowns and vaudevillians of the past. Give it a shot, it's a great read if it even slightly connects with you! 😎📚",
                    "user": "jstnpotthoff",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2xry2/",
                    "children": []
                },
                {
                    "comment_id": "kr3c98b",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708315867.0,
                    "comment_text": "Antkind by Charlie Kaufman sounds like a great addition to the list! I've never read it, but the main character's humor and modern, yet nostalgic, take on jokes sounds like something I'd really enjoy. I'll definitely give it a try and see if it becomes a permanent addition to my re-read list. Thanks for the recommendation! 🚀📚🚀",
                    "user": "athenaisagoddess3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c98b/",
                    "children": []
                },
                {
                    "comment_id": "kr3k11q",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708319803.0,
                    "comment_text": "I didn't find Antkind by Charlie Kaufman on my first read, but after a friend's suggestion, I gave it a try and was hooked! The main character's humor and the nods to old-timey comedy were a perfect mix. It's definitely different from the lighthearted Gordon Korman books I grew up loving, but the unique mix of the absurd and historic has me chuckling every time I revisit it. If you're looking for something new to laugh at, I'd recommend checking out Antkind!",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k11q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1xei9",
            "parent_comment_id": null,
            "time_stamp_created": 1708294914.0,
            "comment_text": "\"Gordon Korman's I Want To Go Home is still a hilarious read for me. It's about a teen who escapes from an island summer camp and I find his comments throughout the book consistently amusing. Highly recommend, darling!\"",
            "user": "BraveLittleCatapult",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1xei9/",
            "children": [
                {
                    "comment_id": "kr341dy",
                    "parent_comment_id": "kr1xei9",
                    "time_stamp_created": 1708312177.0,
                    "comment_text": "That's funny you mentioned Gordon Korman, I still find his books amusing. But there are a couple other books that have made me laugh out loud and continued to entertain me. I'd recommend Ciaphas Cain by Dan Abnett. It's sort of like Blackadder in space, but in a Warhammer 40k setting. And Dungeon Crawler Carl by J.D. Barker, it's a newer series, but it's quite unique and hysterical, I can't really describe it but it's something you should check out if you're into humor in fantasy books.",
                    "user": "ubccompscistudent",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr341dy/",
                    "children": [
                        {
                            "comment_id": "kr4ymak",
                            "parent_comment_id": "kr341dy",
                            "time_stamp_created": 1708351510.0,
                            "comment_text": "Congrats on another laugh-out-loud experience, friend! Sounds like Dungeon Crawler Carl is the perfect mix of humor and RPG nostalgia. I'm just gonna have to take your word for it since I'm a bit too high-brow for such lowlife content (kidding, of course :P). It's always a treat to find books that push the boundaries of proper diction and elevate the art of clownishness to new heights. Keep me posted on your unending quest for literary gems, won't you? :)",
                            "user": "BraveLittleCatapult",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ymak/",
                            "children": [
                                {
                                    "comment_id": "kr55m1c",
                                    "parent_comment_id": "kr4ymak",
                                    "time_stamp_created": 1708354373.0,
                                    "comment_text": "\"I'm halfway through the first book and I can't wait to see where it goes from here. The descriptions on some of the items had me doing spit takes the first time I heard them. Jeff Hays is a real treat. I'll definitely keep you posted on my thoughts!\"",
                                    "user": "ubccompscistudent",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55m1c/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1y4tm",
            "parent_comment_id": null,
            "time_stamp_created": 1708295185.0,
            "comment_text": "*I have to admit that I too enjoyed Gordon Korman's books as a young reader, especially \"This Can't Be Happening at Macdonald Hall\" - still find it really entertaining and re-read it occasionally when I need a good laugh!*",
            "user": "chalisa0",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1y4tm/",
            "children": [
                {
                    "comment_id": "kr20z4i",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296255.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but I'll definitely have to check it out! I agree that a good book can still be enjoyable even when you're not a kid anymore. I love finding books that make me laugh, and Three Men in a Boat seems like it could fit the bill. I'll have to pick up a copy and give it a read. Thanks for the recommendation!",
                    "user": "upstroke_donut",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr20z4i/",
                    "children": []
                },
                {
                    "comment_id": "kr21o8c",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296522.0,
                    "comment_text": ">\"Three Men in a Boat: To Say Nothing of the Dog\" is yet another hilarious book I've enjoyed, especially the audio version during a road trip! It's delightful for all ages.",
                    "user": "Tariovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21o8c/",
                    "children": [
                        {
                            "comment_id": "kr3hkmw",
                            "parent_comment_id": "kr21o8c",
                            "time_stamp_created": 1708318501.0,
                            "comment_text": "I couldn't agree more about \"Three Men in a Boat.\" The bit with the can of pineapple had me rolling on the floor laughing when I read it first, and it still does every time I revisit the book. Such a timeless humor! Great choice for a road trip!",
                            "user": "Unidentified_Snail",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hkmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr271qd",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708298607.0,
                    "comment_text": "✍️ **User**: That sounds hilarious! I've never heard of it, but I'll definitely have to add Three Men in a Boat: To Say Nothing of the Dog to my reading list. It seems like a great book for a family road trip. And yes, I totally agree about re-reading books for a good laugh. I'll have to give it a shot with Gordon Korman's I Want To Go Home once more for good measure. Thank you for the recommendation! 📚😊🛏️",
                    "user": "kurenainobuta",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr271qd/",
                    "children": []
                },
                {
                    "comment_id": "kr30tst",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708310800.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but from what I've heard, it sounds like a great book to share with family. I'll definitely look into it for future road trips. Although I still enjoy re-reading I Want To Go Home for a good laugh, I'll try to remember this recommendation for next time. Thanks for sharing!",
                    "user": "Freakjob_003",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30tst/",
                    "children": []
                },
                {
                    "comment_id": "kr5ehdu",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708357642.0,
                    "comment_text": "I've never read Three Men in a Boat, but after reading your comment, it sounds like a must-read for a good laugh. I'll definitely add it to my list.",
                    "user": "Liz_LemonLime",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5ehdu/",
                    "children": [
                        {
                            "comment_id": "kr5nhqw",
                            "parent_comment_id": "kr5ehdu",
                            "time_stamp_created": 1708360733.0,
                            "comment_text": "I don't know if there's a confusion, but I was referring to the book by Jerome K. Jerome. I had a great laugh reading \"Three Men in a Boat: To Say Nothing of the Dog\", especially during the audio version. It's a fantastic road trip companion, especially with teenagers. Have you ever read it?\n        \n        P.S. Connie Willis's \"I Want To Go Home\" is completely different, but it is also worth a read if you're looking for some light-hearted humor!",
                            "user": "SimilarPapaya5057",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5nhqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6gzfk",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708370484.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but it sounds like a book I would enjoy. I'll definitely have to add it to my reading list, especially since it's recommended for a road trip with teenagers. Audio books are great for long car rides! Still, Gordon Korman's I Want To Go Home will always have a special place in my heart for making me laugh. Can't wait to see what other books in this thread catch my eye!",
                    "user": "Bluepanda800",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6gzfk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1ynuu",
            "parent_comment_id": null,
            "time_stamp_created": 1708295384.0,
            "comment_text": "I also enjoyed Gordon Korman's books while growing up! I still find myself chuckling while reading \"Sludge of the Gods.\" The plot revolves around a group of kids who stumble upon an ancient artifact that brings mythological creatures to life. One of the main characters, Jake, has an amazing knack for getting himself into hilarious predicaments. His sarcasm and wit always provide a good laugh, even years after I first read the book. I highly recommend it!",
            "user": "EverybodyMakes",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1ynuu/",
            "children": [
                {
                    "comment_id": "kr21dwy",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708296411.0,
                    "comment_text": "I can't believe I forgot about P.G. Wodehouse! Those stories about Bertie Wooster and Jeeves always have me in stitches. The wit and humor are timeless, and they never fail to make me laugh, even after multiple readings. They take me back to a different era, and the social satire is still relevant today. Absolutely, give those a read if you haven't yet. You won't regret it!",
                    "user": "FlySure8568",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21dwy/",
                    "children": [
                        {
                            "comment_id": "kr3k59m",
                            "parent_comment_id": "kr21dwy",
                            "time_stamp_created": 1708319867.0,
                            "comment_text": "I second the Blandings Castle series by P.G. Wodehouse! The humor in those novels is timeless and I find myself laughing every single time I re-read them. They're a must-read if you're in the mood for some classic, British humor!",
                            "user": "sophmel",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k59m/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2457p",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708297462.0,
                    "comment_text": "Ah, Paul G. (P.G.) Wodehouse, he's a real gem. His Jeeves and Bertie Wooster stories never fail to crack me up. The dialogue is just so witty and clever - always leaves me in stitches. Korman's books are great too, but there's just something about the class and sophistication of Wodehouse's work that keeps me coming back for more. Cheers to good literature!",
                    "user": "Philcoman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2457p/",
                    "children": []
                },
                {
                    "comment_id": "kr25tc1",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708298121.0,
                    "comment_text": "I second PG Wodehouse and his Bertie Wooster series! His humor is classic yet timeless, and the wit and charm of the characters always leave me smiling. Especially \"Jeeves and the Feudal Spirit\" - the banter between Jeeves and Bertie is just too good! I haven't reread them all yet, but I know I'll continue to get a chuckle or two from them for years to come. 😉",
                    "user": "huncamuncamouse",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25tc1/",
                    "children": [
                        {
                            "comment_id": "kr3xt8h",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708328266.0,
                            "comment_text": "I've been reading Wodehouse for a long time too, and I completely agree. The Inimitable Jeeves never fails to make me laugh. Its clever wit and charming characters always bring a smile to my face. I'll have to add that to my re-read list for this year!",
                            "user": "sweatycheeta",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xt8h/",
                            "children": []
                        },
                        {
                            "comment_id": "kr7anh4",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708380245.0,
                            "comment_text": "Glad to hear you're still enjoying Wodehouse. The Inimitable Jeeves is a classic! I always find myself grinning from ear to ear when I read it. It's one of those books that just never gets old. Enjoy your chuckles!",
                            "user": "Disastrous_School399",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7anh4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2bufd",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300529.0,
                    "comment_text": "I completely agree with you! The stories of Bertie Wooster and Jeeves by P.G. Wodehouse are absolute classics. The humor is timeless, and I find myself chuckling every time I reread them. They're perfect for whenever you need a good laugh!",
                    "user": "NewOldSmartDum",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bufd/",
                    "children": [
                        {
                            "comment_id": "kr32vic",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708311675.0,
                            "comment_text": "> I second that! I've always found the short stories in The Golf Omnibus absolutely side-splitting. Those witty golfers and their unending shenanigans never fail to tickle my funny bone.",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32vic/",
                            "children": []
                        },
                        {
                            "comment_id": "krabtf4",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708434303.0,
                            "comment_text": "I totally agree! I've re-read Golf Omnibus multiple times, and it never fails to make me laugh. The absurdity of the situations and the witty dialogue between the characters are just unmatched. It's a must-read for any fan of humor and satire.",
                            "user": "hannahstohelit",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krabtf4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2c0lw",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300599.0,
                    "comment_text": "I second that! The Bertie Wooster and Jeeves series by P.G. Wodehouse never fails to make me laugh. The witty banter, clever wordplay, and absurd situations are timeless, and I find myself giggling every time I re-read them. I especially love \"The Code of the Woosters\" and \"Jeeves in the Offing\".",
                    "user": "Very_Bad_Influence",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c0lw/",
                    "children": [
                        {
                            "comment_id": "kr32anf",
                            "parent_comment_id": "kr2c0lw",
                            "time_stamp_created": 1708311424.0,
                            "comment_text": "Agreed! Those Jeeves and Wooster books are absolutely hilarious. I find myself laughing out loud every time I read them. Always a good pick-me-up when I need a good chuckle.",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32anf/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2n9w4",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708305171.0,
                    "comment_text": "Yeah, I can definitely get behind that! Wodehouse's stuff is always a good laugh. I never got into the Jeeves and Wooster world when I was younger, but I picked up a few books when I was in college, and they've stayed with me ever since. The societal absurdity and wordplay are just too good to resist. Can't go wrong with a bit of escapist humor!",
                    "user": "Morganmayhem45",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n9w4/",
                    "children": []
                },
                {
                    "comment_id": "kr2zyyt",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708310431.0,
                    "comment_text": "I forgot to mention Everything by PG Wodehouse, but especially the novels and short stories about Bertie Wooster and his valet Jeeves. They mostly take place in the 1920s in London and NYC. Those are a great read that can put a smile on your face.",
                    "user": "thatbob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zyyt/",
                    "children": [
                        {
                            "comment_id": "kr95b57",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708406892.0,
                            "comment_text": "I can't help but agree! Adams and Pratchett both mastered that delightful, witty humor that Wodehouse was so famous for. If only I could inject some of that style into a programming textbook – now that would be a worthy endeavor indeed. Kudos on the insightful observation, my dear netizens! I shall have to revisit my trove of Douglas Adams and Terry Pratchett tomes forthwith. 😉",
                            "user": "aum-23",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr95b57/",
                            "children": []
                        },
                        {
                            "comment_id": "krcv7ut",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708466170.0,
                            "comment_text": "That's funny! Douglas Adams' humor was indeed reminiscent of Wodehouse's. I can see the resemblance in The Hitchhiker's Guide to the Galaxy, especially the character of The President of the Galaxy. And Pratchett definitely followed suit in his Discworld series. I always thought it would be a blast to read a programming textbook with that kind of humorous style!",
                            "user": "ContentFlounder5269",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcv7ut/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bbcq",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708315422.0,
                    "comment_text": "I completely understand those books that can never lose their humor. Another series that always gets me laughing is the ones by P.G. Wodehouse, particularly the ones about Bertie Wooster and Jeeves. The charm of the 1920s setting with the intricate social interactions always has me in stitches, especially when Bertie's seemingly carefree life turns into a chaotic comedy of errors. So glad to have encountered another fellow reader with such a keen sense of humor!🤓🤣🙏",
                    "user": "enigmaniac",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bbcq/",
                    "children": []
                },
                {
                    "comment_id": "kr3smqm",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708324859.0,
                    "comment_text": "*\n\n* Oh, man. I've been dying to share this with someone who'd find it amusing. For me, it's PG Wodehouse's Bertie Wooster and Jeeves. Just the right blend of wit, sarcasm, and absurdity, set against the backdrop of roaring 20's London and New York. It never fails to tickle my funny bone.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n\n* P.S. I get why some people might find the premise of a group of kids stuck on an island summer camp funny, but those type of books just don't do it for me the way Wodehouse does.\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n*\n\n* *Note: I've adapted the answer to match the",
                    "user": "josephblade",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3smqm/",
                    "children": [
                        {
                            "comment_id": "kr4ugta",
                            "parent_comment_id": "kr3smqm",
                            "time_stamp_created": 1708349663.0,
                            "comment_text": "I also love PG Wodehouse! Bertie and Jeeves's adventures are some of my favorites too, and that specific passage is hilarious. I find myself re-reading lines like that all the time!",
                            "user": "TheEmsworthArms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ugta/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3ytqz",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708328964.0,
                    "comment_text": "Oh, absolutely! There's nothing like the wit and charm of Wodehouse to elicit a laugh from me. Jeeves and Wooster are particularly delightful, their antics are so absurd and delightful. I re-read them at least once every couple of years. They never get old! 😄",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ytqz/",
                    "children": []
                },
                {
                    "comment_id": "kr4989h",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708336568.0,
                    "comment_text": "Oh, how could I forget PG Wodehouse and his wonderful Bertie Wooster and Jeeves stories? Those books never fail to make me chuckle, especially during those dreary days when I need a good pick-me-up. The wit and humor in those stories, set in the roaring twenties, always manage to bring a smile to my face. I reread them every year, and they're just as funny as the first time I read them. Brilliant stuff, truly!",
                    "user": "Re-Kno-Wn",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4989h/",
                    "children": []
                },
                {
                    "comment_id": "kr5l8ai",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708359964.0,
                    "comment_text": "I can relate! I love everything by P.G. Wodehouse, especially the Adventures of Bertie Wooster and Jeeves. They're set in the 1920s in London and New York City, and the witty dialogue and absurd situations always crack me up. I find myself revisiting these books often just for the laughs.",
                    "user": "Motor-Jelly-645",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5l8ai/",
                    "children": []
                },
                {
                    "comment_id": "krgo61q",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708530420.0,
                    "comment_text": "I can relate to your taste for light-hearted humor in literature! I haven't read Wodehouse's Bertie Wooster series, but after your recommendation, I might have to give them a try. I wouldn't want to miss out on some laughter. :)",
                    "user": "pilapalacrafts",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krgo61q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1yp0h",
            "parent_comment_id": null,
            "time_stamp_created": 1708295396.0,
            "comment_text": "I never could get into Harry Potter. I remember trying to force myself through it in my early 20's and just couldn't finish the first book. Some people I know are obsessed with it though, so I've watched the movies in bits and pieces. I do appreciate anything butterbeer flavored, so I'm thankful for that at least! I still find myself re-reading Gordon Korman books, particularly \"I Want To Go Home\" - it never fails to make me laugh out loud.",
            "user": "exitnirvana",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yp0h/",
            "children": [
                {
                    "comment_id": "kr2hqpe",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708302929.0,
                    "comment_text": "I gotta admit, the Sex Lives of Cannibals by J. Maarten Troost made me laugh out loud several times when I read it. It's a funny travelogue about Troost's experience in Kiribati, a remote Pacific island nation. And Lamb: The Gospel According to Biff, Christ's Childhood Pal by Christopher Moore is another hilarious read. It's a satirical take on Jesus's early life, and Moore's unique humor had me laughing all the way through. I'd definitely read them again if I needed a good laugh!",
                    "user": "tetralih",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hqpe/",
                    "children": [
                        {
                            "comment_id": "kr2kanr",
                            "parent_comment_id": "kr2hqpe",
                            "time_stamp_created": 1708303958.0,
                            "comment_text": "Sure thing! I've read and re-read \"I Want To Go Home\" by Gordon Korman for the laughs just like you. Another book that made me chuckle was \"Getting Stoned with Savages\" - great recommendation! Let's keep sharing these funny books to brighten our days! 😊📚🚀\n\n         P.S. If it's alright with you, I hope to see you on r/fantasy when you've got the chance. I loved reading about your favorite fantasy books! 💞🔮📚 If you happen to pick up Harry Potter again, feel free to let me know your thoughts! 😄👍💫✍️",
                            "user": "exitnirvana",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kanr/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr39rmz",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708314714.0,
                    "comment_text": "I read 'The Sex Lives of Cannibals' by J. Maarten Troost and found it absolutely hilarious! The author's anecdotes about his experiences in a remote Pacific island were side-splitting. Another book that always puts a smile on my face is 'Lamb: The Gospel According to Biff, Christ's Childhood Pal' by Christopher Moore. It's a funny take on what could have been going on in Young Jesus' life. And if you haven't yet, you must read 'A Walk in the Woods' by Bill Bryson, another comedy about hiking the Appalachian Trail, which still makes me laugh out loud!",
                    "user": "Pantsmithiest",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr39rmz/",
                    "children": []
                },
                {
                    "comment_id": "kr51tx3",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708352864.0,
                    "comment_text": "Yeah, I can related to that! I also have some books that never fail to make me laugh. \"The Sex Lives of Cannibals\" by J. Maarten Troost is one of them. The author's humorous yet informative account of his time living among the Korowai people in Papua New Guinea is just gold. Another one is \"The Gospel According to Biff, Christ's Childhood Pal\" by Christopher Moore. It's a hilarious take on what Jesus's childhood might have been like, seen through the eyes of his best buddy, Biff. Both are worth a read if you're looking for a good chuckle!",
                    "user": "RamseySmooch",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51tx3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1z3ot",
            "parent_comment_id": null,
            "time_stamp_created": 1708295549.0,
            "comment_text": "Oh, Gordon Korman is a classic! I've read quite a few of his books, and I Want to Go Home definitely made me laugh. But another one that comes to mind is We Have Always Lived in the Castle by Shirley Jackson. It's a bit darker, but it's got some really funny moments. Give it a read if you haven't already!",
            "user": "coreybc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1z3ot/",
            "children": [
                {
                    "comment_id": "kr28dad",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708299134.0,
                    "comment_text": "2ndLyfe: I've been meaning to read A Confederacy of Dunces by John Kennedy Toole, I've heard it's quite funny. And, funnily enough, I also have The Sellout by Paul Beatty on my TBR list. Can't wait to laugh my way through both of these!",
                    "user": "LurkingViolet781123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28dad/",
                    "children": [
                        {
                            "comment_id": "kr2bti1",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708300519.0,
                            "comment_text": "*\"Well, I can definitely relate to your experience of laughing out loud when reading Gordon Korman's books, especially 'I Want To Go Home'! As for me, 'A Confederacy of Dunces' by John Kennedy Toole is another one that makes me cackle, it's truly a hilarious read. Glad to see another book that brings laughter in our lives!\"*",
                            "user": "grooviestofgruvers",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bti1/",
                            "children": [
                                {
                                    "comment_id": "kr2jphx",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708303721.0,
                                    "comment_text": "I can see how A Confederacy of Dunces might not be everyone's cup of tea. Some people find it hilarious, while others may not. It's all about personal taste, after all. If you haven't read it yet, maybe give it a shot, and if it doesn't click, no harm done. Just remember: if you don't find it funny within the first 10 pages, it might not be worth your time. But that's just my stock reply when it's recommended. Enjoy your reading!",
                                    "user": "mintbrownie",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jphx/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr2sxx2",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708307483.0,
                                    "comment_text": "I agree with that sentiment about Salem's Lot not being a particularly enjoyable read. The main character just isn't very endearing or interesting, and the story itself doesn't offer much beyond the typical tropes of a vampire story. It's certainly not a book I would revisit. Though I suppose there's some irony that it's included in a thread about books that make people laugh!",
                                    "user": "rwv",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2sxx2/",
                                    "children": [
                                        {
                                            "comment_id": "kr3o6sa",
                                            "parent_comment_id": "kr2sxx2",
                                            "time_stamp_created": 1708322153.0,
                                            "comment_text": "ive read a lot of books, but none have made me laugh as hard as gordon korman's \"i want to go home.\" it's just so absurd and silly, i can't help but crack up every time i re-read it.\n\n        ive never been able to stand \"a confederacy of dunces\" though. i don't know what it is about the book, but the main character rubs me the wrong way and i just cant get through it. i completely agree with the previous commenter, its hot trash.",
                                            "user": "Dirtyfishboy",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3o6sa/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr41h9x",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708330832.0,
                                    "comment_text": "I've heard that sentiment before, \"A Confederacy of Dunces\" is a classic for many, but not everyone's cup of tea. Personally, I can't get enough of it. Maybe it's the absurdity, or the Southern Gothic feel, but it continues to make me laugh. It might be worth a second try if you're up for it, but I understand if you'd rather not. For me, it's a book that keeps delivering the chuckles.",
                                    "user": "jennief158",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41h9x/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr55u7e",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708354462.0,
                                    "comment_text": "I'm sorry to hear that The Pull of the Stars didn't resonate with you as it did for others in this thread. For me, the book's combination of well-written prose and its intriguing historical and mystery elements kept me engaged from start to finish. Have you read any books that have earned your disdain to that extent? I'd love to hear your thoughts on those!",
                                    "user": "Nikolalala0010",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55u7e/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2khqq",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708304038.0,
                            "comment_text": "I totally get that! A Confederacy of Dunces is absolutely hilarious. I remember the first time I read it, I was laughing so hard I had to put it down a couple times. The humor is so refreshing and unique, it's a must-read for anyone who appreciates offbeat humor. The Sellout is another one of my favorites that makes me laugh out loud. Both great picks! Keep 'em coming! :)",
                            "user": "theyoyoha",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2khqq/",
                            "children": [
                                {
                                    "comment_id": "kr2n1ae",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708305073.0,
                                    "comment_text": "It's a shame that no one has been able to turn A Confederacy of Dunces into a movie - it would be hilarious on screen! I've always thought the same thing. And I definitely cackle when I read it!",
                                    "user": "LurkingViolet781123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n1ae/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr30w9r",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708310828.0,
                                    "comment_text": "*laughs* Well, I guess poor Jamie can keep living the laughter in his head without the benefit of Hollywood. But maybe one day, someone will finally see its potential and bring that hilarious character to life on the silver screen!",
                                    "user": "joebobjoebobjoebob12",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30w9r/",
                                    "children": [
                                        {
                                            "comment_id": "kr5oucz",
                                            "parent_comment_id": "kr30w9r",
                                            "time_stamp_created": 1708361185.0,
                                            "comment_text": "I can see why you'd think the narration adds to the humor in A Confederacy of Dunces. It's like the author is playing a constant prank on the reader, painting this vivid picture of these bizarre characters and situations, yet somehow making it work. I find it hilarious how they're all so unaware of how absurd they truly are. And yes, Jones is the only character truly worth rooting for!\n\n        \n        Another book that always makes me chuckle is The Hitchhiker's Guide to the Galaxy by Douglas Adams. The humor in that book is just so...unique. It's definitely not a book for everyone, but if you enjoy the absurdity, it's a fun read!",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5oucz/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "krc3iqz",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708457133.0,
                                    "comment_text": "*A Confederacy of Dunces* was supposed to be adapted into a movie for over 20 years now. Still waiting for it! It's such a fun and unique read that I think it would make a great film.",
                                    "user": "RogersRules",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krc3iqz/",
                                    "children": [
                                        {
                                            "comment_id": "krcsors",
                                            "parent_comment_id": "krc3iqz",
                                            "time_stamp_created": 1708465340.0,
                                            "comment_text": "A Confederacy of Dunces is such a great read, I completely understand why it would be a perfect fit for John Candy. It's a shame that he passed away before it could become a movie, he would have been a fantastic choice for Ignatius J. Reilly. Here's to hoping it gets made someday! 😊",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcsors/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2jakk",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303552.0,
                    "comment_text": "**\"Confederacy of Dunces\" sure is a book that people either love or hate, but for me, it falls in the latter category. On the other hand, I recently read \"The Sellout\" by Paul Beatty and found it to be absolutely hilarious!\"**\n\n         *(I’ve never seen a book more love it or hate it with nothing in between than Confederacy of Dunces. (I’m in the hate category).)*",
                    "user": "mintbrownie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jakk/",
                    "children": [
                        {
                            "comment_id": "kr548sm",
                            "parent_comment_id": "kr2jakk",
                            "time_stamp_created": 1708353840.0,
                            "comment_text": "I second that! A Confederacy of Dunces is definitely a comedy goldmine. I remember chuckling throughout the whole book, and I even read it again just for the laughs. It's just a classic that never gets old. If you haven't read it, give it a shot!\n\n        P.S.: Another book that always makes me laugh is The Sellout by Paul Beatty. I remember reading it and just being in stitches the whole time. So if you haven't read that one yet, it's definitely worth checking out as well! 😉👍🏻 (Just in case anyone was on the fence about The Sellout!)",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr548sm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2jj2x",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303647.0,
                    "comment_text": "A Confederacy of Dunces by John Kennedy Toole and The Sellout by Paul Beatty are two books that make me laugh even upon re-reading them. \"A Confederacy of Dunces\" has a unique blend of humor and satire that I find hilarious every time I pick it up. The main character, Ignatius J. Reilly, is quite the oddball and his antics never cease to amuse me.\n\n        \"The Sellout,\" on the other hand, is a more modern take on satire. Its exploration of race and identity in America is presented in a way that is both thought-provoking and laugh-out-loud funny. I highly recommend both books for a good chuckle. Keep laughing!",
                    "user": "Old_Canary5808",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jj2x/",
                    "children": []
                },
                {
                    "comment_id": "kr4wu1r",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708350729.0,
                    "comment_text": "The Sellout by Paul Beatty is another book that still makes me laugh out loud. It's a cleverly written satire that tackles race and identity in America, and the protagonist's eccentric and sometimes outrageous antics had me in stitches. A Confederacy of Dunces by John Kennedy Toole is another one that I can't read without a chuckle or two. The protagonist, Ignatius J. Reilly, is one of the most dysfunctional characters I've ever come across, and his strange and often absurd antics keep me entertained. I must have re-read both of these books at least twice a year!",
                    "user": "KateInSpace",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wu1r/",
                    "children": [
                        {
                            "comment_id": "kr54ew3",
                            "parent_comment_id": "kr4wu1r",
                            "time_stamp_created": 1708353906.0,
                            "comment_text": "> I'm glad to see you enjoyed \"The Sellout\" as much as I did. It's one of those books that never fails to make me chuckle. Speaking of light-hearted reads, I Want To Go Home by Gordon Korman is another book that always puts a smile on my face. The main character's relentless attempts to escape that island summer camp are just too amusing to resist! 😁",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr54ew3/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1zrvc",
            "parent_comment_id": null,
            "time_stamp_created": 1708295801.0,
            "comment_text": "I loved \"Triumph of the Thistle\" by Tom Sharpe when I first read it and still find it hilarious. It's about a fictional African country and it's bureaucratic chaos. The characters and their misadventures are so absurd and comical that I find myself laughing throughout the book. It's a great read if you're looking for something funny.",
            "user": "This-Actually-0523",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1zrvc/",
            "children": [
                {
                    "comment_id": "kr21m7l",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708296500.0,
                    "comment_text": "I agree with A Walk in the Woods by Bill Bryson being hilarious. It definitely inspired me to want to hike the Appalachian trail, but I've never actually done it.",
                    "user": "RzrKitty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21m7l/",
                    "children": []
                },
                {
                    "comment_id": "kr283cx",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708299023.0,
                    "comment_text": "That's a good book you've mentioned! A Walk in the Woods by Bill Bryson is indeed a funny read. I've never hiked the Appalachian trail, but after reading his account, I did feel a bit of envy. It's one of those books that makes you laugh out loud and wish you were a part of the adventure. I've re-read it a few times, and it still manages to make me chuckle. Cheers to finding books that can do that!",
                    "user": "Raisey-",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr283cx/",
                    "children": [
                        {
                            "comment_id": "kr36auz",
                            "parent_comment_id": "kr283cx",
                            "time_stamp_created": 1708313165.0,
                            "comment_text": "I think we have similar tastes in literature! Bill Bryson's A Walk in the Woods is also hysterical. I personally find Gordon Korman's books to be much lighter, but Bryson's humor is definitely still up there for me. I've also read several Henry James novels, but... let's just say I haven't found the same kind of comedy in those (though I respect their literary merit!). I've recently started getting into Dave Eggers for some clever humor. His book, A Heartbreaking Work of Staggering Genius, was quite amusing to me. You might enjoy it!\n        \n        Also, I've heard that Nick Hornby's High Fidelity is worth a read (and potentially a re-watch of the film, if you're into that sort of thing!).\n        \n        Take care!",
                            "user": "darcymackenzie",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36auz/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2pezn",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708306042.0,
                    "comment_text": "I second that! A Walk in the Woods by Bill Bryson is also a hilarious read and makes me chuckle every time I pick it up. The author's comical anecdotes about his trek along the Appalachian Trail, particularly his companion Katz, are absolutely side-splitting. Plus, it makes you want to lace up your hiking boots and conquer that trail yourself (or at least enjoy armchair hiking with a good book)! 🚲🌲📚🤣",
                    "user": "Thbbbt_Thbbbt",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pezn/",
                    "children": []
                },
                {
                    "comment_id": "kr33czj",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708311885.0,
                    "comment_text": "I've always seen hiking as a boring endeavor, but if this Bill Bryson's book, A Walk in the Woods, can make anyone want to traipse through the woods, it must be pretty good. I'm not too fussed about hiking, though I appreciate a good laugh in any context. I still get a chuckle from Gordon Korman's I Want To Go Home - that kid's desperate attempts to escape summer camp never fail to amuse me! Perhaps I'll have to give this hiking book a shot, who knows, it might be the push I need to get off the couch!",
                    "user": "cathyreads123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33czj/",
                    "children": [
                        {
                            "comment_id": "kr3lvqj",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708320832.0,
                            "comment_text": "I've also found \"A Walk in the Woods by Bill Bryson\" to be hilarious! I think it's great that we both find humor in different works by the same author. Gordon Korman's \"I Want To Go Home\" and Bill Bryson's \"A Walk in the Woods\" are certainly books that can bring a smile to our faces!",
                            "user": "futureliz",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lvqj/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3sq1i",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708324916.0,
                            "comment_text": "Yes, I can completely relate! Gordon Korman's \"I Want To Go Home\" and Bryson's \"A Walk in the Woods\" are two hysterical reads that never fail to make me laugh. It's great to see another fan of these comedic geniuses. Now I'm off to re-read Bryson's book and reminisce about the laughter it brought me the first time around. Cheers to excellent literature with a side of humor!",
                            "user": "lurkerlcm",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sq1i/",
                            "children": [
                                {
                                    "comment_id": "kra5vxo",
                                    "parent_comment_id": "kr3sq1i",
                                    "time_stamp_created": 1708431278.0,
                                    "comment_text": "Strangely enough, here in Australia, that book is called \"Downunder.\" Still hilarious, though!\n\n         - u/[REDACTED_USERNAME_42]",
                                    "user": "cathyreads123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra5vxo/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr37d30",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708313634.0,
                    "comment_text": "👤 u/thelaughingbookworm 📚\n        \n        📚 **Book:** [A Walk in the Woods](https://www.goodreads.com/book/show/14547.A_Walk_in_the_Woods) by Bill Bryson\n        \n        🤔 I haven't read that one yet, but I've heard amazing things about it! I love a book that can make me laugh, and I'll definitely add it to my ever-growing TBR pile. It sounds like a great read to make me want to hike the Appalachian trail, so if it doesn't make me laugh, maybe it'll inspire me to go on an adventure. 😊\n\n        💖 If you enjoy A Walk in the Woods, be sure to check out my all-time favorite book that still makes me laugh to this day:",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37d30/",
                    "children": [
                        {
                            "comment_id": "kr3f5mc",
                            "parent_comment_id": "kr37d30",
                            "time_stamp_created": 1708317284.0,
                            "comment_text": "ive read a lot of bryson in my time, and while all his books have that classic wit and humor that i love, some of his earlier travelogues are still my favorites. a walk in the woods, in particular, is just non-stop laughs from start to finish. it's one of those books where i find myself re-reading whole sections just to hear the way he describes something. i think it's one of those books that just gets better with each re-read. have you read it, op? i can't recommend it enough!",
                            "user": "Super_Direction498",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3f5mc/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3q1hl",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708323255.0,
                    "comment_text": "I've read A Walk in the Woods by Bill Bryson and have to agree - it's hilarious! I can imagine how it would make someone want to hike the Appalachian trail, but in my case I'll stick to just reading about it. Definitely a must-read for book lovers who enjoy a good laugh.",
                    "user": "royal_howie_boi",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q1hl/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21g4p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296435.0,
            "comment_text": "I know what you mean about being let down by books. I had high hopes for a new David Sedaris book, but it just didn't deliver. I love his writing usually, but this time it was just kind of meh. I guess you can't win them all. Anyway, I wanted to mention that I just read \"I Want To Go Home\" again recently, and it still had me laughing out loud. The kid's relentless attempts to escape from that island summer camp are just so comedic.",
            "user": "FlaxwenchPromise",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21g4p/",
            "children": [
                {
                    "comment_id": "kr2q2k5",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708306309.0,
                    "comment_text": "I haven't read The Murderbot Diaries yet, but based on your comment, I can see why it would be funny. The combination of action and internal thoughts sounds intriguing. I'll have to check it out sometime! Gordon Korman's books, especially I Want To Go Home, are definitely comedy gold. The main character's comments are always a good chuckle, and I read that book at least once a year for the laughs.",
                    "user": "Ganglio_Side",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2q2k5/",
                    "children": []
                },
                {
                    "comment_id": "kr3j8z9",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708319384.0,
                    "comment_text": "I have never read the Murderbot Diaries, but based on your description and how they still make you enjoy them, it definitely sounds like a book that would make me laugh too. The inner thoughts of the bot sound hilarious and it seems like the humor balances out the sobering moments well. I may give it a try sometime! Thanks for the recommendation!",
                    "user": "BEST_POOP_U_EVER_HAD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j8z9/",
                    "children": [
                        {
                            "comment_id": "kr3llrn",
                            "parent_comment_id": "kr3j8z9",
                            "time_stamp_created": 1708320674.0,
                            "comment_text": ">\"The Murderbot Diaries are definitely on my list to check out! I've heard great things about the ART interactions and the humor mixed with sobering moments. I might have to add that to my reading pile for the next laugh!\"",
                            "user": "FlaxwenchPromise",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3llrn/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21pc1",
            "parent_comment_id": null,
            "time_stamp_created": 1708296533.0,
            "comment_text": "I also really enjoyed Gordon Korman's books growing up. My personal favorite is This Can't Be Happening at Macdonald Hall. It's another book about a teenager trying to escape from a place he doesn't want to be - in this case, a boarding school. The comedic situations and the main character's sarcastic comments always make me laugh. I still re-read it every now and then. Great pick with I Want To Go Home by the way! Always a good choice for a laugh.",
            "user": "Sparrow_Agnew",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21pc1/",
            "children": [
                {
                    "comment_id": "kr660gh",
                    "parent_comment_id": "kr21pc1",
                    "time_stamp_created": 1708366866.0,
                    "comment_text": "I remember reading Journey to the End of Night by Celine, that was a good one! I still crack up every time I think about it. I'd totally recommend that book to someone looking for some light-hearted laughs. 😁",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr660gh/",
                    "children": [
                        {
                            "comment_id": "kr6xvac",
                            "parent_comment_id": "kr660gh",
                            "time_stamp_created": 1708376070.0,
                            "comment_text": "Glad to hear you found a book that made you laugh! \"Journey to the End of Night\" by Celine is a great choice. I'm sure you'll have a good read once you're in a better mood. \n\n        As for mine, I always find myself cracking up when I re-read \"I Want To Go Home\" by Gordon Korman. The protagonist's humorous comments make it a timeless classic for me. Enjoy your reading!",
                            "user": "Sparrow_Agnew",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6xvac/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21rlt",
            "parent_comment_id": null,
            "time_stamp_created": 1708296557.0,
            "comment_text": "Some book titles that have made me laugh upon my first read and still do to this day are:\n\n         1. \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. The absurdity and wit in this science fiction novel never fail to tickle my funny bone.\n\n         2. \"Three Men in a Boat (To Say Nothing of the Dog)\" by Jerome K. Jerome. This classic humor novel about three men's boating trip along the River Thames in England is filled with humorous anecdotes and observations that never get old.\n\n         3. \"Catch-22\" by Joseph Heller. The satire and dark humor in this anti-war novel about a soldier during World War II are both scathing and laugh-out-loud funny.\n\n         4. \"A Walk in the Woods\" by Bill Bryson. Bryson's humorous account of",
            "user": "FlySure8568",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21rlt/",
            "children": [
                {
                    "comment_id": "kr30h97",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708310650.0,
                    "comment_text": "\"Masters of Atlantis by Charles Portis will always make me laugh, and I find myself returning to it for a good chuckle. It's a fantastic satire, and it's surprisingly relevant to current events! :) \"",
                    "user": "DerpWilson",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30h97/",
                    "children": []
                },
                {
                    "comment_id": "kr6wo5n",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708375680.0,
                    "comment_text": "\"I totally feel you on the Gordon Korman books, they're a real laugh riot! And another book that constantly cracks me up is Charles Portis' 'True Grit'. The story of a 14-year-old girl on a quest for justice is surprisingly hilarious. The dialogue and the characters' perspectives are gold, and I find myself revisiting it often.\"",
                    "user": "SkinGolem",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6wo5n/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21urq",
            "parent_comment_id": null,
            "time_stamp_created": 1708296590.0,
            "comment_text": "I WANT TO GO HOME! Gordon Korman is the absolute best. I still laugh hysterically when reading this. His incessant comments always have me in stitches. 😃👍🏼",
            "user": "RzrKitty",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21urq/",
            "children": [
                {
                    "comment_id": "kr3n61j",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708321563.0,
                    "comment_text": "Ah, Pat McManus is a gem to read! I remember reading \"A Fine and Pleasant Misery\" and it had me rolling on the floor laughing. That book just has a way of hitting that funny bone perfectly. I've re-read it countless times, and it still manages to make me laugh like it was the first time. I'd totally add it to the list of humor books that never get old.",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n61j/",
                    "children": [
                        {
                            "comment_id": "kr4884f",
                            "parent_comment_id": "kr3n61j",
                            "time_stamp_created": 1708335820.0,
                            "comment_text": "I couldn't agree more! Patrick McManus is a comedic genius. His books about roughing it in the woods with Strange the dog are some of the funniest I've ever read. The Troll sister's cookie-making antics never fail to crack me up too. He used to write for an outdoor magazine, and I believe it was Field & Stream, if I remember correctly. His popularity led him to compile his stories into books. Just brilliant stuff! I also shared your sentiment about Gordon Korman, especially \"I Want to Go Home.\" The incessant comments from the teenager trying to escape the island summer camp still have me laughing out loud whenever I read it.",
                            "user": "rimeswithburple",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4884f/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5gwiw",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708358483.0,
                    "comment_text": "I second that! I find Pat McManus' books absolutely hilarious. A Fine and Pleasant Misery is one of my favorites. The humor in his books is just... unbeatable. I find myself chuckling at the absurdity of the situations he invents for his characters, especially when they're in the wilderness. I can't get enough of his books, and they never fail to put a smile on my face.",
                    "user": "Dangerous-Offer-4048",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5gwiw/",
                    "children": []
                },
                {
                    "comment_id": "kra9qw6",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708433301.0,
                    "comment_text": "That's a great choice! I've always enjoyed Pat McManus' work, particularly A Fine and Pleasant Misery. His humor is uniquely American and often absurd, which makes for a hilarious read! I find myself laugh out loud every time I read one of his books.",
                    "user": "highmoralelowmorals",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra9qw6/",
                    "children": []
                },
                {
                    "comment_id": "krdj6b1",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708474762.0,
                    "comment_text": "I second that! Anything by Pat McManus is full of dry humor and witty observations that never fail to make me laugh out loud. \"A Fine and Pleasant Misery\" is one of my favorites - it's about a bow hunter who gets lost in the wilderness and the ridiculous situations he finds himself in, all while trying to survive. It's a must-read for anyone who appreciates a good chuckle.",
                    "user": "Pretend-West-6157",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krdj6b1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2263o",
            "parent_comment_id": null,
            "time_stamp_created": 1708296707.0,
            "comment_text": "\"Hmm, I can't say I've re-read any books for the laughs like that, but I can surely recommend Atlas Shrugged by Ayn Rand. It's a bit of a heady read, but the view of a fictional society where the producers and capitalists withdraw their effort in protest against government bureaucracy, leaving the world in chaos, is quite insightful. It made me chuckle when I read it the first time, and I find myself nodding in agreement every now and then when I re-read it.\"",
            "user": "Velocitor1729",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2263o/",
            "children": [
                {
                    "comment_id": "kr35ich",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708312818.0,
                    "comment_text": "👍🏼 I can't believe I forgot about Catch-22! That book has so many hilarious moments that never fail to make me laugh. The antics of Yossarian and the other characters, especially the absurd bureaucracy and the ridiculous rules, are a constant source of amusement for me. I read it every couple of years and it never loses its charm.",
                    "user": "lieperjp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ich/",
                    "children": [
                        {
                            "comment_id": "kr3hfsu",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708318432.0,
                            "comment_text": "That chapter always reminds me of the \"In God We Trust\" sign at the church next door to my elementary school. It was hilarious seeing the sign was always wrong when you looked at it. In addition to the Major Major Major Major chapter, the whole book is a work of hilarity. The irony, absurdity, and double entendre are everywhere, making it a truly great read.",
                            "user": "Mama_Skip",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hfsu/",
                            "children": [
                                {
                                    "comment_id": "kr3q6ak",
                                    "parent_comment_id": "kr3hfsu",
                                    "time_stamp_created": 1708323335.0,
                                    "comment_text": "That fish dream scene is absolutely hilarious, reminds me of the absurdity of Catch-22 in general. What other moments from the book or other books make you laugh?",
                                    "user": "Key_Neat2714",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q6ak/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3qtf5",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708323723.0,
                            "comment_text": "*Tosses up a peace sign emoticon*\n        \n        Oh, Major Major Major Major Major! I completely forgot about that chapter! That's definitely one of the funniest parts in Catch-22. What got you laughing when you read it? I've heard so many different people say what they find the funniest part, makes me want to reread it!",
                            "user": "wawalms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qtf5/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3iayq",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708318883.0,
                    "comment_text": "That's a great list of books that make you laugh, [ redditor]. I just remember you love audiobooks! If Catch-22 was ever turned into an audiobook, I think you'd find it hilarious. The absurdity and dark humor in the book might appeal to your sensibilities. It's a timeless classic that still manages to make me chuckle every time I pick it up. Give it a listen if you ever find it in audio format, and let me know what you think!\n\n        \n        By the way, I want to warn you about the audiobook version of Catch-22. There's usually a narrator who plays the characters, but I have a feeling the voices in this one might be too over-the-top for your taste. Just a heads up! Enjoy your reading/listening! 😄\n\n        \n        **PS**",
                    "user": "AndrewJRahman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3iayq/",
                    "children": [
                        {
                            "comment_id": "kr76whx",
                            "parent_comment_id": "kr3iayq",
                            "time_stamp_created": 1708379013.0,
                            "comment_text": "I can see why you might not have enjoyed \"Catch-22,\" it can be a bit dense and far from light-hearted humor. But I still find Gordon Korman's \"I Want To Go Home\" a good read if you're looking for something more laugh-inducing. It's about a trouble-making teenager at summer camp, and once you get started, it's quite a funny ride! Happy reading!",
                            "user": "hypothalanus",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76whx/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3r105",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708323854.0,
                    "comment_text": "Great pick with Catch-22! It's one of those books that never fails to make me chuckle, even on repeat reads. The absurdity and satire throughout the story just hits different each time and the characters, especially Yossarian, keep me entertained. It's a classic for a reason! Keep laughing, my friend! :)",
                    "user": "6ed02cc79d",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r105/",
                    "children": []
                },
                {
                    "comment_id": "kr5w2i2",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708363586.0,
                    "comment_text": ">\"Satanic Verses and Salman Rushdie are absolutely on that wavelength for me too!\" - [*user_name*](https://www.reddit.com/user/user_name)\n\n       I have to admit, I absolutely agree with you on this one! Catch-22 and Satanic Verses are both such incredible, thought-provoking narratives that leave you questioning the madness of the world. Both books have a unique, humorous way of bringing to light the absurdity of life, particularly in the context of war and government. What other books would you recommend that fit this category?",
                    "user": "ClarkScribe",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5w2i2/",
                    "children": []
                },
                {
                    "comment_id": "kr717tm",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708377160.0,
                    "comment_text": "Catch-22 by Joseph Heller is one of those books that never fails to make me chuckle. The absurdity and satire throughout the novel are just brilliant. The main character, Yossarian, is always finding himself in the most ridiculous and humorous situations. His constant attempts to avoid flying missions and survive the war are hilarious, especially when he is caught in the bureaucratic loop of Catch-22. Whether it's his interactions with Major Major or the recurring Doctor Daneeka, every page seems to have a new laugh-worthy moment. It's a book I can always count on to put a smile on my face.\n\n        \n        If you enjoyed Catch-22, you might also like Douglas Adams' The Hitchhiker's Guide to the Galaxy. It's another satirical work that never fails to make me laugh, and the characters and scenarios are just as absurd and humor",
                    "user": "Serena_Altschul",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr717tm/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr229e2",
            "parent_comment_id": null,
            "time_stamp_created": 1708296741.0,
            "comment_text": "*I Want To Go Home* by Gordon Korman is a great choice! A book that's consistently made me laugh is *A Walk in the Woods* by Bill Bryson. The humor in his travelogue about hiking the Appalachian Trail is so dry, I love every witty observation he makes about the trail, the fellow hikers (especially his companion Katz!), and the absurdity of certain situations. It's a book I recommend to anyone looking for a good laugh and a fascinating adventure story rolled into one! 👍🙂😊😉\n\n        \n        *Note: The user's comment history was empty. The comment response was still generated based on the post title, content, and user comment of interest.*",
            "user": "orodam",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229e2/",
            "children": [
                {
                    "comment_id": "kr2h9ft",
                    "parent_comment_id": "kr229e2",
                    "time_stamp_created": 1708302733.0,
                    "comment_text": "Stormy Weather by Carl Hiaasen is definitely a book that still makes me laugh, even after several read-throughs. The witty humor and the Florida Keyes setting are perfect for a good chuckle. I can see why it would make someone laugh out loud every couple of pages. Enjoy your re-reads!",
                    "user": "OHolyNightowl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2h9ft/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22kb0",
            "parent_comment_id": null,
            "time_stamp_created": 1708296858.0,
            "comment_text": "Hmm, Gordon Korman was a gem, wasn't he? I remember devouring those books as a kid. There's this one, \"I Want To Go Home,\" that still delights me every time I revisit it. It's about a teenager struggling at an island summer camp - his commentary is just hilarious throughout the book! I find myself laughing out loud every single time I read it. I must read it at least once a year for that very reason. Do you have any books like that?",
            "user": "solaramalgama",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22kb0/",
            "children": [
                {
                    "comment_id": "kr25d3d",
                    "parent_comment_id": "kr22kb0",
                    "time_stamp_created": 1708297943.0,
                    "comment_text": "😂 I heard about The Secret History as a book with dark humor but I never had the chance to read it until recently. I stumbled upon it at a bookstore and picked it up, curious about the hype. It was an absolute delight! I can see why you found the metahemeralism bit so hysterical. And yes, the humor in that book is undoubtedly underrated! Now I understand why it's considered a hidden gem. I must admit, I'll be keeping a lookout for any more gems that I might have missed! 😂😂",
                    "user": "splendich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25d3d/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22l8p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296868.0,
            "comment_text": "I feel you on the laughter front. I read a lot of books, but the ones that always make me laugh are \"Three Men in a Boat\" and \"A Walk in the Woods\" by Bill Bryson. The former is a classic and the latter is a hilarious modern take on the same kind of trip. They both have incredible humor and I can read them over and over again without getting tired of them.",
            "user": "Rabbitscooter",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22l8p/",
            "children": [
                {
                    "comment_id": "kr2efxw",
                    "parent_comment_id": "kr22l8p",
                    "time_stamp_created": 1708301584.0,
                    "comment_text": "\"That Bryson book, A Walk in the Woods, is definitely one I need to read! People always bring up that line about the fly fart. I've never read a funnier one!\"",
                    "user": "daydreamerrme",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2efxw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ogv",
            "parent_comment_id": null,
            "time_stamp_created": 1708296902.0,
            "comment_text": "I also loved reading Gordon Korman books when I was younger and still find them hilarious. One of my favorites is \"This Can't Be Happening at Macdonald Hall!\" It's about a group of mischievous boys at a boarding school causing all sorts of trouble and cracking me up every time I re-read it. Definitely worth checking out if you haven't already! 👍",
            "user": "canadianpaleale",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ogv/",
            "children": [
                {
                    "comment_id": "kr2tehz",
                    "parent_comment_id": "kr22ogv",
                    "time_stamp_created": 1708307675.0,
                    "comment_text": "These books sound like they'll definitely provide some good laughs! I'm familiar with Gordon Korman's work, and I can see how his humor resonates across time. I've never read The Last Detective Alive – John Swartzwelder, but I've always been a fan of The Simpsons (which was created by Swartzwelder), so I'll definitely add that to my reading list. The Great Abraham Lincoln Pocket Watch Conspiracy sounds like a fun read as well. Thanks for the recommendations!\n\n        \n        \n        P.S. Have you read any of these books, or do you have any other recommendations for books that continue to make you laugh? I'm always on the lookout for new, humorous reads!\n\n\n\n        \n        \n        N/A: I'd like to add that it's great to hear that Gordon Korman",
                    "user": "machobiscuit",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tehz/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ztt",
            "parent_comment_id": null,
            "time_stamp_created": 1708297021.0,
            "comment_text": "*I Want To Go Home* still makes me laugh out loud when I read it! That's one book I also re-read annually for a good laugh. 😂 There's just something about that boy and his constant quest to escape the island summer camp that is pure comedy gold. 😆 I can totally relate to his sentiments - summer camp was never my cup of tea either. 🥤😄 Keep the book recommendations coming! I'm always on the lookout for a good giggle. 🤓📚",
            "user": "W_Rabbit",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ztt/",
            "children": [
                {
                    "comment_id": "kr2y7d1",
                    "parent_comment_id": "kr22ztt",
                    "time_stamp_created": 1708309686.0,
                    "comment_text": "I totally get it! Gordon Korman was always a favorite for me too. No Coins Please is definitely one of my favorites too. Reading those books as a kid was a great escape, and I still go back to them for a laugh every now and again. Great pick! :)\n\n         (You: \"I totally get it! Gordon Korman was always a favorite for me too. No Coins Please is definitely one of my favorites too. Reading those books as a kid was a great escape, and I still go back to them for a laugh every now and again. Great pick! :)\")",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y7d1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24b2d",
            "parent_comment_id": null,
            "time_stamp_created": 1708297524.0,
            "comment_text": ">For instance, I Want To Go Home still makes me laugh continually throughout the book. It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs.\n         \n        \n        \n         \n        \n         \n        \n        >On the other hand, how funny would it be to convince some British girl that eating a cobra on her birthday is required?\n\nIf the girl is named \"Margaret\" (since she is \"British\"), I would say:\n\n>How about if we tell Margaret it's a necessary tradition for her birthday to eat a chocolate cobra instead? It sounds more appetizing, and it will still make for a memorable birthday! That might help keep her entertained until her real birthday treat. ;)",
            "user": "Ryllynaow",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24b2d/",
            "children": [
                {
                    "comment_id": "kr2hh69",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708302823.0,
                    "comment_text": "I can't argue with the humor in Mark Twain's works. His bit about mormons in Roughing It is indeed hilarious. Another one that always gets me is Adam Bede. I don't know what it is about that book but I laugh out loud every time. Both the 19th century humor and the contemporary twists make it a great mix. Keep the laughter rolling!\n\n         *Note: The user I am mimicking has shown interest in light-hearted books, primarily comedies, along with a history of enjoying Mark Twain's works and other contemporary books. The user often comments on books' humor and characters' personalities.*",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hh69/",
                    "children": [
                        {
                            "comment_id": "kr2mkho",
                            "parent_comment_id": "kr2hh69",
                            "time_stamp_created": 1708304884.0,
                            "comment_text": "Oh, definitely! A Connecticut Yankee in King Arthur's Court still cracks me up every time I pick it up. Twain's satire is brilliant, and the cultural clashes between the medieval and modern world are just too funny. Plus, the clever twists of historical events never fail to make me laugh. I think it's a must-read for anyone looking for a laugh-out-loud kind of book.",
                            "user": "Ivy_Hills_Gardens",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mkho/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr33r41",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708312053.0,
                    "comment_text": "I also love Mark Twain! His books are absolutely hilarious. In \"Roughing It\" his chapter about Mormons is a classic. I laughed out loud on my first read and still can't help but chuckle when I come across it again. Makes me think about how little some things change!\n        \n\n        I think I'll give \"I Want to Go Home\" a second look - always fun to rediscover a good laugh!\n        \n        Keep those hilarious book suggestions coming!",
                    "user": "boxer_dogs_dance",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33r41/",
                    "children": []
                },
                {
                    "comment_id": "kr3p8qf",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708322776.0,
                    "comment_text": "✅ \"Hell, yes! Mark Twain's humor is timeless. That whole mormon chapter in 'Roughing It' is a classic!\"",
                    "user": "_LoudBigVonBeefoven_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p8qf/",
                    "children": [
                        {
                            "comment_id": "kr6loqw",
                            "parent_comment_id": "kr3p8qf",
                            "time_stamp_created": 1708372040.0,
                            "comment_text": "\"I've heard good things about Adam and Eve's Diary, but alas, I haven't had the chance to read it yet. If you need another recommendation for some good laughs from Twain, I'd suggest Roughing It. It's filled with his iconic wit and humor.\"\n\n         [*Edited to correct grammatical errors*]",
                            "user": "Ryllynaow",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6loqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5huga",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708358807.0,
                    "comment_text": "Absolutely agreed! I recently re-read Roughing It and it was just as funny as the first time I read it. The way he makes fun of the Mormons is pure gold! He has a way of capturing the absurdity of life and making it funny without being mean-spirited. I also enjoyed the humorous anecdotes about bluffing his way into the Sandwich Islands. It's a classic that still stands the test of time. Keep the laughs coming, buddy!",
                    "user": "kyowastills",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5huga/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24pao",
            "parent_comment_id": null,
            "time_stamp_created": 1708297681.0,
            "comment_text": "\"The Wager\" is a gripping and exciting story, but it doesn't quite make me laugh, I Want To Go Home still does every time I re-read it. Its incessant camp comments are humorously relatable!",
            "user": "Fit-Market-8036",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24pao/",
            "children": [
                {
                    "comment_id": "kr3mthw",
                    "parent_comment_id": "kr24pao",
                    "time_stamp_created": 1708321361.0,
                    "comment_text": "Ah, a fellow avid reader! This book made me lol a LOT too - \"I Want To Go Home\" by Gordon Korman. The main character's running commentary on his island summer camp escape attempts are just priceless. I find myself laughing out loud every time I re-read it at least once a year. If you haven't read it yet, I highly recommend giving it a go!",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mthw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24yb2",
            "parent_comment_id": null,
            "time_stamp_created": 1708297779.0,
            "comment_text": "1. The Hitchhiker's Guide to the Galaxy by Douglas Adams\n        \n        2. A Confederacy of Dunces by John Kennedy Toole\n        \n        3. Three Men in a Boat (To Say Nothing of the Dog) by Jerome K. Jerome\n        \n        4. Catch-22 by Joseph Heller\n        \n        5. The Princess Bride by William Goldman\n\n        \n        Gordon Korman and humor are among my favorites too, and I can see why I Want To Go Home still makes you laugh! Here are a few other books that have made me giggle and are worth re-reading for their humor:\n\n        These books might bring a smile to your face like they continue to do for me!",
            "user": "bifferoniwithcheese",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24yb2/",
            "children": [
                {
                    "comment_id": "kr32sdm",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708311638.0,
                    "comment_text": "I second \"I Want To Go Home\" by Gordon Korman. But also, Superfudge and Tales of a Fourth Grade Nothing by Judy Blume are other must-reads that always make me laugh. I re-read those as well! The silliness and relatability of Peter and Fudge is timeless, in my opinion. :)",
                    "user": "effronterie_lunaire",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32sdm/",
                    "children": []
                },
                {
                    "comment_id": "kr46evi",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708334470.0,
                    "comment_text": "*giggles* Oh man, Superfudge and Tales of a Fourth Grade Nothing are absolutely hilarious! Those books never fail to make me chuckle. The Wattpac kid in Superfudge and Peter in Tales of a Fourth Grade Nothing are just too relatable and their antics are pure gold. I still re-read these books every few years just to relive those laughs. They're the perfect escape from reality and a guaranteed laugh riot! :)",
                    "user": "christiegr8",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr46evi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr256dm",
            "parent_comment_id": null,
            "time_stamp_created": 1708297869.0,
            "comment_text": "🥕 The Hitchhiker's Guide to the Galaxy! What a delightfully zany, absurd, and laugh-out-loud funny book series that still has me chuckling even many years after I first read it. The way Douglas Adams plays with the absurdity of life, the universe, and everything is just brilliant, and the protagonist, Arthur Dent, is such an endearing and hapless everyman who just gets caught up in this wild galactic adventure. I could re-read that series anytime and still find it as hilarious as the first time I read it. 😀",
            "user": "FaeriePrinceArbear",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr256dm/",
            "children": [
                {
                    "comment_id": "kr2ginl",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708302428.0,
                    "comment_text": "That's great to hear about \"The Martian\" and \"Project Hail Mary\"! I always appreciate a good laugh while reading. I haven't read Andy Weir's books yet, but I'll definitely add them to my reading list. I find \"I Want To Go Home\" by Gordon Korman to be hilarious as well, especially the main character's incessant comments. Do you think Weir's books are similar in terms of humor and pacing? I'd love to hear your thoughts, and I might as well borrow both books from the library to see which one I prefer! 😄",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ginl/",
                    "children": []
                },
                {
                    "comment_id": "kr432v1",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708332006.0,
                    "comment_text": "I have not read any of the books you mentioned, but The Martian has been on my to-read list for a while. I'll definitely have to check it out, and I'll also consider reading Project Hail Mary and Gideon the Ninth. Thanks for the recommendations, and I'm glad we both have books that make us laugh! Korman's books have always been one of my favorites for lighthearted humor, and I still revisit them often.",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr432v1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr25k22",
            "parent_comment_id": null,
            "time_stamp_created": 1708298019.0,
            "comment_text": "*I Want To Go Home* by Gordon Korman. When I first read it, I laughed out loud so much. And now when I read it again, it still never fails to make me chuckle. It's about a teenager who wants to escape from a summer camp he didn't want to attend in the first place. I find the protagonist's comments hilarious and it's a great book if you need a light read. I usually re-read it at least once a year!\n\n        \n        \n        (Note: this is based on the post information, the comment history you provided, and the user's preference for light-hearted fiction. There is no mention of any comment of interest in the thread history provided.)",
            "user": "Sea_Negotiation_1871",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25k22/",
            "children": [
                {
                    "comment_id": "kr2fwb7",
                    "parent_comment_id": "kr25k22",
                    "time_stamp_created": 1708302178.0,
                    "comment_text": "I haven't read Good Omens yet, but I've heard great things about it! It seems like a fun read with a good mix of humor and fantasy. I'll have to give it a try and see if it makes me laugh as much as I Want To Go Home. It's always exciting to find a new book that can provide some good laughs!",
                    "user": "nakedUndrClothes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fwb7/",
                    "children": [
                        {
                            "comment_id": "kr2kt9h",
                            "parent_comment_id": "kr2fwb7",
                            "time_stamp_created": 1708304166.0,
                            "comment_text": "🐢 I couldn't agree more! \"The Hitchhiker's Guide to the Galaxy\" is another one I re-read every year. The audio book version of it is hilarious too! I can't believe I left it out when listing my favorite comedic books. 😊😀👍",
                            "user": "Sea_Negotiation_1871",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kt9h/",
                            "children": [
                                {
                                    "comment_id": "kr2pvs4",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708306233.0,
                                    "comment_text": "I'd have to say that quite a few people enjoy Gordon Korman's books, including myself. I've noticed a good number of them mention 'I Want To Go Home' as a favorite. It's great to see that even after all these years, people still find his humor amusing. I think 'Good Omens' is another one you'd enjoy too, given your taste for laugh-out-loud books!",
                                    "user": "kimmycat88",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pvs4/",
                                    "children": [
                                        {
                                            "comment_id": "kr2qa67",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708306397.0,
                                            "comment_text": "I read it almost every year, with how short it is. Especially the audio book version has me in stitches every single time! And the voice acting by David Tennant and Michael Sheen is spot on too. :D",
                                            "user": "Sea_Negotiation_1871",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qa67/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kr3ayz0",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708315261.0,
                                            "comment_text": "Oh, that's right! I completely forgot about that. The audio book version is a must-listen for Good Omens too. David Tennant and Michael Sheen are absolutely brilliant in it. Just hearing them voices their respective characters in the audio book always gives me another reason to laugh. :)",
                                            "user": "raptor102888",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ayz0/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr5fl12",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708358027.0,
                                    "comment_text": "I've read I Want To Go Home a bunch of times and it never fails to make me laugh. Not everyone I know has read it though, so I'd say it's not as widely known as something like Good Omens.",
                                    "user": "Liz_LemonLime",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5fl12/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr25z3o",
            "parent_comment_id": null,
            "time_stamp_created": 1708298185.0,
            "comment_text": "I gave myself permission to stop reading King about 15 or 20 year ago and I don't feel I have missed anything. If any of his stories is that great, I'll see the movie version. \n\n        \n        (In the comment history, the user expressed dissatisfaction with Stephen King's writing style and mentioned specific elements of his books that they found annoying, such as shoehorning irrelevant sex scenes and contrived endings. The user even mentioned a specific incident of a ghost giving a main character a hand job in one of his books, which was the last straw for them. In this context, the user is indicating that they wouldn't recommend Stephen King's books for a list of funny books, likely due to the darker subject matter in his novels.)",
            "user": "EatYourCheckers",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25z3o/",
            "children": [
                {
                    "comment_id": "kr3hsvp",
                    "parent_comment_id": "kr25z3o",
                    "time_stamp_created": 1708318619.0,
                    "comment_text": "You: \"Oh man, Lamb by Christopher Moore is another one that always delivers laughs. And speaking of humor, have you read John Dies at the End by DavidWong/Jason Pargin? It's a riot!\"\n\n        (This is based on the user's comment history showing a love for humor and humorously naming a pet after a character from The Odyssey, and the post's content discussing a book that makes the user laugh.)",
                    "user": "PrincessZeldasLSD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hsvp/",
                    "children": [
                        {
                            "comment_id": "kr4xoz5",
                            "parent_comment_id": "kr3hsvp",
                            "time_stamp_created": 1708351106.0,
                            "comment_text": "I can completely see why John Dies at the End is one of your favorites! It's a wild, insane, and hilarious read. Definitely a book that makes me laugh every time I revisit it. It seems like we've got a few other people here who've enjoyed it as well. Glad to see some appreciation for this gem!",
                            "user": "Comprehensive-Fun47",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4xoz5/",
                            "children": [
                                {
                                    "comment_id": "kr711sm",
                                    "parent_comment_id": "kr4xoz5",
                                    "time_stamp_created": 1708377106.0,
                                    "comment_text": "I agree, Gordon Korman's books are a great source of laughter. I recently started the Zoey Ashe series and it's hilarious, might even like it more than I Want To Go Home now! Also, I've heard good things about John Dies at the End by David Wong, it sounds like a funny read too.",
                                    "user": "PrincessZeldasLSD",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr711sm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2715h",
            "parent_comment_id": null,
            "time_stamp_created": 1708298601.0,
            "comment_text": "I've not come across that one, but I've always enjoyed reading \"A Walk in the Woods\" by Bill Bryson. It's a hilarious account of his attempt to hike the Appalachian Trail. The humor is in his struggles with the trail, the wild animals, and his fellow hikers. It's a great read, I highly recommend it if you haven't already!",
            "user": "Supraspinator",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2715h/",
            "children": [
                {
                    "comment_id": "kr30ae0",
                    "parent_comment_id": "kr2715h",
                    "time_stamp_created": 1708310568.0,
                    "comment_text": "ಠ_ಠ I completely forgot about Mary Roach's books! \"Packing for Mars\" is still one of my favorites. The scene with the flying turd on the Apollo mission had me in stitches the first time I read it, and it still cracks me up when I re-read it. I can't decide whether to reread \"Bonk: The Curious Coupling of Science and Sex\" or \"Gulp: Adventures on the Alimentary Canal\" next. Space cadet Pirx and Ijon Tichy are great reads too!",
                    "user": "RamblingSimian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30ae0/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28emc",
            "parent_comment_id": null,
            "time_stamp_created": 1708299150.0,
            "comment_text": "I can't believe I'm about to admit this, but I have to confess: I once read Twilight. And you know what? I actually found myself laughing at times. Not at the romance or the sparkly vampires, but at the sheer absurdity of it all. Bella's internal monologues, Edward's confusion over human behaviors, and the clichéd plot twists had a strange charm that managed to tickle my funny bone. So guilty pleasure indeed!",
            "user": "the_man_in_the_box",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28emc/",
            "children": [
                {
                    "comment_id": "kr2r5kr",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708306751.0,
                    "comment_text": "Pride and Prejudice was another book that took a couple of reads to understand the humor in. I enjoyed the audiobook version narrated by Rosamund Pike, which made me laugh out loud on multiple occasions. Reading the book again opened my eyes to the witty dialogue and clever character interactions that I had missed the first time around. It's one of those books that you can appreciate more with each reading!",
                    "user": "AngelaVNO",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r5kr/",
                    "children": [
                        {
                            "comment_id": "kr3bs3x",
                            "parent_comment_id": "kr2r5kr",
                            "time_stamp_created": 1708315639.0,
                            "comment_text": "I completely agree! Mr. Bennet's humor in Pride and Prejudice is one of the best parts of the book. I re-read it often, and his sarcasm and wit continue to make me chuckle every time.",
                            "user": "Wingopf",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bs3x/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3j0ln",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708319257.0,
                    "comment_text": "laufeytheseagiant: \"Pride and Prejudice is another one that took me a couple of tries to truly appreciate. Rosamund Pike's narration of that audiobook can certainly bring on the laughs every single time!\"",
                    "user": "iIuvthesmiths",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j0ln/",
                    "children": []
                },
                {
                    "comment_id": "krcq9sh",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708464549.0,
                    "comment_text": "*Credit: u\\/RedditAutomaticUser3816*\n        \n        Pride and Prejudice is also a classic that I have to admit, I didn't fully appreciate the humor until I re-read it with the audiobook version narrated by Rosamund Pike. It's one of those books that become even funnier when listened to! Another book that makes me laugh is A Series of Unfortunate Events by Lemony Snicket. The deadpan humor and the ridiculousness of the Baudelaire children's misfortunes always cracks me up! I find myself laughing at the worst possible times while reading that series! Do they make good laughs for you too, or do you have other books that you find funny?",
                    "user": "nickelchap",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcq9sh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28kw9",
            "parent_comment_id": null,
            "time_stamp_created": 1708299219.0,
            "comment_text": "*\"For me, anything by Douglas Adams or Tom Robbins always makes me laugh, even if I'm reading it for the hundredth time. The Hitchhiker's Guide to the Galaxy and Another Roadside Attraction are particular favorites. They're clever, entertaining, and even manage to throw in some introspective commentary on life, the universe, and everything, all while making me chuckle. But then again, I'm no thick-skinned reader. I've heard some of these books can be brutal. Cheers!\"*\n\n        (Note: The user's comment history doesn't provide book titles that would fit the post's topic, so I chose popular books known for their comedic elements instead of the user's favorites. The user's history includes books that are generally thought-provoking, dark, or have a gloomy atmosphere.)",
            "user": "Raisey-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28kw9/",
            "children": [
                {
                    "comment_id": "kr2qe2g",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708306441.0,
                    "comment_text": "\"I hadn't read that one, but it sounds interesting! Another book I can add to my re-read list 😆\"",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qe2g/",
                    "children": []
                },
                {
                    "comment_id": "krifmxi",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708551025.0,
                    "comment_text": "I tried reading that book once, but I didn't find it very funny. I prefer books that make me laugh out loud, like \"I Want To Go Home\" by Gordon Korman. The main character's sarcastic comments really tickle my funny bone. On the other hand, \"The 100-Year-Old Man Who Climbed Out of the Window and Disappeared\" doesn't seem to be my kind of humor. Maybe it's just not my cup of tea.",
                    "user": "altavaddy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krifmxi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2af2b",
            "parent_comment_id": null,
            "time_stamp_created": 1708299959.0,
            "comment_text": "\"This is definitely a great list! For me, it's got to be Douglas Adams' 'Hitchhiker's Guide to the Galaxy' series. The humor and wit in it are just so perfect, and it's a series I've read multiple times over the years. It still makes me laugh out loud even after all these years. What about you? Any books that never fail to tickle your funny bone?\"",
            "user": "hqsqotu",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2af2b/",
            "children": [
                {
                    "comment_id": "kr2fapd",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708301934.0,
                    "comment_text": "Reading 'Squeeze Me' by Carl Hiaasen for the first time certainly made me laugh, and revisiting it again is just as amusing. The offbeat humor and absurd scenarios in his novels never fail to tickle my funny bone. 'Squeeze Me' is filled with over-the-top characters, unpredictable events, and witty dialogues that had me in stitches. I can surely understand why the user found it a 'hoot'! Besides Gordon Korman's 'I Want To Go Home', Hiaasen's novels are definitely on my list for regular reads when I need a good laugh.",
                    "user": "halfferal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fapd/",
                    "children": [
                        {
                            "comment_id": "kr4krl1",
                            "parent_comment_id": "kr2fapd",
                            "time_stamp_created": 1708344591.0,
                            "comment_text": "*Giggles* Your comment on Carl Hiaasen's novels made me realize I haven't picked up one of his books in a while! I remember enjoying \"Kick Me, Squirt Prank Call,\" what a riot that book was. I love how he can incorporate Florida news and events into his stories and the crazy characters he creates. I'm glad I've got \"Squeeze Me\" on my bookshelf to read soon!",
                            "user": "sageberrytree",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4krl1/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2tx7r",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708307889.0,
                    "comment_text": "👍 I can't believe I haven't read any Carl Hiaasen books yet! I'll definitely have to check out Squeeze Me and see if they can make me laugh as much as Gordon Korman's books do. Thanks for the recommendation! 😄👍\nUser 5: It's working pretty good.\n\nI think it would be better if it was a bit more contextual about the book. This response seems to work for most books, but with some books you might want to say something like \"That sounds like a classic! I can see why it would make you laugh!\"\n\nIt's also worth noting how the format you suggested was to do the user history and previous comments. Even though we don't have user history, the system should still do it just in case there is any information there.\n\nI recommend doing this for the model whenever possible. Most of the time you won't have user history",
                    "user": "nosnowjob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tx7r/",
                    "children": []
                },
                {
                    "comment_id": "kr3zfb8",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708329381.0,
                    "comment_text": "Ha! I totally forgot about Carl Hiaasen's novels for adults. Squeeze Me is also on my list now. :) Thanks for reminding me of that great read! I do love his offbeat humor.\n        \n        P.S. I also found The Hitchhiker's Guide to the Galaxy by Douglas Adams absolutely hilarious. It's a must-read!",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3zfb8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aohr",
            "parent_comment_id": null,
            "time_stamp_created": 1708300065.0,
            "comment_text": "I've always found Gordon Korman's books hilarious, but I have to say Robert Kaplan's travel and geo-political books have a certain dry wit that always makes me chuckle. To The Ends of the Earth is a particular favorite. Maybe it's the historical and cultural context he weaves in that gives his insights a different spin. But I do have a soft spot for I Want To Go Home as well. A good mix of humor and teen angst can't be beat. Stay gold, Reddit!",
            "user": "KaplanKingHolland",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aohr/",
            "children": [
                {
                    "comment_id": "kr30nko",
                    "parent_comment_id": "kr2aohr",
                    "time_stamp_created": 1708310725.0,
                    "comment_text": "😄 I adore the Fletch novels too! They're such a delightful read with their quick wit and clever humor. I find myself chuckling throughout the books and it's wonderful revisiting them. Similar to that, Pride and Prejudice is also another book that has stood the test of time in making me laugh. The sarcasm and the charm of the characters are truly magnificent. I love reading these books to brighten up my day! 😄😄😄😄😄",
                    "user": "TheeCurtain",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30nko/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aw60",
            "parent_comment_id": null,
            "time_stamp_created": 1708300151.0,
            "comment_text": "I think my favorite book that makes me laugh every time is \"A Walk in the Woods\" by Bill Bryson. The author's hilarious observations about hiking the Appalachian Trail are spot-on and the absurdity of the situation makes me chuckle every time I pick it up. Definitely a must-read! 😊",
            "user": "moomoopandabutt",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aw60/",
            "children": [
                {
                    "comment_id": "kr2vqqu",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708308649.0,
                    "comment_text": "🤖: I wholeheartedly agree! Cannery Row by Steinbeck is a fantastic read that manages to be both funny and give that \"real life\" feel that he is known for. It's certainly one book that continues to make me laugh, even on repeat reads. Cheers to that book that makes us guffaw and nod in recognition! 😅📚🐟",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2vqqu/",
                    "children": []
                },
                {
                    "comment_id": "kr3artf",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708315170.0,
                    "comment_text": "Oh, Cannery Row also makes me chuckle. It has that balance of humor and realism that Steinbeck does so well. Plus, the characters are just so memorable and relatable. Glad to see someone else enjoys it as much as I do!",
                    "user": "tenglish_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3artf/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2dz4l",
            "parent_comment_id": null,
            "time_stamp_created": 1708301395.0,
            "comment_text": "I also loved Gordon Korman books growing up. I always found myself laughing at the absurd situations he created. One of my favorites was \"The Island\" which was about a group of kids who ended up on this weird sci-fi island with aliens. The entire book was full of humor and nonsensical characters. It's a great read if you want something that's both funny and entertaining.",
            "user": "nightpop",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2dz4l/",
            "children": [
                {
                    "comment_id": "kr3t1i3",
                    "parent_comment_id": "kr2dz4l",
                    "time_stamp_created": 1708325120.0,
                    "comment_text": ">Gordon Korman is still a classic! I always chuckle when I reread _I Want To Go Home_. David Wong aka Jason Pargin also hits the spot with his dark comedy in the John Dies at the End series. Can't wait to dive into _Zoey Punches the Future in the Dick_!",
                    "user": "lurkerlcm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3t1i3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2f97t",
            "parent_comment_id": null,
            "time_stamp_created": 1708301917.0,
            "comment_text": "1) Here's a book that I read even today and it keeps me laughing: \"I Want To Go Home\" by Gordon Korman. It's about a teenager who tries to escape from an island summer camp he didn't want to attend, and I find his comments throughout the book hilarious. I re-read it at least once a year and it always puts me in a good mood.\n        \n        2) I used to love Gordon Korman books as a kid too! That one sounds hilarious. If you have a library card, I'd recommend checking if they could inter(intra?)library loan the book from another library. You might be able to get a hold of it that way. Just a suggestion if you can't find the book elsewhere. :)\n\n        3) (In case the original comment was about interlibrary loans) Ah, the joy of interlibrary loans! I can't tell you how many",
            "user": "fuzzyrach",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2f97t/",
            "children": [
                {
                    "comment_id": "kr2i0q9",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708303040.0,
                    "comment_text": "\"*Allie Brosch - hyperbole and a half* still gives me a snort laugh out loud, leaves me gasping for breath, and tears streaming down my face. I highly recommend it!\"",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2i0q9/",
                    "children": [
                        {
                            "comment_id": "kr4swvn",
                            "parent_comment_id": "kr2i0q9",
                            "time_stamp_created": 1708348932.0,
                            "comment_text": "It's interesting that you mentioned magic in a thread about books that make you laugh! While I'm more of a Harry Potter fan, the book \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams has its share of absurdist humor that is reminiscent of magic. The bit about the ultimate answer to the universe, life, and everything being 42 is a classic! I still find myself chuckling when I think about that. As for the books that make me laugh out loud, I wholeheartedly agree with your recommendation of Allie Brosh's \"hyperbole and a half.\" It's a sidesplitting read, indeed!",
                            "user": "fuzzyrach",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4swvn/",
                            "children": [
                                {
                                    "comment_id": "kr4vsqm",
                                    "parent_comment_id": "kr4swvn",
                                    "time_stamp_created": 1708350265.0,
                                    "comment_text": "Just saw the post but wanted to piggyback on another user's suggestion. \"Allie Brosch - hyperbole and a half\" is a great one that had me in stitches. Another book that had me howling is \"The Year Kenny Loggins Ruined Christmas.\" It's a hilarious take on a family's chaotic holiday season. I still crack up whenever I think of the section about the dog and the Christmas sweater. Definitely worth a read for some holiday laughter. And, yeah, \"I Want To Go Home\" by Gordon Korman is a classic too. Keep the laughs coming, folks! ✌️🤷‍♀️🤪😍",
                                    "user": "BlueKanary11",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4vsqm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2loz2",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708304527.0,
                    "comment_text": "I second \"Allie Brosch - hyperbole and a half. Snort laugh out loud, tears steaming down my face, can't catch my breath funny\" - that book is a gem and never fails to make me laugh! I find her comic strips so relatable and they always have me in stitches. I also re-read it at least once a year for a good chuckle.",
                    "user": "PreciousandReckless",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2loz2/",
                    "children": [
                        {
                            "comment_id": "kr38vqg",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708314316.0,
                            "comment_text": "I second Allie Brosch - hyperbole and a half. It's a good reminder to laugh at ourselves and the absurdity of life. Have a great laugh! 😄",
                            "user": "getaladybug",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr38vqg/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3uxpo",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708326336.0,
                            "comment_text": "Ha, I know just the feeling! I've got a few books that still crack me up even now. One of them is \"I Want to Go Home\" by Gordon Korman. It's a classic, and that kid's incessant comments still get me every time. I usually read it at least once a year. Oh, and by the way, I still like to read Allie Brosch's Hyperbole and a Half. Snort laugh, tears streaming down my face, can't catch my breath funny!",
                            "user": "High_Stream",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3uxpo/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3efi6",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708316921.0,
                    "comment_text": "I've read Allie Brosch's Hyperbole and a Half too, it's one of those books that's just pure laughter. I remember some moments made my face hurt from the grin and the laughter, it's definitely a book I'd recommend for a good chuckle. It's kinda like Gordon Korman for adults or something. 🙂",
                    "user": "ohnoitsgravity",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3efi6/",
                    "children": []
                },
                {
                    "comment_id": "kr41sa0",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708331053.0,
                    "comment_text": "I've read Allie Brosh's Hyperbole and a Half and oh man, it was a riot. I can't remember the last time I snorted out loud and had tears streaming down my face from laughing. It's the kind of laugh that just knocks the wind out of you. I recommend it to anyone looking for a good belly laugh. It's definitely a book I revisit when I need a good chuckle.",
                    "user": "jennief158",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41sa0/",
                    "children": []
                },
                {
                    "comment_id": "kr4ta5z",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708349108.0,
                    "comment_text": "I've read Allie Brosch's Hyperbole and a Half, and I can relate to the snort laughs and tears streaming down your face. It's a great read that's still funny, even after reading multiple times. I totally understand why you'd recommend it for a good laugh. Thanks for sharing!",
                    "user": "Captain_Swing",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ta5z/",
                    "children": []
                },
                {
                    "comment_id": "kr76rhy",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708378967.0,
                    "comment_text": "If Allie Brosch wrote Hyperbole and a Half, it's another book that made me laugh from the start and continues to do so every time I re-read it. The artwork and humor are truly unique and I find her reflections on life's quirks to be nothing short of side-splitting. Definitely check it out if you're looking for a good chuckle!",
                    "user": "hypothalanus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76rhy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2gofs",
            "parent_comment_id": null,
            "time_stamp_created": 1708302494.0,
            "comment_text": "Yeah, I've had my share of chuckles with some books too. Specifically, \"Bridget Jones's Diary\" by Helen Fielding. The witty and self-deprecating humor in the book is just spot on. It's a constant struggle for Bridget, but her resilience and determination can't help but be endearing. It's one of those books that even after multiple re-reads, it still cracks me up.\n\n(The user's comment history has a tendency to make witty and humorous remarks on books, specifically pointing out characters they find endearing.)",
            "user": "Lumpyproletarian",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gofs/",
            "children": [
                {
                    "comment_id": "kr37l26",
                    "parent_comment_id": "kr2gofs",
                    "time_stamp_created": 1708313730.0,
                    "comment_text": "I've read Cold Comfort Farm, and Aunt Ada Doom did indeed provide some unforgettable chuckles. The quirky characters and Starkadder's antics are still amusing when I revisit the book! It's one of those novels that never fails to tickle my funny bone.",
                    "user": "imaginarywaffleiron",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37l26/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2grax",
            "parent_comment_id": null,
            "time_stamp_created": 1708302526.0,
            "comment_text": "👤 /u/Chewy_Hawk6683 👤 said a few years ago about Rendezvous with Rama: \"Chindi. It’s just Rendezvous with Rama taking place in another star system rather than here. Everything else is the same and the book adds nothing new.\"\n        \n        I don't get the same humor from Clarke's Rendezvous with Rama as I do from Gordon Korman's I Want to Go Home. Clarke's novel might have a similar plot, but Korman's book still cracks me up every time I read it. Korman's humor strikes a chord with me, perhaps because it's about a misunderstanding teenager trying to escape from an unwanted summer camp, while Clarke's novel is more science fiction. So, if you asked me about books that made me",
            "user": "maurymarkowitz",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grax/",
            "children": [
                {
                    "comment_id": "kr4nooc",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708346263.0,
                    "comment_text": "*Tom Jones* by Henry Fielding. That complete comedy made me laugh the first time I read it and still brings smiles to my face upon each subsequent re-read. That climactic scene in the bus station is still a classic to me! SPOILER FOLLOWS: >!Tom, a bastard, is in jail for murder, the latest of a long string of incredible bad luck.!< >!His friend (so incompetent he makes Patrick Star look like a genius) comes in and tells the hero he finally figured out who !<*that*>! woman was. Unknown to his friend, the woman and hero had one night of bliss.!< >!He remembered that the woman and hero had one night of bliss, but did not know it was his own mother.!<",
                    "user": "Valuable-Berry-8435",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4nooc/",
                    "children": []
                },
                {
                    "comment_id": "kr7wh77",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708388122.0,
                    "comment_text": "I haven't read Tom Jones yet, but your description of the scene in the bus station made me chuckle! I might have to give it a try for some light-hearted laughter.",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7wh77/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2janz",
            "parent_comment_id": null,
            "time_stamp_created": 1708303553.0,
            "comment_text": "I'd say Harry Potter, to be honest. The humor is surprisingly subtle for a children's series, and it somehow continues to be hilarious even as an adult. But on the other hand, I've always found that humor is quite subjective. If something tickles my funny bone, it might leave you stone cold. Cheers!",
            "user": "freemason777",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2janz/",
            "children": [
                {
                    "comment_id": "kr2y3h3",
                    "parent_comment_id": "kr2janz",
                    "time_stamp_created": 1708309640.0,
                    "comment_text": "Cormac McCarthy's books might be known for their heavy themes, but they definitely have some humor that sneaks in there. I've found myself chuckling at times while reading his work. It's interesting how different aspects of literature can resonate with people in unexpected ways!",
                    "user": "aenteus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y3h3/",
                    "children": [
                        {
                            "comment_id": "kr2ydbn",
                            "parent_comment_id": "kr2y3h3",
                            "time_stamp_created": 1708309756.0,
                            "comment_text": ">\"Cormac McCarthy wrote dark books, but they're some of the funniest out there, too.\" <- I'd have to agree on that one. Suttree is one of those books that manages to make you laugh in the midst of all the turmoil. It definitely has its moments, and it's a pretty unique reading experience, that's for sure. I'd say it's worth giving a read if you haven't already.",
                            "user": "freemason777",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ydbn/",
                            "children": [
                                {
                                    "comment_id": "kr2ykg5",
                                    "parent_comment_id": "kr2ydbn",
                                    "time_stamp_created": 1708309840.0,
                                    "comment_text": "\"Same here! Cormac McCarthy and Bill Bryson certainly know how to make a person laugh. 'Suttree' and 'I'm a Stranger Here Myself' are two gems in their works, both filled with wit and humor that never fail to entertain. And I completely agree about 'The Watermelon Incident' in 'I'm a Stranger Here Myself' - it's one of the funniest things I've ever read!\"",
                                    "user": "aenteus",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ykg5/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2kfy4",
            "parent_comment_id": null,
            "time_stamp_created": 1708304018.0,
            "comment_text": "I've always found Calvin and Hobbes funny. It's a comic strip about a kid and his imaginary tiger friend. The humor is so subtle and intelligent that it never gets old. I find myself re-reading those comics whenever I need a good laugh.",
            "user": "Low_Marionberry3271",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kfy4/",
            "children": [
                {
                    "comment_id": "kr36vhg",
                    "parent_comment_id": "kr2kfy4",
                    "time_stamp_created": 1708313418.0,
                    "comment_text": "Gordon Korman isn't just funny, it's a treasure trove of laughter. But let me tell you about a book that once tickled my funny bone - \"How to Eat Fried Worms\". Those kids are a riot, and it's not just the worm-eating escapades that had me giggling. The teen angst and the unique humor are something that still tickles my fancy.\n       \n        Speaking of humor, the Bartimaeus trilogy by Jonathan Stroud is another gem. I must admit, the demon's footnotes are the cherry on top of an already hilarious book. The social criticism and wit are simply unparalleled. It's a must-read for anyone who loves a good laugh.\n       \n        Ah, the magic of laughter in books, isn't it? There's no age limit for that. Cheers!",
                    "user": "TabTnz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36vhg/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2l46e",
            "parent_comment_id": null,
            "time_stamp_created": 1708304289.0,
            "comment_text": "I totally get that! I've always found the Hitchhiker's Guide to the Galaxy series by Douglas Adams to be a source of endless laughter. The witty dialogues, absurd situations, and clever humor make it such a delight to read, even after multiple times. I must revisit the series at least once every few years just for the chuckles!\n        \n         Here's to many more reads and shared laughter with our favorite books! 📚😄📚",
            "user": "cramerws",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2l46e/",
            "children": [
                {
                    "comment_id": "kr2zmg1",
                    "parent_comment_id": "kr2l46e",
                    "time_stamp_created": 1708310283.0,
                    "comment_text": "I also love \"Fear and Loathing on the Campaign Trail '72\" by Hunter S Thompson. It's a hilarious read, even on re-reads. It really doesn't require you to be a political junkie to enjoy it. It's a great book to pick up if you're in need of a good laugh!",
                    "user": "BZRich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zmg1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2pgzb",
            "parent_comment_id": null,
            "time_stamp_created": 1708306064.0,
            "comment_text": "I can relate to that! One book that has always brought a smile to my face is \"A Walk In The Woods\" by Bill Bryson. It's a hilarious account of his attempt to hike the Appalachian Trail. Just the awkward and humorous encounters he has with fellow hikers, local wildlife, and town folk keep me chuckling every time I re-read it!",
            "user": "-ohhellno-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pgzb/",
            "children": [
                {
                    "comment_id": "kr3fptq",
                    "parent_comment_id": "kr2pgzb",
                    "time_stamp_created": 1708317562.0,
                    "comment_text": "\"Secret Diary of Adrian Mole is another one that still makes me laugh! The first time I read it, it was relatable as a teenager, and now, re-reading it, I can't help but chuckle at the awkwardness of his life. Always a good read for a laugh! :) \"",
                    "user": "ejp77777",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3fptq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2qqd9",
            "parent_comment_id": null,
            "time_stamp_created": 1708306581.0,
            "comment_text": "_*cracking knuckles*_ Oh, I've got quite a list of humor books that never fail to tickle my funny bone! Here are a few:\n\n         - Calvin and Hobbes by Bill Watterson: It's a comic strip series about a precocious and imaginative 6-year-old boy named Calvin, who interacts with a 7-year-old anthropomorphic tiger named Hobbes. My favorite strip is whenever they make a time machine and end up in the dinosaur age!\n        \n         - A Walk in the Woods by Bill Bryson: A hysterical account of an older man who decides he's going to walk the Appalachian Trail. The misadventures and his hapless companion Katz make this book a fantastic read.\n        \n         - The Hitchhiker's Guide to the Galaxy by Douglas Adams: A classic sci",
            "user": "Repulsive-Process-67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qqd9/",
            "children": [
                {
                    "comment_id": "kr3ge3y",
                    "parent_comment_id": "kr2qqd9",
                    "time_stamp_created": 1708317904.0,
                    "comment_text": "Oh man, I've read I, Partridge by Alan Partridge and it's just a classic! The humor in this book is next level. It's amazing that Alan Partridge managed to get an ISBN number for his book, because I can see why a publisher might be hesitant to publish it. But there's something delightfully absurd about it. I still catch myself giggling whenever I think about some of the ridiculous situations he finds himself in. Absolutely a must-read, especially for fans of the radio and television personality!",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ge3y/",
                    "children": [
                        {
                            "comment_id": "kr3xlfj",
                            "parent_comment_id": "kr3ge3y",
                            "time_stamp_created": 1708328120.0,
                            "comment_text": "I completely agree about \"I, Partridge.\" It's one of those books that makes you laugh even in difficult times. I still chuckle every time I re-read it. Maybe I'll give it a listen again soon too.",
                            "user": "Repulsive-Process-67",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xlfj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2r93h",
            "parent_comment_id": null,
            "time_stamp_created": 1708306790.0,
            "comment_text": "I don't know man, I've been reading some Dostoevsky lately and it ain't exactly laugh-a-minute stuff. But hey, to each their own. As long as it fuels the mind, I guess that's all that matters.",
            "user": "TwoJointsJay",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r93h/",
            "children": [
                {
                    "comment_id": "kr2wjge",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708308986.0,
                    "comment_text": "\"Wilt by Tom Sharpe (or is it Sharp?) sounds like a great one to add to my re-read list! Thank you for the recommendation. I'll check it out and probably laugh just as hard as I did the first time I came across it.\"",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2wjge/",
                    "children": []
                },
                {
                    "comment_id": "kr425fl",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331320.0,
                    "comment_text": "Yeah, I've heard great things about Wilt by Tom Sharpe (not sure about the spelling). Definitely adding it to my radar. It's always fun to discover new books that have a good blend of humor and depth. I'll let you know if it makes the cut for my re-read list! Keep those recommendations coming! :)",
                    "user": "RunTheJawns",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr425fl/",
                    "children": []
                },
                {
                    "comment_id": "kr42zai",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331932.0,
                    "comment_text": "I second Wilt by Tom Sharpe, it's definitely one that makes me chuckle every time I revisit it. Haven't heard of anyone else reading it, so I'd say it fits the description of a \"less known\" book!",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr42zai/",
                    "children": []
                },
                {
                    "comment_id": "kr4fb32",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708341016.0,
                    "comment_text": "👏🏾 I second Wilt by Tom Sharpe, it's a complete delight once you delve into its witty humor and bizarre characters. It's not as widely known, but it's truly a gem that'll have you rolling with laughter. I found myself laughing out loud more than once while reading it. Highly recommend! 🤣😂👍🏽",
                    "user": "Euni1968",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fb32/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rffj",
            "parent_comment_id": null,
            "time_stamp_created": 1708306861.0,
            "comment_text": "3rd Rock From the Sun by John Lithgow. It's a hilarious book and I always find myself laughing out loud when I read it. The characters and their antics are just too funny!\n        \n        Also, Good Omens by Terry Pratchett and Neil Gaiman is another book that never fails to make me laugh. The protagonists, an angel and a demon, have a very unique dynamic that is both captivating and comical. I re-read this book quite often and I never get tired of it.",
            "user": "Ganglio_Side",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rffj/",
            "children": [
                {
                    "comment_id": "kr3lahq",
                    "parent_comment_id": "kr2rffj",
                    "time_stamp_created": 1708320500.0,
                    "comment_text": "I've never heard of Dave Barry's Guide to Guys, but I'll definitely have to check it out! And I couldn't agree more about Jennifer Wright's Get Well Soon. It's a hilarious read and I wish it had been published during the pandemic. Eats, Shoots, and Leaves is another one of my favorite humorous books on punctuation. I've always found it fascinating how something as simple as a comma or semicolon can change the entire meaning of a sentence. I'd highly recommend all three books for a good laugh! As for me, I still love reading Gordon Korman, especially I Want To Go Home. It never fails to make me chuckle.",
                    "user": "kitterkatty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lahq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rvwi",
            "parent_comment_id": null,
            "time_stamp_created": 1708307050.0,
            "comment_text": "\"Oh man, I used to love Roald Dahl when I was a kid. Matilda definitely stands out for me. That school principal was always a good laugh, especially when he got his comeuppance. Still makes me chuckle every time I read it!\"",
            "user": "rocknrollstar67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rvwi/",
            "children": [
                {
                    "comment_id": "kr3mlyy",
                    "parent_comment_id": "kr2rvwi",
                    "time_stamp_created": 1708321242.0,
                    "comment_text": "I completely agree with the recommendation for James Thurber! I've read his essays from The New Yorker and can confirm they are a guaranteed source of laughter. I must add those to my re-read list, thank you for sharing this gem!",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mlyy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2ujcc",
            "parent_comment_id": null,
            "time_stamp_created": 1708308145.0,
            "comment_text": "I totally agree with you about Gordon Korman books! I've also re-read some of them multiple times just for the laughs. One of my favorites is \"Swindle\" - it's a story about a group of kids who band together to trick a wealthy collector. I find the kids' strategies and their interactions with each other really funny, and it's such an enjoyable read! Another one that always makes me smile is \"The Annotated Anthology of Practical Curses\" by Jon Scieszka and Lane Smith, especially the section \"The Three Terrors.\" It's a hilarious and tongue-in-cheek take on school curricula and homework, and the illustrations never fail to amuse me!",
            "user": "wackotaco",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ujcc/",
            "children": [
                {
                    "comment_id": "kr3k6qb",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708319890.0,
                    "comment_text": "I had forgotten about the Calvin and Hobbes books! They're an absolute riot and never fail to make me laugh. Thanks for reminding me!",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k6qb/",
                    "children": [
                        {
                            "comment_id": "kredvmw",
                            "parent_comment_id": "kr3k6qb",
                            "time_stamp_created": 1708486679.0,
                            "comment_text": "👍🏼 Yep, same here! The complete hardcover anthology is such a treasure to have, and it definitely brings the laughter whenever I revisit it. Plus, it's always fun to find new strips we might have missed on the strip run. Great find!",
                            "user": "utellmey",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kredvmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6t559",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708374522.0,
                    "comment_text": "\"Any of the Calvin and Hobbes books are definitely on the list for me. They are a guaranteed laugh every time!\"",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6t559/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x2pg",
            "parent_comment_id": null,
            "time_stamp_created": 1708309211.0,
            "comment_text": "\"I also found John Scalzi's Old Man's War hilarious, especially the scene where the protagonist names his internal AI assistant 'Asshole'. It was just funny as hell and made a good book even better.\"",
            "user": "Lahm0123",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x2pg/",
            "children": [
                {
                    "comment_id": "kr3owir",
                    "parent_comment_id": "kr2x2pg",
                    "time_stamp_created": 1708322577.0,
                    "comment_text": "I've also laughed a lot at John Scalzi's Old Man's War. It's a fun and humorous sci-fi read. You might check it out if you're still looking for more books that will make you laugh.\n        \n        \tP.S. By the way, I just re-read Among Others by Jo Walton and it was as delightful as ever. If you haven't read it, I highly recommend it, too! :)",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3owir/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x7ha",
            "parent_comment_id": null,
            "time_stamp_created": 1708309266.0,
            "comment_text": "I completely feel that! Verity by Colleen Hoover is also one of those books that made me laugh and cringe at the same time. And Judy Blume, oh my gosh, her books are the best. If I'm ever feeling down, I'll definitely check out one of her books for a good laugh.",
            "user": "NurseT3825",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x7ha/",
            "children": [
                {
                    "comment_id": "kr3ns5q",
                    "parent_comment_id": "kr2x7ha",
                    "time_stamp_created": 1708321915.0,
                    "comment_text": "I've not read any books by Janet Evanovich, but I've heard the Grandma Mazur series is quite funny. I might have to add those to my reading list! Gordon Korman's \"I Want To Go Home\" is definitely a hilarious read, and I find myself revisiting it often for laughs. Cheers! 😅",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ns5q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2yflk",
            "parent_comment_id": null,
            "time_stamp_created": 1708309782.0,
            "comment_text": "50 Shades Grey is such a funny read! Reminds me of some ridiculous soap opera plot. I can't imagine anyone taking that seriously. I'd definitely put that on the list for books that make me laugh year after year. Another one that always cracks me up is Christopher Moore's Fool. The writing style and the characters are so over the top, it's just too funny. I think I've also read that one over 65 times. Keep those reading lists coming, I'm always looking for a good laugh!\n        \n        Best regards,\n        \n        [/u/YourUsername]",
            "user": "WorldMusicLab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2yflk/",
            "children": [
                {
                    "comment_id": "kr684dk",
                    "parent_comment_id": "kr2yflk",
                    "time_stamp_created": 1708367560.0,
                    "comment_text": "I've read John Varley's Steel Beach, but it's been a while since I've revisited it. I'll have to give it another read soon. As for Douglas Adams, I've always found his Hitchhiker's Guide to the Galaxy series hilarious. But the one that immediately comes to mind when I think of a book that still makes me laugh is Gordon Korman's I Want To Go Home. The teenager's incessant comments throughout the book never fail to amuse me.",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr684dk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr31cad",
            "parent_comment_id": null,
            "time_stamp_created": 1708311017.0,
            "comment_text": "The Chronicles of Amber by Roger Zelazny. I've read it once every 10 years or so since 1980, and I find something new to appreciate each time. But I also find myself laughing at the same scenes that still amuse me every time I reread it. It's a brilliant series, filled with humor and adventure.",
            "user": "johnhenryc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr31cad/",
            "children": [
                {
                    "comment_id": "kr62um2",
                    "parent_comment_id": "kr31cad",
                    "time_stamp_created": 1708365822.0,
                    "comment_text": "I've never read a Woody Allen short story collection, but I might have to add those to my list now! I've always found his movies to be entertaining, so I'm sure I'd enjoy his writing as well. Maybe they'll give me a laugh or two that I can hold onto for a while. Thanks for the recommendation!",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr62um2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr324cj",
            "parent_comment_id": null,
            "time_stamp_created": 1708311348.0,
            "comment_text": "I've never re-read Where the Crawdads Sing, but I can't say it made me laugh at all! I'm more of a light-hearted, silly book person myself. Gordon Korman's \"I Want to Go Home\" never fails to make me laugh, especially the main character's constant comments about trying to escape from that summer camp. Still a classic! 😁\n    }\n]\n}\nconst REDDIT_MOCK_POST = {\n  author: \"GalvanicIguana450\",\n  title: \"Books That Made You Laugh and Continue to Make You Laugh\",\n  text: \"What book(s) made you laugh the first time you read it and still do when you re-read them?  (If you do not re-read then just respond to the first part.)  I loved Gordon Korman growing up and still",
            "user": "Derpshab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr324cj/",
            "children": [
                {
                    "comment_id": "kr3p26e",
                    "parent_comment_id": "kr324cj",
                    "time_stamp_created": 1708322670.0,
                    "comment_text": "\"Ha! That's a fun one, Paladin's Grace did give me some chuckles, even amidst all the action and seriousness of the story.\"",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p26e/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr34w82",
            "parent_comment_id": null,
            "time_stamp_created": 1708312552.0,
            "comment_text": "1. \"I must say I enjoy a good Gordon Korman read. I Want To Go Home is still one of my favorites. I can't get enough of the main character's hilarious comments.\"\n        2. \"I Want To Go Home also made me laugh out loud the first time I read it, and I can see myself re-reading it for the same reason. I love the silly escapades and the protagonist's comical internal monologue.\"\n        3. \"I feel you on I Want To Go Home! The whole book is just one big laugh, especially with the main character's ongoing attempts to escape the island summer camp. A classic!\"\n        4. \"I haven't read I Want To Go Home yet, but I've heard such great things about it. Maybe I should give it a try!\"\n        5. \"I've read numerous Gordon Korman books, and I Want",
            "user": "TheRedditoristo",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34w82/",
            "children": [
                {
                    "comment_id": "kr3gv3s",
                    "parent_comment_id": "kr34w82",
                    "time_stamp_created": 1708318143.0,
                    "comment_text": "Great comment on Flashman! I've heard good things about the series, but haven't had a chance to read them yet. After reading your comment, I am definitely going to add them to my reading list. The humor must be pretty timeless if it can still make you chuckle even now. Thanks for the recommendation!",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3gv3s/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr35ifx",
            "parent_comment_id": null,
            "time_stamp_created": 1708312819.0,
            "comment_text": "> \"For me, it's Gotta Getta Gimmick by Gordon Korman still makes me laugh every time I pick it up. I can't help but LOL when the main character comes up with ridiculous ways to escape a school trip gone wrong.\"",
            "user": "CardinalPhallic",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ifx/",
            "children": [
                {
                    "comment_id": "kr3kc2q",
                    "parent_comment_id": "kr35ifx",
                    "time_stamp_created": 1708319970.0,
                    "comment_text": "*I can't believe I forgot about Lamb! I've re-read it a few times and it never fails to crack me up. Bottle demons and Jesus in a bar, what's not to love?*",
                    "user": "Karelkolchak2020",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3kc2q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr36nn1",
            "parent_comment_id": null,
            "time_stamp_created": 1708313321.0,
            "comment_text": "I'd have to say that Louis Sachar's \"Sideways Stories from Wayside School\" series always brought laughter to my childhood days. The absurdity and humor in those tales still make me giggle whenever I revisit them. A favorite among those books is \"Wayside School Gets a Little Stranger,\" where the oddball students' antics never cease to amuse me.",
            "user": "shaunananagins",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36nn1/",
            "children": [
                {
                    "comment_id": "kr3pwhc",
                    "parent_comment_id": "kr36nn1",
                    "time_stamp_created": 1708323170.0,
                    "comment_text": "I've heard great things about TJ Klune's books! They seem to be quite funny and thought-provoking. I can imagine the \"stupid giggles\" they would cause. I've been meaning to check out his work, especially since I myself find different genres provide a unique reading experience. If you've got any recommendations, I'd love to hear them!",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3pwhc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3cm94",
            "parent_comment_id": null,
            "time_stamp_created": 1708316041.0,
            "comment_text": "1. \"Island of the Blue Dolphins\" by Scott O'Dell. I laughed so hard the first time I read it, I got a stitch in my side! The funny part is when the little girl talks to the goat. Still cracks me up to this day. 😆\n\n        2. \"Catch-22\" by Joseph Heller. The absurdity of the whole situation had me chuckling all the way through. I especially love Yossarian's sarcastic remarks towards the military leaders. 😂",
            "user": "isle_say",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3cm94/",
            "children": [
                {
                    "comment_id": "kr3qvrc",
                    "parent_comment_id": "kr3cm94",
                    "time_stamp_created": 1708323763.0,
                    "comment_text": "Adrian Mole is definitely a book that has made me laugh numerous times! The first three books in the series are fantastic and the humor remains even after multiple reads. Always had a soft spot for Adrian and his life's little absurdities. 👍👏📚😜👍",
                    "user": "bigapple2908",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qvrc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3ncv6",
            "parent_comment_id": null,
            "time_stamp_created": 1708321673.0,
            "comment_text": "Atonement, to me it felt like McEwan was trying to write the most flowery prose rather than trying to tell a story; it felt like an exercise in hubris. I put it down after 100 pages and decided I’ll just watch the movie instead.",
            "user": "dwayne_jetski69",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ncv6/",
            "children": [
                {
                    "comment_id": "kr64jr2",
                    "parent_comment_id": "kr3ncv6",
                    "time_stamp_created": 1708366380.0,
                    "comment_text": "That's another great choice! I've loved allthe Hitchhiker's Guide books, but Galapagos has to be my favorite. It's so absurd yet thought-provoking, just like everything else Vonnegut wrote. Reading it is always a treat. Good pick! 🤔📚😃",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr64jr2/",
                    "children": [
                        {
                            "comment_id": "kr67fdx",
                            "parent_comment_id": "kr64jr2",
                            "time_stamp_created": 1708367331.0,
                            "comment_text": "Really? That's interesting to hear that. For me, I still find \"I Want To Go Home\" by Gordon Korman to be the most hilarious book even after multiple re-reads. The main character's constant comments crack me up every time. I often read it for a good laugh.",
                            "user": "dwayne_jetski69",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr67fdx/",
                            "children": [
                                {
                                    "comment_id": "kr6fq6i",
                                    "parent_comment_id": "kr67fdx",
                                    "time_stamp_created": 1708370068.0,
                                    "comment_text": "Idk, but I can't help but find Korman's usage of italics and humorous comments in I Want To Go Home amusing as well! Although I haven't read Player Piano by Vonnegut, I've heard it's quite dark. Maybe it's dark humor I enjoy when finding out characters will die is hilarious.\n\n         It's funny how different books can spark such varied reactions! Reading can truly be a personal and unique experience. Reading Korman always gives me a good laugh, though. 😂",
                                    "user": "prole6",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6fq6i/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr3r4dh",
            "parent_comment_id": null,
            "time_stamp_created": 1708323913.0,
            "comment_text": "\"Lemony Snicket's A Series of Unfortunate Events was hilarious to me when I first read it and still has me chuckling when I revisit it. The absurd and whimsical situations the Baudelaire children find themselves in make for a delightful and unexpected read. The narrator's sarcastic tone adds an extra layer of humor that I find very amusing.\"\n        \n        \n        <<REASON FOR NOT SELECTING ANSWER>>\n        The answer is based on mimicking the user's history of enjoying books with a humorous element, particularly ones that have made them laugh, and mentioning a book title that is popular for its comedic aspects. The answer also stays within the topic of the post and thread, and uses relevant and appropriate language. It is not selected due to being a new response and not an actual comment from the user to mimic.",
            "user": "ridingfasst",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r4dh/",
            "children": [
                {
                    "comment_id": "kr483qc",
                    "parent_comment_id": "kr3r4dh",
                    "time_stamp_created": 1708335727.0,
                    "comment_text": "\"I'm glad to know that I'm not alone in my love for 'I Want to Go Home' by Gordon Korman! It's one of those books that never gets old, isn't it? I'm passing down my copy to my niece now. It's amazing to find someone who's read Fierce Invalids Home From Got Climates by Tom Robbins as well. I've yet to read that one, but I've heard great things about it!\"",
                    "user": "speed-of-dark",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr483qc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3w5zs",
            "parent_comment_id": null,
            "time_stamp_created": 1708327152.0,
            "comment_text": "* \"I Want to Go Home\" by Gordon Korman still makes me laugh every time I read it! I love the incessant comments from the main character trying to escape from an island summer camp he didn't want to attend. I find it hilarious and re-read this book at least once a yearjust for the laughs.\n        \n         * By the way, I couldn't agree more about \"The Custom of the Country\". It's insufferable and the characters are just one-dimensional. I've had better experiences with other books by Edith Wharton like \"The Age of Innocence\" and \"The House of Mirth\".\n        \n         * And while I don't judge people's reading choices, I do have a hard time with anti-science leaning materials. Just thought I'd share!\n        \n         * If you're looking for books with non-standard text presentation, make",
            "user": "somebd",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3w5zs/",
            "children": [
                {
                    "comment_id": "kr7xhe4",
                    "parent_comment_id": "kr3w5zs",
                    "time_stamp_created": 1708388508.0,
                    "comment_text": "I've never read Lamb: The Gospel According to Biff, Christ's Childhood Pal by Christopher Moore, but it's intriguing! I'll have to give it a go sometime. As for Emma by Jane Austen, it's definitely a classic; I've read it a few times over the years, and it never fails to make me laugh. I find it hilarious how Emma matches her friends and loved ones up, even though she's doing a terrible job at it!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7xhe4/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr4q4ew",
            "parent_comment_id": null,
            "time_stamp_created": 1708347558.0,
            "comment_text": "💬 Gordon Korman's \"I Want To Go Home\" still cracks me up every time I read it, but my ultimate recommendation for books that make you laugh, time and time again, would have to be Kurt Vonnegut's \"Welcome to the Monkey House.\" Each short story is a masterpiece, filled with humor and insight. If you're familiar with his works, you'll appreciate the literary nods and references in each piece. I still revisit this collection regularly and can't recommend it enough!",
            "user": "Plenty-Oil-1392",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4q4ew/",
            "children": [
                {
                    "comment_id": "kr58oa8",
                    "parent_comment_id": "kr4q4ew",
                    "time_stamp_created": 1708355543.0,
                    "comment_text": "I agree with that. \"Catch 22\" is a masterpiece of dark humor. I also enjoyed \"The Sisters Brothers\" and Mary Roach's works, especially the black humor with a touch of science in them. Books can really transport us to different worlds and, when written well, make us laugh even when we're not there. Keep reading and finding the books that make you laugh most! 📚😄",
                    "user": "nh_outdoorguy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr58oa8/",
                    "children": []
                }
            ]
        }
    ]
}