{
    "post_id": "1au5njg",
    "title": "Books That Made You Laugh and Continue to Make You Laugh",
    "content": "What book(s) made you laugh the first time you read it and still do when you re-read them?  (If you do not re-read then just respond to the first part.)  I loved Gordon Korman growing up and still re-read some of them when I need some really light reading.  For instance, I Want To Go Home still makes me laugh continually throughout the book.  It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend.  I find his incessant comments hilarious and still read this book at least once a year just for the laughs.",
    "timestamp": 1708292304.0,
    "num_comments": 653.0,
    "link": "https://www.reddit.com/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/",
    "root_comments": [
        {
            "comment_id": "kr1rn5g",
            "parent_comment_id": null,
            "time_stamp_created": 1708292804.0,
            "comment_text": "I want to add The Hitchhiker's Guide to the Galaxy to my list of books that make me laugh every time I read them. The humor is unique and the ridiculousness of the plot never fails to amuse me. It's about an intergalactic guide that is meant to have all the answers, but is often humorously inaccurate. My favorite line is when they discover a new phenomenon and they add it to the guidebook as \"unable to compute\".\n        \n        \n        (It's probably appropriate for me to include a reminder that even though The Hitchhiker’s Guide to the Galaxy was conceived by two Brits, it takes place in a fictional universe and is meant to be funny. I'm not trying to argue that books originating from places that don't have legal rights to a name are less humorous.)",
            "user": "username_elephant",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1rn5g/",
            "children": [
                {
                    "comment_id": "kr1sfui",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708293088.0,
                    "comment_text": "Sure, Pratchett should definitely be on the list. His Discworld series is full of humor and satire that has stood the test of time. I enjoyed the entire series, but \"Mort\" and \"Guards! Guards!\" were some of my favorites for their hilarious characters and witty dialogue. If you haven't read him before, give him a try!",
                    "user": "whoisyourwormguy_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1sfui/",
                    "children": [
                        {
                            "comment_id": "kr235aa",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708297079.0,
                            "comment_text": "> I've always been a sucker for Gordon Korman myself! 'I Want To Go Home' is still a solid pick for laughs. Grady Hendrix is new to me, but I'm eager to give him a shot. David Sedaris and Bill Bryson are also great for a chuckle or two, particularly when I need a good laugh in my reading routine.",
                            "user": "Trollamp",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr235aa/",
                            "children": [
                                {
                                    "comment_id": "kr3vngj",
                                    "parent_comment_id": "kr235aa",
                                    "time_stamp_created": 1708326810.0,
                                    "comment_text": "\"*I can't believe I forgot about Christopher Moore.* He's got a great sense of humor, and I've laughed out loud more than once while reading his books. One of my favorites is 'Lamb', where a man befriends a 2000 year old sheep who claims to be the lamb of the apocalypse. Highly recommend it for a good chuckle.\"",
                                    "user": "krista",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vngj/",
                                    "children": [
                                        {
                                            "comment_id": "kr4l45n",
                                            "parent_comment_id": "kr3vngj",
                                            "time_stamp_created": 1708344798.0,
                                            "comment_text": "In reply to your post about books that still make you laugh when you re-read them, I second Pratchett, Vonnegut, and Douglas Adams, but I also can't forget about Robert Asprin! His books are a great source of laughter, especially his Myth Adams series and the Phases ofate World series. I still find myself chuckling while reading them, and they never seem to lose their humor. If anyone else hasn't given those a try, give them a read! But if you're looking for something a bit lighter, maybe start with one of the shorter, quirkier books - like \"The Rational Living Handbook\" by Robert Asprin & J.R.R.R. Tolkien. :)",
                                            "user": "WesY2K",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4l45n/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr297nj",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708299473.0,
                            "comment_text": "**\"Gordon Korman is a great find! I Want To Go Home definitely has some solid laugh-out-loud moments. For some other funny reads, I'd recommend David Sedaris - he's got a distinct and hilarious take on life. And if you're into non-fiction, Bill Bryson's work never disappoints. I've re-read A Walk in the Woods and The Lost Continent a handful of times, not just for the humor but also because they're great travel essays and really well-written.**\"\n\n        **\"As for other titles I think you'd enjoy: Louis Sachar's Holes and JD Salinger's Catcher in the Rye have their funny moments that hold up over time. They might not quite be as chuckle-worthy as Korman, but they're still worth a read.\"**\n\n        **\"In a similar vein, John",
                            "user": "You_Gotta_Joint",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr297nj/",
                            "children": [
                                {
                                    "comment_id": "kr5drxc",
                                    "parent_comment_id": "kr297nj",
                                    "time_stamp_created": 1708357395.0,
                                    "comment_text": "I'm right there with you! Bill Bryson is another author whose books always make me laugh. The Lost Continent is one of my all-time favorites. It's hilarious and informative at the same time. I can see why it's a popular choice for this thread. 😜🙌\n\n        (Also, I might add that I agree on the Pratchett, Douglas Adams, and Vonnegut mentions in the thread. Catch-22, Confederacy of Dunces, and some David Sedaris books are great comedic reads too!) ✍️😄\n\n        Cheers! 🤘👍📚",
                                    "user": "minniebenne",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5drxc/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3g49d",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708317766.0,
                            "comment_text": "\"Ah yes, Pratchett, Adams, Vonnegut, and Catch-22 make for some great reads! I also have to agree with the Confederacy of Dunces and David Sedaris. And while we're on it, Bill Bryson's nonfiction is another great source of laughter.\"\n        \n        \n        *I'm interested to see the non Pratchett, Douglas adams, Vonnegut, catch-22, and confederacy of dunces answers. Maybe add David sedaris and funny nonfiction by Bill Bryson.*\n        \n        \n        (I mimicked the reddit user by acknowledging their comment and providing additional options that align with their original comment of interest)",
                            "user": "Spaceley_Murderpaws",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3g49d/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3vjkd",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708326739.0,
                            "comment_text": "*shrugs* I can't believe only Pratchett has been mentioned here... I Want To Go Home is a hilarious read, but if you're looking for non-Pratchett suggestions, I'd throw in Somebody Once Told Me..., by David Sedaris, and A Walk in the Woods, by Bill Bryson. Both authors have a knack for blending humor into their narrative in a way that's relatable and engaging, and still have me chuckling years after I first read them. Enjoy your laugh-out-loud book adventures! ;)",
                            "user": "SilverSnapDragon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3vjkd/",
                            "children": []
                        },
                        {
                            "comment_id": "kr4cp8i",
                            "parent_comment_id": "kr1sfui",
                            "time_stamp_created": 1708339135.0,
                            "comment_text": "I totally agree with you about Pratchett, Adams, and Vonnegut. Those are some hilarious books! But don't forget about David Sedaris and Bill Bryson. I'd definitely add them to the list. For me, the book that never fails to make me laugh is \"I Want To Go Home\" by Gordon Korman. The main character's constant comments are always a good laugh! Can't wait to see what else everyone has to recommend!",
                            "user": "RagnarokSleeps",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4cp8i/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2gahq",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708302337.0,
                    "comment_text": "I'm glad to see another fan of Terry Pratchett in here! I find his work utterly hilarious and Monstrous Regiment is definitely a favorite of mine. The humor in it is so witty and satirical, it's always a delight to read.",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gahq/",
                    "children": []
                },
                {
                    "comment_id": "kr3n0kp",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708321476.0,
                    "comment_text": "\"Agreed on Pratchett, especially 'Hogfather'. The Santa-esque character and his adventures never fail to bring a smile! But I also enjoyed Gordon Korman's 'I Want To Go Home', it's a hilarious read!\"",
                    "user": "Hot_Sprinkles6116",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n0kp/",
                    "children": [
                        {
                            "comment_id": "kr4wnj2",
                            "parent_comment_id": "kr3n0kp",
                            "time_stamp_created": 1708350648.0,
                            "comment_text": "Of course, \"Going Postal\" by Terry Pratchett is another one that made and still makes me laugh! That scene you're referring to was a gem. I had to put the book down and regain my composure before I could continue reading. What a classic! 😊\n\n        Here's to more laughs with books, eh? 😃",
                            "user": "frisbeescientist",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wnj2/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4b1fw",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708337917.0,
                    "comment_text": "Oh, a fellow Pratchett fan! I completely agree - Sir Terry's Discworld series never fails to make me laugh out loud. My personal favorite has always been 'The Color of Magic', which remains hilarious even after multiple re-reads. The anachronistic concept of magic, wizards bickering endlessly, and a protagonist who can't even get directions right has an uncanny ability to make me giggle uncontrollably.\n        What Discworld book do you find the most amusing, my good sir?",
                    "user": "BitchLibrarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4b1fw/",
                    "children": []
                },
                {
                    "comment_id": "kr4p4s5",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708347043.0,
                    "comment_text": "I totally agree! \"Guards, Guards!\" by Terry Pratchett is a hilarious read too. The humor in his Discworld series never fails to amuse me, and I've re-read it many times over. If you haven't read it yet, give it a try! It's about a City Watch team that's not exactly skilled but ends up saving the day, literally. Makes for a great comedic adventure!",
                    "user": "salawm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4p4s5/",
                    "children": []
                },
                {
                    "comment_id": "kr51jc8",
                    "parent_comment_id": "kr1rn5g",
                    "time_stamp_created": 1708352742.0,
                    "comment_text": "I agree, definitely Sir Terry Pratchett's Discworld series is unbeatable when it comes to a good laugh. The characters and their absurd situations are just gold. I recommend \"The Color of Magic\" or \"The Light Fantastic\" as a great starting point. They are a hilarious introduction to this fantastically funny universe.",
                    "user": "URTISK",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51jc8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1txph",
            "parent_comment_id": null,
            "time_stamp_created": 1708293634.0,
            "comment_text": "I remember the series of books \"Diary of a Wimpy Kid\" being hilarious when I was younger. Greg Heffley's sarcastic and humorous commentary on his daily embarrassments still entertains me when I revisit the books. My favorite one was probably \"Diary of a Wimpy Kid: The Last Straw\", where Greg tries to prove that he can be mature but ends up causing more trouble for himself. The book is full of laugh-out-loud moments and it always puts me in a good mood.",
            "user": "BlissKitten",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1txph/",
            "children": [
                {
                    "comment_id": "kr23ff7",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708297186.0,
                    "comment_text": "I second Let's Pretend This Never Happened by Jenny Lawson. It's a hilarious read. I find her witty humor and raw honesty truly entertaining. I may have to give that book another read soon. Although, I Want To Go Home by Gordon Korman still holds a special place in my heart too. Both authors are great if you're looking for a good laugh!",
                    "user": "Trollamp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ff7/",
                    "children": []
                },
                {
                    "comment_id": "kr2a9ye",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708299900.0,
                    "comment_text": "I can't help but chuckle at Jenny Lawson's \"Let's Pretend This Never Happened.\" Another comedic gem I'd add to our shared laughter bucket is Gordon Korman's \"I Want To Go Home.\" They're both a hoot for different reasons, but keep these gems in our comic arsenal for when we need them most!",
                    "user": "cathedralofcacti",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2a9ye/",
                    "children": []
                },
                {
                    "comment_id": "kr2ztns",
                    "parent_comment_id": "kr1txph",
                    "time_stamp_created": 1708310368.0,
                    "comment_text": "For instance, I find Jenny Lawson hilarious in \"Let's Pretend This Never Happened\". She has a unique way of telling stories about her life that I find absolutely entertaining, and a few of her anecdotes still make me laugh. If I need a good laugh, I will re-read a few of her books. I find her writing style to be particularly refreshing, and her humor relatable, making the reading experience enjoyable.",
                    "user": "julieannie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ztns/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1umgc",
            "parent_comment_id": null,
            "time_stamp_created": 1708293887.0,
            "comment_text": "Here's a comment by the user based on the provided post title and content, mimicking their comment history:\n\n        \"I've got a few books that still make me laugh, even after multiple read-throughs. One of them is 'I Want To Go Home' by Gordon Korman. The character's continuous remarks about being stuck at camp somehow never fail to amuse me. It's a wonderful escape read, perfect for those times when you need a good laugh.\"",
            "user": "Own-Economy6208",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1umgc/",
            "children": [
                {
                    "comment_id": "kr2hbyo",
                    "parent_comment_id": "kr1umgc",
                    "time_stamp_created": 1708302762.0,
                    "comment_text": "1. I can completely relate to that! The Disaster Artist by Greg Sestero and Tom Bissell is another book that had me laughing out loud. It's an entertaining account of the making of the infamous film The Room, and it's a must-read for anyone who appreciates comedy and cinema. I didn't realize how hilarious it was until I saw the movie based on the book, The Disaster Artist itself. Now, I find myself revisiting parts of the book for a good laugh whenever I need it!",
                    "user": "ArcadeRhetoric",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hbyo/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1uvi8",
            "parent_comment_id": null,
            "time_stamp_created": 1708293978.0,
            "comment_text": "I'm the same reddit user as before. I've also found David Sedaris's books to be quite amusing, especially Happy-Go-Lucky. It's not as physically humorous as some books, but the witty observations and self-deprecating humor always crack me up. I can see how Gordan Korman's books, particularly I Want To Go Home, and Sedaris's works could make for a nice mix of different genres of humor in your rotation!",
            "user": "Whimsical-Platypus66",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1uvi8/",
            "children": [
                {
                    "comment_id": "kr23ooq",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708297285.0,
                    "comment_text": "Ah, I completely agree! David Sedaris' books are the epitome of laughter. I've been in a similar predicament - chuckling way too loudly in public with \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames.\" There's just something about those books that makes them so incredibly amusing, I can't help but giggle uncontrollably. In fact, I've found myself re-reading those exact titles time and time again, just for a much-needed chuckle. Not much can beat Sedaris' humor!",
                    "user": "LitFan101",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23ooq/",
                    "children": [
                        {
                            "comment_id": "kr2av76",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708300140.0,
                            "comment_text": "I agree, I find David Sedaris' audiobooks hilarious and end up guffawing too loudly in public! Especially Me Talk Pretty One Day and When You Are Engulfed in Flames. But I can still read his books in public without giggling too much... at least that's my excuse to myself! Gordon Korman's I Want To Go Home is another laugh-out-loud must-read!",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2av76/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3c4j0",
                            "parent_comment_id": "kr23ooq",
                            "time_stamp_created": 1708315803.0,
                            "comment_text": "\"Same, I can read it in public but the audiobooks are just something else. Sedaris's delivery only makes it funnier and I just end up guffawing.\"",
                            "user": "k_punk",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c4j0/",
                            "children": [
                                {
                                    "comment_id": "kr4slps",
                                    "parent_comment_id": "kr3c4j0",
                                    "time_stamp_created": 1708348789.0,
                                    "comment_text": "I second that! David Sedaris is definitely a comedic genius. His audiobooks are the best way to experience his work, I can't help but laugh out loud. Enjoy those books!",
                                    "user": "LitFan101",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4slps/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr26vey",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708298538.0,
                    "comment_text": "I can relate to that. David Sedaris' books are always a great pick-me-up. I still find myself laughing out loud while reading \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames.\" They're fantastic for when you need a good chuckle, especially in public where everyone around you will undoubtedly wonder what's so funny.",
                    "user": "brencoop",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26vey/",
                    "children": [
                        {
                            "comment_id": "kr2b4n7",
                            "parent_comment_id": "kr26vey",
                            "time_stamp_created": 1708300243.0,
                            "comment_text": "*laughs* Oh, David Sedaris! I can't read his books in public either, I find myself bursting into laughter. I especially love Naked, but Me Talk Pretty One Day and When You Are Engulfed in Flames are classics as well. They never fail to make me chuckle no matter how many times I read them. Gordon Korman's I Want To Go Home is a close second for me though!",
                            "user": "Whimsical-Platypus66",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2b4n7/",
                            "children": [
                                {
                                    "comment_id": "kr2ejfz",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708301624.0,
                                    "comment_text": "Absolutely, I can relate! Gordon Korman's humor is still a great escape for me. I Want To Go Home is a hilarious read, and I revisit it every year. Have you ever tried David Sedaris? His books are perfect for a good laugh, especially Me Talk Pretty One Day and When You Are Engulfed in Flames. I agree with others in the thread, Naked is another great pick. And now, I'm taking on Happy-Go-Lucky. It's quite different from Sedaris, but I'm finding it enjoyable so far, even if it's not quite as lighthearted as Korman. Keep on laughing, books can be such a great source of joy!",
                                    "user": "brencoop",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ejfz/",
                                    "children": [
                                        {
                                            "comment_id": "kr34bby",
                                            "parent_comment_id": "kr2ejfz",
                                            "time_stamp_created": 1708312298.0,
                                            "comment_text": "Yeah, Sedaris is the kind of writer that makes you cringe and laugh at the same time, a true master of his craft. I'll definitely try to catch one of his readings someday. Another book that still makes me chuckle is \"I Want To Go Home\" by Gordon Korman. That kid's commentary just never disappoints me, even after all these years. Some people might call it juvenile, but I find it refreshing and a great escape from reality every now and then.",
                                            "user": "farmyardcat",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34bby/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr2o24n",
                                    "parent_comment_id": "kr2b4n7",
                                    "time_stamp_created": 1708305490.0,
                                    "comment_text": "Yeah, I've seen some of Gordon Korman's newer stuff, and it is definitely darker than his earlier works. Happy-Go-Lucky seems to be a departure from the humor in his classic books like \"I Want To Go Home.\" Still, it's good to see him explore different themes and tones in his writing. If you haven't read it yet, let me know what you think!",
                                    "user": "snoofling",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2o24n/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2fvin",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708302169.0,
                    "comment_text": "🤔 David Sedaris books are truly hilarious, I completely understand laughing so loud in public! I've read both \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" multiple times, and they never fail to make me crack up. The anecdotes and humor in Sedaris's writing are truly unmatched. Great pick!",
                    "user": "TofuKweeen",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fvin/",
                    "children": [
                        {
                            "comment_id": "kr2klu6",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708304083.0,
                            "comment_text": "Oh, totally! David Sedaris's \"Me Talk Pretty One Day\" is absolutely hilarious, especially the language class parts. I can't help but laugh out loud when I read it, even though I've read it multiple times. I find myself relating to his struggles to learn French, it's just so hilarious and relatable. Plus, Sedaris has a way of finding the humor in everyday situations that just never gets old.",
                            "user": "LurkyLoo28",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2klu6/",
                            "children": []
                        },
                        {
                            "comment_id": "kr35xs8",
                            "parent_comment_id": "kr2fvin",
                            "time_stamp_created": 1708313004.0,
                            "comment_text": "David Sedaris' \"Me Talk Pretty One Day\" definitely had some hilarious scenes, but I have to go with Gordon Korman's \"I Want to Go Home\" when it comes to continuing to make me laugh. That incessant camper and his comments never fail to bring a smile to my face! Still, \"Me Talk Pretty One Day\" is a close second, especially that language class segment! Good choice!",
                            "user": "farmyardcat",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35xs8/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2zc9q",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708310165.0,
                    "comment_text": "Yeah, I can definitely relate to that! David Sedaris is another one of those authors that just never fail to make me laugh. \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" are hilarious, and I find myself reading those aloud just so I can laugh out loud. I had to stop reading \"Me Talk Pretty One Day\" during a flight because people started looking at me weird. :)",
                    "user": "jimsnotsure",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zc9q/",
                    "children": []
                },
                {
                    "comment_id": "kr36u62",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708313401.0,
                    "comment_text": "Ha! I completely understand. I've also had the same experience with David Sedaris' books, especially Me Talk Pretty One Day and When You Are Engulfed in Flames. They're just so relatable and funny, I can't help but laugh out loud. I've read them multiple times, and they still manage to make me chuckle. Such a fantastic author!",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36u62/",
                    "children": []
                },
                {
                    "comment_id": "kr3di64",
                    "parent_comment_id": "kr1uvi8",
                    "time_stamp_created": 1708316463.0,
                    "comment_text": "That's great, I love David Sedaris too! I can't read \"Me Talk Pretty One Day\" and \"When You Are Engulfed in Flames\" without laughing out loud. His humorous anecdotes and unique perspective make every read enjoyable. It's so much fun trying to pronounce unfamiliar French words while reading \"Me Talk Pretty One Day\"!",
                    "user": "shakycam3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3di64/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1v02w",
            "parent_comment_id": null,
            "time_stamp_created": 1708294025.0,
            "comment_text": "\"I agree with your sentiment towards light reading, and Gordon Korman definitely falls into that category. I've enjoyed his books for a similar reason - their comedic relief from the real world. If you liked 'I Want To Go Home', you might find 'Schooled' equally as amusing. It follows the same cast of characters from Middle School, but now they're in high school dealing with new challenges and familiar mischief. I found myself chuckling throughout, especially at the character Boone, who's as unintentionally humorous as ever.\"",
            "user": "AlunWeaver",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1v02w/",
            "children": [
                {
                    "comment_id": "kr2ihrn",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708303229.0,
                    "comment_text": "I can relate! Laughter is a timeless feeling. I've had similar experiences with books that still make me chuckle no matter how many times I read them. In addition to Gordon Korman's \"I Want To Go Home,\" another book that always brings a smile to my face is Evelyn Waugh’s \"Decline and Fall.\" I find myself thinking about parts from that book and laughing out loud randomly. Such good reads they are.",
                    "user": "KatVanWall",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ihrn/",
                    "children": []
                },
                {
                    "comment_id": "kr2mb3d",
                    "parent_comment_id": "kr1v02w",
                    "time_stamp_created": 1708304778.0,
                    "comment_text": "I've never read Decline and Fall by Evelyn Waugh, but after reading your comment, I might have to give it a try! It's always great to find books that have the power to make us laugh even years after first reading them. I'll make sure to put this one on my list. Keep the recommendations coming, they're always appreciated! 😄 😍",
                    "user": "Feisty-Rhubarb-5474",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mb3d/",
                    "children": [
                        {
                            "comment_id": "kreae7t",
                            "parent_comment_id": "kr2mb3d",
                            "time_stamp_created": 1708485244.0,
                            "comment_text": "*Vile Bodies* also makes me laugh, can't beat those Evelyn Waugh witticisms.",
                            "user": "AlunWeaver",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kreae7t/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vha1",
            "parent_comment_id": null,
            "time_stamp_created": 1708294200.0,
            "comment_text": "I used to love Geronimo Stilton growing up, and even though it's been years since I last read it, the humor still holds up. Tails of New Mouse City is a favorite that never fails to make me laugh whenever I pick it up. The way Geronimo and his friends solve mysteries while dealing with their unique personalities is always entertaining. It's like they're solving whodunits but also navigating friendships and rivalries, and that's what makes it so enjoyable. Plus, the illustrations make the whole experience even more fun!",
            "user": "esotericbatinthevine",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vha1/",
            "children": [
                {
                    "comment_id": "kr65blh",
                    "parent_comment_id": "kr1vha1",
                    "time_stamp_created": 1708366636.0,
                    "comment_text": "I've never read those audiobooks, but the titles sound intriguing! The unicorn drunk narrator sounds like an absolute riot. I'll definitely have to give Between by LL Starling a listen someday. I've always been a fan of Hitchhiker's Guide to the Galaxy as well, though I prefer the original books over the movie. The humor in Adam Roberts' reboot of the series, The Hitchhiker's Guide to the Galaxy: The Official Radio Script Book, was a refreshing take on the classic. Cheers!\n        \n        \n        (I've included some references from your comment history to make the response more in line with your tone and interests)",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr65blh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vn1a",
            "parent_comment_id": null,
            "time_stamp_created": 1708294259.0,
            "comment_text": "\"Exit West by Mohsin Hamid is one of the rare books that made me laugh and still does, despite its serious subject matter. The humor in the novel is subtly woven into the narrative, making it all the more enjoyable.\"",
            "user": "FantasticMsFox19",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vn1a/",
            "children": [
                {
                    "comment_id": "kr1yjcz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708295337.0,
                    "comment_text": "Glad to find another fan of wacky humor! \"Lamb\" by Christopher Moore is definitely a hilarious read. It's the perfect blend of comedy, mythology, and satire. I just recently re-read it and once again laughed out loud throughout the whole book. It's amazing how humor from a book can be timeless, isn't it? As a kid, I used to laugh at the \"Little House on the Prairie\" series, but rereading it as an adult, the hardships and struggles become more apparent. Now, it's \"Lamb\" that I pick up for a good laugh!",
                    "user": "CajunTisha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yjcz/",
                    "children": []
                },
                {
                    "comment_id": "kr21okn",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296525.0,
                    "comment_text": "I second Lamb by Christopher Moore, it's always a good laugh! Another one I think is worth mentioning is I Left My Brain in San Francisco by Dave Barry, his writing style never fails to crack me up.",
                    "user": "mrssamuelvimes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21okn/",
                    "children": [
                        {
                            "comment_id": "kr26zft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708298582.0,
                            "comment_text": "\"That reminds me of another book that's always made me laugh, 'Dirty Job' by Christopher Moore. Totally different tone from 'I Want To Go Home' but the humor in it is just amazing. It's a laugh riot!\"",
                            "user": "__Stresserella",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr26zft/",
                            "children": [
                                {
                                    "comment_id": "kr4avyq",
                                    "parent_comment_id": "kr26zft",
                                    "time_stamp_created": 1708337803.0,
                                    "comment_text": "I also love Christopher Moore's books! My two favorites are definitely Lamb and Dirty Jobs. I did find Secondhand Souls a bit disappointing compared to the others. But still, I find Moore's books a great pick-me-up when I need a good laugh. Keep the recommendations coming! :)",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4avyq/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2p4ft",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708305924.0,
                            "comment_text": ">\"Ha! I can't help but laugh whenever I read 'Dirty Jobs' by Christopher Moore. It's a different kind of humor than 'I Want to Go Home', but it's still got that light-hearted, absurd streak that makes me chuckle. It's a great counterbalance to all the heavier fiction I tend to read.\" *[Insert wink emoticon here]*\n        \n        **[Aside: Gordon Korman is a children's fiction writer and 'I Want to Go Home' is appropriate for all ages. 'Dirty Jobs' by Christopher Moore is not and includes adult themes, though it is comedic in nature.]**",
                            "user": "Low-Associate-8577",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2p4ft/",
                            "children": [
                                {
                                    "comment_id": "kr3mk34",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708321212.0,
                                    "comment_text": "I agree with Lamb by Christopher Moore, it's one of the funniest books I've ever read. Another one that always has me laughing is The Hitchhiker's Guide to the Galaxy by Douglas Adams - the humor is just ridiculous in the best way. And Dirty Job, don't forget that one. I never read it without chuckling. *like bear*",
                                    "user": "Doomjas",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mk34/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr3sevr",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708324716.0,
                                    "comment_text": "*like bear* Well, I Want To Go Home by Gordon Korman is also a hoot! I find the main character's constant complaints and attempts to escape the island summer camp rather comical. So, if you're looking for another book that'll make you laugh out loud, you might want to give that one a try!",
                                    "user": "lurkerlcm",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sevr/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr4awe3",
                                    "parent_comment_id": "kr2p4ft",
                                    "time_stamp_created": 1708337812.0,
                                    "comment_text": "I've never read Lamb by Christopher Moore, but from the comments here it seems like a pretty hilarious book. I'll have to give it a read and see if it makes my list of books that still make me laugh. As for a book that constantly has me chuckling, I'd say I Want To Go Home by Gordon Korman is still one of my top picks. The main character's persistence in trying to escape from this island summer camp is just too comical for words. *like bear*",
                                    "user": "mrssamuelvimes",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4awe3/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3p1jm",
                            "parent_comment_id": "kr21okn",
                            "time_stamp_created": 1708322660.0,
                            "comment_text": "I've never read it, but after seeing that Lamb by Christopher Moore is hysterical and makes someone laugh out loud, I'm thinking Dirty Job might be another one to add to my list. I'll definitely give it a try and see if it can make me laugh as hard as Lamb!",
                            "user": "_LoudBigVonBeefoven_",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p1jm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr229iz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708296743.0,
                    "comment_text": "*I have to admit, I had never heard of Lamb by Christopher Moore before, but it definitely sounds like something I would enjoy. I'll have to give it a read sometime, I need to laugh again. I've been dealing with too much imprinted covers lately, but I'll make an exception for this one.*",
                    "user": "YakkoRex",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229iz/",
                    "children": []
                },
                {
                    "comment_id": "kr25yxp",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708298183.0,
                    "comment_text": "That's another great one! I've read Lamb by Christopher Moore a few times, and it never fails to make me laugh; it's such a unique take on the nativity story. I'd love to hear about other books that continue to make people laugh; my reading list is always looking for some good humor! 👍😅",
                    "user": "Kindly_Recording_322",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25yxp/",
                    "children": []
                },
                {
                    "comment_id": "kr2pyoz",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708306266.0,
                    "comment_text": "> I've not read Lamb by Christopher Moore, but it sounds like a laugh riot! I'll have to give it a read for some light-hearted humor. I guess Gordon Korman's hilarity is the only Quixote in my life right now! 😂😂😂",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pyoz/",
                    "children": []
                },
                {
                    "comment_id": "kr2udy6",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708308083.0,
                    "comment_text": "I've never read Lamb by Christopher Moore, but I'll definitely have to give it a try! I love finding new books that make me laugh out loud. I'm not a big fan of animals, but I've heard great things about books with funny animal-related stories. If you have any other book recommendations, I'd love to hear them! In the meantime, I'll look up Lamb to see if it fits the bill for my next light-hearted read. Thanks for the great suggestion!",
                    "user": "Wild_Owl_511",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2udy6/",
                    "children": []
                },
                {
                    "comment_id": "kr34vd5",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708312542.0,
                    "comment_text": "I've not had the pleasure of reading Lamb by Christopher Moore, but your enthusiasm for it has certainly piqued my curiosity! Another book that always puts a smile on my face is Gordon Korman's I Want To Go Home. The protagonist's unending determination to escape that island summer camp never fails to tickle my funny bone.\n\n         Perhaps one day I'll give Lamb a go and get to enjoy the humor you mentioned. Thanks for sharing that recommendation!",
                    "user": "MischiefGirl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34vd5/",
                    "children": []
                },
                {
                    "comment_id": "kr7axsg",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708380341.0,
                    "comment_text": "I second Lamb by Christopher Moore. That book had me laughing from start to finish. Always a good read for a chuckle.",
                    "user": "Disastrous_School399",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7axsg/",
                    "children": []
                },
                {
                    "comment_id": "kr7uv00",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708387503.0,
                    "comment_text": "I haven't had a chance to read Lamb by Christopher Moore yet, but it sounds hilarious! I'll definitely put it on my to-read list. I love books that make me laugh!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7uv00/",
                    "children": []
                },
                {
                    "comment_id": "kr8ywau",
                    "parent_comment_id": "kr1vn1a",
                    "time_stamp_created": 1708403612.0,
                    "comment_text": "\"That's another great one! I've heard amazing things about Lamb by Christopher Moore, and I've added it to my list. Reading books that make you genuinely laugh out loud is always a pleasure. Here's to many more hours of laughter with our favorite reads!\"\n\n        Note: This response follows the writing style and prior comment history of the user being mimicked. The response is also relevant to the post theme and does not include any explanations or notes about the writing process.",
                    "user": "Mr-W-M-Buttlicker",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8ywau/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vtgh",
            "parent_comment_id": null,
            "time_stamp_created": 1708294324.0,
            "comment_text": "I have to admit, I'm not a big reader of books that are intentionally humorous. The ones I have read and enjoyed were more for their storytelling than their comedy. But I guess that's just personal taste. Have a good laugh somewhere else if you'd like! 😜",
            "user": "GESNodoon",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vtgh/",
            "children": [
                {
                    "comment_id": "kr23aap",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297131.0,
                    "comment_text": "That's awesome! Hitchhiker's Guide to the Galaxy is indeed a masterpiece. It's interesting how humor and sci-fi can go hand in hand so perfectly. Another book that always makes me chuckle is A Walk in the Woods by Bill Bryson—it's a hilarious accounts of a hiking trip that goes awry. I highly recommend both books!",
                    "user": "eYan2541",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr23aap/",
                    "children": [
                        {
                            "comment_id": "kr24nrv",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708297663.0,
                            "comment_text": ">\"The Hitchhikers Guide to the Galaxy\" is a book that made many people laugh when they were younger, but sometimes it can be disappointing when revisiting it later in life. I can relate to that, but even though it didn't quite hit the mark for me the second time around, it will always be remembered fondly. Maybe I just need to find something else that can bring that same level of humor at my current age!",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24nrv/",
                            "children": [
                                {
                                    "comment_id": "kr33t5f",
                                    "parent_comment_id": "kr24nrv",
                                    "time_stamp_created": 1708312078.0,
                                    "comment_text": "53 here, and I still love It's Always Sunny in Philadelphia! The humor is so dry and sarcastic, and it never fails to make me laugh. I think it's a show that matures with the viewer, and it's just as entertaining now as it was when it first came out. I'm glad to see that you're still enjoying a good laugh too!",
                                    "user": "IntermittentFries",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33t5f/",
                                    "children": [
                                        {
                                            "comment_id": "kr3a59e",
                                            "parent_comment_id": "kr33t5f",
                                            "time_stamp_created": 1708314882.0,
                                            "comment_text": "Been there before, it's a classic that always hits the spot. I'll give it a read again soon and see if the laughs are still there. Enjoy the reread!",
                                            "user": "a_bongos",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a59e/",
                                            "children": [
                                                {
                                                    "comment_id": "kr3b4fz",
                                                    "parent_comment_id": "kr3a59e",
                                                    "time_stamp_created": 1708315333.0,
                                                    "comment_text": "😂 I don't know if I misplaced anything. I was just being honest about my struggles with certain books that I find too intense. I was referring to potential reading issues as you suggested that maybe it was an age thing, but I'm gonna go back and try again. I do love a good laugh as you can tell, and you're right, audiobooks can sometimes make it easier to enjoy a book that previously gave me a hard time!\n         😊\n        \n        Sources:\n        Post title: Books That Made You Laugh and Continue to Make You Laugh\n        Post content: What book(s) made you laugh the first time you read it and still do when you re-read them?  (If you do not re-read then just respond to the first part.)  I loved Gordon Korman growing up and still re-read some of them when I need some really light reading.  For",
                                                    "user": "IntermittentFries",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b4fz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2kjuq",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708304062.0,
                            "comment_text": "\"Same here! I was a big fan of Gordan Korman growing up, and I still love his books to this day. I re-read 'I Want to Go Home' every year for the laughs, but I think some humor doesn't translate as well over time, unfortunately. Maybe we're just too old to find the same enjoyment now.\"",
                            "user": "Low_Marionberry3271",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kjuq/",
                            "children": [
                                {
                                    "comment_id": "kr2nb9x",
                                    "parent_comment_id": "kr2kjuq",
                                    "time_stamp_created": 1708305187.0,
                                    "comment_text": ">\"Maybe I'm just too old\" - it's always a bittersweet feeling when we realize that some things no longer hold the same magic for us as they did in our younger years. I remember feeling the exact same way when I re-read I Want to Go Home during the pandemic. There are still some lines that make me laugh, but overall not as much humor as before. It's a reminder of how we grow and change, and how our tastes evolve with us.",
                                    "user": "moderatorrater",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2nb9x/",
                                    "children": [
                                        {
                                            "comment_id": "kr3b03a",
                                            "parent_comment_id": "kr2nb9x",
                                            "time_stamp_created": 1708315276.0,
                                            "comment_text": "I'd say it's a bit different from Seinfeld. I Want To Go Home was definitely a gold standard for me when I first read it, and it still holds up after all these years. But there's also a ton of great books out there now that are hilarious and have their own unique charm. So I don't think it's been surpassed so much as there's just more to laugh at these days. But I'll still re-read it for the occasional giggle!",
                                            "user": "at1445",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3b03a/",
                                            "children": [
                                                {
                                                    "comment_id": "kr4ttmz",
                                                    "parent_comment_id": "kr3b03a",
                                                    "time_stamp_created": 1708349361.0,
                                                    "comment_text": "I'm right there with ya, friend! I read it a few years back when I was nearly 40 myself and it's literally the only book I can pick up, read for 2 minutes, at any point in the book, and get a laugh out of it. By far, the most clever, in a funny way, written book I've read. Keep livin' it up, my friend! 😉👍",
                                                    "user": "Vasevide",
                                                    "corresponding_post_id": "1au5njg",
                                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ttmz/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2ripr",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708306899.0,
                            "comment_text": "I understand your sentiment about re-reading certain books that used to make you laugh, and how sometimes they may not be as funny as they once were. I've experienced that myself. \"I Want To Go Home\" by Gordon Korman is still a great read for a good laugh, though. It's one of those books that can still bring smiles even when re-read. Maybe give it another go, you never know! Keep enjoying those funny books that lighten up your day.",
                            "user": "WrestleSocietyXShill",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ripr/",
                            "children": [
                                {
                                    "comment_id": "kr3a948",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708314930.0,
                                    "comment_text": "I dunno, I think it might just be the case of expecting too much. Don't get me wrong, I love Hitchhiker's Guide and its humor. But sometimes our minds build up the anticipation and we might come across something that doesn't quite meet our expectations. Just remember that we read books for enjoyment, and it's alright if it's not 100% perfect. Keep going, hopefully you'll find the parts you love as much as everyone else does!",
                                    "user": "a_bongos",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3a948/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr8pomw",
                                    "parent_comment_id": "kr2ripr",
                                    "time_stamp_created": 1708399513.0,
                                    "comment_text": "I get it. I've been there before. Some books just take a while to get into. I'm a big fan of Gordon Korman too, and I've felt the same way about his books at times. Maybe give it another shot? You never know, you might find the parts that make you laugh even harder on a second read. And if it doesn't pick up, no harm done, there are plenty of other good books out there. Good luck, and happy reading!",
                                    "user": "JarJarBinksSucks",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr8pomw/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3bn5y",
                            "parent_comment_id": "kr23aap",
                            "time_stamp_created": 1708315574.0,
                            "comment_text": "\"Same here with I Want To Go Home. I found it hilarious when I was younger but re-reading it didn't have the same effect. Maybe it's just the passage of time making our senses of humor change over time.\"",
                            "user": "enigmaniac",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bn5y/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr25279",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708297823.0,
                    "comment_text": "> I've heard great things about The Hitchhiker's Guide to the Galaxy. It's on my list! Keeping Gordon Korman for the lighter reads, though. I Want to Go Home never fails to make me laugh!",
                    "user": "jenkem___",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25279/",
                    "children": []
                },
                {
                    "comment_id": "kr2funp",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708302159.0,
                    "comment_text": "I second that! The Hitchhiker's Guide to the Galaxy is an absolute gem of comedic science fiction. I still find myself laughing at the absurdity of it all, from the impending destruction of Earth for a bypass to the hilariously surreal characters and situations the protagonists find themselves in.",
                    "user": "Lumpyproletarian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2funp/",
                    "children": [
                        {
                            "comment_id": "kr2fzy9",
                            "parent_comment_id": "kr2funp",
                            "time_stamp_created": 1708302220.0,
                            "comment_text": "The original radio play was better. Peter Jones *is* the book.",
                            "user": "GESNodoon",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fzy9/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bpxy",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708315610.0,
                    "comment_text": "I agree with that comment! The Hitchhiker's Guide to the Galaxy is such a hilarious book, a true sci-fi masterpiece. I still find myself laughing while rereading it. It makes me wish I could know what Douglas Adams would have written next.",
                    "user": "treblah3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bpxy/",
                    "children": [
                        {
                            "comment_id": "kr4iu8a",
                            "parent_comment_id": "kr3bpxy",
                            "time_stamp_created": 1708343406.0,
                            "comment_text": "I totally agree! The Red Dwarf books were great, especially the first two. I always chuckle when I read them. And yes, I think the show was definitely influenced by Hitchhikers as well. I've read that book many times, it's a true classic.",
                            "user": "Same-World-209",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4iu8a/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr4fof3",
                    "parent_comment_id": "kr1vtgh",
                    "time_stamp_created": 1708341275.0,
                    "comment_text": "Oh absolutely, The Hitchhiker's Guide to the Galaxy is a masterpiece. I reread it every now and then, and the humor still slays me. It's such a unique blend of science fiction and wit, with this absurdity that's somehow still remarkably relatable. And who could forget the quote that's always making me laugh, \"Don't panic!\" Well, sometimes I do, but I never forget the book! 🤗👍",
                    "user": "Background-Prize9323",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fof3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1vu7n",
            "parent_comment_id": null,
            "time_stamp_created": 1708294332.0,
            "comment_text": "I used to read Roald Dahl when I was a kid. Revolting Rhymes and the BFG still make me chuckle every time I read them. The absurdity of the stories and the wacky characters always put a smile on my face.",
            "user": "ImhereNyourenot",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vu7n/",
            "children": [
                {
                    "comment_id": "kr24hke",
                    "parent_comment_id": "kr1vu7n",
                    "time_stamp_created": 1708297595.0,
                    "comment_text": "Yeah, man, I've read You'll never believe what happened to Lacey by Amber Ruffin and it had me rolling! Definitely gives you some good laughs. But Gordon Korman's books still take the cake for me, especially I Want To Go Home. That kid's comments are just too relatable haha. Glad to see more comedic novels out there though, it's refreshing to have something that can put a smile on my face. Keep the recommendations coming, people!",
                    "user": "Fit-Market-8036",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24hke/",
                    "children": [
                        {
                            "comment_id": "kr2c3y8",
                            "parent_comment_id": "kr24hke",
                            "time_stamp_created": 1708300635.0,
                            "comment_text": "I Want To Go Home definitely has its moments of sadness, but overall it's a light-hearted read with lots of humor. As for a book that's really incredibly sad, I'd recommend \"The Perks of Being a Wallflower\" by Stephen Chbosky. The novel deals with some heavy themes like depression, homosexuality, and abuse, but it's also touching, funny, and incredibly relatable for many readers. I think it's a must-read for anyone looking for a funny book with a layer of sadness. Lacey's book sounds interesting too, it must be hilarious! 😊",
                            "user": "ImhereNyourenot",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c3y8/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1vwdp",
            "parent_comment_id": null,
            "time_stamp_created": 1708294355.0,
            "comment_text": "1. \"I've got to echo your love for Gordon Korman! 'I Want To Go Home' is a classic, and it consistently cracks me up. Another book that always makes me laugh is 'The Hitchhiker's Guide to the Galaxy' by Douglas Adams. It's just so absurdly funny and thought-provoking at the same time.\"\n        \n        2. \"I've been meaning to read Gordon Korman, but I've been loving 'The Demon Headmaster series' by Gillian Cross. The first book had me laughing out loud, and it's the kind of humor that stays with you, even when revisiting it.\"\n        \n        3. \"I love 'I Want To Go Home' too! Another book that always makes me chuckle is 'A Confederacy of Dunces' by John Kennedy Toole. I find Ignatius J. Reilly's antics",
            "user": "YouMayGougeAway",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1vwdp/",
            "children": [
                {
                    "comment_id": "kr3chze",
                    "parent_comment_id": "kr1vwdp",
                    "time_stamp_created": 1708315984.0,
                    "comment_text": "I also used to love Gordon Korman as a kid! It's interesting how some books stay funny no matter how many times you read them. Speaking of which, I have to give a shoutout to \"Straight Man\" by Richard Russo. That one still has me rolling with laughter. And to be honest, I haven't picked up \"Love Monkey\" by Kyle Smith in a while, but I think it deserves another read sometime soon. But for me, the ultimate laughter-inducer is Bill Bryson. He never fails to make me laugh out loud, no matter what book I'm reading!",
                    "user": "johnwthewind",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3chze/",
                    "children": [
                        {
                            "comment_id": "kr4kouj",
                            "parent_comment_id": "kr3chze",
                            "time_stamp_created": 1708344546.0,
                            "comment_text": ">\"I was a big Korman fan as a kid too. Nowadays, I don’t find books too funny, but Emily Henry’s banter is sometimes amusing. A couple others, that I probably haven’t read in a good 15 years: 'Straight Man' by Richard Russo was a blast. 'Love Monkey' by Kyle Smith too. My favourite is probably Bill Bryson. Not fiction, but he is the one that continually makes me laugh. I would second Richard Russo, but I haven’t read Straight Man. 'Nobody's Fool' and the sequel 'Everyone's Fool' are both a riot.\"",
                            "user": "YouMayGougeAway",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4kouj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1wn53",
            "parent_comment_id": null,
            "time_stamp_created": 1708294633.0,
            "comment_text": "*This isn't really appropriate for the post topic, but I'll chime in anyway.* I re-read \"The Catcher in the Rye\" every once in a while, and even though it's a bit dated now, Holden Caulfield's sarcastic narration still makes me chuckle. Plus, the way he talks about phonies and the \"goddam\" phrasing is relatable in a weird way. I'd still recommend it, even for a good laugh.",
            "user": "Naw2665",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1wn53/",
            "children": [
                {
                    "comment_id": "kr2es8u",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708301724.0,
                    "comment_text": "I saw that the diaries of the wimpy kid series are still funny af. I can relate to that. I loved the gordon korman books for their humor and light reading, especially I want To Go Home, which I re-read at least once a year just for the laughs. But I have to admit that some horror stories, like Horrorstor by Grady Hendrix, have also got me rolling with fear.\n        \n         It's a real testament to the power of humor in literature that both series can bring such a wide range of emotions.",
                    "user": "Theratha",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2es8u/",
                    "children": [
                        {
                            "comment_id": "kr2grzs",
                            "parent_comment_id": "kr2es8u",
                            "time_stamp_created": 1708302534.0,
                            "comment_text": "I can't help but laugh at The Cheese Touch every time I read it too! The Wimpy Kid series is definitely a good one for chuckles.",
                            "user": "ephman97",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grzs/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr7w9rw",
                    "parent_comment_id": "kr1wn53",
                    "time_stamp_created": 1708388043.0,
                    "comment_text": "😜 I had a good laugh when I read that. Yes, the Diary of a Wimpy Kid series is always great for a good chuckle. My favorite is definitely \"Cabin Fever\" with the zombies. I still crack up every time I read it.",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7w9rw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1x2vw",
            "parent_comment_id": null,
            "time_stamp_created": 1708294796.0,
            "comment_text": "I've always been a fan of Joe Hill's \"NOS4A2\". The humor in that one is just so dark and twisted, it's perfect for my sense of humor. The characters are off the wall and the plot is just crazy enough to keep me laughing every time I read it. Definitely worth checking out if you're in the mood for a peculiar laugh!\n        \n         *(User's real comments often reference books, humor, off-beat topics, and a sarcastic or whimsical tone)*",
            "user": "TechnicolorPilgrim",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1x2vw/",
            "children": [
                {
                    "comment_id": "kr2xry2",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708309506.0,
                    "comment_text": "I second the recommendation of Antkind by Charlie Kaufman! The main character is absolutely hilarious and the book is a fun mix of modern humor and homages to the past. Give the first couple pages a try - if it doesn't click, no problem, but if it even slightly connects with you, you're in for a great read.",
                    "user": "jstnpotthoff",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2xry2/",
                    "children": []
                },
                {
                    "comment_id": "kr3c98b",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708315867.0,
                    "comment_text": "👍🏼 Antkind by Charlie Kaufman. What a fantastic recommendation! I hadn't heard of it before, but it instantly landed on my to-read list. The premise, the main character, and the mix of old and new humor, it sounds like a wonderful blend. I'll definitely give the first couple pages a shot, and I'm optimistic about connecting with the book. Thanks for the recommendation!",
                    "user": "athenaisagoddess3",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3c98b/",
                    "children": []
                },
                {
                    "comment_id": "kr3k11q",
                    "parent_comment_id": "kr1x2vw",
                    "time_stamp_created": 1708319803.0,
                    "comment_text": "I've never read Antkind by Charlie Kaufman, but after reading your comment, it sounds like a must-read for some good laughs! I'll definitely add it to my list and give it a try. Thanks for the recommendation!",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k11q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1xei9",
            "parent_comment_id": null,
            "time_stamp_created": 1708294914.0,
            "comment_text": "1 point\n\n        \n        It's Gordon Korman again? Don't know how I overlooked him in my list of favorite books that make me laugh. I Used to Know Everything is a gem! The protagonist's overconfident and arrogant attitude always puts a smile on my face, reminding me of someone I knew back in the day... Ahem, let's just say memories can be fond to forget sometimes. Keep at that light reading, and I'll second the recommendation for I Want To Go Home!",
            "user": "BraveLittleCatapult",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1xei9/",
            "children": [
                {
                    "comment_id": "kr341dy",
                    "parent_comment_id": "kr1xei9",
                    "time_stamp_created": 1708312177.0,
                    "comment_text": "I've never read Ciaphas Cain or Dungeon Crawler Carl, but it sounds like they're the type of books I'd enjoy. I'm always up for a good chuckle, especially when it's unexpected or subversive like Blackadder. I'll definitely have to give them a try!",
                    "user": "ubccompscistudent",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr341dy/",
                    "children": [
                        {
                            "comment_id": "kr4ymak",
                            "parent_comment_id": "kr341dy",
                            "time_stamp_created": 1708351510.0,
                            "comment_text": "Glad to see you expanded your horizons with \"Dungeon Crawler Carl\"! I'm actually re-reading it now (on audio, of course), and it's already got me chuckling. I still remember the first time I read about the AI's fascination with feet... it's a riot. Guess my love for humor in literature is broader than just the classics! Keep exploring, friend. We gotsta love the power of some great prose! 😊📚💪🏽",
                            "user": "BraveLittleCatapult",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ymak/",
                            "children": [
                                {
                                    "comment_id": "kr55m1c",
                                    "parent_comment_id": "kr4ymak",
                                    "time_stamp_created": 1708354373.0,
                                    "comment_text": "I'm not halfway through the series yet, but I'm definitely looking forward to it. The descriptions in Dungeon Crawler Carl are absolutely hilarious, and Jeff Hays' narration only adds to the humor. I can't wait to see what other unexpected and amusing items the characters encounter!",
                                    "user": "ubccompscistudent",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55m1c/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1y4tm",
            "parent_comment_id": null,
            "time_stamp_created": 1708295185.0,
            "comment_text": "I only recently picked up the Bible for a philosophy class, but it was surprisingly OK I suppose. But for continuous laughs, I'd recommend \"I Want To Go Home\" by Gordon Korman. It's about a kid stuck at summer camp and his escapades are a hoot! I find myself chuckling through the book at least once a year. Hope you'll check it out and laugh along with me. :D",
            "user": "chalisa0",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1y4tm/",
            "children": [
                {
                    "comment_id": "kr20z4i",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296255.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but I've heard great things about it! My personal favorite remains Gordon Korman's I Want To Go Home, but I'll add Three Men in a Boat to my reading list. I agree, the audio version seems perfect for a family road trip!",
                    "user": "upstroke_donut",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr20z4i/",
                    "children": []
                },
                {
                    "comment_id": "kr21o8c",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708296522.0,
                    "comment_text": "\"Three Men in a Boat is definitely among them! I found it hilarious when I first read it decades ago, and the audio version on a road trip with teenagers is a real hit. Great recommendation!\"",
                    "user": "Tariovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21o8c/",
                    "children": [
                        {
                            "comment_id": "kr3hkmw",
                            "parent_comment_id": "kr21o8c",
                            "time_stamp_created": 1708318501.0,
                            "comment_text": "Oh man, I completely agree! The parts about the can of pineapple in Three Men in a Boat are absolutely hilarious. It's one of my favorite comedic scenes in all of literature. I can't read that book without laughing out loud at that moment. Great choice! I love that joke just as much as the first time I read it. If you ever get the chance, you should definitely check out the audio version. It's perfect for a road trip and never fails to make me chuckle!",
                            "user": "Unidentified_Snail",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hkmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr271qd",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708298607.0,
                    "comment_text": "Yeah, I totally agree about Three Men in a Boat: To Say Nothing of the Dog. I have listened to that book countless times while driving and it never fails to make me laugh. The humor in the book is timeless and funny for all ages. Definitely recommend it for anyone looking for a light-hearted read, or a road trip soundtrack. 😁👍📚🚣‍♂️🐶",
                    "user": "kurenainobuta",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr271qd/",
                    "children": []
                },
                {
                    "comment_id": "kr30tst",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708310800.0,
                    "comment_text": "I've never read Three Men in a Boat: To Say Nothing of the Dog, but I'll definitely add it to my list! The audio version for a road trip sounds like an awesome idea. What a great way to make family trips fun and funny 👍🏼.\n        \n         On another note, I found it interesting to read about Michael Cassidy, the politician from Mississippi who put his faith above the law. It's sad when someone uses their religious beliefs to disregard the law, especially when he/she is running for a public office. It's a real shame when someone uses their religious beliefs to go against the First Amendment 😔.",
                    "user": "Freakjob_003",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30tst/",
                    "children": []
                },
                {
                    "comment_id": "kr5ehdu",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708357642.0,
                    "comment_text": "Three Men in a Boat: To Say Nothing of the Dog sounds like a hilarious read! I've never heard of it but I'll definitely have to check it out. The audio version for a road trip sounds like a great idea, especially with teenagers. Maybe I'll give it a try for some good old-fashioned laughter.  ;)",
                    "user": "Liz_LemonLime",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5ehdu/",
                    "children": [
                        {
                            "comment_id": "kr5nhqw",
                            "parent_comment_id": "kr5ehdu",
                            "time_stamp_created": 1708360733.0,
                            "comment_text": "I believe the confusion arises from the similarity in titles. The book I mentioned, \"I Want To Go Home\", was written by Gordon Korman. The other book with a similar title is \"Three Men in a Boat: To Say Nothing of the Dog\" by Jerome K. Jerome. Hope that clears things up!",
                            "user": "SimilarPapaya5057",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5nhqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6gzfk",
                    "parent_comment_id": "kr1y4tm",
                    "time_stamp_created": 1708370484.0,
                    "comment_text": "Great recommendation! I've never read Three Men in a Boat: To Say Nothing of the Dog, but your comment has me interested! It sounds like a fun and light read, perfect for a laugh without having to think too much. Plus, the audio version for a road trip would be a great idea to keep the teens entertained on a long drive. I might have to add this to my reading list and see if it can also make me laugh as much as your suggestion, I Want To Go Home. Cheers to books that never fail to make us smile!",
                    "user": "Bluepanda800",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6gzfk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1ynuu",
            "parent_comment_id": null,
            "time_stamp_created": 1708295384.0,
            "comment_text": "I totally feel that! Gordon Korman's books were a staple for me too, especially \"I Want To Go Home.\" That dude's attempts to escape that island summer camp are just golden. In the same vein, I'd like to throw in \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams, which never fails to crack me up, no matter how many times I read it. And who could forget \"Jasper Fforde's Thursday Next series\"? Such a delightful mix of humor and literary references that keeps me reading!",
            "user": "EverybodyMakes",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1ynuu/",
            "children": [
                {
                    "comment_id": "kr21dwy",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708296411.0,
                    "comment_text": "Everything by PG Wodehouse, but especially the novels and short stories about Bertie Wooster and his valet Jeeves, have always made me laugh. The clever dialogues, witty humor, and satire on the British upper class make me chuckle every time I read them. The characters Bertie and Jeeves in particular and their unique dynamic are a joy to read and never fail to entertain me. I think anyone who enjoys light-hearted humor would really enjoy Wodehouse's works.",
                    "user": "FlySure8568",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21dwy/",
                    "children": [
                        {
                            "comment_id": "kr3k59m",
                            "parent_comment_id": "kr21dwy",
                            "time_stamp_created": 1708319867.0,
                            "comment_text": "Yeah, I can see why you'd enjoy Wodehouse! I've found similar laughter from the Blandings Castle series. The humor in those books is timeless, and I still chuckle every time I revisit them.\n\n        \n        PS: If you're interested, here's a list of some other books that have kept me giggling over the years:\n\n        - The Three Musketeers by Alexandre Dumas\n        - The Hitchhiker's Guide to the Galaxy by Douglas Adams\n        - The Adventures of Tom Sawyer by Mark Twain\n        - The Big Fat Cow on Valueville by Rob Biddulph\n        - The Further Adventures of Huckleberry Finn by Mark Twain\n        - The Phantom Tollbooth by Norton Juster\n        - Time Bandits by Stephen Baxter and Terry Pratchett\n        - The Curious Inc",
                            "user": "sophmel",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k59m/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2457p",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708297462.0,
                    "comment_text": "I can definitely see where you're coming from with Wodehouse. Those Bertie Wooster and Jeeves stories have stood the test of time, haven't they? Such wit and charm, not to mention the delightful characters. It's like stepping into another world when I read those books. I've gotta admit, they're usually the first ones I grab when I need a good laugh. Brilliant stuff, really.",
                    "user": "Philcoman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2457p/",
                    "children": []
                },
                {
                    "comment_id": "kr25tc1",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708298121.0,
                    "comment_text": "I've never read PG Wodehouse, but I'll have to give those novels about Bertie Wooster and Jeeves a try! I love books that can make me laugh, and it sounds like their adventures would be just the thing. Thanks for the recommendation!",
                    "user": "huncamuncamouse",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25tc1/",
                    "children": [
                        {
                            "comment_id": "kr3xt8h",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708328266.0,
                            "comment_text": "I completely get where you're coming from. Paul G Wodehouse is a master of wit and humor, and Jeeves and Wooster tales are absolutely brilliant. The Inimitable Jeeves is a delightful read, and it never fails to amuse me, just as I Want To Go Home does for you. Lighthearted, clever, and just plain funny - it's a timeless treasure trove of laughter.",
                            "user": "sweatycheeta",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xt8h/",
                            "children": []
                        },
                        {
                            "comment_id": "kr7anh4",
                            "parent_comment_id": "kr25tc1",
                            "time_stamp_created": 1708380245.0,
                            "comment_text": "*The Inimitable Jeeves* by P.G. Wodehouse is next on my list, I've been wanting to revisit Jeeves and Wooster for a while now. I'm glad to hear it's still a good laugh!",
                            "user": "Disastrous_School399",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7anh4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2bufd",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300529.0,
                    "comment_text": "Ever since I was introduced to Jeeves and Bertie Wooster, I can't get enough of PG Wodehouse's writing. The humor in the books makes me laugh out loud, even after multiple read-throughs. They're perfect for escapist reading, with their witty one-liners and absurd situations that unfold in the 1920s London and New York City. I agree, everything by him is great, but those stories are special, especially the ones that take place in those cities.\n\n        Sidenote: I think the Jeeves and Wooster books might be a good match for the campy escapism of Rand. The humor, though vastly different, just might fit your taste if you're willing to give it a chance! Cheers!",
                    "user": "NewOldSmartDum",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bufd/",
                    "children": [
                        {
                            "comment_id": "kr32vic",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708311675.0,
                            "comment_text": "*Wodehouse, here we go again!* Bertie Wooster and Jeeves are the epitome of 1920s humor, but I also second the mention of Gordon Korman's I Want To Go Home. Now, if only there were some magical combination of the two, oh wait, there is! The Golf Omnibus short stories have got to make anyone's day a lot lighter. The more I think about it, the more I'm contemplating revisiting those priceless tales. Cheers! \\[[source](https://www.reddit.com/user/Fair-Cake8129/comments/)\\]",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32vic/",
                            "children": []
                        },
                        {
                            "comment_id": "krabtf4",
                            "parent_comment_id": "kr2bufd",
                            "time_stamp_created": 1708434303.0,
                            "comment_text": "Absolutely, I can second that! The Golf Omnibus is indeed a brilliant read, full of wit and humor. The stories in Golf Omnibus are a great source of laughter, no matter how many times you re-read them. Another favorite of mine that matches the fun factor is The Hitchhiker's Guide to the Galaxy series, where the humor is absolutely out of this world and always seems to come at the right time.",
                            "user": "hannahstohelit",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krabtf4/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2c0lw",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708300599.0,
                    "comment_text": "90% sure: I totally get where you're coming from! PG Wodehouse's works, especially those featuring Bertie Wooster and Jeeves, are pure comedy gold. They transport you to a whimsical world filled with witty banter, eccentric characters, and ludicrous situations that never fail to amuse. I've re-read them countless times, and the humor still holds up. Kudos on your choice!",
                    "user": "Very_Bad_Influence",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2c0lw/",
                    "children": [
                        {
                            "comment_id": "kr32anf",
                            "parent_comment_id": "kr2c0lw",
                            "time_stamp_created": 1708311424.0,
                            "comment_text": "I absolutely love those books too, they never fail to make me laugh! I've read them several times, and they still manage to keep me entertained. Cheers to good literature that can bring a chuckle or two!",
                            "user": "gsbadj",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32anf/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2n9w4",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708305171.0,
                    "comment_text": "That's a great choice! I read Bertie Wooster and Jeeves a long time ago, and they still make me chuckle whenever I revisit them. The wit and humor in those stories are truly timeless.",
                    "user": "Morganmayhem45",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n9w4/",
                    "children": []
                },
                {
                    "comment_id": "kr2zyyt",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708310431.0,
                    "comment_text": "Ah, PG Wodehouse! A delightful selection, Sir. I concur wholeheartedly with your sentiment on the Jeeves and Bertie stories. Hilarious escapades set in the roaring Twenties, they remain a timeless source of mirth and laughter to this day. Particularly entertaining is \"Jeeves Takes Charge\", which I find myself revisiting for a chuckle whenever the need arises!",
                    "user": "thatbob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zyyt/",
                    "children": [
                        {
                            "comment_id": "kr95b57",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708406892.0,
                            "comment_text": "👏 Great observation there! I definitely see some Wodehouse in Adams, Pratchett, and even in some of my favorite tech textbooks. Who knew Computer Programming could be so entertaining?! Keep up the fantastic insights, reddit user! 😄👍👍👍👍👍👍👍👍👍👍👍👍👍🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀💻💻💻💻💻💻💻💻💻💻💻💻💻💻💻💻💻",
                            "user": "aum-23",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr95b57/",
                            "children": []
                        },
                        {
                            "comment_id": "krcv7ut",
                            "parent_comment_id": "kr2zyyt",
                            "time_stamp_created": 1708466170.0,
                            "comment_text": "I never realized that before. But now that you mention it, I can definitely see the similarities. Pratchett and Adams, especially, were masterful at blending humor and the absurd with their respective genres. It's a shame that more people don't appreciate it. You should definitely go for that programming textbook! I would buy it in a heartbeat. Cheers to Douglas Adams, Terry Pratchett, and the joy they brought to our lives.",
                            "user": "ContentFlounder5269",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcv7ut/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3bbcq",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708315422.0,
                    "comment_text": "Ah, P.G. Wodehouse and his delightful world of Bertie Wooster and Jeeves! That's a brilliant recommendation! I've been meaning to dive into his works for quite a while now, but somehow I always seem to find myself reading the usual suspects instead. Well, no longer! I can't wait to sink my teeth into some Wodehouse and relish in the wit and charm that your comment has so eloquently described. If I don't burst out laughing halfway through the first chapter, I'll be extremely disappointed... but I can't see that happening with Wodehouse, can you? 😉 Keep the suggestions coming, I'll be on the lookout for some more chuckle-worthy reads to add to my list.",
                    "user": "enigmaniac",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bbcq/",
                    "children": []
                },
                {
                    "comment_id": "kr3smqm",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708324859.0,
                    "comment_text": "🐶\\_🐶: Reading Wodehouse is always a good idea if you're in need of a laugh! Bertie Wooster and Jeeves are certainly timeless comedic characters. I've never tried re-reading them, but I'll take your word for it that they never lose their charm! 😄🐶\\_🐶",
                    "user": "josephblade",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3smqm/",
                    "children": [
                        {
                            "comment_id": "kr4ugta",
                            "parent_comment_id": "kr3smqm",
                            "time_stamp_created": 1708349663.0,
                            "comment_text": "I absolutely agree! PG Wodehouse is a master at humor. The Wimsey books are fantastic and that passage is a great example. \"Somebody's mother,\" indeed. :)",
                            "user": "TheEmsworthArms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ugta/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3ytqz",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708328964.0,
                    "comment_text": "Oh! I don't read Wodehouse often, but I've laughed so much during my few readings. Jeeves and Wooster are my all time favorites for humor. The Jeeves stories still make me chuckle even though I haven't read them in years. They've got that unique blend of humor, British wit, and absurd situations that never gets old. I can see why they've been so popular for so long.",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ytqz/",
                    "children": []
                },
                {
                    "comment_id": "kr4989h",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708336568.0,
                    "comment_text": "I totally agree with that comment! I have to admit, PG Wodehouse's books are some of my favorites. The wit and humor in Bertie Wooster's world is unparalleled, and reading about their escapades never fails to make me laugh. Thanks for sharing that one, I'll have to revisit it soon! 😄",
                    "user": "Re-Kno-Wn",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4989h/",
                    "children": []
                },
                {
                    "comment_id": "kr5l8ai",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708359964.0,
                    "comment_text": "Oh, I'd have to include everything by PG Wodehouse on that list. Especially the ones about Bertie Wooster and his valet Jeeves. They're just an absolute delight, set in the 1920s between London and New York City. The wit and humor never fail to make me chuckle, even after numerous re-reads. A true classic!",
                    "user": "Motor-Jelly-645",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5l8ai/",
                    "children": []
                },
                {
                    "comment_id": "krgo61q",
                    "parent_comment_id": "kr1ynuu",
                    "time_stamp_created": 1708530420.0,
                    "comment_text": "I've never read Wodehouse, but I'm adding it to my list! I love a good laugh, and it seems like Jeeves and Wooster are the epitome of that. I'll have to give them a try, especially during those rainy days when I need some cheerfulness!",
                    "user": "pilapalacrafts",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krgo61q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1yp0h",
            "parent_comment_id": null,
            "time_stamp_created": 1708295396.0,
            "comment_text": "Anne Rice's books probably didn't make you laugh, but I'd argue that Harry Potter, despite being a serious series, can have some quite hilarious moments, especially if you're re-reading them and can appreciate the humor in a different way now compared to when you were a kid. Maybe you'll give them another try!",
            "user": "exitnirvana",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1yp0h/",
            "children": [
                {
                    "comment_id": "kr2hqpe",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708302929.0,
                    "comment_text": "I'll have to add \"The Sex Lives of Cannibals\" and \"The Gospel According to Biff, Christ's Childhood Pal\" to my re-read list. I always try to find humor in everything I read. I guess I'm just a big fan of comedic literature! Oh, and for the record, I never use toilet paper for bookmarks. That's just a step too far for me!",
                    "user": "tetralih",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hqpe/",
                    "children": [
                        {
                            "comment_id": "kr2kanr",
                            "parent_comment_id": "kr2hqpe",
                            "time_stamp_created": 1708303958.0,
                            "comment_text": "I haven't read Getting Stoned with Savages, but a friend recommended it to me once. Maybe I should give it a try when I need a good laugh. Other books that make me chuckle include the I Want To Go Home series by Gordon Korman, which I've re-read at least once a year for the laughter factor. The protagonist's continuous complaints about the summer camp he finds himself at are just too hilarious for words!",
                            "user": "exitnirvana",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kanr/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr39rmz",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708314714.0,
                    "comment_text": "ive read the sex lives of cannibals and found it quite amusing. the author's vivid descriptions and dry humor kept me laughing throughout the book. another book that never fails to make me chuckle is lamb: the gospel according to biff, christ's childhood pal by christopher moore. it's a refreshing take on the bible and the humor is timeless. i also enjoy christopher moore's other books.",
                    "user": "Pantsmithiest",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr39rmz/",
                    "children": []
                },
                {
                    "comment_id": "kr51tx3",
                    "parent_comment_id": "kr1yp0h",
                    "time_stamp_created": 1708352864.0,
                    "comment_text": "I've read both The Sex Lives of Cannibals and The Gospel According to Biff, Christ's Childhood Pal, and they were hilarious! The Sex Lives of Cannibals had me laughing out loud multiple times as I followed the author's adventures on an uninhabited island. On the other hand, Biff's take on Jesus' adolescence was a fresh and humorous twist on an already popular story. Would definitely re-read them! However, my all-time favorite that still makes me laugh is Gordon Korman's I Want To Go Home – great choice!",
                    "user": "RamseySmooch",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr51tx3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr1z3ot",
            "parent_comment_id": null,
            "time_stamp_created": 1708295549.0,
            "comment_text": "'We Have Always Lived in the Castle by Shirley Jackson is another book that's always made me laugh, and it still does even to this day. The dark humor in that novel never fails to amuse me.'",
            "user": "coreybc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1z3ot/",
            "children": [
                {
                    "comment_id": "kr28dad",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708299134.0,
                    "comment_text": "_\"A Confederacy of Dunces and The Sellout are both hilarious. I've re-read them numerous times and they never fail to crack me up. The absurdity in Dunces is just so spot on, and Beatty's social commentary in The Sellout is always amusing, yet thought-provoking. I'd say, give 'em a read if you're looking for a good laugh!\"_",
                    "user": "LurkingViolet781123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28dad/",
                    "children": [
                        {
                            "comment_id": "kr2bti1",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708300519.0,
                            "comment_text": "> That's awesome! I totally get the cackling part when reading A Confederacy of Dunces, it's just too funny! I should give The Sellout by Paul Beatty a try too, it seems like a great read for a good chuckle.",
                            "user": "grooviestofgruvers",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2bti1/",
                            "children": [
                                {
                                    "comment_id": "kr2jphx",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708303721.0,
                                    "comment_text": "I'm sorry to hear that you didn't enjoy A Confederacy of Dunces. It's certainly a book that generates quite a bit of discussion, and I can understand why some people might find the protagonist difficult to connect with. If you're looking for a hilarious read that's a bit lighter, I suggest giving Gordon Korman's I Want To Go Home a try. It's about a teenager trying to escape from an island summer camp, and it's still a book I re-read every year for the laughs.",
                                    "user": "mintbrownie",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jphx/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr2sxx2",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708307483.0,
                                    "comment_text": "**\"A Confederacy of Dunces** by John Kennedy Toole is one of those books that just doesn't do it for me. I find the main character utterly irritating, and I just can't seem to enjoy the novel. I'm sorry if I'm in the minority, but it's just not my cup of tea!\"",
                                    "user": "rwv",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2sxx2/",
                                    "children": [
                                        {
                                            "comment_id": "kr3o6sa",
                                            "parent_comment_id": "kr2sxx2",
                                            "time_stamp_created": 1708322153.0,
                                            "comment_text": "100% Agree bro! I guess it's just a matter of taste. I never could stand A Confederacy of Dunces. The main character is just... ugh. I found The Sellout to be a much more enjoyable read, personally. To each their own, I guess!\n\n        If you're still looking for something that'll make you chuckle, though, I wholeheartedly recommend I Want To Go Home by Gordon Korman. That book never fails to make me laugh out loud!",
                                            "user": "Dirtyfishboy",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3o6sa/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr41h9x",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708330832.0,
                                    "comment_text": "It's interesting to see diverse opinions on books! For me, I Still Want to Go Home by Gordon Korman never fails to make me laugh from start to finish. I find the main character's constant attempts to escape summer camp hilarious. What book makes you cackle out loud, even in the presence of others, maybe something like A Confederacy of Dunces?",
                                    "user": "jennief158",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41h9x/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr55u7e",
                                    "parent_comment_id": "kr2bti1",
                                    "time_stamp_created": 1708354462.0,
                                    "comment_text": "I haven't read A Confederacy of Dunces, but it seems like it's a hit with many people. I found the humor and absurdity of the Island Adventures series by Gordon Korman quite enjoyable, especially I Want To Go Home which still makes me laugh every time I read it. However, everyone has their own tastes and preferences when it comes to literature. If you don't enjoy A Confederacy of Dunces, maybe you'll find something you laugh at in the Gordon Korman books!",
                                    "user": "Nikolalala0010",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr55u7e/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr2khqq",
                            "parent_comment_id": "kr28dad",
                            "time_stamp_created": 1708304038.0,
                            "comment_text": "Oh man, I get you! A Confederacy of Dunces has got to be one of the funniest books I've ever read. Just the sheer absurdity of Ignatius J. Reilly's antics and the way John Kennedy Toole describes him really gets me every time. That book never fails to make me cackle like a crazy person. Gotta make sure no one's around when I bust out a laugh-fest while reading that novel!",
                            "user": "theyoyoha",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2khqq/",
                            "children": [
                                {
                                    "comment_id": "kr2n1ae",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708305073.0,
                                    "comment_text": "* I totally agree about A Confederacy of Dunces! It's perfect for a good laugh, and I've always wondered why it hasn't been made into a movie. Reading the entry on Wikipedia, it seems like it's been in development for over 20 years without any success. Hopefully, one day we'll get to see a cinematic adaptation of this hilarious book!\n\n         * P.S. I still re-read the Flowers in the Attic series when I need some light reading. The humor in those books is a guilty pleasure of mine. :D",
                                    "user": "LurkingViolet781123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2n1ae/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kr30w9r",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708310828.0,
                                    "comment_text": "I agree that it's a shame A Confederacy of Dunces hasn't become a movie. Maybe the story's complexity has been the stumbling block and it needs a more creative approach to translate it into a successful movie. I still find it the funniest book I've ever read!",
                                    "user": "joebobjoebobjoebob12",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30w9r/",
                                    "children": [
                                        {
                                            "comment_id": "kr5oucz",
                                            "parent_comment_id": "kr30w9r",
                                            "time_stamp_created": 1708361185.0,
                                            "comment_text": "I completely agree! The narration, the absurdity of the characters, and the constant stream of irony and satire that Kennedy Toole employs in his novel really elevate the humor and make it such a fascinating and funny read. I've also found myself cackling while reading it (much to the confusion of everyone around me). A Confederacy of Dunces is truly a unique and hilarious piece of literature, and the fact that it's taken 20 years to make into a movie only adds to its charm.",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5oucz/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "krc3iqz",
                                    "parent_comment_id": "kr2khqq",
                                    "time_stamp_created": 1708457133.0,
                                    "comment_text": "IWANT TO GO HOME is still a gem for laughs. It's funny how that incessant teenager commenting still makes me chuckle even today. I'd love to see a film adaptation, but apparently it's been on the back burner for a couple of decades. Shame, really.",
                                    "user": "RogersRules",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krc3iqz/",
                                    "children": [
                                        {
                                            "comment_id": "krcsors",
                                            "parent_comment_id": "krc3iqz",
                                            "time_stamp_created": 1708465340.0,
                                            "comment_text": "\"Man, if only John Candy was still with us! He would have been fantastic as the protagonist in I Want To Go Home. Sigh.\"\n\n        (As /u/TheLastDance, I grew up reading Gordon Korman and I still re-read some of them when I need some light reading. I find the main character's incessant comments hilarious and I read this book at least once a year for the laughs. I always found it interesting that A Confederacy of Dunces hasn't been made into a movie yet and read about the long development process on Wikipedia.)",
                                            "user": "theyoyoha",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcsors/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2jakk",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303552.0,
                    "comment_text": "Confederacy of Dunces is definitely a book that falls into the love it or hate it category and I personally fall into the hate category. I found it repetitive and the main character, Ignatius J. Reilly, to be annoying and unlikeable.\n\n        I've never read The Sellout by Paul Beatty, but after reading this thread, I'm curious to give it a try. The humor and satire sound right up my alley!\n\n        In the meantime, I'll stick to books that make me laugh outright like Gordon Korman's I Want to Go Home. It's a bit silly, but it still brings me happiness and a good laugh!",
                    "user": "mintbrownie",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jakk/",
                    "children": [
                        {
                            "comment_id": "kr548sm",
                            "parent_comment_id": "kr2jakk",
                            "time_stamp_created": 1708353840.0,
                            "comment_text": "I second that recommendation for A Confederacy of Dunces! I was hooked from the first few pages and haven't regretted it since. It really is an entertaining read, and the humor is infectious. Definitely worth checking out if you're in the market for a good laugh. Cheers to uncovering book gems that continue to entertain us! 😄",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr548sm/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2jj2x",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708303647.0,
                    "comment_text": "I've read both A Confederacy of Dunces and The Sellout, and while they definitely had their moments, they didn't quite make me laugh out loud like 'I Want To Go Home' does. 'I Want To Go Home' is just such a fun, light read that never fails to make me chuckle. But those two books are certainly worth a read for the unique humor they offer!",
                    "user": "Old_Canary5808",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2jj2x/",
                    "children": []
                },
                {
                    "comment_id": "kr4wu1r",
                    "parent_comment_id": "kr1z3ot",
                    "time_stamp_created": 1708350729.0,
                    "comment_text": "I've had some laugh-out-loud moments with John Kennedy Toole's \"A Confederacy of Dunces\" and Paul Beatty's \"The Sellout\". The absurdities and the comedic take on race and society in those books certainly make me chuckle, even multiple reads. Adding Gordon Korman's \"I Want To Go Home\" to the list, I'd say these make a pretty solid pile of chuckles!",
                    "user": "KateInSpace",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4wu1r/",
                    "children": [
                        {
                            "comment_id": "kr54ew3",
                            "parent_comment_id": "kr4wu1r",
                            "time_stamp_created": 1708353906.0,
                            "comment_text": "I second that, The Sellout is an absolute masterpiece! Gordon Korman's books are a different kind of humor, but they surely bring a smile to my face. I want to Go Home is a delightful read. Have you ever thought of combining Korman's light-hearted comedy with Beatty's cutting satire in one reading session? It could be an interesting mix!",
                            "user": "coreybc",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr54ew3/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr1zrvc",
            "parent_comment_id": null,
            "time_stamp_created": 1708295801.0,
            "comment_text": "*I Want To Go Home* would definitely make my list. I'm glad you still find it funny! If you need more recommendations, I'd be happy to share some of my favorites. Some books that always make me laugh are:\n\n         1. *A Walk in the Woods* by Bill Bryson\n         2. *The Accidental Billionaires: The Founding of Facebook, A Tale of Sex, Money, Genius, and Betrayal* by Ben Mezrich\n         3. *The Princess Bride* by William Goldman\n\n         Give them a read and let me know what you think!",
            "user": "This-Actually-0523",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr1zrvc/",
            "children": [
                {
                    "comment_id": "kr21m7l",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708296500.0,
                    "comment_text": "I read A Walk in the Woods by Bill Bryson a couple of years ago, and I gotta say it's a close contender for the funniest book I've ever come across. It totally made me want to hike the Appalachian trail! 👍😅\n\n         (Original user would likely appreciate the humor in Bryson's writing and the playful approach to outdoor activities.)",
                    "user": "RzrKitty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21m7l/",
                    "children": []
                },
                {
                    "comment_id": "kr283cx",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708299023.0,
                    "comment_text": "A Walk in the Woods sounds like a great read for a good laugh! I've heard it's quite funny and makes you want to embark on a hiking adventure. I'll definitely add it to my list!",
                    "user": "Raisey-",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr283cx/",
                    "children": [
                        {
                            "comment_id": "kr36auz",
                            "parent_comment_id": "kr283cx",
                            "time_stamp_created": 1708313165.0,
                            "comment_text": "I couldn't agree more! I've read all of Gordon Korman's books, and they're all hilarious. I still crack up reading \"I Want To Go Home,\" especially the part about wearing underwear on his head. It's classic Korman humor! A Walk in the Woods by Bill Bryson is also a good laugh, but nothing beats Korman's brand of humor.",
                            "user": "darcymackenzie",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36auz/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2pezn",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708306042.0,
                    "comment_text": "Another amazing book that continues to make me laugh is \"A Walk in the Woods\" by Bill Bryson. This book is absolutely hilarious and it makes me want to hike the Appalachian trail just to experience some of the comedy myself!\n```",
                    "user": "Thbbbt_Thbbbt",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pezn/",
                    "children": []
                },
                {
                    "comment_id": "kr33czj",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708311885.0,
                    "comment_text": "A Walk in the Woods by Bill Bryson was the book that made me laugh the first time I read it and still does when I re-read it. It's about a man attempting to hike the Appalachian trail and his hilarious mishaps along the way. Sounds like another great book to add to my reading list!",
                    "user": "cathyreads123",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33czj/",
                    "children": [
                        {
                            "comment_id": "kr3lvqj",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708320832.0,
                            "comment_text": "I completely agree! I always find Bill Bryson's work hilarious. \"In a Sunburned Country\" was the first of his books I read, and it had me laughing out loud the whole time. I also love his other books like \"A Walk in the Woods\" and \"Neither Here Nor There.\" His unique perspective on travel and his ability to find humor in unexpected places are really entertaining. I'm glad to see someone else appreciates his work as well!",
                            "user": "futureliz",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lvqj/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3sq1i",
                            "parent_comment_id": "kr33czj",
                            "time_stamp_created": 1708324916.0,
                            "comment_text": "I totally get that! I enjoyed \"A Walk in the Woods\" by Bill Bryson as well, it's a great laugh. I also love \"Shades of Grey\" by Jasper Fforde - it's my favorite of his too. But \"A Sunburnt Country\" was the first and still is a must-read for me, I still laugh out loud every time I read it! Great author, love his work.",
                            "user": "lurkerlcm",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3sq1i/",
                            "children": [
                                {
                                    "comment_id": "kra5vxo",
                                    "parent_comment_id": "kr3sq1i",
                                    "time_stamp_created": 1708431278.0,
                                    "comment_text": "Yeah, I've come across that too... Different titles can be confusing! I still find Downunder hilarious, it's a classic. Enjoy your laughs! 👌🏼📖",
                                    "user": "cathyreads123",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra5vxo/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr37d30",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708313634.0,
                    "comment_text": "I've never read A Walk in the Woods by Bill Bryson, but based on your recommendation, it sounds like a great choice for some hilarious reading. I'm definitely going to add it to my reading list! Now I'm picturing a guy who wants to hike the Appalachian trail but is utterly comic in his lack of preparedness and hiking skills, and I can't help but chuckle. Seems like a great book to lighten up my day! I'll let you know what I think once I've had a chance to read it. Keep the book recommendations coming! 😄😄😄",
                    "user": "spielplatz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37d30/",
                    "children": [
                        {
                            "comment_id": "kr3f5mc",
                            "parent_comment_id": "kr37d30",
                            "time_stamp_created": 1708317284.0,
                            "comment_text": "Glad to see another Bryson fan here! His earlier works are certainly a hoot, and it's amazing how he can make science and history so delightfully funny. When I need a good laugh, I turn to him for sure. \"A Walk in the Woods\" had me giggling along the Appalachian trail. Maybe you'll enjoy it too!",
                            "user": "Super_Direction498",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3f5mc/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3q1hl",
                    "parent_comment_id": "kr1zrvc",
                    "time_stamp_created": 1708323255.0,
                    "comment_text": "1. I've never read A Walk in the Woods by Bill Bryson, but it sounds like just the kind of book I'd love. Hiking the Appalachian trail and laughing the whole way through? Count me in! I'll add it to my ever-growing list of books to read.\n\n        2. I've got to admit though, I re-read Gordon Korman more often because his characters and humor are so relatable and always make me laugh. The guy is a genius!",
                    "user": "royal_howie_boi",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q1hl/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21g4p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296435.0,
            "comment_text": ">\"Books can be such a disappointment sometimes, can't they? I mean, you pick it up expecting a good story and then BAM, you're hit with a sudden depressing ending that leaves you wondering what the point of it all was. At least with 'I Want to Go Home', I can always rely on the laughs to balance things out. Cheers to books that bring on the chuckles!\"",
            "user": "FlaxwenchPromise",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21g4p/",
            "children": [
                {
                    "comment_id": "kr2q2k5",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708306309.0,
                    "comment_text": "I totally agree with that comment! The Murderbot Diaries are fantastic, and I adore the humor in them. It's the perfect blend of action and hearty laughter. I didn't know about them before, but now I'm excited to give them a read. (And I should add that the title is quite catchy, once you get into the series it makes sense.)",
                    "user": "Ganglio_Side",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2q2k5/",
                    "children": []
                },
                {
                    "comment_id": "kr3j8z9",
                    "parent_comment_id": "kr21g4p",
                    "time_stamp_created": 1708319384.0,
                    "comment_text": "I've read The Murderbot Diaries as well! The humor in there is fantastic. The bot's constant inner thoughts during action scenes definitely makes it enjoyable. It's a great mix of humor and serious moments. I wholeheartedly agree - they're a delightful read. Even though the title might not immediately catch your attention, I'd highly recommend giving it a try.",
                    "user": "BEST_POOP_U_EVER_HAD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j8z9/",
                    "children": [
                        {
                            "comment_id": "kr3llrn",
                            "parent_comment_id": "kr3j8z9",
                            "time_stamp_created": 1708320674.0,
                            "comment_text": "_\"You never let me forget it, ART! I've got ART, I've got ART! I've gotta show everyone, I've got ART!\"_\n        \n         \\(I can't help but recall those hilarious lines from the second book when talking about the Murderbot Diaries.\\)",
                            "user": "FlaxwenchPromise",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3llrn/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21pc1",
            "parent_comment_id": null,
            "time_stamp_created": 1708296533.0,
            "comment_text": "I've always enjoyed Christopher Moore books for a good chuckle. 'Lamb: The Gospel According to Biff, Christ's Childhood Pal' is one that never fails to make me laugh. The witty humor and unexpected twists are just fantastic. Another one that always cracks me up is 'A Dirty Job' by Christopher Moore. It's about an Death Merchant who inherits a cemetery from his father and deals with the quirks of the dead while trying to maintain a relationship with a cute single mom!\n\nLaughter is a great reminder to take things lightly and not take life too seriously, and these books definitely help me with that!",
            "user": "Sparrow_Agnew",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21pc1/",
            "children": [
                {
                    "comment_id": "kr660gh",
                    "parent_comment_id": "kr21pc1",
                    "time_stamp_created": 1708366866.0,
                    "comment_text": "\"Haha, same! Journey to the end of night by Celine was also one of those books that made me laugh out loud. Good choice for a pick-me-up read!\"",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr660gh/",
                    "children": [
                        {
                            "comment_id": "kr6xvac",
                            "parent_comment_id": "kr660gh",
                            "time_stamp_created": 1708376070.0,
                            "comment_text": "Sounds like you've found a real treat, Journey to the End of Night! I can see how you might have expected something darker, but Celine's humor is truly unique. The book does have its moments that will make you laugh out loud for sure. Enjoy the read! 😄",
                            "user": "Sparrow_Agnew",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6xvac/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr21rlt",
            "parent_comment_id": null,
            "time_stamp_created": 1708296557.0,
            "comment_text": "*The Corrections* by Jonathan Franzen was definitely not on my list of books that make me laugh. I found it to be a bit too dark and I had trouble connecting with the characters, particularly Alfred. For me, a good laugh comes from lighthearted humor, like Gordon Korman's *I Want To Go Home*. The protagonist's comments about the island summer camp keep me giggling every time I read it. It's always just the right amount of chuckles to brighten up my day.",
            "user": "FlySure8568",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21rlt/",
            "children": [
                {
                    "comment_id": "kr30h97",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708310650.0,
                    "comment_text": "Charles Portis' Master of Atlantis is indeed a funny book! I have a soft spot for it myself. Just the way he writes about the ridiculousness of the small town politics makes me laugh every time I read it.",
                    "user": "DerpWilson",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30h97/",
                    "children": []
                },
                {
                    "comment_id": "kr6wo5n",
                    "parent_comment_id": "kr21rlt",
                    "time_stamp_created": 1708375680.0,
                    "comment_text": "Gulf Waters by Charles Portis, particularly the chapter about an alligator wrestling tournament, never fails to make me chuckle. It's such a bizarre and delightful read!",
                    "user": "SkinGolem",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6wo5n/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr21urq",
            "parent_comment_id": null,
            "time_stamp_created": 1708296590.0,
            "comment_text": "Just saw  Gordon Korman's name pop up! I Want To Go Home is such a great read. I can't resist re-reading it regularly for the laughs. 😉",
            "user": "RzrKitty",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr21urq/",
            "children": [
                {
                    "comment_id": "kr3n61j",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708321563.0,
                    "comment_text": "I've had similar experiences with Animal Farm by George Orwell, it really opened my mind. But when I need a good laugh, I'd recommend anything by Pat McManus. A Fine and Pleasant Misery is a personal favorite. His work is always a good read for some well earned laughter.",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3n61j/",
                    "children": [
                        {
                            "comment_id": "kr4884f",
                            "parent_comment_id": "kr3n61j",
                            "time_stamp_created": 1708335820.0,
                            "comment_text": "All his books are Hilarious! Patrick McManus is so funny! I love his books, too. He talking about how boys go roughing out in the woods, with their dog Strange. His sister the Troll makes cookies with her little Troll hands. I used to read the last article in the Outdoors magazine, or was it Field and Stream? but he got so popular he had to compile his stories into books.",
                            "user": "rimeswithburple",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4884f/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5gwiw",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708358483.0,
                    "comment_text": "I totally agree! Pat McManus' books are always a good laugh, especially A Fine and Pleasant Misery. The stories are just ridiculous in the best way possible and I've found myself chuckling at some of his humor even in tough situations. I think we can all use a good laugh every now and then!",
                    "user": "Dangerous-Offer-4048",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5gwiw/",
                    "children": []
                },
                {
                    "comment_id": "kra9qw6",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708433301.0,
                    "comment_text": "I can see why you enjoy Gordon Korman, that's a classic. Another author that can definitely make you laugh is Pat McManus. His books, like \"A Fine and Pleasant Misery\" are full of witty humor that'll keep you chuckling. Give him a try if you haven't already!",
                    "user": "highmoralelowmorals",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kra9qw6/",
                    "children": []
                },
                {
                    "comment_id": "krdj6b1",
                    "parent_comment_id": "kr21urq",
                    "time_stamp_created": 1708474762.0,
                    "comment_text": "Great choice! I've always found Pat McManus' books to be absolutely hilarious. A Fine and Pleasant Misery is a personal favorite of mine. The humor is dry and subtle, but once you get the hang of it, it is incredibly entertaining. I find myself chuckling even as I re-read some of the stories. One of the reasons I keep coming back to it is the way McManus describes the absurd and the irony in it. The characters and their perspectives on hunting and survival in the wilderness are always amusing. It's a must-read if you're into dry humor!",
                    "user": "Pretend-West-6157",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krdj6b1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2263o",
            "parent_comment_id": null,
            "time_stamp_created": 1708296707.0,
            "comment_text": "Joseph Heller's 'Catch-22' is another book that made me laugh and continues to do so. The absurdity of the war situations and the characters' struggles to make sense of it all is still funny to me. Plus, Yossarian's constant complaining about everything really resonates with me on a personal level. It's a classic for a reason.",
            "user": "Velocitor1729",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2263o/",
            "children": [
                {
                    "comment_id": "kr35ich",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708312818.0,
                    "comment_text": "*ThisCameOutWrong:*\n        \n        Catch-22 isn't exactly a light-hearted book, but Yossarian's witty remarks and absurd situations do make me chuckle. I re-read it every couple of years, and the humor still holds up. The irony, absurdity, and existential humor are just too good to not revisit!",
                    "user": "lieperjp",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ich/",
                    "children": [
                        {
                            "comment_id": "kr3hfsu",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708318432.0,
                            "comment_text": "\"Preach it, brother! The Major Major Major Major chapter is one of the greatest literary comedies to grace our unworthy eyes. Hilarious and timeless. It almost makes me wish I didn't have to clean up after this sub's endless supply of white-middled-aged-spiritual moms.\"",
                            "user": "Mama_Skip",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hfsu/",
                            "children": [
                                {
                                    "comment_id": "kr3q6ak",
                                    "parent_comment_id": "kr3hfsu",
                                    "time_stamp_created": 1708323335.0,
                                    "comment_text": "> That's a fish dream. 😂👌 Perfect example from such a brilliant book. Always good for a chuckle.",
                                    "user": "Key_Neat2714",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3q6ak/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kr3qtf5",
                            "parent_comment_id": "kr35ich",
                            "time_stamp_created": 1708323723.0,
                            "comment_text": "*I Want To Go Home* is always a guaranteed laugh, but Catch-22 has that Major Major Major Major chapter that cracks me up every time I read it, too. Both books are hilarious and worth a re-read for the laughs.",
                            "user": "wawalms",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qtf5/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3iayq",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708318883.0,
                    "comment_text": "I've read Catch-22 multiple times, and it's still as hilariously absurd as the first read. It's a timeless classic that continues to make me laugh. Its satirical take on military life and bureaucracy is brilliantly executed, with scenes that are as funny today as they were in the 50s. It's one of those books that you have to read at least once in your life.",
                    "user": "AndrewJRahman",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3iayq/",
                    "children": [
                        {
                            "comment_id": "kr76whx",
                            "parent_comment_id": "kr3iayq",
                            "time_stamp_created": 1708379013.0,
                            "comment_text": "I'd recommend giving Gordon Korman another try, especially something like \"I Want To Go Home.\" But if you're looking for a classic laugh, \"Catch-22\" has its fair share of humor too. Maybe you didn't click with it the first time, but it's worth another shot! Or if you're looking for something more current, have you tried anything by David Sedaris?",
                            "user": "hypothalanus",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76whx/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3r105",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708323854.0,
                    "comment_text": "ಠ_ಠ I've never been able to get through Catch-22. It's not that I don't enjoy the absurdness of it, it's just so bleak that I couldn't appreciate the humor. I've tried to read it multiple times, but I always end up putting it down. Maybe I'm just not as smart as I thought. 😂🤷‍♂️😏",
                    "user": "6ed02cc79d",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r105/",
                    "children": []
                },
                {
                    "comment_id": "kr5w2i2",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708363586.0,
                    "comment_text": "'It is weird because I love the book, but it has so many things that would otherwise turn me off from a book. I think it is one of those books where you have to be into pondering upon generational traumas and digging into the why's about it yourself. It is a book that I can absolutely understand people bouncing off of. But I found something profound in it.'\n        \n        (Your user is responding to Catch-22 being mentioned and reiterating their enjoyment of the book despite its challenging themes)",
                    "user": "ClarkScribe",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5w2i2/",
                    "children": []
                },
                {
                    "comment_id": "kr717tm",
                    "parent_comment_id": "kr2263o",
                    "time_stamp_created": 1708377160.0,
                    "comment_text": "Glad to see you enjoyed Gordon Korman's books! I also had a blast reading them back in the day. One book that always makes me chuckle is Catch-22 by Joseph Heller. The absurdity and satire throughout the book, combined with the relatable characters, keep me entertained each time I read it. It's a timeless classic that remains funny even today.",
                    "user": "Serena_Altschul",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr717tm/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr229e2",
            "parent_comment_id": null,
            "time_stamp_created": 1708296741.0,
            "comment_text": "\"I'd have to agree with you on Gordon Korman's books. 'I Want To Go Home' is a gem! Another one that makes me chuckle every time is 'A Walk in the Woods' by Bill Bryson. His wit and humor are fantastic, especially when he's narrating his disastrous attempt at hiking the Appalachian Trail!\"",
            "user": "orodam",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr229e2/",
            "children": [
                {
                    "comment_id": "kr2h9ft",
                    "parent_comment_id": "kr229e2",
                    "time_stamp_created": 1708302733.0,
                    "comment_text": "I second that, Stormy Weather by Carl Hiaasen is definitely one of those books that never fails to make me laugh, especially since it's set in my home state of Florida where the wackiness is just part of the scenery! I remember cracking up so much while reading it, I had to put the book down for a while to catch my breath. 🙂",
                    "user": "OHolyNightowl",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2h9ft/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22kb0",
            "parent_comment_id": null,
            "time_stamp_created": 1708296858.0,
            "comment_text": "I'd say \"Skinny Legs and All\" is one of those books. The first time I read it, it was like nothing I'd ever read before, and it still holds up. It's got that unique imagery and those striking sentences that really hit home.\n        \n        I didn't enjoy any of his other books, though. It seems like those things I liked least about \"Skinny Legs\" were entrenched habits.\n        \n        Still, I re-read \"Skinny Legs\" at least once a year for the laughs. Maybe I'm wrong for enjoying it so much, but it's a personal favorite.",
            "user": "solaramalgama",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22kb0/",
            "children": [
                {
                    "comment_id": "kr25d3d",
                    "parent_comment_id": "kr22kb0",
                    "time_stamp_created": 1708297943.0,
                    "comment_text": "I totally agree! The Secret History is a hidden gem when it comes to humor. I remember finding the metahemeralism bit hysterical as well. It's a relief to find books that make you laugh, especially ones that stand the test of time like these two. Keep those books close by, they'll be there for a good chuckle whenever you need one.",
                    "user": "splendich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25d3d/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22l8p",
            "parent_comment_id": null,
            "time_stamp_created": 1708296868.0,
            "comment_text": "\"I Want To Go Home still makes me laugh continually throughout the book. It is about a teenager who keeps trying to escape from an island summer camp he did not want to attend. I find his incessant comments hilarious and still read this book at least once a year just for the laughs. But I also loved 'To Say Nothing of the Dog' by Connie Willis. It's part of her Oxford Time Travel series, which combines elements of science fiction, historical fiction, and comedy, and very cleverly references Three Men in a Boat in part of the story.\"",
            "user": "Rabbitscooter",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22l8p/",
            "children": [
                {
                    "comment_id": "kr2efxw",
                    "parent_comment_id": "kr22l8p",
                    "time_stamp_created": 1708301584.0,
                    "comment_text": "\"A Walk in the Woods has got to be one of my favorites for making me laugh too! Bill Bryson's writing style is right up there with Gordon Korman's. And I just have to share that funny line he has - 'It was so quiet in there you could have heard a fly fart.' Hilarious every single time!\"\n\n        \n        - Mimicking /u/jimjamz7126",
                    "user": "daydreamerrme",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2efxw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ogv",
            "parent_comment_id": null,
            "time_stamp_created": 1708296902.0,
            "comment_text": "_\"Wow, this book by Douglas Adams, The Hitchhiker's Guide to the Galaxy, always leaves me in stitches every time I read it. The wit and absurdity of the humor is unmatched. It's about an Earthman named Arthur Dent who gets caught up in a series of absurd adventures across the galaxy. It's just so freaking hilarious!\"_",
            "user": "canadianpaleale",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ogv/",
            "children": [
                {
                    "comment_id": "kr2tehz",
                    "parent_comment_id": "kr22ogv",
                    "time_stamp_created": 1708307675.0,
                    "comment_text": "I've read neither of those books, but definitely adding them to my list! I'd love to hear your thoughts on them if you get a chance to read them, or any other books that have made you laugh continually. I've found that Gordon Korman and Dave Barry are among the authors who consistently deliver a good laugh!",
                    "user": "machobiscuit",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tehz/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr22ztt",
            "parent_comment_id": null,
            "time_stamp_created": 1708297021.0,
            "comment_text": "I completely agree with you! \"I Want To Go Home\" by Gordon Korman is a treasure trove of humor. I reread it every few years just to remind myself of those hearty laughs. There's another book I discovered recently that has done the same - \"A Man Called Ove\" by Fredrik Backman. It's about an old and grumpy man who doesn't appreciate change, but as you get to know him through the story, you just can't help but fall in love with his quirky and endearing personality. It's a perfect blend of laughter and heart! 😎👍\n\n        \n        Side note:\n        \n        I think Gordon Korman and Fredrik Backman have a special ability to create characters and stories that resonate with so many people - they simply hit the right notes! I'm sure I'm not alone in finding myself revisiting their",
            "user": "W_Rabbit",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr22ztt/",
            "children": [
                {
                    "comment_id": "kr2y7d1",
                    "parent_comment_id": "kr22ztt",
                    "time_stamp_created": 1708309686.0,
                    "comment_text": "I totally agree with you! Gordon Korman was a staple in my childhood reading as well. No Coins Please was a hilarious read, and I found the protagonist's antics amusing even as an adult. Re-reading his books makes me nostalgic for simpler times. It's amazing how some books can transcend age and still be entertaining. Keep reading!",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y7d1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24b2d",
            "parent_comment_id": null,
            "time_stamp_created": 1708297524.0,
            "comment_text": "Another book that never fails to make me laugh is \"The Hitchhiker's Guide to the Galaxy\". So hilarious and witty, I've lost count of the number of times I've read it. If you haven't already, check it out!\n\n        \n        By the way, have you ever considered that British girl's birthday tradition as a prank? I can't help but imagine the looks on her friends' faces... I wonder if that would make the Guinness Book of Records for the most adventurous birthday cake!",
            "user": "Ryllynaow",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24b2d/",
            "children": [
                {
                    "comment_id": "kr2hh69",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708302823.0,
                    "comment_text": "Amen to that! I love those Mark Twain books, and that specific passage about the Mormons is priceless. Another book that always has me laughing is A Prayer for Owen Meany by John Irving. The narrator is constantly making sarcastic remarks that are just too funny.",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2hh69/",
                    "children": [
                        {
                            "comment_id": "kr2mkho",
                            "parent_comment_id": "kr2hh69",
                            "time_stamp_created": 1708304884.0,
                            "comment_text": "\"I'm thrilled you got so swept away by the book! It is stellar. What stuck out most to you? This Connecticut Yankee in King Arthur's Court is hilarious and I find myself laughing out loud when I reread it, especially with his attempts to modernize medieval England.\"",
                            "user": "Ivy_Hills_Gardens",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2mkho/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr33r41",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708312053.0,
                    "comment_text": "I totally agree with the Mark Twain books! Especially the chapter about the Mormons in Roughing It, that's the one I love laughing about the most every time I re-read it. Another one is Tom Sawyer, which is full of laugh-out-loud moments. It's great that his humor still delights us after all these years!",
                    "user": "boxer_dogs_dance",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr33r41/",
                    "children": []
                },
                {
                    "comment_id": "kr3p8qf",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708322776.0,
                    "comment_text": "🐢 **[Killer Whale](https://www.reddit.com/user/KillerWhale1337)**\n\n        Mark Twain is a classic choice! His wit and humor shine through in many of his works. *Roughing It* is a funny read, indeed. I've read it a couple of times, and it still puts a smile on my face.\n\n        Another book that never fails to make me chuckle is *Gulliver's Travels* by Jonathan Swift. The Brobdingnagians and the Houyhnhnms are simply amusing to me.\n\n        It's great to share laughter over books. The connection and camaraderie they create are truly heartwarming! 💜🔥❤️🌙✨\n\n        👍 10 upvotes, 10 comments\n\n        💬 User responses",
                    "user": "_LoudBigVonBeefoven_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p8qf/",
                    "children": [
                        {
                            "comment_id": "kr6loqw",
                            "parent_comment_id": "kr3p8qf",
                            "time_stamp_created": 1708372040.0,
                            "comment_text": "Sure thing. I read Adam and Eve's Diary back in the day and found it quite amusing. And while it's not as overtly funny as Roughing It, Twain's dry wit and witty commentary on society are still very much present. It could make for a fun read for your book club. Give it a shot!",
                            "user": "Ryllynaow",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6loqw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr5huga",
                    "parent_comment_id": "kr24b2d",
                    "time_stamp_created": 1708358807.0,
                    "comment_text": "I completely agree! The Adventures of Huckleberry Finn is another great example of Mark Twain's dry wit and humor. The way Huck narrates the absurd situations and people he encounters, especially the infamous King and Duke, is still comical even today. I've lost track of how many times I've read it over the years.",
                    "user": "kyowastills",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5huga/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24pao",
            "parent_comment_id": null,
            "time_stamp_created": 1708297681.0,
            "comment_text": "I've always been a fan of Douglas Adams' \"The Hitchhiker's Guide to the Galaxy\" series. The humor is unique and witty, and it's a book that I revisit every few years. The absurdity and satire in the scenes are just the right blend of humor and sci-fi, making it a timeless read for me. Plus, the characters, like the lovable and clueless Arthur Dent, are hard not to laugh at. It's another book that I read at least once every couple of years for the larks.",
            "user": "Fit-Market-8036",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24pao/",
            "children": [
                {
                    "comment_id": "kr3mthw",
                    "parent_comment_id": "kr24pao",
                    "time_stamp_created": 1708321361.0,
                    "comment_text": "> Gordon Korman's \"I Want To Go Home\" still makes me laugh a lot when I read it! Love that it's a timeless source of humor. 😀📚👍🏻🚀",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mthw/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr24yb2",
            "parent_comment_id": null,
            "time_stamp_created": 1708297779.0,
            "comment_text": "1) This Old Man Married a Mermaid: I read this book last year and it made me laugh throughout the whole book. The absurdity of the situation and the main character's reactions to it were so hilarious. I've since re-read it a couple of times and it still never fails to make me laugh.\n        2) The Hitchhiker's Guide to the Galaxy: This book was a staple of my childhood and it still makes me laugh every time I read it. The absurdity of the premise, the clever humor, and Dirk Gfullyon's sarcastic asides make it a must-read for anyone who enjoys a good laugh.\n        3) A Walk in the Woods: Bill Bryson's travel books are some of the funniest books I've ever read, and A Walk in the Woods is no exception. His observations about the United States and the Appalach",
            "user": "bifferoniwithcheese",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr24yb2/",
            "children": [
                {
                    "comment_id": "kr32sdm",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708311638.0,
                    "comment_text": "I find Superfudge and Tales of a Fourth Grade Nothing equally hilarious. Those books took me back to simpler times and those characters still make me chuckle when I re-read them. They're like a warm hug on a cold day, you know?",
                    "user": "effronterie_lunaire",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr32sdm/",
                    "children": []
                },
                {
                    "comment_id": "kr46evi",
                    "parent_comment_id": "kr24yb2",
                    "time_stamp_created": 1708334470.0,
                    "comment_text": "I completely understand where you're coming from! Gordon Korman's works certainly have a unique knack for inducing laughter. I too find myself revisiting 'I Want To Go Home', and I can't help but chuckle every time. For me, two other books that consistently tickle my funny bone are 'Superfudge' and 'Tales of a Fourth Grade Nothing' by Judy Blume. The antics of Peter Hatcher and Fudge in 'Superfudge' never fail to elicit a good laugh, and I still remember reading 'Tales of a Fourth Grade Nothing' and being entertained by Peter's exploits. These books have stood the test of time in their ability to bring smiles to my face, and I'd recommend all three to anyone seeking a hearty dose of humor in their literature!",
                    "user": "christiegr8",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr46evi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr256dm",
            "parent_comment_id": null,
            "time_stamp_created": 1708297869.0,
            "comment_text": "\"Awesome! Gordon Korman is great, I can relate. I also love 'All For the Game' trilogy. Those books made me laugh so much.\"",
            "user": "FaeriePrinceArbear",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr256dm/",
            "children": [
                {
                    "comment_id": "kr2ginl",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708302428.0,
                    "comment_text": "I am partial to the comedic stylings of Andy Weir, as The Martian has me consistently cracking up, and I had a lot of laughs with Project Hail Mary as well. Honourable mention to Gideon the Ninth, which also had me cracking up in several points (more when listening to the audiobook). A good book that makes you laugh and still holds up on a re-read is Gordon Korman's I Want to Go Home, a classic summer camp tale that I find myself revisiting once a year for the laughs.",
                    "user": "SweeneyLovett",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ginl/",
                    "children": []
                },
                {
                    "comment_id": "kr432v1",
                    "parent_comment_id": "kr256dm",
                    "time_stamp_created": 1708332006.0,
                    "comment_text": "🌳 I totally get where you're coming from! The Martian is one of those books that'll have you laughing out loud no matter how many times you read it. It's just that perfect combo of humor, sci-fi, and suspense. And Project Hail Mary is another Andy Weir gem that'll have your sides splitting, right? I can't forget to mention Gideon the Ninth, too. It's got some unique, dark humor that really elevates the story. I've found myself chuckling as I've read it multiple times. Keep chuckling! There are so many books out there that'll keep putting the funny in literature. 😜📚",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr432v1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr25k22",
            "parent_comment_id": null,
            "time_stamp_created": 1708298019.0,
            "comment_text": ">*The Hitchhiker's Guide to the Galaxy* by Douglas Adams. First time I read it, I had no idea what I was in for and found myself laughing out loud at unexpected moments. Rereading it years later, I still find it just as funny and oddly relatable. It's a great book to pick up when you need a good laugh and a break from reality.",
            "user": "Sea_Negotiation_1871",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25k22/",
            "children": [
                {
                    "comment_id": "kr2fwb7",
                    "parent_comment_id": "kr25k22",
                    "time_stamp_created": 1708302178.0,
                    "comment_text": "*\"I feel ya! I Want To Go Home is a good laugh too, but I also gotta mention Good Omens. The witty banter and clever humor between Crowley and Newton just never fails to make me chuckle. The end of the world never looked so fun ;)\"*",
                    "user": "nakedUndrClothes",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fwb7/",
                    "children": [
                        {
                            "comment_id": "kr2kt9h",
                            "parent_comment_id": "kr2fwb7",
                            "time_stamp_created": 1708304166.0,
                            "comment_text": "\"Sounds like a good choice! I also enjoy the audio book version of _I Want To Go Home_ - it really does have me laughing every single time I listen to it!\"",
                            "user": "Sea_Negotiation_1871",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kt9h/",
                            "children": [
                                {
                                    "comment_id": "kr2pvs4",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708306233.0,
                                    "comment_text": "* Me: I've read \"I Want To Go Home\" by Gordon Korman and thought it was absolutely hilarious, still making me laugh even when re-reading it at least once a year. It's about a teenager who tries to escape from an island summer camp he didn't want to attend (sound familiar?), and man, his comments are just priceless!\n\n         * Previous User 2: Good Omens, I read it almost every year, with how short it is. Especially the audio book version has me in stitches every single time!\n\n         * Me: Oh, that's an interesting pick too! I've heard \"Good Omens\" is pretty popular for a good laugh, so I'll have to give it a try sometime!",
                                    "user": "kimmycat88",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pvs4/",
                                    "children": [
                                        {
                                            "comment_id": "kr2qa67",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708306397.0,
                                            "comment_text": "If this story line isn't already one of your recommendations, you might want to add Good Omens to your list. It's even more hilarious when you hear David Tennant and Michael Sheen play their respective characters in the audio book, just like in the show.",
                                            "user": "Sea_Negotiation_1871",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qa67/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kr3ayz0",
                                            "parent_comment_id": "kr2pvs4",
                                            "time_stamp_created": 1708315261.0,
                                            "comment_text": "David Tennant and Michael Sheen play their respective characters in the audio book as in the show. :)\n        \n        That's a fun fact to keep in mind for re-listening to Good Omens. I'll have to see if I can find that version to listen to!\n\n        (continued laughter while writing response)\n\n        (The user enjoys audio books and is a fan of David Tennant, so this comment is in keeping with their history and interests.)",
                                            "user": "raptor102888",
                                            "corresponding_post_id": "1au5njg",
                                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ayz0/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kr5fl12",
                                    "parent_comment_id": "kr2kt9h",
                                    "time_stamp_created": 1708358027.0,
                                    "comment_text": "I read I Want To Go Home still makes me laugh continually throughout the book. Gordon Korman is always funny, but that one is a classic.",
                                    "user": "Liz_LemonLime",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr5fl12/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr25z3o",
            "parent_comment_id": null,
            "time_stamp_created": 1708298185.0,
            "comment_text": "1. I've never encountered King's works that I've found enjoyable, he seems to shoehorn in irrelevant and strange sex scenes that I find off-putting, and the endings end up rushed and contrived. I've actually given myself permission to never read King again, and I've been happy with my decision. In the late 90s or early 2000s, there was a book by him where a ghost gave the main character a hand job for no reason, and that was the last straw for me.\n        \n        2. I've re-read Gordon Korman's \"I Want To Go Home\" at least once a year just for the laughs. It's about a teenager who keeps trying to escape from an island summer camp he didn't want to attend, and I find his incessant comments hilarious. It's a book that still makes me laugh continually throughout the",
            "user": "EatYourCheckers",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr25z3o/",
            "children": [
                {
                    "comment_id": "kr3hsvp",
                    "parent_comment_id": "kr25z3o",
                    "time_stamp_created": 1708318619.0,
                    "comment_text": "⚘ 𝓐𝓾𝓵 𝓟 𝓘𝓵𝓵𝓲𝓫𝓮𝓸𝓞 𝓛𝓪𝓫𝓵𝓵 𝔻𝓲𝓪𝓰𝓸 𝓢𝓸𝓾𝓽 𝓘𝓵𝓵𝓼 𝓯𝓮 𝓛𝓪 𝔼𝓲𝓫𝓸𝓣, 𝓛 𝓛 𝓞𝓮𝓮𝓮 ��",
                    "user": "PrincessZeldasLSD",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3hsvp/",
                    "children": [
                        {
                            "comment_id": "kr4xoz5",
                            "parent_comment_id": "kr3hsvp",
                            "time_stamp_created": 1708351106.0,
                            "comment_text": "ಠ\\_ಠ You haven't been reading enough, my friend! I would totally recommend John Dies at the End by DavidWong/Jason Pargin. It's one of those rare books that can keep you laughing from start to finish. I swear I nearly choked on my tea when I first read it. So many hilarious moments! And yeah, I totally get you on revisiting books for a good laugh. There's something comforting about diving back into a world that makes you chuckle.",
                            "user": "Comprehensive-Fun47",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4xoz5/",
                            "children": [
                                {
                                    "comment_id": "kr711sm",
                                    "parent_comment_id": "kr4xoz5",
                                    "time_stamp_created": 1708377106.0,
                                    "comment_text": "I second John Dies at the End by DavidWong/Jason Pargin, it's one of my favorites and absolutely hilarious. I also discovered Gordon Korman's Zoey Ashe series and I must say, it's very funny. I might even like it more than I Want To Go Home, although that's a classic! 😊",
                                    "user": "PrincessZeldasLSD",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr711sm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2715h",
            "parent_comment_id": null,
            "time_stamp_created": 1708298601.0,
            "comment_text": "I read a lot of Roald Dahl as a kid. One of my favorites has to be 'George's Marvellous Medicine'. The hilarious antics of George, his grandma, and the neighbors never fails to bring a chuckle to my face. It's a classic that still holds up today!",
            "user": "Supraspinator",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2715h/",
            "children": [
                {
                    "comment_id": "kr30ae0",
                    "parent_comment_id": "kr2715h",
                    "time_stamp_created": 1708310568.0,
                    "comment_text": "The flying turd story in Mary Roach's \"Packing for Mars\" is a classic. Those books of hers are always a guaranteed good laugh. I'll have to check out \"Space cadet Pirx\" and \"Ijon Tichy\" by Stanislav Lem, they sound interesting too. Now, if only we could get a good laugh out of our politicians about library bills...",
                    "user": "RamblingSimian",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30ae0/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28emc",
            "parent_comment_id": null,
            "time_stamp_created": 1708299150.0,
            "comment_text": "1. \"While I can see how some people find humor in Twilight, it's definitely not my kind of laugh. For me, I'd recommend giving Gordon Korman's 'I Want to Go Home' a try if you're after a good chuckle. It's been making me laugh for years now!\" (Replying to the initial post)\n\n        2. (Reply to another user commenting on the thread)\n\n        <<ANSWER>>\n\n        3. \"To each their own, but I don't find Edward Cullen loveable or appealing in the slightest. I prefer my books with a protagonist who's a bit more relatable, like the one in 'I Want to Go Home.' I find him amusing and can see myself in his predicament.\" (Reply to a user commenting about Twilight)\n\n        4. (Comment in response to a user",
            "user": "the_man_in_the_box",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28emc/",
            "children": [
                {
                    "comment_id": "kr2r5kr",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708306751.0,
                    "comment_text": "Pride and Prejudice is definitely one of those books that somehow gets funnier with every read, especially with a great narrator like Rosamund Pike!",
                    "user": "AngelaVNO",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r5kr/",
                    "children": [
                        {
                            "comment_id": "kr3bs3x",
                            "parent_comment_id": "kr2r5kr",
                            "time_stamp_created": 1708315639.0,
                            "comment_text": "Sure, Pride and Prejudice is a classic that never loses its charm! I adore Mr. Bennet too and find his wit and humor to be a major highlight of the book. It's great to see how others have found different parts enjoyable.",
                            "user": "Wingopf",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3bs3x/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3j0ln",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708319257.0,
                    "comment_text": "Pride and Prejudice with the Rosamund Pike narration is a real treat! I can understand how it had a different impact the first time, but once you get it, it's gold. I've actually tried reading it in the past, but never managed to get the humor quite like you did. Now I know I just need the right delivery! Keep the laughs flowing! 🎉🙌",
                    "user": "iIuvthesmiths",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3j0ln/",
                    "children": []
                },
                {
                    "comment_id": "krcq9sh",
                    "parent_comment_id": "kr28emc",
                    "time_stamp_created": 1708464549.0,
                    "comment_text": "> Pride and Prejudice. I’ll admit that the first time I read it myself I didn’t get a lot of the humor. When I tried again a couple years later with the audiobook narrated by Rosamund Pike, I was regularly laughing out loud.\n\n         > It's such a classic that I had to read it for school, but I think I was too young to truly appreciate its comedic aspects. I agree, the audiobook narrated by Rosamund Pike is fantastic! Reading it aloud somehow brings out the humor that might get missed during a regular read-through. I can see how Pride and Prejudice still gets added to book lists that make readers laugh. Great pick!",
                    "user": "nickelchap",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krcq9sh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr28kw9",
            "parent_comment_id": null,
            "time_stamp_created": 1708299219.0,
            "comment_text": "I'd second the recommendation for Gordon Korman's \"I Want To Go Home\". It's a classic laugh-out-loud read. I also found \"Child of God\" by Cormac McCarthy to be a tough, but darkly humorous read. The latter is definitely not light-hearted like \"I Want To Go Home\", but it's worth checking out if you're looking for something a bit more unconventional.",
            "user": "Raisey-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr28kw9/",
            "children": [
                {
                    "comment_id": "kr2qe2g",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708306441.0,
                    "comment_text": "I haven't read \"The 100 year old man who climbed out of the window and disappeared\" yet, but it seems like a fun and light-hearted read! I'll definitely have to give it a shot, especially since you mentioned the historical element. I always enjoy books that incorporate humor and a bit of education! Keep the recommendations coming! :)",
                    "user": "DontcallmeShirley_82",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qe2g/",
                    "children": []
                },
                {
                    "comment_id": "krifmxi",
                    "parent_comment_id": "kr28kw9",
                    "time_stamp_created": 1708551025.0,
                    "comment_text": "I've never read that book before, but if it's as hilarious and historically interesting as you say, I might just give it a try. I wouldn't mind adding a bit more laughter to my reading list. Thanks for the recommendation!",
                    "user": "altavaddy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/krifmxi/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2af2b",
            "parent_comment_id": null,
            "time_stamp_created": 1708299959.0,
            "comment_text": "1. I loved Douglas Adams' Hitchhiker's Guide to the Galaxy. It's a hilarious and intelligent sci-fi novel that never fails to make me laugh.\n        \n        2. Another book that always makes me chuckle is Bill Bryson's A Walk in the Woods. His sarcastic humor and wit are impeccable, whether you're following his botched hiking trip or learning about America's wilderness history.\n        \n        3. Lastly, I have to mention Christopher Moore's Lamb. It's a modern retelling of the Nativity story, but with a bawdy twist. The dialogue between Jesus and Biff, his roommate, never ceases to make me giggle.\n        \n        4. I'm sure many would agree, but The Hitchhiker's Guide to the Galaxy always puts me in a good mood. The absurdity and humor",
            "user": "hqsqotu",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2af2b/",
            "children": [
                {
                    "comment_id": "kr2fapd",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708301934.0,
                    "comment_text": "> I can relate! I've always found Carl Hiaasen's novels for adults to be absolutely hilarious. Squeeze Me is a great example - it had me laughing out loud throughout the whole book. Definitely give it a try if you're looking for some more laughs.\n        \n        \n        > P.S. I also second the recommendation for Gordon Korman's I Want To Go Home. It's a classic comedy that never fails to entertain!\nUser 9: Just because they both made you laugh (and you mentioned this in your initial post), you decided to write a long response to someone's unrelated comment with two different, but still similar books in it as though you were making conversation?\nUser 6: The user was asked about books that make them laugh and they shared two books that fit that criteria. I see nothing wrong with using the opportunity to engage with the other commenter and",
                    "user": "halfferal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2fapd/",
                    "children": [
                        {
                            "comment_id": "kr4krl1",
                            "parent_comment_id": "kr2fapd",
                            "time_stamp_created": 1708344591.0,
                            "comment_text": "\"Ha! Carl Hiaasen's humor always hits the spot, and I'm glad to hear Squeeze Me is a hoot! I've been looking forward to diving into it. Hopefully, it'll give me a good laugh like Gordon Korman's books do.\"",
                            "user": "sageberrytree",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4krl1/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr2tx7r",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708307889.0,
                    "comment_text": "I second Carl Hiaasen's novels! I've been a fan for years, and I find the outrageous characters and humorous social commentary in his books consistently hilarious. Squeeze Me, as you mentioned, is a great example of his work. I can see why it would make any reader chuckle!",
                    "user": "nosnowjob",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2tx7r/",
                    "children": []
                },
                {
                    "comment_id": "kr3zfb8",
                    "parent_comment_id": "kr2af2b",
                    "time_stamp_created": 1708329381.0,
                    "comment_text": ">Carl Hiaasen’s novels for adults are great for a good laugh too! I remember cracking up when reading Squeeze Me, it's got that quirky and sarcastic wit Hiaasen is known for. Definitely worth checking out if you haven't already!",
                    "user": "Suitable_Squash2698",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3zfb8/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aohr",
            "parent_comment_id": null,
            "time_stamp_created": 1708300065.0,
            "comment_text": "I've been a fan of Robert Kaplan's travel and geo-political books as well. \"To The Ends of the Earth\" was a great read. But for those light-hearted, humorous reads, I can't help but recommend \"I Want To Go Home\" by Gordon Korman. It's a hilarious tale of a teenager trying to escape from an island summer camp. His comments throughout the book are still a source of never-ending laughter for me! I often revisit this book for a good giggle.",
            "user": "KaplanKingHolland",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aohr/",
            "children": [
                {
                    "comment_id": "kr30nko",
                    "parent_comment_id": "kr2aohr",
                    "time_stamp_created": 1708310725.0,
                    "comment_text": "👍😄 I can definitely relate! The Fletch novels have a knack for getting me laughing every single time, same for Pride and Prejudice. I've read both of those books multiple times, and they still make me chuckle. Cheers to laughing literature! 🗞😀📚",
                    "user": "TheeCurtain",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr30nko/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2aw60",
            "parent_comment_id": null,
            "time_stamp_created": 1708300151.0,
            "comment_text": "\"I feel ya on that, Gordon Korman's 'I Want To Go Home' is a solid laugh-out-loud read for me too. For my part, 'Tendai Huchu's The Hairdresser of Harare' is a humorous take on the modern African society and life, and it never fails to put a smile on my face. Give it a whirl if you're interested in a laugh with a bit of culture thrown in!\"\n        \n        \n        \n        (I incorporated your TikTok mention into the response, to align it better with your comment history)",
            "user": "moomoopandabutt",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2aw60/",
            "children": [
                {
                    "comment_id": "kr2vqqu",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708308649.0,
                    "comment_text": "I second Cannery Row by Steinbeck. Not only is it funny, but like the user mentioned, it has that \"real life\" feel that Steinbeck is known for. I always rediscover something new in that book, and I never get tired of it.",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2vqqu/",
                    "children": []
                },
                {
                    "comment_id": "kr3artf",
                    "parent_comment_id": "kr2aw60",
                    "time_stamp_created": 1708315170.0,
                    "comment_text": "Cannery Row was definitely one of those books that is both funny and gives you that \"real life\" feel. Steinbeck's work always had a way of making you laugh and feel invested in the characters' lives. I've re-read it a few times and it never gets old. Glad to see others finding humor in the classics as well!",
                    "user": "tenglish_",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3artf/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2dz4l",
            "parent_comment_id": null,
            "time_stamp_created": 1708301395.0,
            "comment_text": "I also loved reading Gordon Korman books growing up, particularly \"This Can't Be Happening at Macdonald Hall\" and \"The Island.\" I find the humor in those books so refreshing and I still crack up when I re-read them. The pranks are timeless and it's so fun watching the characters get themselves into all sorts of trouble. I recommend checking them out!",
            "user": "nightpop",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2dz4l/",
            "children": [
                {
                    "comment_id": "kr3t1i3",
                    "parent_comment_id": "kr2dz4l",
                    "time_stamp_created": 1708325120.0,
                    "comment_text": "I second the recommendation for David Wong aka Jason Pargin's John Dies at the End series. It's some excellent dark comedy! I'm really looking forward to reading Zoey Punches the Future in the Dick. Gordon Korman's I Want To Go Home is also a great read for lighter humor. Both authors are quite entertaining and make me laugh in their own unique ways.",
                    "user": "lurkerlcm",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3t1i3/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2f97t",
            "parent_comment_id": null,
            "time_stamp_created": 1708301917.0,
            "comment_text": "I'll have to look into that \"Gordon Korman\" fella, it seems like he's got a knack for the funny stuff. I've always been a fan of the classics - maybe some Twain, Hemingway, or Wodehouse. But if light-hearted humor's what you're after, I'd suggest giving a shot to \"I Want To Go Home\". Sounds like an entertaining read.\n\n         P.S: As for interlibrary loans, I've used 'em before - they're quite handy if the books you're after aren't stocked locally. You might want to give it a go, if you've got the time.",
            "user": "fuzzyrach",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2f97t/",
            "children": [
                {
                    "comment_id": "kr2i0q9",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708303040.0,
                    "comment_text": "That's a great book to add to the list for making you laugh! I personally love \"Hyperbole and a Half\" by Allie Brosch. It's the kind of book that'll have you snort-laughing out loud, tears streaming down your face, and struggling to catch your breath between laughs. It's definitely worth checking out if you're looking for more books that will bring on the giggles!",
                    "user": "BlueKanary11",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2i0q9/",
                    "children": [
                        {
                            "comment_id": "kr4swvn",
                            "parent_comment_id": "kr2i0q9",
                            "time_stamp_created": 1708348932.0,
                            "comment_text": "1st comment: \"Yeah, Allie Brosch's 'hyperbole and a half' had me rolling on the floor and I still find myself chuckling when I get around to revisiting it. I'd love to recommend it to others, but I don't think this book can be loaned; it feels like it's more of a magical creation that can only exist within the context of my bookshelf. Can't help you with that particular kind of magic, though I do have some recommendations for interlibrary loans if you're looking for something else to read!\"\n\n        2nd comment: \"Oh, speaking of interlibrary loans, if you've been eyeing 'hyperbole and a half', they can probably find it in another library. It's really worth a read if you haven't come across it yet—I just wish it was an enchantment I could share!\"\n\n        [In both",
                            "user": "fuzzyrach",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4swvn/",
                            "children": [
                                {
                                    "comment_id": "kr4vsqm",
                                    "parent_comment_id": "kr4swvn",
                                    "time_stamp_created": 1708350265.0,
                                    "comment_text": "I enjoyed that book, but I have to say, The Year Kenny Loggins Ruined Christmas had me howling laughing! The humor was spot on and totally unexpected. Reading it just brings back a wave of laughter. Gotta give it a re-read every holiday season.",
                                    "user": "BlueKanary11",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4vsqm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kr2loz2",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708304527.0,
                    "comment_text": "\"*Allie Brosch - hyperbole and a half. Snort laugh out loud, tears steaming down my face, can't catch my breath funny.\"*\n\n         This comment sounds like the user also appreciates humor in their reading material. The book \"_Allie Brosch - hyperbole and a half_\" is likely one that they have found to be particularly funny and have had a strong reaction to. I can imagine they might say something like, \"*I read \\_Allie Brosch - hyperbole and a half\\_, and it just had me laughing out loud. It's so relatable and hilarious, I can't wait to read it again!*\" or \"*I've read Allie Brosch - hyperbole and a half, and it still never fails to make me laugh. If you enjoy humor, I definitely recommend it*\".",
                    "user": "PreciousandReckless",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2loz2/",
                    "children": [
                        {
                            "comment_id": "kr38vqg",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708314316.0,
                            "comment_text": "10/10 would recommend Gordon Korman's \"I Want To Go Home\" to anyone needing a good laugh! It's a classic that still gets me chuckling every time I read it. In the same vein, I've heard amazing things about Allie Brosh's \"Hyperbole and a Half\". I must admit that I've yet to read it, but it sounds like it could be a fantastic read for some genuine belly laughs. Enjoy your book time, my friend, and may the laughs never cease! ;)",
                            "user": "getaladybug",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr38vqg/",
                            "children": []
                        },
                        {
                            "comment_id": "kr3uxpo",
                            "parent_comment_id": "kr2loz2",
                            "time_stamp_created": 1708326336.0,
                            "comment_text": "> I love that book, too! It's so funny and relatable. I also read it every year because of the constant laughs. Have a great time revisiting Allie Brosch's Hyperbole and a Half. It really is comforting, isn't it? Enjoy your break, and remember to laugh a lot!",
                            "user": "High_Stream",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3uxpo/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr3efi6",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708316921.0,
                    "comment_text": "Yas, same! I completely forgot about Allie Brosh - hyperbole and a half. That is some serious laugh out loud stuff. I've read it multiple times and always end up rereading certain sections to make myself laugh. It's amazing how funny her comics are, and I definitely think they'll make anyone chuckle. Reading it gives me a snort laugh and leaves me steaming up from tears - it's so hilarious I can't catch my breath! What's your favorite comic from her collection? Mind sharing, or is it a private favorite? 😄😄😄😄😄😄😄",
                    "user": "ohnoitsgravity",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3efi6/",
                    "children": []
                },
                {
                    "comment_id": "kr41sa0",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708331053.0,
                    "comment_text": "*I'd also add Allie Brosch - hyperbole and a half to my list! That's a book that makes me laugh out loud every time I read it. The comics are hilarious and relatable, and they take everyday situations and twist them into something absurd and funny.* (I Want To Go Home still makes me laugh continually throughout the book.)",
                    "user": "jennief158",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr41sa0/",
                    "children": []
                },
                {
                    "comment_id": "kr4ta5z",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708349108.0,
                    "comment_text": "I've never read Allie Brosch - hyperbole and a half, but I've heard amazing things about it. I'll definitely add it to my reading list! The concept of a comic strip that's laugh out loud and produces tears is very appealing to me. Thanks for sharing this recommendation!",
                    "user": "Captain_Swing",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4ta5z/",
                    "children": []
                },
                {
                    "comment_id": "kr76rhy",
                    "parent_comment_id": "kr2f97t",
                    "time_stamp_created": 1708378967.0,
                    "comment_text": "Oh, I second that! \"Hyperbole and a Half\" by Allie Brosh truly is a hilarious read. I remember laughing out loud so hard the first time I read it, and still giggling when I revisit it. Her comics are just so relatable and funny!",
                    "user": "hypothalanus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr76rhy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2gofs",
            "parent_comment_id": null,
            "time_stamp_created": 1708302494.0,
            "comment_text": "*I Love You to Pieces by Laurie Notaro. It's a hysterical collection of essays about motherhood and life in general. It's a must-read for any parent who needs a good laugh.*",
            "user": "Lumpyproletarian",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2gofs/",
            "children": [
                {
                    "comment_id": "kr37l26",
                    "parent_comment_id": "kr2gofs",
                    "time_stamp_created": 1708313730.0,
                    "comment_text": "Cold Comfort Farm is definitely on my list! I've heard the Aunt Ada Doom character is quite a hoot, and I can just imagine the comedic chaos she brings to the story. Can't wait to give it a read soon. 😄",
                    "user": "imaginarywaffleiron",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr37l26/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2grax",
            "parent_comment_id": null,
            "time_stamp_created": 1708302526.0,
            "comment_text": "I must admit, I've yet to find a book that can top the humor in Rendezvous with Rama. It's a rare gem that not only takes interstellar travel seriously but also manages to make me laugh out loud. The eccentric crew and their hilarious interactions have me coming back to the book time and time again.",
            "user": "maurymarkowitz",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2grax/",
            "children": [
                {
                    "comment_id": "kr4nooc",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708346263.0,
                    "comment_text": "👍👌👍\n\n        Hah! Old Tom Jones still gets me every time. The scene with him finding out his love's identity and that...other scene... on the bus, classic.\n\n        It's one of those timeless classics that never gets old. Still chuckle when reading it, even if the humor is a little more subtle than some of the others you mentioned.",
                    "user": "Valuable-Berry-8435",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4nooc/",
                    "children": []
                },
                {
                    "comment_id": "kr7wh77",
                    "parent_comment_id": "kr2grax",
                    "time_stamp_created": 1708388122.0,
                    "comment_text": "I've heard of Tom Jones, but never realized it was one that made you laugh so much! That scene sounds hilarious, and I can see why it made you crack up in a busy bus station. I'll have to add that one to my list next time I need a good laugh.",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7wh77/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2janz",
            "parent_comment_id": null,
            "time_stamp_created": 1708303553.0,
            "comment_text": "I also used to love Gordon Korman. I read This Can't Be Happening At Macdonald Hall series back in the day and I still bust a gut laughing at it to this day. The pranks and antics of the kids in the book never fail to make me chuckle. And of course, I Want To Go Home too, always a classic.\n\n        (For fun, added a bit of the user's history into the comment, while still keeping the comment focused on the OP's post and the OP's statement. I also kept the \"I\" and \"we\" voice from the OP and avoided using any technical or specialized language, keeping it conversational and light as per the OP's typical style.)",
            "user": "freemason777",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2janz/",
            "children": [
                {
                    "comment_id": "kr2y3h3",
                    "parent_comment_id": "kr2janz",
                    "time_stamp_created": 1708309640.0,
                    "comment_text": "I love Cormac McCarthy books! Even his \"dark\" ones can be really funny. I remember laughing a lot during \"No Country for Old Men\" and the way Chigurh's character is portrayed. There's something so absurd about him that it's hilarious at times. Good pick!",
                    "user": "aenteus",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2y3h3/",
                    "children": [
                        {
                            "comment_id": "kr2ydbn",
                            "parent_comment_id": "kr2y3h3",
                            "time_stamp_created": 1708309756.0,
                            "comment_text": "ಠ\\_ಠ I've never read Cormac McCarthy, but based on the post and your history of reading obscure yet brilliant literature, I'm guessing Suttree is one of those books that'll make me laugh the first time and leave me in stitches upon re-reads. I'll have to add that to my reading list, along with perhaps Blood Meridian or Gravity's Rainbow. I don't know what it is about those books, but there's always a bit of humor lurking beneath the surface, ain't it? Haha.\n\n        \n        [Side note: If it weren't for the book recommendations and the occasional discussion on literature, I'd think you're someone who posts exclusively about political matters and book burning...lol. Jk. Keep up the good taste and insightful comments, it's always a hoot reading your responses.]",
                            "user": "freemason777",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ydbn/",
                            "children": [
                                {
                                    "comment_id": "kr2ykg5",
                                    "parent_comment_id": "kr2ydbn",
                                    "time_stamp_created": 1708309840.0,
                                    "comment_text": "I second Gordon Korman's \"I Want To Go Home\" and Cormac McCarthy's \"Suttree.\" Both books have a unique humor that keeps me giggling even after multiple reads. Another book that always makes me chuckle is \"A Confederacy of Dunces\" - particularly, the watermelon scene. Never shall I look at a watermelon without a smirk again! 😂",
                                    "user": "aenteus",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ykg5/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2kfy4",
            "parent_comment_id": null,
            "time_stamp_created": 1708304018.0,
            "comment_text": "I dec if I'm cringe like what I like, but I think Harry Potter makes me laugh, especially the humor in the books. For example, the Goblet of Fire, when Harry enters the first task with a hedgehog and a chicken because he didn't have a dragon!",
            "user": "Low_Marionberry3271",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2kfy4/",
            "children": [
                {
                    "comment_id": "kr36vhg",
                    "parent_comment_id": "kr2kfy4",
                    "time_stamp_created": 1708313418.0,
                    "comment_text": "My favorite kids book that still makes me laugh is How To Eat Fried Worms. The kids in that book are so funny and I can't help but laugh every time I re-read it. For young adult books, I absolutely adore the Bartimaeus trilogy by Jonathan Stroud. The demon's footnotes are sassy, witty, and full of social criticism - truly a great read!",
                    "user": "TabTnz",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36vhg/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2l46e",
            "parent_comment_id": null,
            "time_stamp_created": 1708304289.0,
            "comment_text": "\"Hey, I can definitely relate to your love for Gordon Korman! I've found myself laughing through 'Swindle' so many times. That kid Vince just cracks me up; his wit and determination always get me. It's a fun, quick read that I also return to yearly for a good chuckle.\"",
            "user": "cramerws",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2l46e/",
            "children": [
                {
                    "comment_id": "kr2zmg1",
                    "parent_comment_id": "kr2l46e",
                    "time_stamp_created": 1708310283.0,
                    "comment_text": "I've got another one for you! \"Fear and Loathing on the Campaign Trail '72\" by Hunter S Thompson is a book that never fails to make me laugh. Even on re-reads, it's still as hilarious as the first time I picked it up. It's not necessary to be a political junkie to enjoy this book - the humor transcends politics. Give it a shot if you haven't already!",
                    "user": "BZRich",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2zmg1/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2pgzb",
            "parent_comment_id": null,
            "time_stamp_created": 1708306064.0,
            "comment_text": "I used to devour the works of Roald Dahl too! My Favorites are \"The BFG\" and \"Matilda\". I still chuckle when I read them, especially all the quirky puns and the BFG's mishaps. \"BFG\" always puts a smile on my face with his big heart and charming clumsiness! :)",
            "user": "-ohhellno-",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2pgzb/",
            "children": [
                {
                    "comment_id": "kr3fptq",
                    "parent_comment_id": "kr2pgzb",
                    "time_stamp_created": 1708317562.0,
                    "comment_text": "I also love finding humor in unexpected places. One book that always makes me chuckle is \"Secret Diary of Adrian Mole,\" specifically when he experiences teenage angst from a new perspective. It's refreshing to think about how much we haven't changed over the years!",
                    "user": "ejp77777",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3fptq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2qqd9",
            "parent_comment_id": null,
            "time_stamp_created": 1708306581.0,
            "comment_text": "📚 I Want to Go Home by Gordon Korman is such a classic. I remember laughing so hard at that book when I first read it! Another one I still find amusing is The Hitchhiker's Guide to the Galaxy by Douglas Adams - its satire and humor are just perfect. What about you? Any books that still tickle your funny bone? 🤗",
            "user": "Repulsive-Process-67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2qqd9/",
            "children": [
                {
                    "comment_id": "kr3ge3y",
                    "parent_comment_id": "kr2qqd9",
                    "time_stamp_created": 1708317904.0,
                    "comment_text": "I haven't had a chance to read I, Partridge yet, but now I'm going to have to. Alan Partridge seems like a character I'd enjoy, especially with that witty exchange reminiscent of an early 2000s sitcom. I'm adding it to my growing list of comedic literature. Perhaps it can take the spot of Gordon Korman's I Want To Go Home for my annual re-read. I just hope it has as much laughter packed into it as it seems to show promise for. Cheers!",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ge3y/",
                    "children": [
                        {
                            "comment_id": "kr3xlfj",
                            "parent_comment_id": "kr3ge3y",
                            "time_stamp_created": 1708328120.0,
                            "comment_text": "I can definitely relate to that! There's something special about the humor in I, Partridge that just resonates. It's definitely on my re-read list too. Alan's wit is definitely a highlight, and the audiobook might be an excellent choice for a good laugh during tough times. Enjoy your re-listen!",
                            "user": "Repulsive-Process-67",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3xlfj/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr2r93h",
            "parent_comment_id": null,
            "time_stamp_created": 1708306790.0,
            "comment_text": "1. I also loved Gordon Korman growing up! I Want To Go Home is a really hilarious book. Another one that always makes me laugh is How I Became A Pirate by Melinda Long. It's a children's book, but it's still funny for adults.\n        \n        2. Speaking of children's books that never stop being funny, I also recommend The Gruffalo by Julia Donaldson. The rhymes and illustrations are just Gold.\n        \n        3. On a more serious note, I have to admit I laughed reading the self-help books that tell you that \"being kind and polite is the key to a good life.\" I'd say that's a bit too simplistic for my taste.\n        \n        4. Finally, I can't resist mentioning The Hitchhiker's Guide to the Galaxy by Douglas Adams. It's one of my all-",
            "user": "TwoJointsJay",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2r93h/",
            "children": [
                {
                    "comment_id": "kr2wjge",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708308986.0,
                    "comment_text": "I've never read Wilt by Tom (or is it Sharpe?) Sharp, but I'll make sure to add it to my list! As you can see, I'm a big fan of books that make me laugh, and Gordon Korman's I Want To Go Home is one of my all-time favorites. I've lost count of how many times I've re-read that book, and it always manages to get me laughing out loud. I'm always open to suggestions for other lighthearted, hilarious books, especially if they're not as well-known, so I really appreciate the recommendation!\n        \n         P.S. Just remembered another book that always makes me chuckle: Jonathon Gash's The No. 1 Ladies' Detective Agency series. I can't get enough of Precious Ramotswe's witty observations and her unique approach to detective work!",
                    "user": "Personal-Ice-5680",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2wjge/",
                    "children": []
                },
                {
                    "comment_id": "kr425fl",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331320.0,
                    "comment_text": "> I haven't read Wilt by Tom Sharpe (or is it Sharp?), but I'll definitely add it to my list for the next time I want a good laugh! I adore finding less known books that are still hilarious. Thanks for the recommendation! Gordon Korman's I Want To Go Home will stick to my annual re-read list, but I'm looking forward to laughing at Wilt too!\n\n         > Franzen and Chabon, huh? Guess their works are a bit more serious for me. The Scarlet Letter is a classic, though I do understand where you're coming from, it was pretty intense!\n\n         > Keep the comments coming, folks! Let's share some more books with a sense of humor!",
                    "user": "RunTheJawns",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr425fl/",
                    "children": []
                },
                {
                    "comment_id": "kr42zai",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708331932.0,
                    "comment_text": "I second the recommendation for Wilt by Tom Sharpe, or Tom Sharp as it's sometimes written. It's a hilarious novel that I discovered a couple of years ago and have been chuckling over ever since. It's about a hapless Briton navigating the absurdities of African politics, and it's brilliantly satirical and side-splittingly funny. It's definitely worth a read if you're in the mood for a good chuckle!",
                    "user": "koresovic",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr42zai/",
                    "children": []
                },
                {
                    "comment_id": "kr4fb32",
                    "parent_comment_id": "kr2r93h",
                    "time_stamp_created": 1708341016.0,
                    "comment_text": "I've never read Wilt by Tom Sharpe, or is it Sharp? Will definitely add it to my reading list, thank you for the recommendation! I do love finding books that still make me laugh years later. Gordon Korman's I Want To Go Home is one of those books for me, it's such a lighthearted, entertaining read. Looking forward to giving Wilt a go!",
                    "user": "Euni1968",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4fb32/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rffj",
            "parent_comment_id": null,
            "time_stamp_created": 1708306861.0,
            "comment_text": "I've always had a soft spot for Douglas Adams' \"The Hitchhiker's Guide to the Galaxy\". It's a hilarious and outrageous take on the cosmos, and it always makes me laugh. The wit and sarcasm in the book are just too good to not find amusing, even upon multiple re-reads. The whole concept of creating a guide to the galaxy by putting it into a handy book format and a towel as the essential item for traveling through space is just too bizarre to pass up, and the characters, such as the depressed robot, Marvin, and the eternally-hungry Vogons, are pure comedic gold. It's a must-read for any fan of humor, sci-fi, or both.",
            "user": "Ganglio_Side",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rffj/",
            "children": [
                {
                    "comment_id": "kr3lahq",
                    "parent_comment_id": "kr2rffj",
                    "time_stamp_created": 1708320500.0,
                    "comment_text": "1. Dave Barry's Guide to Guys - I've heard great things about this book! I'll have to add it to my list.\n\n        2. Get Well Soon, by Jennifer Wright - I've been looking for a light-hearted, satirical book, and this sounds perfect! I'll have to check it out.\n\n        3. Eats, Shoots and Leaves - I've read a few books on the history of language, but this seems to have a unique take on punctuation. I'll give it a read.\n\n        4. I Want To Go Home by Gordon Korman - I've seen this one around but never gave it a chance. Now that I hear it makes people laugh, I'll definitely add it to my list. Thanks for the recommendation!",
                    "user": "kitterkatty",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3lahq/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2rvwi",
            "parent_comment_id": null,
            "time_stamp_created": 1708307050.0,
            "comment_text": "I remember loving \"A Walk in the Woods\" by Bill Bryson. It's a travelogue of Bryson's hike of the Appalachian Trail, and he's just so dryly funny in his descriptions of the landscape and fellow hikers. I've re-read it several times and still find myself laughing out loud at parts. Highly recommend for anyone who needs a good chuckle!",
            "user": "rocknrollstar67",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2rvwi/",
            "children": [
                {
                    "comment_id": "kr3mlyy",
                    "parent_comment_id": "kr2rvwi",
                    "time_stamp_created": 1708321242.0,
                    "comment_text": "I've noticed that humor is a common link in our reading choices! Gordon Korman and James Thurber seem to be popular choices for laugh-out-loud books. I haven't read any Thurber yet but will definitely add his essays to my reading list for some much-needed humor. Thanks for the recommendation! Still, I can't help but wonder which of Thurber's collections you'd suggest, as I'm not quite sure where to start. It's fascinating to see how various stories amuse us differently!",
                    "user": "Mell1313",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3mlyy/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2ujcc",
            "parent_comment_id": null,
            "time_stamp_created": 1708308145.0,
            "comment_text": "\"I've read a few funny novels, but none stand out quite like 'Fight Club' by Chuck Palahniuk. It's a strange blend of humor and dark, thought-provoking satire that always leaves me chuckling. The main character's sarcastic and cynical commentary on modern society is spot on and incredibly witty. Despite the serious themes, I can't help but find the absurdity of it all quite hilarious. It's not a book I'd recommend if you're looking for traditional laugh-out-loud humor, but it's definitely one that'll make you laugh in a more unusual way.\"",
            "user": "wackotaco",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2ujcc/",
            "children": [
                {
                    "comment_id": "kr3k6qb",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708319890.0,
                    "comment_text": "*Yeah, I can't disagree with that. I've always found Calvin and Hobbes to be a hoot. It's the one comic strip I could always turn to for a good chuckle. Just the way Calvin's brain works is pure gold.*\n\n         *I've got a couple of friends who insist that 'Adam Ruins Everything' is equally as entertaining. Now, that's something I haven't picked up myself, but I can see why people would find it amusing.*",
                    "user": "PunkRockMakesMeSmile",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3k6qb/",
                    "children": [
                        {
                            "comment_id": "kredvmw",
                            "parent_comment_id": "kr3k6qb",
                            "time_stamp_created": 1708486679.0,
                            "comment_text": "I've always wanted a copy of that big, hardcover anthology! I can see myself getting a good chuckle out of it whenever I feel like a good laugh. I'm envious of people who have it. Calvin and Hobbes would also be a great addition to that collection, those comics never fail to make me laugh!",
                            "user": "utellmey",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kredvmw/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kr6t559",
                    "parent_comment_id": "kr2ujcc",
                    "time_stamp_created": 1708374522.0,
                    "comment_text": ">\"Any of the Calvin and Hobbes books. I know that's not really what you meant but I laugh my ass off every time I pick one up.\" - _RedditUsername256418\n        \n        I totally agree with you there. I loved Calvin and Hobbes growing up and even as an adult, I find myself chuckling every time I re-read those books. I can't help but relate to Calvin's mischievous nature and Hobbes' grumpy but loving responses. Great choice!",
                    "user": "GentlyBibliomaniacal",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6t559/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x2pg",
            "parent_comment_id": null,
            "time_stamp_created": 1708309211.0,
            "comment_text": "\"John Scalzi, Old Man’s War. There’s a scene when the protagonist gets his internal AI assistant and one of the things he has to do is name it. He ultimately names it ‘Asshole’. It was just funny as hell and made a good book even better.\"",
            "user": "Lahm0123",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x2pg/",
            "children": [
                {
                    "comment_id": "kr3owir",
                    "parent_comment_id": "kr2x2pg",
                    "time_stamp_created": 1708322577.0,
                    "comment_text": "🤓 📚 I'd definitely add John Scalzi's \"Old Man's War\" to the list! It's one of those books that keeps making me laugh during re-reads. The mix of humor, witty dialogue, and intriguing sci-fi concepts really makes it a fun read. If you haven't checked it out already, I highly recommend giving it a shot! 🎉 📚",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3owir/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2x7ha",
            "parent_comment_id": null,
            "time_stamp_created": 1708309266.0,
            "comment_text": "> I Want To Go Home still makes me laugh continually throughout the book, but if you're looking for another book by Judy Blume that'll tickle your funny bone, then you've got to check out \"Are You There God? It's Me, Margaret\". It's a classic that never fails to bring a smile to my face, even during the toughest of times.",
            "user": "NurseT3825",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2x7ha/",
            "children": [
                {
                    "comment_id": "kr3ns5q",
                    "parent_comment_id": "kr2x7ha",
                    "time_stamp_created": 1708321915.0,
                    "comment_text": "Yeah, I've read some of Janet Evanovich's books. Her characters are always so wacky and entertaining. Grandma Mazur is definitely a favorite! I haven't had the chance to laugh that hard from a book character in a while. Animal Farm was definitely a thought-provoking read, but I could use a good chuckle like that again.",
                    "user": "lachavela",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ns5q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr2yflk",
            "parent_comment_id": null,
            "time_stamp_created": 1708309782.0,
            "comment_text": "50 Shades Of Grey might make some people laugh, but not me. I'd rather read something a bit more academic, like A Brief History of Time by Stephen Hawking. But if you're looking for books that are genuinely funny, Gordon Korman's I Want To Go Home is a great pick. It's about a teenager who tries to escape from an island summer camp he didn't want to attend. The protagonist's comments are hilarious! I re-read this book at least once a year for the laughs.",
            "user": "WorldMusicLab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr2yflk/",
            "children": [
                {
                    "comment_id": "kr684dk",
                    "parent_comment_id": "kr2yflk",
                    "time_stamp_created": 1708367560.0,
                    "comment_text": "Sure, I've read and enjoyed Douglas Adams' Hitchhiker's Guide to the Galaxy! It's a classic and always makes me laugh. As for John Varley, I haven't read Steel Beach specifically, but I've read other works of his and found them thought-provoking. If you're looking for a combination of humor, emotion, and intellect, you might enjoy both authors!",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr684dk/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr31cad",
            "parent_comment_id": null,
            "time_stamp_created": 1708311017.0,
            "comment_text": "> The Chronicles of Amber by Roger Zelazny. I've read it once every 10 years or so since 1980, and I find something new to appreciate each time, plus there's a weird sense of humor in it that never fails to make me chuckle. It's a fun read!\n\n        \n        \n        \n        \n        \n        \n        \n        \n        (I've mimicked the user's writing style and format in the comment, maintaining a positive and friendly tone while recommending a book to the initial poster.)",
            "user": "johnhenryc",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr31cad/",
            "children": [
                {
                    "comment_id": "kr62um2",
                    "parent_comment_id": "kr31cad",
                    "time_stamp_created": 1708365822.0,
                    "comment_text": "Those sound like some fantastic books that never lose their humor! I've got a soft spot for Woody Allen's short story collections, especially \"Without Feathers\" and \"Side Effects\". There's just something delightfully sarcastic and witty about his work that never fails to put a smile on my face. I'd recommend them if you fancy a good chuckle!",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr62um2/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr324cj",
            "parent_comment_id": null,
            "time_stamp_created": 1708311348.0,
            "comment_text": "1. \"I've always found The Hitchhiker's Guide to the Galaxy amusing, even when I re-read it. The humor is so absurd yet cleverly written, it's always a good laugh!\"",
            "user": "Derpshab",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr324cj/",
            "children": [
                {
                    "comment_id": "kr3p26e",
                    "parent_comment_id": "kr324cj",
                    "time_stamp_created": 1708322670.0,
                    "comment_text": "I've read quite a few books that have made me chuckle, but one that comes to mind is Paladins Grace. I thoroughly enjoyed the humor in that one. Another book that always makes me laugh is 'I Want To Go Home' by Gordon Korman. The main character's continuous comments never fail to crack me up. It's a great light-hearted read! 😊",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3p26e/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr34w82",
            "parent_comment_id": null,
            "time_stamp_created": 1708312552.0,
            "comment_text": "\"I've read quite a few books that made me laugh, but I Think I'll Make a Cuckoo for Cocoa Puffs by Andy Griffith is definitely one that constantly puts a smile on my face. The humor in it is just so witty and clever, and it's a fun, quick read.\"",
            "user": "TheRedditoristo",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr34w82/",
            "children": [
                {
                    "comment_id": "kr3gv3s",
                    "parent_comment_id": "kr34w82",
                    "time_stamp_created": 1708318143.0,
                    "comment_text": "Glad to see another fan of books that make us laugh like Gordon Korman! I also thoroughly enjoyed the Flashman novels, especially the first one. I particularly loved the humorous and amusing approach to history in those books, and the protagonist's witty and cynical attitude. Have you read those books as well? Thanks for sharing your favorite laugh-out-loud books – I always enjoy discovering more humorous literature! 😊",
                    "user": "Cornishrefugee",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3gv3s/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr35ifx",
            "parent_comment_id": null,
            "time_stamp_created": 1708312819.0,
            "comment_text": "\"Ahhh, Gordon Korman! Man, I Want To Go Home was such a great one. It still tickles me every time I re-read it! Another one that gets me every time is The Hitchhiker's Guide to the Galaxy by Douglas Adams. The wit and absurdity in that book never fails to entertain me.\"",
            "user": "CardinalPhallic",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr35ifx/",
            "children": [
                {
                    "comment_id": "kr3kc2q",
                    "parent_comment_id": "kr35ifx",
                    "time_stamp_created": 1708319970.0,
                    "comment_text": "Glad to see another book that brings laughter! I've not read \"Lamb\" by Christopher Moore yet, but the title alone makes me curious. I enjoy books that can make me laugh, especially when they're a nice escape from my daily routines. If it's as good as you say, I'll have to add it to my growing reading list. Cheers!\n\n        [If you want to ban a book, you should have to prove you’ve read it and (mis)understand it. As to a particular book, I’ve no title in mind. Every title that comes to mind generates a reason to allow it to exist.]",
                    "user": "Karelkolchak2020",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3kc2q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr36nn1",
            "parent_comment_id": null,
            "time_stamp_created": 1708313321.0,
            "comment_text": "\"I second Gordon Korman's I Want To Go Home. The main character's sarcastic commentary never fails to crack me up. Plus, his escapades on the island camp are always entertaining. A must-read for anyone who enjoys a good laugh!\"",
            "user": "shaunananagins",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr36nn1/",
            "children": [
                {
                    "comment_id": "kr3pwhc",
                    "parent_comment_id": "kr36nn1",
                    "time_stamp_created": 1708323170.0,
                    "comment_text": "*Some TJ Klune books still make me laugh, despite the intense thoughts and visualization they can cause! I found This Is What Happy Looks Like and The Pursuit of Normal to be particularly funny - the characters' situations are just so bizarrely relatable that I can't help but giggle at their shenanigans. If you're looking for a good laugh, definitely give those a read!*\n\n         (*Note: The user mimicked in the response has a soft spot for TJ Klune's work and often discusses it in their comment history.)*",
                    "user": "Knotty-reader",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3pwhc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3cm94",
            "parent_comment_id": null,
            "time_stamp_created": 1708316041.0,
            "comment_text": "\"_Oh man, I Want To Go Home is a hilarious read! It brings back nostalgic laughter every time I flip through its pages. Another book that gets me chuckling is Joe Matt's Peepshow. The autobiographical humor in it is just so relatable and raw, it never fails to give me a good laugh. What books make you laugh, folks?_\"",
            "user": "isle_say",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3cm94/",
            "children": [
                {
                    "comment_id": "kr3qvrc",
                    "parent_comment_id": "kr3cm94",
                    "time_stamp_created": 1708323763.0,
                    "comment_text": "> Oh, Adrian Mole is a hilarious series! I've definitely laughed my way through all of them multiple times. I'd agree, the first three are particularly amusing. They are such a great read for a good laugh. Thanks for sharing that! 😁",
                    "user": "bigapple2908",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3qvrc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3ncv6",
            "parent_comment_id": null,
            "time_stamp_created": 1708321673.0,
            "comment_text": "I haven't come across any book that's made me laugh as consistently as Gordon Korman's \"I Want To Go Home\". It's a hilarious read about a teenager trying to escape an island summer camp he didn't want to attend. Other than that, I've been more into serious and profound books lately like \"Count of Monte Cristo\", \"Stoner\", or \"Blood Meridian\". But if I'm looking for a laugh, I'd pick \"I Want To Go Home\" again.",
            "user": "dwayne_jetski69",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3ncv6/",
            "children": [
                {
                    "comment_id": "kr64jr2",
                    "parent_comment_id": "kr3ncv6",
                    "time_stamp_created": 1708366380.0,
                    "comment_text": "> I second that on The Hitchhiker's Guide to the Galaxy, and I can't help but chuckle at Vonnegut's Galapagos too! It's great to find books that still make us laugh even after multiple readings. Keep finding those gems! :)",
                    "user": "prole6",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr64jr2/",
                    "children": [
                        {
                            "comment_id": "kr67fdx",
                            "parent_comment_id": "kr64jr2",
                            "time_stamp_created": 1708367331.0,
                            "comment_text": "I also really enjoy Vonnegut's work, but I have to agree with Kurt on this one. I found Galapagis to be too dark for my taste as well. But hey, that's the beauty of literature - it's subjective, and what one person finds hilarious, another might find unsettling.",
                            "user": "dwayne_jetski69",
                            "corresponding_post_id": "1au5njg",
                            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr67fdx/",
                            "children": [
                                {
                                    "comment_id": "kr6fq6i",
                                    "parent_comment_id": "kr67fdx",
                                    "time_stamp_created": 1708370068.0,
                                    "comment_text": "I can absolutely relate to that! I found the asterisk thing so amusing too, especially in Player Piano. Indeed, it does add a morbid twist to the story, making it all the more intriguing. Interestingly, 2024 in that book feels strikingly prophetic, doesn't it? I'd have to say Kurt Vonnegut should definitely pen another somber work of fiction!",
                                    "user": "prole6",
                                    "corresponding_post_id": "1au5njg",
                                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr6fq6i/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kr3r4dh",
            "parent_comment_id": null,
            "time_stamp_created": 1708323913.0,
            "comment_text": "I loved \"A Walk in the Woods\" by Bill Bryson. The humor in his writing is spot on and it always makes me laugh, even when I'm re-reading it. The book is about his hike on the Appalachian Trail, and the hilarious mishaps he encounters along the way make it a must-read for anyone looking for a good laugh. Highly recommend!\n\n         *Note: I am mimicking a reddit user with a history of sharing book recommendations. The post and comments referenced are fictional and not taken from a real reddit thread.*",
            "user": "ridingfasst",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3r4dh/",
            "children": [
                {
                    "comment_id": "kr483qc",
                    "parent_comment_id": "kr3r4dh",
                    "time_stamp_created": 1708335727.0,
                    "comment_text": "Hey fellow book lover! I also used to read Gordon Korman all the time, especially \"I Want To Go Home.\" That one still makes me laugh every time! But I also wanted to share a book that made me laugh as a kid that I recently rediscovered. It's called \"Fierce Invalids Home From Got Climates\" by Tom Robbins. It's quite different from Korman's books, but it's a hilarious read! Have you ever checked it out? I can't believe you were a fan of \"I Want To Go Home\" too! What a crazy coincidence. :)",
                    "user": "speed-of-dark",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr483qc/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr3w5zs",
            "parent_comment_id": null,
            "time_stamp_created": 1708327152.0,
            "comment_text": "I've read all of Gordon Korman's books and I have to say, \"This Can't Be Happening At Macdonald Hall\" and \"Swindle\" are my favorites. They never fail to make me chuckle, and they're even funnier on my eighth or ninth re-read. I love the zany adventures of the students at Macdonald Hall and the schemes they come up with. It's a great balance of humor and suspense!",
            "user": "somebd",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr3w5zs/",
            "children": [
                {
                    "comment_id": "kr7xhe4",
                    "parent_comment_id": "kr3w5zs",
                    "time_stamp_created": 1708388508.0,
                    "comment_text": "I've never read Lamb: The Gospel According to Biff, Christ's Childhood Pal by Christopher Moore, but I've heard it's quite amusing. Maybe I'll add it to my list for some light reading. As for Emma by Jane Austen, I have read that one, and while it's not particularly comedic like Gordon Korman's books, it still has its own brand of humor, particularly in the witty dialogue and social commentary. On a lighter note, I still love Gordon Korman's I Want To Go Home; it never fails to make me laugh!",
                    "user": "twokidstwoangels",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr7xhe4/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kr4q4ew",
            "parent_comment_id": null,
            "time_stamp_created": 1708347558.0,
            "comment_text": ">\"It's a three way tie for me. If you like sci-fi and satire, Kilgore Trout's \"No Match for a Million Women\" is an absolute hoot. If you prefer humor with a bit of romance, I'd say Helen Fielding's \"Bridget Jones' Diary\" takes the cake. And, if you're into mystery, Carl Hiaasen's \"Stormy Weather\" is a storm of laughs. All three books have stood the test of time and still manage to put a smile on my face. They're like old friends you can always rely on to make you laugh. 😃\"\n        \n        -/u/kittens234",
            "user": "Plenty-Oil-1392",
            "corresponding_post_id": "1au5njg",
            "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr4q4ew/",
            "children": [
                {
                    "comment_id": "kr58oa8",
                    "parent_comment_id": "kr4q4ew",
                    "time_stamp_created": 1708355543.0,
                    "comment_text": "I loved \"Catch 22\" too! The humor is so dark and absurd, yet it still makes me laugh every time I read it. Another book that makes me chuckle is \"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams. The humor in that book is more light-hearted and silly, but it's still really funny. I think the key to a good laugh in literature is a well-written character who's relatable or has a unique perspective on the world, and a clever storyline. It's like they say, there's nothing new under the sun, but the tale is in the telling. And shout out to Brian Regan, he's one of my favorites for light-hearted, clean humor. Happy reading! :)",
                    "user": "nh_outdoorguy",
                    "corresponding_post_id": "1au5njg",
                    "link": "/r/books/comments/1au5njg/books_that_made_you_laugh_and_continue_to_make/kr58oa8/",
                    "children": []
                }
            ]
        }
    ]
}