{
    "post_id": "18vx8ip",
    "title": "How to read a book a week?",
    "content": "I keep saying stories and posts about challenges like 52 books a year etc, and simply don't understand how people do it. With work, families and other commitments, and assuming the average book/novel takes anywhere from 15-20 hours to complete, where do people find the time? Do they ensure they read short books? Is it mostly audio books? Do you actually retain a lot of what you read?",
    "timestamp": 1704117398.0,
    "num_comments": 646.0,
    "link": "https://www.reddit.com/r/books/comments/18vx8ip/how_to_read_a_book_a_week/",
    "root_comments": [
        {
            "comment_id": "kftzzry",
            "parent_comment_id": null,
            "time_stamp_created": 1704117893.0,
            "comment_text": "The average novel is about 8 hours in audio and most people read faster than that. Remember most novels are under 500 pages. It all depends on the book. Some are light and you fly through them even if they are huge. Other 250 page books take forever to read.",
            "user": "Smooth-Review-2614",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kftzzry/",
            "children": [
                {
                    "comment_id": "kfu1mh8",
                    "parent_comment_id": "kftzzry",
                    "time_stamp_created": 1704118788.0,
                    "comment_text": "Been an platinum audible subscriber since 2003 (Jesus Christ, 21 years now. Wow). If a book is less than 10 hours, I will generally avoid it unless it's by an author or a narrator I really like.",
                    "user": "ShippingMammals",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu1mh8/",
                    "children": [
                        {
                            "comment_id": "kfu7fzs",
                            "parent_comment_id": "kfu1mh8",
                            "time_stamp_created": 1704121679.0,
                            "comment_text": "I dunno not everything has to be Storming Archives or Tolstoy. Are any of the Agatha Christie Novels over 10 hours in audiobook form? I don't think any of the Discworld books were that long either.",
                            "user": "MaimedJester",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu7fzs/",
                            "children": [
                                {
                                    "comment_id": "kfu8ump",
                                    "parent_comment_id": "kfu7fzs",
                                    "time_stamp_created": 1704122323.0,
                                    "comment_text": "Oh, I wish I could say I've read Tolstoy etc. but I could care less about the 'classics' or books deemed historically important. I really only listen to Sci-Fi and occasionally fantasy these days with some horror thrown in from King now and then. I used to be more evenly split between the two genres but over the past decade I've mostly stuck to Sci-Fi with a few exceptions like Sanderson, but I realized early on the kind of stories I like are the long Space / Fantasy opera with a lot of characters etc. although some more focused stories like Altered Carbon etc. work in too. It's not that I wont go lower than 10 hours, but takes something to make me consider using a credit. Shorter books area also a lot cheaper so sometimes I'll just pony up and buy low hour book if it's cheap enough and something I'm into to save the credit. Length is certainly a part of my equation too - bang for the buck. I get two credits a month, which comes out to two books so I like to go for long ones over short.. but again depends on the author and narrator.",
                                    "user": "ShippingMammals",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu8ump/",
                                    "children": [
                                        {
                                            "comment_id": "kful3me",
                                            "parent_comment_id": "kfu8ump",
                                            "time_stamp_created": 1704127370.0,
                                            "comment_text": "If space is your thing and not historical period pieces... That's totally understandable. Like I like the Murderbot diaries but those are barely novellas and if I had to pay for them at the same rate as say Project Hail Mary or Leviathan Wakes, I can see having an issue with them. But Murderbot is fun and if they ever do a bundle of the first 4 for like 2 credits, that's about 12-14 hours and each story is pretty good.",
                                            "user": "MaimedJester",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kful3me/",
                                            "children": [
                                                {
                                                    "comment_id": "kfulldq",
                                                    "parent_comment_id": "kful3me",
                                                    "time_stamp_created": 1704127559.0,
                                                    "comment_text": "Is this related to the internet series on YouTube? I've not watched it but there is a series called murderbots, if I am not mistaken, that's very popular.",
                                                    "user": "ShippingMammals",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfulldq/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfuskp8",
                                                            "parent_comment_id": "kfulldq",
                                                            "time_stamp_created": 1704130188.0,
                                                            "comment_text": "It's about a security robot that is an internal first perspective who hacked it's safety protocols, and instead of just killing everyone discovers cheesy soap operas and just wants to veg out and watch soap operas on the internet feed and is socially awkward around humans but has to keep up it's job to not be found out. All it wants to do is be left alone to watch cheesy soap operas. And stop these idiot humans from getting killed.",
                                                            "user": "MaimedJester",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuskp8/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfutf8d",
                                                                    "parent_comment_id": "kfuskp8",
                                                                    "time_stamp_created": 1704130501.0,
                                                                    "comment_text": "That actually sounds really good, I'll have to look that up. I love stories like that. Somewhat reminds me of Chappie.",
                                                                    "user": "ShippingMammals",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfutf8d/",
                                                                    "children": [
                                                                        {
                                                                            "comment_id": "kfycyyw",
                                                                            "parent_comment_id": "kfutf8d",
                                                                            "time_stamp_created": 1704184452.0,
                                                                            "comment_text": "FYI If your library does Hoopla the whole series is there for instant listen, and the ebooks are on Kindle unlimited",
                                                                            "user": "SinkPhaze",
                                                                            "corresponding_post_id": "18vx8ip",
                                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfycyyw/",
                                                                            "children": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfvg1x6",
                                    "parent_comment_id": "kfu7fzs",
                                    "time_stamp_created": 1704138662.0,
                                    "comment_text": "This is very much an outcome of how Audible works. One credit is one credit, regardless of what book you spend it on, so it feels very wasteful to spend a credit on a short book and get half the entertainment time out of the same money.",
                                    "user": "TemperatureRough7277",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvg1x6/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfu70nd",
                    "parent_comment_id": "kftzzry",
                    "time_stamp_created": 1704121480.0,
                    "comment_text": "The average book on my audible is 15 hours which would make a book a week pretty infeasible. Most biographies, which I enjoy, are over 22 hours.",
                    "user": "PositionAdmirable282",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu70nd/",
                    "children": [
                        {
                            "comment_id": "kfu7xv8",
                            "parent_comment_id": "kfu70nd",
                            "time_stamp_created": 1704121913.0,
                            "comment_text": "That’s only if you’re listening at 1x speed, though. My audiobooks average probably 15-20 hours and I can finish them in a week easy between listening at 1.7-2.0x speed and an hour commute each way. I also combo read, so if I’m at home and can’t listen, I read the book either physically or on my phone or kindle. I read Lonesome Dove (which is like 950 pages) in two and a half days doing that.",
                            "user": "yohbahgoya",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu7xv8/",
                            "children": [
                                {
                                    "comment_id": "kfuo34f",
                                    "parent_comment_id": "kfu7xv8",
                                    "time_stamp_created": 1704128501.0,
                                    "comment_text": "> between listening at 1.7-2.0x speed Any slower and I find my mind tends to wander away from the story",
                                    "user": "lawstandaloan",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuo34f/",
                                    "children": [
                                        {
                                            "comment_id": "kfv3w9o",
                                            "parent_comment_id": "kfuo34f",
                                            "time_stamp_created": 1704134313.0,
                                            "comment_text": "Yup me too! My first recommendation when people say they have trouble focusing on audiobooks is to speed them up. I almost never listen to anything slower than 1.5, and usually 1.7-2 is my go-to.",
                                            "user": "nopantstime",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3w9o/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kfxjcyd",
                                            "parent_comment_id": "kfuo34f",
                                            "time_stamp_created": 1704167271.0,
                                            "comment_text": "Figuring out speeding things up was a lifesaver for me. I still VASTLY prefer actually reading, because I can read faster myself than anyone can read to me. But speeding up my podcasts was life changing for me. I still don't like audio books, but have been using the occasionally for books I know really well in a secondary language to immerse myself in the language a bit more and become more comfortable hearing and deciphering it. Usually when able I will listen to it alongside reading the book in English, which has shown me a few new interesting words/ways that native speakers say certain things. Then I usually go bug my sister in law when I'm confused about linguistic things that don't seem to translate well. Lol",
                                            "user": "KhaiPanda",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxjcyd/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfyck4a",
                                    "parent_comment_id": "kfu7xv8",
                                    "time_stamp_created": 1704184128.0,
                                    "comment_text": "I seriously don't understand how people do this, 2x sounds like I'm listening to Alvin and the Chipmunks on speed read a book to me. Fastest I can do is 1.3x and have it still be comprehensible.",
                                    "user": "QueenMackeral",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyck4a/",
                                    "children": [
                                        {
                                            "comment_id": "kfydjls",
                                            "parent_comment_id": "kfyck4a",
                                            "time_stamp_created": 1704184906.0,
                                            "comment_text": "My theory is that you get used to it. When I started listening to audiobooks, I couldn’t go over 1.2x but that’s gradually gone up over the years. I just recently made the jump from 1.8x to 2.0x in the last few weeks. Sometimes I do slow down to 1.7x if it’s a fantasy book and I’m struggling with the words or names used but it’s mostly fine. My husband makes fun of how it sounds at higher speeds too 😅",
                                            "user": "yohbahgoya",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfydjls/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfusuyc",
                            "parent_comment_id": "kfu70nd",
                            "time_stamp_created": 1704130293.0,
                            "comment_text": "I listened to 82 audiobooks this year. 85% of my listening was while doing housework, driving, and walking around the neighborhood (1hr/day). You have hours upon hours per day of mindless tasks that you could listen to audiobooks while doing. I listened to 2 20+ hour long books in December. One in less than 3 days! (That was too intense.)",
                            "user": "pretenditscherrylube",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfusuyc/",
                            "children": []
                        },
                        {
                            "comment_id": "kfx4s9b",
                            "parent_comment_id": "kfu70nd",
                            "time_stamp_created": 1704161308.0,
                            "comment_text": "2x speed audio books and I can finish 2 a week while I do chores and drive!",
                            "user": "pinkphysics",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfx4s9b/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfu00ig",
            "parent_comment_id": null,
            "time_stamp_created": 1704117905.0,
            "comment_text": "How does a novel take 15 hours to read? A reasonable pace is something like 80-100 pages an hour with a 500 page book that is 5-6 hours. Most novels are in the 300 something page area so that is 3-4 hours pure reading time.",
            "user": "Ihrenglass",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu00ig/",
            "children": [
                {
                    "comment_id": "kfu0n62",
                    "parent_comment_id": "kfu00ig",
                    "time_stamp_created": 1704118251.0,
                    "comment_text": "80-100 pages an hour?! That’s some insane speed reading. I read like 20 pages an hour which is the 15-20 hour time frame OP posted.",
                    "user": "Hopefulwaters",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0n62/",
                    "children": [
                        {
                            "comment_id": "kfubtpx",
                            "parent_comment_id": "kfu0n62",
                            "time_stamp_created": 1704123633.0,
                            "comment_text": "20 pages an hour is crazy to me. I feel like I would never finish any books if I read at that speed. That's not a dig at you, I just prefer to finish books faster because I get tired of reading the same story for weeks at a time. I personally read around 60 pages an hour for the average book. If it's a romance or YA then anywhere from 80-100 is definitely plausible.",
                            "user": "talesofabookworm",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfubtpx/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfu1r28",
                    "parent_comment_id": "kfu00ig",
                    "time_stamp_created": 1704118853.0,
                    "comment_text": "Well that just sounds insane. How big is the text in your books?",
                    "user": "ShippingMammals",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu1r28/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu0ggg",
            "parent_comment_id": null,
            "time_stamp_created": 1704118149.0,
            "comment_text": "Depending on your preference, some books are easier to read an consume than others. I.e. romance, mystery, YA, are quick reads for me because writing is simple. I read them for entertainment, but a lot of them doesn't stick with me. Classics or noteworthy books may take longer because of the complexity of the writing, and time it takes to process. At the end, it's not a competition, read what you like and enjoy the process.",
            "user": "busselsofkiwis",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0ggg/",
            "children": [
                {
                    "comment_id": "kfu88hp",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704122048.0,
                    "comment_text": "^ “Astro physics for People In A Hurry” is a 4 hour audiobook, “Game of Thrones” is a 34 hour audiobook. If finishing books quickly is very inspiring for you, then pick easier reading level + shorter books. Dense fantasy or a lengthy historical autobiography are not conducive to quick reading. Make sure you take the appropriate amount of time to ENJOY the book. If the point of stories was just to know the bullet points, we’d all be buying PowerPoint presentations. Enjoy the journey, enjoy the language, and enjoy the fact that you’ve chosen a slow medium to consume a (hopefully) beautiful story.",
                    "user": "bbradleyjayy",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu88hp/",
                    "children": []
                },
                {
                    "comment_id": "kfu8ql1",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704122275.0,
                    "comment_text": "Read children's books and then BAM suddenly you're a super fast amazing reader by your book/week stats.",
                    "user": "AnorhiDemarche",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu8ql1/",
                    "children": [
                        {
                            "comment_id": "kfulnyh",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704127588.0,
                            "comment_text": "Guess how I went from 26/ year to 54 last year! I decided all children's books are worth counting once as they also is cultural references. Then they of course is another category...",
                            "user": "avdpos",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfulnyh/",
                            "children": [
                                {
                                    "comment_id": "kfvbc1u",
                                    "parent_comment_id": "kfulnyh",
                                    "time_stamp_created": 1704136971.0,
                                    "comment_text": "Add comic books and boom you reach 70+ books easy",
                                    "user": "catsumoto",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvbc1u/",
                                    "children": [
                                        {
                                            "comment_id": "kfviizk",
                                            "parent_comment_id": "kfvbc1u",
                                            "time_stamp_created": 1704139545.0,
                                            "comment_text": "If they have an isbn I register them. So \"The complete collection of Calvin and Hobles\" (in swedish) is 4-5 books and I count them as that as each has an isbn.",
                                            "user": "avdpos",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfviizk/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfxifyy",
                                    "parent_comment_id": "kfulnyh",
                                    "time_stamp_created": 1704166874.0,
                                    "comment_text": "I don't count picture books, personally. But I definitely count anything middle grade and up. Which isn't to say we shouldn't read younger stuff. Picture books truly bring me a lot of joy.",
                                    "user": "beldaran1224",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxifyy/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfurl68",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704129817.0,
                            "comment_text": "But then it does also affect your average pages per book. I say this as someone who has been doing a read along of the American Girl books for several years now, but also I read 193 books last year with an average of 303 pages per book so it’s all about balance.",
                            "user": "julieannie",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurl68/",
                            "children": [
                                {
                                    "comment_id": "kfxi9sh",
                                    "parent_comment_id": "kfurl68",
                                    "time_stamp_created": 1704166799.0,
                                    "comment_text": "Why does that matter? Page count isn't a sign of quality or worth or even weight.",
                                    "user": "beldaran1224",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxi9sh/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfvypwx",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704145293.0,
                            "comment_text": "I read ~800 pages of official 40k fiction last week. When I realized how quickly I'd finished it, I felt dirty.",
                            "user": "thelubbershole",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvypwx/",
                            "children": []
                        },
                        {
                            "comment_id": "kfwyub3",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704159032.0,
                            "comment_text": "Manga",
                            "user": "sixtus_clegane119",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwyub3/",
                            "children": []
                        },
                        {
                            "comment_id": "kfxi4oy",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704166739.0,
                            "comment_text": "Yeah, last year I wanted to read the Wings of Fire series and read 3 of them in a single day. Really fun books, recommend them. Also just very quick.",
                            "user": "beldaran1224",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxi4oy/",
                            "children": []
                        },
                        {
                            "comment_id": "kfxosa9",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704169739.0,
                            "comment_text": "I've read almost a thousand books this year. 😅 We read 3 books every night before bedtime.",
                            "user": "newenglander87",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxosa9/",
                            "children": []
                        },
                        {
                            "comment_id": "kfz5e2v",
                            "parent_comment_id": "kfu8ql1",
                            "time_stamp_created": 1704203535.0,
                            "comment_text": "Graphic novels go pretty quick too, even the collected volume ones (forgot the proper name)",
                            "user": "LaptopsInLabCoats",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfz5e2v/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfux2q9",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704131835.0,
                    "comment_text": "Fiction vs non-fiction too. Seeing pages that are just walls of text are difficult to get through and consume vs a lot of dialog.",
                    "user": "R0binSage",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfux2q9/",
                    "children": []
                },
                {
                    "comment_id": "kfv3a28",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704134092.0,
                    "comment_text": "I had this happen with my graphic novels/manga. Depending on the size, content, and how eager I am to finish said item, I can easily get through at least 1 of those per day. More if I have more free time and cut down on tv. Most weeks I was clearing roughly a graphic novel/manga volume per day. Easily got to 7 books per week. Plus, I found them as a really good way to engage with genres and materials I would normally not engage with as text/audiobook material.",
                    "user": "Abyssal_Minded",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3a28/",
                    "children": []
                },
                {
                    "comment_id": "kfwy2b7",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704158737.0,
                    "comment_text": "Yeah I've read almost a book a day over the Xmas break but they've all been ~350 page crime/thriller/mystery books. Its basically like watching a movie or two, just that I'm reading it on my phone in the sunshine!",
                    "user": "typewriter07",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwy2b7/",
                    "children": []
                },
                {
                    "comment_id": "kfxeg51",
                    "parent_comment_id": "kfu0ggg",
                    "time_stamp_created": 1704165186.0,
                    "comment_text": "So true! I usually read over 100 books a year, but most are romance and fantasy. They aren’t actually any shorter than other genres of books, sometimes they’re longer, but they’re easier to read and process, so I can get through them way quicker.",
                    "user": "JadeM785",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxeg51/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu0gjs",
            "parent_comment_id": null,
            "time_stamp_created": 1704118150.0,
            "comment_text": "The average book does not take 15-20 hours to read. Let’s say To Kill a Mockingbird. It’s about 300 pages. That’s between 5-7 hours for a normal reader. Think how much time you waste online. Your phone screen time could easily be substituted for reading. Once you do that, you can read a book in a day or two. It’s just about making time and how important you regard reading to be.",
            "user": "Kafka1915",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0gjs/",
            "children": [
                {
                    "comment_id": "kfuk3vn",
                    "parent_comment_id": "kfu0gjs",
                    "time_stamp_created": 1704126990.0,
                    "comment_text": "TKaMB isn’t an average book that you’d find in an airport bookshop. But that’s beside the point. 15-20 hours is reasonable. If you factor in people’s lives; working 8-9hrs; commuting to work, household chores, cooking, socialising, tv shows and other hobbies then actually, 15-20 hours is normal. I prefer the art of studying books than reading them. However, I think anyone who goes home from work and then just sits and reads for hours need to find more than one hobby. I get home around 6pm. In order to get sufficient sleep, I have to be asleep by 10. In the space of 4 hours, I need to cook (and prep for next working day such as ironing clothes, lunch), I would listen to a podcast, watch a tv show. I’ve already lost about 3 hours. I’ve probably got forty-minutes-to-an-hour to read. That’s 5 hours a week. Or 20 hours a month. For me, to complete perhaps 10-12 books a year is completely normal. Because I do other things besides reading. If you spend your whole life with your head in books, you’ll pass up on real moments.",
                    "user": "LemonCurdJ",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuk3vn/",
                    "children": [
                        {
                            "comment_id": "kfunjba",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704128293.0,
                            "comment_text": "Some of us are out of those trenches and thrive on being able to read for a few hours. I work less, the kids are out of the house, etc. I still have other hobbies and keep track of my progress with those, too. Reading is BY FAR my most enjoyed hobby right now. I live a simple life and my \"real moments\" are enjoying peace and quiet.",
                            "user": "NotOkayThanksBuddy",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfunjba/",
                            "children": [
                                {
                                    "comment_id": "kfupy48",
                                    "parent_comment_id": "kfunjba",
                                    "time_stamp_created": 1704129201.0,
                                    "comment_text": "Don’t know why Ive been downvoted to hell. But yeah I guess some people have more time than others and that’s OK.",
                                    "user": "LemonCurdJ",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfupy48/",
                                    "children": [
                                        {
                                            "comment_id": "kfv1vmp",
                                            "parent_comment_id": "kfupy48",
                                            "time_stamp_created": 1704133582.0,
                                            "comment_text": "I'm guessing the \"missing real moments because reading\" didn't go over well in a books sub. 🤷‍♀️",
                                            "user": "NotOkayThanksBuddy",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv1vmp/",
                                            "children": [
                                                {
                                                    "comment_id": "kfv226c",
                                                    "parent_comment_id": "kfv1vmp",
                                                    "time_stamp_created": 1704133649.0,
                                                    "comment_text": "I expected nothing less from people who capture their lives behind a book.",
                                                    "user": "LemonCurdJ",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv226c/",
                                                    "children": []
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfv5zl9",
                                            "parent_comment_id": "kfupy48",
                                            "time_stamp_created": 1704135064.0,
                                            "comment_text": "Because you sound prudish and invalidate what others might find important. Having opinions is okay buy that doesnt mean they are right.",
                                            "user": "popolander",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv5zl9/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kfv80du",
                                            "parent_comment_id": "kfupy48",
                                            "time_stamp_created": 1704135789.0,
                                            "comment_text": "Because you made a ton of generalizations about people who enjoy reading while simultaneously talking down from your high horse. Someone asked how they can read more because that’s what they want to do and your response was to go find other hobbies because you think reading isn’t a good enough hobby and you assume that’s the only hobby OP can have.",
                                            "user": "brakeled",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv80du/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfup5u2",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704128902.0,
                            "comment_text": "Listen to an audiobook instead of a podcast while doing your evening prep. It’s an easy swap!",
                            "user": "happygoluckyourself",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfup5u2/",
                            "children": []
                        },
                        {
                            "comment_id": "kfuq6xk",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704129294.0,
                            "comment_text": "Who is to say that whatever experience you have reading books isn’t a real moment? Books are my main hobby and I’ll get home from work and read for hours. Reading supports my inner life and allows me to examine life more deeply than I would if I were to just quickly from life event to life event. It makes me happy. You live differently and it makes you happy, which is great. So why the judgement?",
                            "user": "she_is_the_slayer",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuq6xk/",
                            "children": [
                                {
                                    "comment_id": "kfuqjh5",
                                    "parent_comment_id": "kfuq6xk",
                                    "time_stamp_created": 1704129427.0,
                                    "comment_text": "We are all allowed to experience life differently from others. I was simply stating my experience. My judgement comes from the tripe that some people think reading is some sort of competition and if you don’t read 100s of books in a year, you’re somehow less than.",
                                    "user": "LemonCurdJ",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuqjh5/",
                                    "children": [
                                        {
                                            "comment_id": "kfv0z42",
                                            "parent_comment_id": "kfuqjh5",
                                            "time_stamp_created": 1704133259.0,
                                            "comment_text": "People set goals for THEMSELVES. When I set my goal, I don’t judge or criticize others for not meeting MY goals. Nobody cares how much anyone else reads or doesn’t read. From what I’ve seen, the community is supportive of people’s goals whether they are lower, or exceed average. I’ve never seen this “judgement” you speak of. And as far as people telling op how to read more books… op asked! So of course people will tell them how to increase the amount of books read, and things that worked for each of them",
                                            "user": "Pristine-Fusion6591",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv0z42/",
                                            "children": [
                                                {
                                                    "comment_id": "kfv2cgq",
                                                    "parent_comment_id": "kfv0z42",
                                                    "time_stamp_created": 1704133752.0,
                                                    "comment_text": "You choose whatever hill you wish to die on. It’s crazy how mad people get on social media.",
                                                    "user": "LemonCurdJ",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv2cgq/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfv5aly",
                                                            "parent_comment_id": "kfv2cgq",
                                                            "time_stamp_created": 1704134817.0,
                                                            "comment_text": "A different perspective does not equal anger.",
                                                            "user": "Pristine-Fusion6591",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv5aly/",
                                                            "children": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfuqjfn",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704129426.0,
                            "comment_text": "Very funny that you say that people who get home from work and then spend their time reading need to find other hobbies, when you also say that you get home from work and spend your time watching TV. If you have time to watch TV after work but also have other hobbies then how can you think that the people who sit and read a book after work don't also have other hobbies? We're just reading instead of watching TV.",
                            "user": "itsableeder",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuqjfn/",
                            "children": [
                                {
                                    "comment_id": "kfuqw56",
                                    "parent_comment_id": "kfuqjfn",
                                    "time_stamp_created": 1704129559.0,
                                    "comment_text": "I’d say the same for people who just watch tv for hours on end or scroll through social media for hours on end too. I may watch a TV programme, but it’s not the only thing I will do. I’d rather have more than one thing to do.",
                                    "user": "LemonCurdJ",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuqw56/",
                                    "children": [
                                        {
                                            "comment_id": "kfur6bp",
                                            "parent_comment_id": "kfuqw56",
                                            "time_stamp_created": 1704129664.0,
                                            "comment_text": "My point is that avid readers *do* have other hobbies. You're not unique.",
                                            "user": "itsableeder",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfur6bp/",
                                            "children": [
                                                {
                                                    "comment_id": "kfurbl0",
                                                    "parent_comment_id": "kfur6bp",
                                                    "time_stamp_created": 1704129718.0,
                                                    "comment_text": "My comment goes to the ones that don’t.",
                                                    "user": "LemonCurdJ",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurbl0/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfv04qg",
                                                            "parent_comment_id": "kfurbl0",
                                                            "time_stamp_created": 1704132954.0,
                                                            "comment_text": "but most do",
                                                            "user": "2001exmuslim",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv04qg/",
                                                            "children": []
                                                        },
                                                        {
                                                            "comment_id": "kfxenan",
                                                            "parent_comment_id": "kfurbl0",
                                                            "time_stamp_created": 1704165267.0,
                                                            "comment_text": "Even if they don’t, why’s that an issue? What is the harm in having reading as your primary (or only) hobby?",
                                                            "user": "JadeM785",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxenan/",
                                                            "children": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfv5x6w",
                                            "parent_comment_id": "kfuqw56",
                                            "time_stamp_created": 1704135041.0,
                                            "comment_text": "Then listen to audiobooks, that's what I do.",
                                            "user": "zxyzyxz",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv5x6w/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfurq4j",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704129872.0,
                            "comment_text": "This doesn’t make sense, how does factoring in work/chores/etc equate to needing 15-20 hours to read an average length book? It would still take 5-7 hours, but just spread out over a longer time period",
                            "user": "daisycheyenne",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurq4j/",
                            "children": [
                                {
                                    "comment_id": "kfuulqx",
                                    "parent_comment_id": "kfurq4j",
                                    "time_stamp_created": 1704130936.0,
                                    "comment_text": "I only read about 1 hr at night. So for me, I read about 1 book a month. So for me, it takes about 15-20 hours in a month to finish a novel (based on my Goodreads data).",
                                    "user": "LemonCurdJ",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuulqx/",
                                    "children": [
                                        {
                                            "comment_id": "kfvfkti",
                                            "parent_comment_id": "kfuulqx",
                                            "time_stamp_created": 1704138491.0,
                                            "comment_text": "That's... Still nonsense A book takes x hours to read. How does that depend on how spread out it is? If you pick up a 150 page novella it's not going to magically still take you 15 hours just because you read one hour a night.",
                                            "user": "neophlegm",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvfkti/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kfvsffg",
                                            "parent_comment_id": "kfuulqx",
                                            "time_stamp_created": 1704143034.0,
                                            "comment_text": "you either read extremely slow or you are not actually reading 1hr a night lol",
                                            "user": "sorayori97",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvsffg/",
                                            "children": [
                                                {
                                                    "comment_id": "kfvvqtr",
                                                    "parent_comment_id": "kfvsffg",
                                                    "time_stamp_created": 1704144208.0,
                                                    "comment_text": "Extremely slow! I’m okay with that. :)",
                                                    "user": "LemonCurdJ",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvvqtr/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfw1qjq",
                            "parent_comment_id": "kfuk3vn",
                            "time_stamp_created": 1704146396.0,
                            "comment_text": "The average length of a novel is around 350 pages. I’d say 7 hours is honestly a good estimate for how long it should take to finish one book, I don’t see what having other hobbies or life experiences has to do with that???",
                            "user": "lost_alchemy",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw1qjq/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfzwk4s",
                    "parent_comment_id": "kfu0gjs",
                    "time_stamp_created": 1704214553.0,
                    "comment_text": "Sometimes I'll look up audiobook read times to see how long I might spend reading a book in print or ebook format. I know I read faster than most narrators speak, but I also know I'm prone to distraction while reading, or setting the book down to ruminate on something, etc. -- so it ends up evening out more or less. A lot of the books I look up on Audible fall between 8 and 12 hours. Longer books do end up in the 15-20 range, but I feel like 10 or 11 hours is the average for most of the books I look up.",
                    "user": "Glass-Professor9325",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzwk4s/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu0oc8",
            "parent_comment_id": null,
            "time_stamp_created": 1704118269.0,
            "comment_text": "Do you ask how people have time to watch two netflix episodes a night? Switch that time for reading - boom, 52 books easy.",
            "user": "little_carmine_",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0oc8/",
            "children": [
                {
                    "comment_id": "kfu0t81",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704118345.0,
                    "comment_text": "Yes, this is probably the main thing and was even before there was a Netflix LOL",
                    "user": "apri11a",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0t81/",
                    "children": []
                },
                {
                    "comment_id": "kfu3izv",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704119779.0,
                    "comment_text": "Last January i did this without trying to and read 5 books in the month. I didn’t keep that pace up but you never realize how much time you actually have to read",
                    "user": "PMBSteve",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu3izv/",
                    "children": []
                },
                {
                    "comment_id": "kfu62r9",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704121030.0,
                    "comment_text": "This is exactly how I went from reading 16 books in 2021 to 51 in 2023. Watching significantly less TV and replacing phone scrolling time with reading.",
                    "user": "cat83883",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu62r9/",
                    "children": [
                        {
                            "comment_id": "kfu6n72",
                            "parent_comment_id": "kfu62r9",
                            "time_stamp_created": 1704121304.0,
                            "comment_text": "But,that’s the toughest part isn’t it?? How to replace phone and keep it away? Phone do have pull and how do I resist it? Could you please give some tips because I really struggle with that aspect",
                            "user": "adrianlannister007",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu6n72/",
                            "children": [
                                {
                                    "comment_id": "kfu7pqg",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704121808.0,
                                    "comment_text": "Turn off notifications so it won’t bother you. If its extra tough in the beginning set a timer for 20 min or something. Read without stopping or checking your phone til timer goes off. Then gradually increase the time or do multiple sessions until its not a problem.",
                                    "user": "little_carmine_",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu7pqg/",
                                    "children": [
                                        {
                                            "comment_id": "kfuoqkq",
                                            "parent_comment_id": "kfu7pqg",
                                            "time_stamp_created": 1704128742.0,
                                            "comment_text": "I use the timer trick and for the whatever reason it always works. \"I'm gonna sit and read for 45 minutes, no distraction\" it's like the itch to check my phone goes away, because I can do that after my time is up.",
                                            "user": "Mighty_Lorax",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuoqkq/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfu8al5",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704122076.0,
                                    "comment_text": "I’ve disabled notifications and badges. On iOS you can set up scheduled summary and set it to only send notifications on specific hours. You can of course customise it “, so reminders and calendar apps (or whatever you think is a must) are sent immediately whereas less priority apps like social media would be scheduled. This has been a game changer. I even disabled messages because nobody with an actual emergency will message me, they will call 911 or if it’s me they need, they will call, so no need for my attention to be pulled all the time. In the end you need to change your attitude toward the phone. Use it as a tool, not a distraction. Notifications are a distraction so I disabled them. I use the phone when I need to, not when the phone (or someone else) wants me to. I’d recommend reading Spark by Manoush Zomorodi as well as Digital Minimalism by Cal Newport.",
                                    "user": "SubparBookLibrary",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu8al5/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfu9bdi",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704122533.0,
                                    "comment_text": "Like the other two responses here, I think phone notifications plays a big part. I only have notifications on for messages (text, WhatsApp, and Facebook messenger only), and have no notifications for social media otherwise. That way, my phone isn’t always buzzing. When I started really getting into reading, I’d find that I’d read maybe 1/2 a page then be thinking about getting on my phone, so I started giving myself small goals, like “read 5 pages before picking up your phone.” Now I can sit and read for much longer periods most days, but some days it feels like I read a page then pick my phone back up! A big part of reading more for me was wanting to use my phone less, so I try to remind myself of that too.",
                                    "user": "cat83883",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu9bdi/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfu9opu",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704122699.0,
                                    "comment_text": "I put a digital timer on all my apps. Instagram becomes unavailable after 10 minutes. Reddit after 45 minutes of use. Deleted all time-wasting games. Turned off notifications for FB, IG, reddit, whatever. Once I hit my daily limits, I find i have nothing to do with my phone so I pick up a book instead. I'm also lazy so if I really need to I can put my phone in a different room (like upstairs) and get settled into my book downstairs. I'm much less likely to take a peak at my phone if I have to run up the stairs to get it. (I do keep my smart watch with me to get notifications because I do get anxiety about missing calls or texts from certain people, like work, but I can't mindlessly scroll whatever).",
                                    "user": "_notkvothe",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu9opu/",
                                    "children": [
                                        {
                                            "comment_id": "kfv3vvz",
                                            "parent_comment_id": "kfu9opu",
                                            "time_stamp_created": 1704134309.0,
                                            "comment_text": "What do you use for the digital timer?",
                                            "user": "pennyandthejets",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3vvz/",
                                            "children": [
                                                {
                                                    "comment_id": "kfveloa",
                                                    "parent_comment_id": "kfv3vvz",
                                                    "time_stamp_created": 1704138138.0,
                                                    "comment_text": "It's a built-in feature on my phone! I have a Pixel so not sure what's specific to Pixel vs Android, but I just search for \"Digital Wellbeing\" in settings and it has all the controls you could want. I can also long-press on an app, click App Info then Screen time and can set the limit there.",
                                                    "user": "_notkvothe",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfveloa/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfw3pzk",
                                                            "parent_comment_id": "kfveloa",
                                                            "time_stamp_created": 1704147131.0,
                                                            "comment_text": "It's an android feature",
                                                            "user": "Retinion",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw3pzk/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfwjsuz",
                                                                    "parent_comment_id": "kfw3pzk",
                                                                    "time_stamp_created": 1704153232.0,
                                                                    "comment_text": "iPhones have it too, under ‘Screen Time’.",
                                                                    "user": "habitualmess",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwjsuz/",
                                                                    "children": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfubi5t",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704123493.0,
                                    "comment_text": "I delete the big culprits from my phone until I reach my daily goal",
                                    "user": "spiritualspanx",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfubi5t/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfugx0j",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704125740.0,
                                    "comment_text": "I try , whenever I pull out my phone to kill time, to open up the kindle app and read a few pages rather than opening up a social media app.",
                                    "user": "TurquoiseHareToday",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfugx0j/",
                                    "children": [
                                        {
                                            "comment_id": "kfvww2k",
                                            "parent_comment_id": "kfugx0j",
                                            "time_stamp_created": 1704144623.0,
                                            "comment_text": "How has this thought never occurred to me?! Downloading the Kindle app now!",
                                            "user": "AvocadosAtLaw95",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvww2k/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfuh1b6",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704125787.0,
                                    "comment_text": "The phone has no pull over me. It generally stays in my pocket or on my desk, only used when I need to take a call or respond to something.",
                                    "user": "7LeagueBoots",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuh1b6/",
                                    "children": [
                                        {
                                            "comment_id": "kfuvy97",
                                            "parent_comment_id": "kfuh1b6",
                                            "time_stamp_created": 1704131430.0,
                                            "comment_text": "Burn the witch! (Kidding. I'm jealous.)",
                                            "user": "lilspydermunkey",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuvy97/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfuimzu",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704126425.0,
                                    "comment_text": "I did a self reflection a few years ago on what I gained from social media that year that I thought would matter to me in 6mo, 1 yr, 5 yrs. The answer was basically nothing. Fun for some jokes and whatnot, but fills time and attention with no lasting benefit. I deleted Twitter, basically got off Facebook, and limit Instagram/Reddit to a couple checks per week. I moved all apps I kept to a folder to be less accessible and put the kindle app in prominent place. Then I made a list of books on goodread I wanted to complete which helped keep me focused on the value of reading (mix of fun, classics, religious, sociological) and got to it! Went from 28 books to 87, 101, 82, 90, 107. A huge boost in those numbers for me as well I audiobooks. I get up early to run and get 1.5 hrs audiobooks in or more almost every morning.",
                                    "user": "KanterIHardlyKnowHer",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuimzu/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfuin7r",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704126427.0,
                                    "comment_text": "I'd recommend starting with the two minute rule. Pick a time to read, say an hour before bed and just commit yourself to reading for two minutes. After those two minutes, do whatever you want.",
                                    "user": "IWantAGI",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuin7r/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfuizya",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704126566.0,
                                    "comment_text": "Constraints work better than restraint. If there is no junk food in your home, you won't eat junk food. If there is no tv in your home, you won't watch tv. If you power off your phone every day after work, you won't spend your free time on your phone. Humans only have so many no's in a day. We are able to restrain ourselves a limited amount. Removing questions, removing temptations, removing things which control us is the easiest way to hault their power in our lives.",
                                    "user": "withboldentreaty",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuizya/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfumzo4",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704128087.0,
                                    "comment_text": "Consciously put your phone in a different room with only the most important contacts to ring in case of emergency. With how addicted we all are to our phones, even seeing it facedown can trigger the part of your brain that makes you want to check it.",
                                    "user": "charmcitycuddles",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfumzo4/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfur04k",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704129601.0,
                                    "comment_text": "I started just reading on my phone. the Libby app has been a godsend for me because now i replace doom scrolling on instagram or reddit when i’m bored with reading a few pages of a book. i still love physical books, but i love reading more.",
                                    "user": "bookreader018",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfur04k/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfut9t0",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704130446.0,
                                    "comment_text": "I have an app that I can set a time limit for individual app use and then get a pop up every ten minutes I go over. Its annoying as fuck but it gets me off social media.",
                                    "user": "kazuwacky",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfut9t0/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfv2ch2",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704133752.0,
                                    "comment_text": "If you read ebooks, put your Kindle app in a folder with all the apps that you usually scroll on. That's what helped me.",
                                    "user": "1210bull",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv2ch2/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfv93hw",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704136174.0,
                                    "comment_text": "I read ON my phone using Kindle or Libby. You’d be surprised at how easy it is to read a book on your phone - it’s just like scrolling and all notifications except calls are turned off when you’re in the app.",
                                    "user": "hotsauceandburrito",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv93hw/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvgcrj",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704138769.0,
                                    "comment_text": "I just read on my phone, so there's no yearning to check it, since it's in my hand already.",
                                    "user": "jellyrollo",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvgcrj/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvi7lr",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704139433.0,
                                    "comment_text": "Lots of good suggestions but reading on my phone has helped me! I downloaded the Libby app and sometimes it’s just satisfying to read on your phone I can’t explain it. This in combo with turning off notifications helped me, but I know this wouldn’t necessarily work for everyone",
                                    "user": "iffyorange",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvi7lr/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvjwui",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704140051.0,
                                    "comment_text": "I only use my social media apps on my computer; that helped a ton. I also started using the Kindle app on my phone, which I know is heretical to some. Now when I pick up my phone, Kindle is one of my go-to distraction apps while I'm waiting for something or just bored at home. In 2023 I read 5x what I did in 2022 with those changes. I also have 2-4 books I cycle through at a time so I can read according to my current attention span (e.g. an essay collection while in a waiting room, literary fiction before bed, non-fiction in the morning).",
                                    "user": "Material_Marzipan302",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvjwui/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvjyen",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704140065.0,
                                    "comment_text": "I have a magnetic phone case and when I get home I literally hang my phone up on the fridge. Most notifications turned off. If I get a call or text I have to go get the phone. It helps a lot",
                                    "user": "tesseract_89",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvjyen/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvmm2v",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704141003.0,
                                    "comment_text": "I allow very few apps to send me notifications. If it's not pressing and important to me, I don't need to see it. I also watch my screentime counter on my phone and try to keep it reasonable. Get in the habit of leaving your phone somewhere out of your hands. When I read, my phone is on my nightstand, not in bed with me. Other times throughout the day I'll leave it in my pocket if I'm at work, or in another room at home. Can't recommend enough that people find screenless hobbies and engage in them consciously. Takes some willpower, but the sooner you break yourself from pointless distractions and useless apps, the better. Almost nothing chiming up on our phones is all that important, and there's a reason the [people in silicon valley who worked on apps and tech realize how dangerous it all is]( Break the habit or become the product.",
                                    "user": "Frankensteinbeck",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvmm2v/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvnbmu",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704141257.0,
                                    "comment_text": "I pop my phone in focus mode and block everything apart from the kindle app, makes it a bit easier!",
                                    "user": "sorrowstouch",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvnbmu/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvnfpd",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704141298.0,
                                    "comment_text": "Put the kindle app on your phone- right on the front home screen. Bury social media in a folder and page or so away. When you grab your phone read first. And for heaven’s sake, pick a FUN book! Something exciting where you want to know what happens next, similar to a tv show.",
                                    "user": "ktgrok",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvnfpd/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvphty",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704142014.0,
                                    "comment_text": "Practice leaving it in another room. Set a bedtime for yourself an hour or two before you plan to go to sleep, and then put your phone on its charger outside of your bedroom somewhere, then go into your bedroom without it.",
                                    "user": "Kallistrate",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvphty/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfw1s2h",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704146411.0,
                                    "comment_text": "Tiredness is a big obstacle for me with this. Sometimes after work and dinner and putting down the toddler I can barely keep my eyes open, let alone read something. So I just end up watching TV 😞",
                                    "user": "happyhealthy27220",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw1s2h/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfw3ju9",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704147067.0,
                                    "comment_text": "Get kindle on your phone and everytime you find yourself doomscrolling, whip out your current read.",
                                    "user": "BrighterColours",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw3ju9/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfw6o6h",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704148206.0,
                                    "comment_text": "But your phone in another room. I will leave mine in the bedroom and forget about but as soon as it’s near me, the itch to scroll hits.",
                                    "user": "seaotta",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw6o6h/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfxdswe",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704164926.0,
                                    "comment_text": "I kind of trained or tricked myself by using my phone until I got bored, then going to my phone kindle app, allowing myself to get diverted by notifications if it happened, but still coming back to the book — basically treating the book the way i treated Twitter, lol. It worked really well and after one year I got a kindle and read notification-free.",
                                    "user": "eyeball-owo",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxdswe/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfxmzxx",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704168904.0,
                                    "comment_text": "Putting the phone away is easy. Resisting the urge to check it all the time is the hard part. I often put my book down just to check messages, even thought Ive left my phone inside. But it's too late, my mind is already on a tangent. Imo, just slowly reduce phone usage. - I'll take social media breaks and delete Reddit for a week or month. Or others. - I turn silent notifications on, or just turn them off completely; if I want to spend time replying to people, I'll specifically open my emails or message apps. - Start just by turning the phone off. When you pull it out, you'll catch yourself so many times checking it. It was a little sobering doing this when I was in \"reading mode\" or watching a movie. Seeing how bad it is first helped me realise I needed to work on it. - then I moved onto not having my phone on me physically when I was doing **anything** else. This worked the best for me reducing those impulses to check my phone. Watching tv? Leave the phone in another room. Using your phone while watching a show or movie is just as silly as using it while reading imo. Cooking, exercising, meeting someone, etc etc etc, leave the phone somewhere else. Focus on *insert any task here* at anytime. Phone time is phone time. Reading is reading time. Tv is tv time. Phone doesn't need to be on us 24/7. Few tips, hopefully they help. They worked for me. They aren't easy. They take time.",
                                    "user": "dobbydobbyonthewall",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxmzxx/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfy4h6x",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704178260.0,
                                    "comment_text": "r/nosurf",
                                    "user": "wildclouds",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy4h6x/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfyh6ex",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704187787.0,
                                    "comment_text": "This was a huge struggle for me. I read about 40-50 books a year, but i started out with audiobooks to get myself back into reading. That way i could get through books while walking my dog, doing crafts and making dinner, chores became something i just do while listening to my books. The next step was finding out what i like, that way i get invested in the stories and WANT to continue. My husband then gifted me a kindle and that kinda forced me back into physical reading. The stories became more imporant than doomscrolling tiktok. Now i read almost every genre, i love having a ebook/physical copy and an audiobook so i can max out my reading. I read so much when i was younger, but life came in the way and i had to learn myself to love it again. Now my screentime much lower, i sleep better and i love all the stories i get to be a part of.",
                                    "user": "immafookuindaface",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyh6ex/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfyr0nw",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704195197.0,
                                    "comment_text": "I put my phone in another room while reading.",
                                    "user": "IllustriousPost382",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyr0nw/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfzgh1b",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704208466.0,
                                    "comment_text": "What has worked for me is: Use timers in doom scrolly apps those take away an awful amount of your time Keep the phone out of reach when reading especially at night Use the kindle app on my phone",
                                    "user": "nokturnalxitch",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzgh1b/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kgbta3q",
                                    "parent_comment_id": "kfu6n72",
                                    "time_stamp_created": 1704399590.0,
                                    "comment_text": "I put my phone in a whole other room on Do Not Disturb.",
                                    "user": "beesontheoffbeat",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kgbta3q/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfy8jkp",
                            "parent_comment_id": "kfu62r9",
                            "time_stamp_created": 1704181120.0,
                            "comment_text": "Same! Started cutting tv and got rid of most social media and I’ve read 40 books since August.",
                            "user": "mn9211",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy8jkp/",
                            "children": []
                        },
                        {
                            "comment_id": "kg1dchl",
                            "parent_comment_id": "kfu62r9",
                            "time_stamp_created": 1704232748.0,
                            "comment_text": "Would you say it improved your life?",
                            "user": "laurenskz",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg1dchl/",
                            "children": [
                                {
                                    "comment_id": "kg4m5cj",
                                    "parent_comment_id": "kg1dchl",
                                    "time_stamp_created": 1704291308.0,
                                    "comment_text": "The part about using my phone less, yes.",
                                    "user": "cat83883",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg4m5cj/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfu6rq0",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704121361.0,
                    "comment_text": "This is the way. Recently my retired parents binge watched an entire popular TV series in just under a week (one work week, to be precise). In the same time period I read 5 books but watched no TV.",
                    "user": "MPPreads",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu6rq0/",
                    "children": []
                },
                {
                    "comment_id": "kfubhy0",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704123491.0,
                    "comment_text": "But how can you read books while eating food 👀",
                    "user": "yahyamushtaq518",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfubhy0/",
                    "children": [
                        {
                            "comment_id": "kfubqcy",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704123591.0,
                            "comment_text": "Fries",
                            "user": "little_carmine_",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfubqcy/",
                            "children": [
                                {
                                    "comment_id": "kfuc691",
                                    "parent_comment_id": "kfubqcy",
                                    "time_stamp_created": 1704123780.0,
                                    "comment_text": "No I mean I watched/used Netflix when I'm eating proper meal (breakfast,lunch or dinner) but I can't replace Netflix time with books bcz I need both my hands in eating.How will I turn pages lol 🥲",
                                    "user": "yahyamushtaq518",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuc691/",
                                    "children": [
                                        {
                                            "comment_id": "kfuekxa",
                                            "parent_comment_id": "kfuc691",
                                            "time_stamp_created": 1704124789.0,
                                            "comment_text": "Audiobooks!",
                                            "user": "meredithst",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuekxa/",
                                            "children": [
                                                {
                                                    "comment_id": "kfuf6lk",
                                                    "parent_comment_id": "kfuekxa",
                                                    "time_stamp_created": 1704125040.0,
                                                    "comment_text": "Sucks",
                                                    "user": "yahyamushtaq518",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuf6lk/",
                                                    "children": []
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kful3ts",
                                            "parent_comment_id": "kfuc691",
                                            "time_stamp_created": 1704127373.0,
                                            "comment_text": "It’s really not that hard, especially with a Kindle with a stand. I have a hard time if I DON’T have something to read while I eat. I really don’t use both hands the entire time I’m eating so I’m perfectly free to use one hand to turn the page on the Kindle.",
                                            "user": "jillianjo",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kful3ts/",
                                            "children": [
                                                {
                                                    "comment_id": "kfv79yd",
                                                    "parent_comment_id": "kful3ts",
                                                    "time_stamp_created": 1704135523.0,
                                                    "comment_text": "Except that for some stupid reason, they put the on-off switch on the bottom of the Kindle so if you put it on an easel it shuts off! I had to build up the bottom with tape so I can read and eat - an essential for any book lover.",
                                                    "user": "Leontiev",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv79yd/",
                                                    "children": []
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfurf7g",
                                            "parent_comment_id": "kfuc691",
                                            "time_stamp_created": 1704129755.0,
                                            "comment_text": "You use both hands while eating? All the time?",
                                            "user": "KiwiTheKitty",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurf7g/",
                                            "children": [
                                                {
                                                    "comment_id": "kfuroeg",
                                                    "parent_comment_id": "kfurf7g",
                                                    "time_stamp_created": 1704129853.0,
                                                    "comment_text": "Yeah mostly......use one hand when eating something from fork or spoon like rice",
                                                    "user": "yahyamushtaq518",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuroeg/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfusoru",
                                                            "parent_comment_id": "kfuroeg",
                                                            "time_stamp_created": 1704130232.0,
                                                            "comment_text": "Huh. I would say I use both hands maybe 5% of the time when I'm eating. I just hold a book with my left hand.",
                                                            "user": "KiwiTheKitty",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfusoru/",
                                                            "children": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfvhijb",
                                            "parent_comment_id": "kfuc691",
                                            "time_stamp_created": 1704139184.0,
                                            "comment_text": "The sandwich was purportedly invented so that gamblers could eat meals without interrupting their card games. I eat with my dominant hand free to handle food and utensils and my other hand holding my Kindle, turning pages with my thumb. I don't even need to sit at a table to do this, I just balance the plate against my knees and my upper chest (or a cutting board can be used as a mini-table if you're not super flexible).",
                                            "user": "jellyrollo",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvhijb/",
                                            "children": [
                                                {
                                                    "comment_id": "kfwbuom",
                                                    "parent_comment_id": "kfvhijb",
                                                    "time_stamp_created": 1704150145.0,
                                                    "comment_text": "If I do that(all that balancing plates) basically playing with food I'll definitely get slapped by Mom 🥲",
                                                    "user": "yahyamushtaq518",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwbuom/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfwe5qy",
                                                            "parent_comment_id": "kfwbuom",
                                                            "time_stamp_created": 1704151035.0,
                                                            "comment_text": "That's the joy of growing up and becoming independent! I don't play with food (I eat meals quite neatly and efficiently), but even if I did, that would be my choice and no one could tell me otherwise. When I was a kid, my mom used to demand we eat at the table without any books (pure torture), but now that she's retired and living on her own, I notice she eats on the couch with a book in her hand, exactly the same way I do.",
                                                            "user": "jellyrollo",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwe5qy/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfweoux",
                                                                    "parent_comment_id": "kfwe5qy",
                                                                    "time_stamp_created": 1704151243.0,
                                                                    "comment_text": "😂😂😂😂😂😂 happy ending",
                                                                    "user": "yahyamushtaq518",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfweoux/",
                                                                    "children": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfucoso",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704124004.0,
                            "comment_text": "Not a problem on audio or Kindle",
                            "user": "kellyhitchcock",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfucoso/",
                            "children": [
                                {
                                    "comment_id": "kfvgnor",
                                    "parent_comment_id": "kfucoso",
                                    "time_stamp_created": 1704138877.0,
                                    "comment_text": "Audio on kindle (and hoopla) are my go to. I've trained myself to listen to most books on double speed a d can generally finish a book a day. Sometimes two if they're relatively short (they usually are not though lol)",
                                    "user": "sparksgirl1223",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvgnor/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfuetzk",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704124893.0,
                            "comment_text": "Genuinely, when I’m eating by myself I have a book open on the table and read while eating. Occasionally I use something the prop the pages open, the book doesn’t have to be in my hands the whole time.",
                            "user": "MaceT2908",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuetzk/",
                            "children": [
                                {
                                    "comment_id": "kfufcv0",
                                    "parent_comment_id": "kfuetzk",
                                    "time_stamp_created": 1704125110.0,
                                    "comment_text": "That's actually a good idea Most books gets closed but we can use something (such as paperweights or glass) to keep it open",
                                    "user": "yahyamushtaq518",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfufcv0/",
                                    "children": [
                                        {
                                            "comment_id": "kfuhlh6",
                                            "parent_comment_id": "kfufcv0",
                                            "time_stamp_created": 1704126013.0,
                                            "comment_text": "When I was in college, my boyfriend’s mother gave both of us bookweights and I still have mine. They are amazing.",
                                            "user": "ntrrrmilf",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuhlh6/",
                                            "children": [
                                                {
                                                    "comment_id": "kfuhp64",
                                                    "parent_comment_id": "kfuhlh6",
                                                    "time_stamp_created": 1704126054.0,
                                                    "comment_text": "You probably also have bookmarks too, right 🔖",
                                                    "user": "yahyamushtaq518",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuhp64/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfuhyok",
                                                            "parent_comment_id": "kfuhp64",
                                                            "time_stamp_created": 1704126158.0,
                                                            "comment_text": "Ha, my daughter gave me one recently and I have no idea where it went. I’m very much a receipt/scrap of paper marker.",
                                                            "user": "ntrrrmilf",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuhyok/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfui3cm",
                                                                    "parent_comment_id": "kfuhyok",
                                                                    "time_stamp_created": 1704126212.0,
                                                                    "comment_text": "I recently bought two(those were really difficult to find here) I wish there was a way I could show you",
                                                                    "user": "yahyamushtaq518",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfui3cm/",
                                                                    "children": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "comment_id": "kfv96ry",
                                                    "parent_comment_id": "kfuhlh6",
                                                    "time_stamp_created": 1704136208.0,
                                                    "comment_text": "maybe it's what you're talking about, but i used to use a thing that was kind of like a combo bookmark/very thin dumbbell type of deal.",
                                                    "user": "well_uh_yeah",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv96ry/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfvdq7h",
                                                            "parent_comment_id": "kfv96ry",
                                                            "time_stamp_created": 1704137828.0,
                                                            "comment_text": "If you google the term you’ll see the one I have. It is leather and soft on the side that touches the page and kinda looks like it could be used as a weapon in a pinch.",
                                                            "user": "ntrrrmilf",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvdq7h/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfvg8ag",
                                                                    "parent_comment_id": "kfvdq7h",
                                                                    "time_stamp_created": 1704138725.0,
                                                                    "comment_text": "yeah, that's what i was trying to describe as well!",
                                                                    "user": "well_uh_yeah",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvg8ag/",
                                                                    "children": [
                                                                        {
                                                                            "comment_id": "kfvjimt",
                                                                            "parent_comment_id": "kfvg8ag",
                                                                            "time_stamp_created": 1704139903.0,
                                                                            "comment_text": "They’re so great!!",
                                                                            "user": "ntrrrmilf",
                                                                            "corresponding_post_id": "18vx8ip",
                                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvjimt/",
                                                                            "children": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfv3cvb",
                                    "parent_comment_id": "kfuetzk",
                                    "time_stamp_created": 1704134119.0,
                                    "comment_text": "I have a stand made specifically to hold my book open on the table while I eat!",
                                    "user": "nopantstime",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3cvb/",
                                    "children": [
                                        {
                                            "comment_id": "kfxx1jz",
                                            "parent_comment_id": "kfv3cvb",
                                            "time_stamp_created": 1704173879.0,
                                            "comment_text": "Jealous",
                                            "user": "MaceT2908",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxx1jz/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfw5fil",
                                    "parent_comment_id": "kfuetzk",
                                    "time_stamp_created": 1704147751.0,
                                    "comment_text": "My sister and I use to sit on opposite ends of the couch growing up with food balanced on the arm of the couch and a book in our hands. I believe this is where our multitasking abilities stemmed from. After we were done eating we would slide down and lay on the couch feet facing each other. It’s such a childhood memory for us.",
                                    "user": "TheStarKiller",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw5fil/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfuulll",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704130934.0,
                            "comment_text": "I read on my kindle during every meal",
                            "user": "PlantsNWine",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuulll/",
                            "children": []
                        },
                        {
                            "comment_id": "kfuxjeg",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704132004.0,
                            "comment_text": "My lunch hour is one of the few times of the day when I can read with no interruptions. I bring my Kindle with me and it has a cover that lets me prop it up on the table so I can read while I eat. I just need one clean finger to tap the touch screen every so often to turn the page.",
                            "user": "EvieDelacourt",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuxjeg/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvgt9f",
                            "parent_comment_id": "kfubhy0",
                            "time_stamp_created": 1704138932.0,
                            "comment_text": "But how can you eat food without reading books? The only meals I ever consume without a book in hand are when I'm eating out with company.",
                            "user": "jellyrollo",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvgt9f/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfuc9xp",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704123827.0,
                    "comment_text": "Exactly. Compared to people I know with \"no time to read\" I just spend less time on social media and watch little TV / streaming services. All the other things like work, hobbies and social life are pretty much the same.",
                    "user": "InvisibleSpaceVamp",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuc9xp/",
                    "children": []
                },
                {
                    "comment_id": "kfui9d6",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704126276.0,
                    "comment_text": "There are times when I’m so mentally tired from work that reading feels like a complete chore and TV is easier to escape with (uses less brain power, depending on the show I usually dont have to focus 100%). Maybe it’s just me but even if I have a book I am interested in, if my mental isn’t there, I will not read effectively!",
                    "user": "ebolalol",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfui9d6/",
                    "children": [
                        {
                            "comment_id": "kfuj6ej",
                            "parent_comment_id": "kfui9d6",
                            "time_stamp_created": 1704126633.0,
                            "comment_text": "Sure I get that, but that’s a different problem (he was asking where to find the time). It was really just an example. A lot of people play video games, watch TV and scroll a hell of a lot social media and ask how do people find the time to read, and the answer is so sacrifice something. And if night time Netflix is for relaxing, maybe it’s better to switch lunch break reddit scrolling when you’re mind is more alert. I find it relaxing every time I have managed to switch something like that for a bit of reading.",
                            "user": "little_carmine_",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuj6ej/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfuvrnb",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704131362.0,
                    "comment_text": "Or on social media? I guarantee many people spend 15-20 hours a week doom scrolling.",
                    "user": "billymumfreydownfall",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuvrnb/",
                    "children": [
                        {
                            "comment_id": "kfvxn79",
                            "parent_comment_id": "kfuvrnb",
                            "time_stamp_created": 1704144900.0,
                            "comment_text": "I don't even understand how people can spend so much time on social media (aside from reddit) it's not even social anymore just trying to sell you shit. I reactivated Facebook after 7 years because a lot of the stuff I do is organized via Facebook events. It's all just \"suggested\" things instead of things my friends post. I actually counted once and there were 15 \"promoted\" or \"suggested\" things between anything that my friends either posted or shared. It's like the opposite of reddit. Ad then 15 actual posts then an ad. Facebook was post then 15 ads then post.",
                            "user": "0b0011",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvxn79/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfv7byq",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704135544.0,
                    "comment_text": "I mean, to me that seems even less realistic, so yea I do ask that when people tell me about binging TV",
                    "user": "icyDinosaur",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv7byq/",
                    "children": []
                },
                {
                    "comment_id": "kfv8y74",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704136122.0,
                    "comment_text": "I don't really prioritize watching any shows, but I do like to have a general idea what's going on so I can at least nod along to conversations at work so I put the shows on as background noise while I read. It always bumps a book up a notch for me when I get so into it that I miss everything that happened in the show.",
                    "user": "well_uh_yeah",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv8y74/",
                    "children": []
                },
                {
                    "comment_id": "kfvfg6h",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704138446.0,
                    "comment_text": "Yeah if people cut their screen time in half they could read way more. I scroll on my phone for an hour before bed, if I stopped doing that I could read more of the book I just put down lol",
                    "user": "tinasnow-poty",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvfg6h/",
                    "children": []
                },
                {
                    "comment_id": "kfwc4bf",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704150246.0,
                    "comment_text": "Yes, this exactly. I only watch things that I REALLY want to watch. I read 78 books this year. I generally spend an hour or two a day reading.",
                    "user": "nfgchick79",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwc4bf/",
                    "children": []
                },
                {
                    "comment_id": "kfwzyul",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704159462.0,
                    "comment_text": "On top of that, read instead of being on a phone. Boom, 104 books.",
                    "user": "SerratedBrooms",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwzyul/",
                    "children": [
                        {
                            "comment_id": "kfydi6u",
                            "parent_comment_id": "kfwzyul",
                            "time_stamp_created": 1704184875.0,
                            "comment_text": "Me too! Stopped watching tv/movies, gaming and doom scrolling, 100 books flat in 2023. I’m also a teacher so have lots of holidays where I usually read a book every 1-2 days which helps and is a luxury lots of people don’t have!!",
                            "user": "mediocre_mediajoker",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfydi6u/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfxe9kv",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704165115.0,
                    "comment_text": "I don’t watch TV much because I get bored due to poor attention span in regard to movies and shit, but don’t have that issue with books, so for me I can easily read over a hundred books per year because for me, books replace things like TV, music, and other forms of entertainment. I really think it’s about how you prioritise your existing free time more than anything.",
                    "user": "JadeM785",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxe9kv/",
                    "children": []
                },
                {
                    "comment_id": "kfyh3l0",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704187723.0,
                    "comment_text": "This was a huge struggle for me. I read about 40-50 books a year, but i started out with audiobooks to get myself back into reading. That way i could get through books while walking my dog, doing crafts and making dinner, chores became something i just do while listening to my books. The next step was finding out what i like, that way i get invested in the stories and WANT to continue. My husband then gifted me a kindle and that kinda forced me back into physical reading. The stories became more imporant than doomscrolling tiktok. Now i read almost every genre, i love having a ebook/physical copy and an audiobook so i can max out my reading. I read so much when i was younger, but life came in the way and i had to learn myself to love it again. Now my screentime much lower, i sleep better and i love all the stories i get to be a part of.",
                    "user": "immafookuindaface",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyh3l0/",
                    "children": []
                },
                {
                    "comment_id": "kfz7518",
                    "parent_comment_id": "kfu0oc8",
                    "time_stamp_created": 1704204377.0,
                    "comment_text": "100% I cancelled netflix, prime, Disney plus. Miraculously I now have time to read.",
                    "user": "Hunter037",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfz7518/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu0t3s",
            "parent_comment_id": null,
            "time_stamp_created": 1704118344.0,
            "comment_text": "You might have the same trouble that I have. My visual processing is very slow and clunky. It might be because of lifelong vision problems, or due to some neurodivergence. Either way, it would also have taken me 20 hours to read a simple 300 page book. I now have to have text-to-speech helping me by letting me process with my ears rather than my eyes so that I have a fighting chance against people who don't have my difficulty. So I look at the words and have the audio text to speech help me when my visual processing fails me. With that, I've been able to read SO much faster. It's night and day. Some people just aren't good at reading with their eyes alone and need help and there's nothing wrong with that. Reading alongside an audiobook is also helpful, or just doing the audiobook alone of course.",
            "user": "Yarn_Mouse",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu0t3s/",
            "children": [
                {
                    "comment_id": "kfub4af",
                    "parent_comment_id": "kfu0t3s",
                    "time_stamp_created": 1704123328.0,
                    "comment_text": "What tool do you use? How does it work? How exactly do you combine text and speech? Sorry, can't imagine the exact steps. Thanks for explaining.",
                    "user": "jd143x",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfub4af/",
                    "children": [
                        {
                            "comment_id": "kfug00m",
                            "parent_comment_id": "kfub4af",
                            "time_stamp_created": 1704125368.0,
                            "comment_text": "Just an example, I would get a DRM free book like a public domain book from then have the book on my phone to use with a text to speech reading app. Currently I use Speech Central on iOS b/c unlike the other apps this one doesn't require a subscription for the paid version. You can also use LibriVox for real people reading the public domain work to you instead of the text to speech, or borrow the audiobook from the library on Libby. I've also borrowed audiobook versions of newer books I own so I can listen and read together. And other times just the audiobook by itself of course, I tend to do that when knitting a very simple pattern so my attention is all on the book.",
                            "user": "Yarn_Mouse",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfug00m/",
                            "children": [
                                {
                                    "comment_id": "kg64pdm",
                                    "parent_comment_id": "kfug00m",
                                    "time_stamp_created": 1704311076.0,
                                    "comment_text": "Thanks for explaining. I think I want to try it out.",
                                    "user": "jd143x",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg64pdm/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfu3x5c",
            "parent_comment_id": null,
            "time_stamp_created": 1704119979.0,
            "comment_text": "50 pages a day will get you through a 350 pager in a week, and if you start committing to 50 pages a day, you will quickly fall into the story and end up reading 60-100 pages.",
            "user": "Pugilist12",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu3x5c/",
            "children": [
                {
                    "comment_id": "kfuev5w",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704124908.0,
                    "comment_text": "This is exactly what I do. For years I read between 6-20 books/year. At the end of 2021 I set a quiet resolution for 2022 to read 50 pages a day for pleasure, knowing if I set myself a daily time goal, like 1-2 hrs.. well, my mind wanders or it gets late, or.. insert any distraction. Just as pugilist points out, I knew that if I read 50/day regularly, the likelier the chances of getting wholly absorbed in something and experiencing that “vanishing of self” — such a relief! — and then there’d be days where I’d read 100-, 200-, 300- pages. Ok, here we are day 1 of 2024. In 2022 I read 122 books, 32,384 pages, 88.7 pages/day. In 2023 I read 136 books, 35,195 pages, 96.4 pages/day. There are days I haven’t hit my 50, but not many. It doesn’t have to be 50. I think picking a goal that feels achievable is the best approach. Even at 20 pages/day you will gain momentum. May 2024 bring you many happy returns!",
                    "user": "Key-Sundae-3450",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuev5w/",
                    "children": [
                        {
                            "comment_id": "kfv9ww6",
                            "parent_comment_id": "kfuev5w",
                            "time_stamp_created": 1704136466.0,
                            "comment_text": "How long does it take you to read 50 pages?",
                            "user": "monkeymind8",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv9ww6/",
                            "children": [
                                {
                                    "comment_id": "kfvusnf",
                                    "parent_comment_id": "kfv9ww6",
                                    "time_stamp_created": 1704143866.0,
                                    "comment_text": "Not OP but I do about 10pg every 15min on a slow, careful read. If I read more than an hour, given all my other chores as a dad and IT worker, I found myself putting audiobooks on during those times to give myself more opportunities to read. Some people like to tell me listening to a book isn't as good as reading one, yet here I am and will listen to a book before reading it, if the narrator is good. I have more favorite narrators than I do authors now.",
                                    "user": "machstem",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvusnf/",
                                    "children": [
                                        {
                                            "comment_id": "kfw3ao5",
                                            "parent_comment_id": "kfvusnf",
                                            "time_stamp_created": 1704146973.0,
                                            "comment_text": "I haven’t lately but I often listen to audiobooks when I cannot use the time to read (driving, walking the dog etc).",
                                            "user": "monkeymind8",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw3ao5/",
                                            "children": [
                                                {
                                                    "comment_id": "kfwhrys",
                                                    "parent_comment_id": "kfw3ao5",
                                                    "time_stamp_created": 1704152439.0,
                                                    "comment_text": "I started to focus on narratoes and found myself reading a variety of books I wouldn't have considered or in some cases I would finish entire series I'd otherwise feel overwhelmed trying to finish It took me 9 years to finish Dark Tower on book, but Wheel of Time in less than 2 by audiobook instead. Wild how much content one can absorb with their free time if they can work it in",
                                                    "user": "machstem",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwhrys/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfyvgk0",
                                                            "parent_comment_id": "kfwhrys",
                                                            "time_stamp_created": 1704198125.0,
                                                            "comment_text": "Honestly you gave me an idea. I really wanted to read the Witcher for a long time but the English edition without the hardcover (60 euros) is poorly made (also has that \"Now on Netflix \" sticker that's printed on it) and the one with hardcover is too expensive. But with the audiobook I can listen to it without worrying about the price and quality",
                                                            "user": "emirobinatoru",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyvgk0/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfzena1",
                                                                    "parent_comment_id": "kfyvgk0",
                                                                    "time_stamp_created": 1704207708.0,
                                                                    "comment_text": "I found it for a good deal last year on AbeBooks fwiw",
                                                                    "user": "machstem",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzena1/",
                                                                    "children": []
                                                                },
                                                                {
                                                                    "comment_id": "kg38ztn",
                                                                    "parent_comment_id": "kfyvgk0",
                                                                    "time_stamp_created": 1704260141.0,
                                                                    "comment_text": "The Witcher audio books are well done!",
                                                                    "user": "Idgie76",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg38ztn/",
                                                                    "children": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfwwuds",
                                            "parent_comment_id": "kfvusnf",
                                            "time_stamp_created": 1704158258.0,
                                            "comment_text": "I have some narrators that I will listen to anything they read!",
                                            "user": "spooper_no_spooping",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwwuds/",
                                            "children": [
                                                {
                                                    "comment_id": "kfzfqt7",
                                                    "parent_comment_id": "kfwwuds",
                                                    "time_stamp_created": 1704208167.0,
                                                    "comment_text": "- Michael Kramer and Kate Reading - Frank Muller (RIP) - Jefferson Mays Who do you recommend? 😀",
                                                    "user": "machstem",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzfqt7/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfzglfq",
                                                            "parent_comment_id": "kfzfqt7",
                                                            "time_stamp_created": 1704208518.0,
                                                            "comment_text": "Probably a different genre than you like but it's Lauren Fortgang and Rebecca Soler. They're just so good at voices",
                                                            "user": "spooper_no_spooping",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzglfq/",
                                                            "children": [
                                                                {
                                                                    "comment_id": "kfzk126",
                                                                    "parent_comment_id": "kfzglfq",
                                                                    "time_stamp_created": 1704209890.0,
                                                                    "comment_text": "Looking over Lauren's goodreads and I like the classics so I'll give her a try!",
                                                                    "user": "machstem",
                                                                    "corresponding_post_id": "18vx8ip",
                                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzk126/",
                                                                    "children": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfy0oew",
                                            "parent_comment_id": "kfvusnf",
                                            "time_stamp_created": 1704175846.0,
                                            "comment_text": "Woah. 10 p on 15???Slow? How",
                                            "user": "KingNeuron",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy0oew/",
                                            "children": [
                                                {
                                                    "comment_id": "kfyvn24",
                                                    "parent_comment_id": "kfy0oew",
                                                    "time_stamp_created": 1704198237.0,
                                                    "comment_text": "While reading Crime and Punishment my reading speed is 25% slower than his",
                                                    "user": "emirobinatoru",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyvn24/",
                                                    "children": []
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kg46mgc",
                                            "parent_comment_id": "kfvusnf",
                                            "time_stamp_created": 1704283412.0,
                                            "comment_text": "Well for audio books, it depends on the category of book. I know for educational books that I’ve tried to listen to I would miss key points the second distraction takes me, then I find my self rewinding constantly. Which would happen to a fictional book as well.",
                                            "user": "GoneFresh",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg46mgc/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfwt19n",
                                    "parent_comment_id": "kfv9ww6",
                                    "time_stamp_created": 1704156797.0,
                                    "comment_text": "Use a pen or pencil to trace under the line as you read it helps keeping focused on reading.",
                                    "user": "Swimming_Argument507",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwt19n/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfx4xwq",
                                    "parent_comment_id": "kfv9ww6",
                                    "time_stamp_created": 1704161372.0,
                                    "comment_text": "Everybody is different, and every book is different. I like to time my reading. Time how lo g it takes to read one page, and then 10, so I can get an average. It helps me know how much time it'll take for me to finish each individual book",
                                    "user": "Maxtrix07",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfx4xwq/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfzrqww",
                                    "parent_comment_id": "kfv9ww6",
                                    "time_stamp_created": 1704212817.0,
                                    "comment_text": "Depends what I’m reading and part of the reason I focus on pages and not time. I’m about a minute/page uninterrupted for most things but it’s rare that I’ll read totally uninterrupted for more than 20 mins. Some books are more demanding than others and it’s 3 mins/page but maybe those will be 20 pages/day and I’ll be reading something lighter alongside.",
                                    "user": "Key-Sundae-3450",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzrqww/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfy0p0d",
                            "parent_comment_id": "kfuev5w",
                            "time_stamp_created": 1704175857.0,
                            "comment_text": "Fiction or non?",
                            "user": "KingNeuron",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy0p0d/",
                            "children": []
                        },
                        {
                            "comment_id": "kfy6b0w",
                            "parent_comment_id": "kfuev5w",
                            "time_stamp_created": 1704179513.0,
                            "comment_text": "What's so good about May 2024?",
                            "user": "Icy-Needleworker-6",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy6b0w/",
                            "children": [
                                {
                                    "comment_id": "kfyovoz",
                                    "parent_comment_id": "kfy6b0w",
                                    "time_stamp_created": 1704193677.0,
                                    "comment_text": "Banger",
                                    "user": "OnlyQualityCon",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyovoz/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfyeq8g",
                            "parent_comment_id": "kfuev5w",
                            "time_stamp_created": 1704185846.0,
                            "comment_text": "This is really cool! Do you read actual paper books? I feel like a lot of people now claim they read so many books, but they’re just listening on audible. I like to read paper books and I’m a “slower” reader compared to the audible listeners- and people brag about how much they get done with audible books. Would you mind sharing some of your favorite books that you would recommend?",
                            "user": "saprobic_saturn",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyeq8g/",
                            "children": [
                                {
                                    "comment_id": "kfzprs6",
                                    "parent_comment_id": "kfyeq8g",
                                    "time_stamp_created": 1704212085.0,
                                    "comment_text": "I don’t listen to many audiobooks, and when I do it’s exclusively nonfiction. Last year I did four audiobooks. They actually take me longer to get through bc I only listen to them when I’m driving. I’m a words-on-the-page kind of guy but any way a person can connect with a story is fine by me. If I’m listening to an audiobook I never consider that part of my daily reading goal. That’s just me and again, whatever works for anyone is Ok in my book Ok here’s a shot in the dark recommendation without knowing what you like, but Betty by Tiffany McDaniel checks a lot of boxes in terms of my tastes: elegant, efficient writing, vibrant, flawed characters, inventive, propulsive episodic storyline. A beautiful, beautiful book that ripped my insides out. I feel good about recommending that book to anyone.",
                                    "user": "Key-Sundae-3450",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzprs6/",
                                    "children": [
                                        {
                                            "comment_id": "kfzqcyc",
                                            "parent_comment_id": "kfzprs6",
                                            "time_stamp_created": 1704212305.0,
                                            "comment_text": "Thank you very much, I’ll have to check it out! Appreciate your response and recommendation.",
                                            "user": "saprobic_saturn",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzqcyc/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfuigzy",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704126361.0,
                    "comment_text": "I mean it also depends on your reading speed. Even with a literature degree and an English teacher, I still have incredibly slow reading. It probably takes me about 10-20 mins to read around 10 pages.",
                    "user": "LemonCurdJ",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuigzy/",
                    "children": [
                        {
                            "comment_id": "kfuk2dx",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704126975.0,
                            "comment_text": "This is me as well, but in school, my comprehension was very high, so I never had to read anything twice.",
                            "user": "dragonflyelh",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuk2dx/",
                            "children": []
                        },
                        {
                            "comment_id": "kfukeiq",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704127105.0,
                            "comment_text": "So 50 pages should only be around an hour. Definitely doable for most people.",
                            "user": "Active2017",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfukeiq/",
                            "children": [
                                {
                                    "comment_id": "kfwr0jn",
                                    "parent_comment_id": "kfukeiq",
                                    "time_stamp_created": 1704156032.0,
                                    "comment_text": "Well, some people read slower or faster, but that's a good estimate to start with.",
                                    "user": "rabidstoat",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwr0jn/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfukilq",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704127149.0,
                            "comment_text": "10 pages per 10 minutes is about average, and lets you read ~50 pages in an hour! I don’t think that’s incredible slow at all; it’s about as fast as I read and I got through over 60 books this year!",
                            "user": "Sabrielle24",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfukilq/",
                            "children": [
                                {
                                    "comment_id": "kfv34iw",
                                    "parent_comment_id": "kfukilq",
                                    "time_stamp_created": 1704134036.0,
                                    "comment_text": "That is blistering speed for my standards!",
                                    "user": "theonewhoknock_s",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv34iw/",
                                    "children": [
                                        {
                                            "comment_id": "kfyvvkx",
                                            "parent_comment_id": "kfv34iw",
                                            "time_stamp_created": 1704198381.0,
                                            "comment_text": "Relatable",
                                            "user": "emirobinatoru",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyvvkx/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfulchf",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704127465.0,
                            "comment_text": "Yeah, unfortunately, reading does not seem to be a skill where you get faster with practice. Been reading every day for over 5 years, and I'm still stuck at 175-200 wpm, depending on the contents of the book. Looking at my goodreads stats, 4/5 years are at \\~26k pages and 29k in 2020 (not related to lockdowns as my life was no different because of covid).",
                            "user": "rmpumper",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfulchf/",
                            "children": [
                                {
                                    "comment_id": "kfv3kim",
                                    "parent_comment_id": "kfulchf",
                                    "time_stamp_created": 1704134197.0,
                                    "comment_text": "Unrelated but it’s interesting to find another person who had increased reading habits in 2020 despite being unaffected by lockdowns. Why do you think that is for you?",
                                    "user": "paleoterrra",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3kim/",
                                    "children": [
                                        {
                                            "comment_id": "kfvbb1r",
                                            "parent_comment_id": "kfv3kim",
                                            "time_stamp_created": 1704136961.0,
                                            "comment_text": "Must be a coincidence of just reading engaging lighter fantasy series with some fun sci-fi that year, which allowed for a faster reading speed than is usual for me. Looking at my list, it was mainly Robin Hobb, Michael J. Sullivan, Martha Wells, Sanderson and others. Biggest book that year was The Count of Monte Cristo, which turned out more interesting that I expected and as a result did not take too long to finish.",
                                            "user": "rmpumper",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvbb1r/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfxdgzf",
                                    "parent_comment_id": "kfulchf",
                                    "time_stamp_created": 1704164796.0,
                                    "comment_text": "I definitely think reading more makes you faster at reading… the things that slow me down are new words, complex / unintuitive sentence structure, and new ideas. As my vocabulary widens and I become familiar with more structures or new ideas, those things become easier to process and I read them faster. I’m not trying to say anything about you, except maybe that you are making progress you’re not recognizing :)",
                                    "user": "eyeball-owo",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxdgzf/",
                                    "children": [
                                        {
                                            "comment_id": "kfyn0kz",
                                            "parent_comment_id": "kfxdgzf",
                                            "time_stamp_created": 1704192315.0,
                                            "comment_text": "That might be the case, but like with everything else, there is a personal limit. For some that limit turns out to be the same as the starting point for others.",
                                            "user": "rmpumper",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyn0kz/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfyokg8",
                                    "parent_comment_id": "kfulchf",
                                    "time_stamp_created": 1704193451.0,
                                    "comment_text": "Hm. I definitely notice a massive difference between my reading speed after barely touching a book for weeks, and my reading speed when I've been reading regularly for a few weeks. But the thing is, the effect isn't primarily due to practice. It's almost correlative. I only manage to read consistently for several weeks, if I am reading attentively. If I'm not, my mind is not in the game, and I will start slacking on tasks, getting distracted more, and quit reading, let alone reading several times a week. So I think what really makes me read faster is attentiveness. Mindfulness exercises, sports, having my tasks, chores, and hobbies in order. Those things give me the clarity of mind to read more quickly, because I'm less distracted, and more mentally present, allowing me to read individual pages faster and take fewer breaks - and they also happen to make me more likely to read more regularly.",
                                    "user": "Laetitian",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyokg8/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfulos6",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704127596.0,
                            "comment_text": "What you're reading also makes a huge difference - some books are just more demanding. I can easily read through a 500 page romance novel in a day, but 350 page literary fiction may take me 2 or 3 days.",
                            "user": "OnlyGrayCellLeft",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfulos6/",
                            "children": [
                                {
                                    "comment_id": "kfuyo04",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704132418.0,
                                    "comment_text": "Yes! When I want to keep my momentum up, I purposefully choose easier books and rereads in between the more challenging reads. You get better at handling more difficult reads over time, of course, but not every reading project has to be as difficult as The Brothers Karamazov or Middlemarch. It helps me appreciate the more challenging reads more, because I am fully rested when I go in to them.",
                                    "user": "Specialist-One1730",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuyo04/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvt4pe",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704143280.0,
                                    "comment_text": "There's a reason for some of those book in a year clubs (like Middlemarch in a year). I can read through Eragon in a day, but right now I'm on In Search of Lost Time, and it'll be months to get through at my current pace, even though it's \"only\" 6x as many pages.",
                                    "user": "megamilf_muffmuncher",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvt4pe/",
                                    "children": [
                                        {
                                            "comment_id": "kfwgdqr",
                                            "parent_comment_id": "kfvt4pe",
                                            "time_stamp_created": 1704151897.0,
                                            "comment_text": "I read ISOLT years ago! It took me about a year, bit I was interspersing other shorter books as well, because it was just so long and such a demanding (in a good way) book.",
                                            "user": "Thaliamims",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwgdqr/",
                                            "children": [
                                                {
                                                    "comment_id": "kfwhkg6",
                                                    "parent_comment_id": "kfwgdqr",
                                                    "time_stamp_created": 1704152356.0,
                                                    "comment_text": "Oh I absolutely love it, but I’ll definitely do a short book between each volume. The way it’s written requires a good deal of focus (for me, at least) trying to keep track of the different clauses in each sentence. I counted 23 commas in a single sentence yesterday, and it wasn’t even listing anything.",
                                                    "user": "megamilf_muffmuncher",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwhkg6/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kfwhti4",
                                                            "parent_comment_id": "kfwhkg6",
                                                            "time_stamp_created": 1704152456.0,
                                                            "comment_text": "Yes! Not to mention the mammoth cast of characters. I really really lovedn it, though. I'd like to go back and do it again.",
                                                            "user": "Thaliamims",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwhti4/",
                                                            "children": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "comment_id": "kfyoxrn",
                                            "parent_comment_id": "kfvt4pe",
                                            "time_stamp_created": 1704193720.0,
                                            "comment_text": "Pack it up, I found the Lost Time you’re In Search Of.",
                                            "user": "OnlyQualityCon",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyoxrn/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfvwx38",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704144634.0,
                                    "comment_text": "Some aren't even that demanding but just packed with words on a page. My copy of thus spake Zarathustra has around 3-4 times as many words per page as my wife's copy of shadow and bone. If you're counting pages instead of words read one will take a lot longer.",
                                    "user": "0b0011",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvwx38/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfw83xy",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704148745.0,
                                    "comment_text": "THIS! I read all 6 twilight books in 2 days, Sapeins took me 5 weeks, if I find myself in a funk I will choose a nice easy book, and go back to the harder ones.",
                                    "user": "becky_1872",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw83xy/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfwpa91",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704155361.0,
                                    "comment_text": "I can't like this enough. I read a ton of non-fiction and it will often take me 50% longer to read a non-fiction book of the same length as a fiction book because I'm reading it for comprehension versus entertainment.",
                                    "user": "nakenyon",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwpa91/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfynek9",
                                    "parent_comment_id": "kfulos6",
                                    "time_stamp_created": 1704192602.0,
                                    "comment_text": "It also depends if the book is good or not lol.",
                                    "user": "Spacejunk20",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfynek9/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfur2ae",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704129622.0,
                            "comment_text": "Lol you think that’s slow. I’m pretty sure I read like 20-30 pages an hour.",
                            "user": "Passname357",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfur2ae/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvdft1",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704137724.0,
                            "comment_text": "Its not a unique revaluation, especially on this site, but I was astounded when I first heard that not everyone literally reads each word aloud in their head. They just sorta skim through it, taking in the information the next jump was realising that's probably why i need good prose, and a cool or interesting idea doesn't get me through to the end of a book that tells it in a boring way.",
                            "user": "DickDastardly404",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvdft1/",
                            "children": [
                                {
                                    "comment_id": "kfxf2zm",
                                    "parent_comment_id": "kfvdft1",
                                    "time_stamp_created": 1704165447.0,
                                    "comment_text": "This is how I read. I've learned that my brain actually \"reads\" only a handful of words in any given sentence, or even paragraph, and because I'm linguistically inclined, and have been an avid reader my entire life (along with the fact that I like certain similar things/tropes) my brain just kind of fills in what \"should\" go in between the few words I actually read. 95% of the time this works, and because of it I read blisteringly fast. That said, if I'm reading something I'm not used to, or doesn't move as expected, I'll frequently find myself spacing out, and having to go back 3-5 times to reread because I've ready 3 out of 20 words and... Things just don't add up, so I must've missed something...? Also I tend To have shorthand for things. Names in particular, so if I'm reading something with lots of similarly named or the names look enough alike, I get confused easily because why the fuck is the author talking about Shiro's period when Shiro was a man three sentences ago? Oh wait, there is a Shiro and a Shiva. Well. That's just... Stupid.",
                                    "user": "KhaiPanda",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxf2zm/",
                                    "children": [
                                        {
                                            "comment_id": "kfxyain",
                                            "parent_comment_id": "kfxf2zm",
                                            "time_stamp_created": 1704174528.0,
                                            "comment_text": "Huh. I actively try to *avoid* skimming with my reading lately, I think as part of an attempt to feel like I'm more fully taking in what the book is trying to paint for me. Up until this thread though, I don't think I'd consciously considered my 'skim to take scenes in quickly' mode to be a valid way to take in a book- just something that happened if I wasn't actively remembering to take in each word.",
                                            "user": "RandoStonian",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxyain/",
                                            "children": []
                                        },
                                        {
                                            "comment_id": "kfyo050",
                                            "parent_comment_id": "kfxf2zm",
                                            "time_stamp_created": 1704193042.0,
                                            "comment_text": "that's interesting yeah my mum reads like that, will blitz a whole ass book in one session. For me it takes a week and a few sessions. I think I've gotten through a whole book in 1 go less than 5 times ever in my life, and even then it was because I was just reading it for like 8hrs straight lol",
                                            "user": "DickDastardly404",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyo050/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfvv0bi",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704143941.0,
                            "comment_text": "That's me, about 15mins on a fast read. Glad I'm not alone in my late 40s",
                            "user": "machstem",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvv0bi/",
                            "children": [
                                {
                                    "comment_id": "kfvvk9s",
                                    "parent_comment_id": "kfvv0bi",
                                    "time_stamp_created": 1704144141.0,
                                    "comment_text": "I’m in my late 20s so don’t you worry! Slow readers for the win!!",
                                    "user": "LemonCurdJ",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvvk9s/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfwrl8e",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704156253.0,
                            "comment_text": "I've always known I'm a slow reader, but if 1-2minutes per page is considered slow I must be glacial. I probably read 10-15 pages an hour. Going about the same speed I talk, it's very tiring saying the words fast inside my head when I try to read faster. And I have to imagine what I'm reading, mimicking facial expressions, thinking about how I would react in the situation etc. Is that not normal behaviour when reading?",
                            "user": "Kittelsen",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwrl8e/",
                            "children": [
                                {
                                    "comment_id": "kfwvdiv",
                                    "parent_comment_id": "kfwrl8e",
                                    "time_stamp_created": 1704157688.0,
                                    "comment_text": "Yeah I read about the same pace as you. It just feels most natural and the best pace for comprehension, but it’s frustrating not being as fast as these other readers. I don’t usually think about how I would react in the situation when reading but I do make an effort to visualize what is happening",
                                    "user": "mayakovskyiv",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwvdiv/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfxgx7n",
                                    "parent_comment_id": "kfwrl8e",
                                    "time_stamp_created": 1704166222.0,
                                    "comment_text": "This is interesting. I have absolutely 0 of the traits that you have. I definitely don't read things \"out loud\" in my head, and also have that thing where I don't necessarily \"see\" things in my mind. So like, when I read a book, I don't do a lot of \"envisioning\" what/who/where things are happening. It doesn't trip me up very often. I don't do a lot of \"imagining/visualizing\" what has happened, nor do I mimic or even see facial expressions. \"Sarah looked at Adam with irritation\" Cool. Adam did something to piss Sarah off. I don't visualize the furrows in Sarah's eyebrows, or the fact that she looked at him and crossed her arms across her chest. Not only because I get the information directly from the statement \"with irritation, therefore she is irritated\" but also because I just don't \"see\" things in my head. Ask me to describe my husband, the man I've been married to for 14 years, and I'm like, \"uhhh. He's back, and bald. And about 6 feet.\" I just don't \"see\" him in my head. I also don't think about what I'd do in the situation, because that's not what I'm here for. I don't give a rats ass how I'd respond in that situation. Now... 90% of my reading is fantasy, so while it'd probably be cool to have a dragon that I'm bonded with, I know it's not a possibility, so why even put myself in that thought process? I'm here to read what the people in the story are doing with the situations at hand. I blaze through books pretty quickly. I'm also not saying that what you are doing is wrong, or what I am doing is right, as a disclaimer. Just find it incredibly interesting that with such different \"methods\" of reading, it's still enjoyable within those methods.",
                                    "user": "KhaiPanda",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxgx7n/",
                                    "children": [
                                        {
                                            "comment_id": "kfy7bto",
                                            "parent_comment_id": "kfxgx7n",
                                            "time_stamp_created": 1704180239.0,
                                            "comment_text": "I was blown away by this talking to other readers about this. One girl I spoke with was subvocalizing in an extreme way. Essentially saying the words aloud, but with their internal monologue. Then \"hearing\" them. Then interpreting them in order to then imagine the situation the words describe, then watching that imagination, only to finally reach an understanding. She was reading maybe 2000 words an hour tops. Probably more like 1500. Literally crying in dispare over our English lit class freshman year, she could not get through the book even with weeks to read like 90000 words. She'd sit there and legit read for 10 hours straight on a Saturday and get less than a 10th through the book. While I never even engage my inner monologue at all, and don't have the ability to create images in my head at all. Reading is a purely concept process. My eyes glide over the words and my brain processes the story directly into memories. Names are insantly translated to this \"basket of being\" for that character. No one has faces or clothes or bodies. I eat through hundreds of pages in a day.",
                                            "user": "Shandlar",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy7bto/",
                                            "children": [
                                                {
                                                    "comment_id": "kfyy36x",
                                                    "parent_comment_id": "kfy7bto",
                                                    "time_stamp_created": 1704199682.0,
                                                    "comment_text": "So nice to hear someone else like me exists. I get people that ask me how I enjoy reading when I don't \"live\" in the story and I'm like, I dunno, I've been reading as long as I remember, I just do it, and enjoy it...?",
                                                    "user": "KhaiPanda",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyy36x/",
                                                    "children": [
                                                        {
                                                            "comment_id": "kgcfblc",
                                                            "parent_comment_id": "kfyy36x",
                                                            "time_stamp_created": 1704406995.0,
                                                            "comment_text": "Reading this is so strange, I don't even know how you do it. Sometimes when I type I even say the words out loud when I type. I didn't know even know I did it until a friend asked me to stop 😅",
                                                            "user": "Kittelsen",
                                                            "corresponding_post_id": "18vx8ip",
                                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kgcfblc/",
                                                            "children": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfy6mui",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704179744.0,
                            "comment_text": "That's fine though? 3 hours of reading a day essentially means just replace 60-70% of your screen time with reading instead. Most people spend at least 4 or 5 hours of TV or computer/phone time a day.",
                            "user": "Shandlar",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy6mui/",
                            "children": []
                        },
                        {
                            "comment_id": "kgbslwg",
                            "parent_comment_id": "kfuigzy",
                            "time_stamp_created": 1704399357.0,
                            "comment_text": "That's fast to me. It can take me an hour to read 30 pages just because I have the attention span of a butterfly.",
                            "user": "beesontheoffbeat",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kgbslwg/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfuwgf0",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704131612.0,
                    "comment_text": "IMo, the easiest way to add pages to your day is an e-reader. So much easier to read 3 pages in line at the pharmacy, and 12 pages while waiting to get your kids from the bus stop, or one page while you are in the car and your partner is fueling it up.",
                    "user": "StrangledInMoonlight",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuwgf0/",
                    "children": [
                        {
                            "comment_id": "kfwtnpq",
                            "parent_comment_id": "kfuwgf0",
                            "time_stamp_created": 1704157029.0,
                            "comment_text": "Do you not find it can make the pacing of the book hard to follow, when reading in short bursts?",
                            "user": "kanyesaysilooklikemj",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwtnpq/",
                            "children": [
                                {
                                    "comment_id": "kfxaucn",
                                    "parent_comment_id": "kfwtnpq",
                                    "time_stamp_created": 1704163751.0,
                                    "comment_text": "No. But I started doing this type of “incremental reading” because I had kids and in couldn’t get a lot of reading in and when I did I was always interrupted. So maybe I got used to it. LOL!",
                                    "user": "StrangledInMoonlight",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxaucn/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfxgc47",
                                    "parent_comment_id": "kfwtnpq",
                                    "time_stamp_created": 1704165975.0,
                                    "comment_text": "This was always my concern, but recently I started just reading when I could, and I haven't found it to be an issue at all! If anything, it almost feels like I'm *always* in the novel.",
                                    "user": "ILoveYourPuppies",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxgc47/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfybneq",
                                    "parent_comment_id": "kfwtnpq",
                                    "time_stamp_created": 1704183426.0,
                                    "comment_text": "Not really. Occasionally it does mean I reread a page or 2. And there are absolutely times where I've gotten so riveted by a book that I get distracted from whatever else I was doing. But I never feel lost",
                                    "user": "SinkPhaze",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfybneq/",
                                    "children": []
                                }
                            ]
                        },
                        {
                            "comment_id": "kfy7k5s",
                            "parent_comment_id": "kfuwgf0",
                            "time_stamp_created": 1704180404.0,
                            "comment_text": "I read a tip somewhere that reading ebooks is also a good way to wean yourself off mindless internet scrolling. Oh you're bored waiting for appointment or during a show that doesn't totally hold your attention? Open your ereader or ereading app instead of twitter or imgur or whatever.",
                            "user": "OneGoodRib",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy7k5s/",
                            "children": [
                                {
                                    "comment_id": "kfywqt0",
                                    "parent_comment_id": "kfy7k5s",
                                    "time_stamp_created": 1704198902.0,
                                    "comment_text": "Any e-reader recommendations ?",
                                    "user": "emirobinatoru",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfywqt0/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfv8vx6",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704136099.0,
                    "comment_text": "This - even if you commit to 1 chapter a day or even 1 page a day, eventually it will become a habit and you will WANT to spend more time on it every day instead of other leisure activities.",
                    "user": "elveebee22",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv8vx6/",
                    "children": [
                        {
                            "comment_id": "kfvvqyy",
                            "parent_comment_id": "kfv8vx6",
                            "time_stamp_created": 1704144209.0,
                            "comment_text": "My ADHD keeps me from enjoying only books so I felt that it was important to split my activities between goal oriented ones like building homelab stuff or gaming, and passive ones like reading. I found audiobooks to be my perfect medium",
                            "user": "machstem",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvvqyy/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvkms1",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704140310.0,
                    "comment_text": "Yup, this is my goal and at that pace I read about a book a week. 50 pages a night before bed. It usually takes me around an hour, but of course it depends on the writing style. More dense and challenging prose will obviously take a bit longer to hit 50 pages. I'm not super beholden to it and sometimes it slows down on the weekends, but most weeks I read about 250-300 pages. Oh, and it's a godsend to sleep as well having a dedicated hour before bed without staring at a screen. I'd highly recommend it to anyone, whether they're trying to read a book a week or even just ten pages a night.",
                    "user": "Frankensteinbeck",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvkms1/",
                    "children": [
                        {
                            "comment_id": "kfvw1ee",
                            "parent_comment_id": "kfvkms1",
                            "time_stamp_created": 1704144311.0,
                            "comment_text": "On Writing is a gem. Everyone who has a love for reading or for writing should give it a read.",
                            "user": "machstem",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvw1ee/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfvuccz",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704143707.0,
                    "comment_text": "I couldn't do 50pg/day, but easily 20 or so. I could split some days and get into a really good book, then I'd be able to do 45-50 in two sittings per day. I actually prefer audiobooks these days because I can get all types of stories in my quota, written and spoken",
                    "user": "machstem",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvuccz/",
                    "children": []
                },
                {
                    "comment_id": "kfw5zgk",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704147957.0,
                    "comment_text": "And if reading those 50 pages is a chore to you, drop the book and pick up another one.",
                    "user": "Khunjund",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw5zgk/",
                    "children": [
                        {
                            "comment_id": "kfwsn89",
                            "parent_comment_id": "kfw5zgk",
                            "time_stamp_created": 1704156649.0,
                            "comment_text": "This is a major key. You want a book you’re excited to read, not one you have to drag your feet to read. Or else you will stall and delay constantly.",
                            "user": "pursuitofbooks",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwsn89/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfwl6ns",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704153777.0,
                    "comment_text": "I often find that I get bored/tired after reading 10-20 pages. This happens with most books I read, even books that I am enjoying. (I have more success listening to audiobooks than reading books traditionally.) Can I ask what your trick is to read 50 pages?",
                    "user": "PenPar",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwl6ns/",
                    "children": [
                        {
                            "comment_id": "kfwqacf",
                            "parent_comment_id": "kfwl6ns",
                            "time_stamp_created": 1704155749.0,
                            "comment_text": "There’s no trick. I like stories. A lot. I wake up most mornings excited to get back to it.",
                            "user": "Pugilist12",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwqacf/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfx2pdq",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704160490.0,
                    "comment_text": "If your average book is 350 pages, then the number of pages read a day is a good approximation for the number of books a year.",
                    "user": "spvvvt",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfx2pdq/",
                    "children": []
                },
                {
                    "comment_id": "kfxek1n",
                    "parent_comment_id": "kfu3x5c",
                    "time_stamp_created": 1704165230.0,
                    "comment_text": "I recently picked up brothers karamazov again after a bit of break. Needless to say I’ll be behind the 8 ball with the 52 books thing out of the gates 🤦🏻‍♂️😅",
                    "user": "Won_More_Time",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxek1n/",
                    "children": [
                        {
                            "comment_id": "kfxgvnf",
                            "parent_comment_id": "kfxek1n",
                            "time_stamp_created": 1704166204.0,
                            "comment_text": "Eh you just pick some novellas to balance the scale",
                            "user": "Pugilist12",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxgvnf/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfu4clp",
            "parent_comment_id": null,
            "time_stamp_created": 1704120196.0,
            "comment_text": "I don’t do audiobooks and I read over 100 books a year. I always read for at least an hour in bed before sleep. Sometimes two, depending on the book. On weekends, I will spent a few hours each day on the couch reading. And then, there’s holidays and commutes. I’m also, probably, what is considered a fast reader. I do also watch lots of Netflix; exercise; have a job and a family. I’ve been reading like this all my life so I guess I am used to it.",
            "user": "PerhentianBC",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu4clp/",
            "children": [
                {
                    "comment_id": "kfum38s",
                    "parent_comment_id": "kfu4clp",
                    "time_stamp_created": 1704127749.0,
                    "comment_text": "I recommend getting some free exercise along with reading books. Instead of sitting on the couch, walk around the room with the book in your hands (though might not be that as viable an option with physical books). Started doing it 2-3 months ago and find it more comfortable than sitting, plus it helps you lose a bit of weight.",
                    "user": "rmpumper",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfum38s/",
                    "children": [
                        {
                            "comment_id": "kfumis0",
                            "parent_comment_id": "kfum38s",
                            "time_stamp_created": 1704127910.0,
                            "comment_text": "I love podcasts too so I walk a lot/ do housework listening to them. I need to be curled up when I read though.",
                            "user": "PerhentianBC",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfumis0/",
                            "children": [
                                {
                                    "comment_id": "kfurcoe",
                                    "parent_comment_id": "kfumis0",
                                    "time_stamp_created": 1704129729.0,
                                    "comment_text": "my problem is i have grown to love podcasts and listening to podcasts has replaced reading before bed for me. i am now trying to read in the mornings instead",
                                    "user": "bookreader018",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurcoe/",
                                    "children": [
                                        {
                                            "comment_id": "kfutbv6",
                                            "parent_comment_id": "kfurcoe",
                                            "time_stamp_created": 1704130466.0,
                                            "comment_text": "I get you. There are so many good podcasts and not enough time in the day!",
                                            "user": "PerhentianBC",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfutbv6/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "comment_id": "kfuwpfv",
                            "parent_comment_id": "kfum38s",
                            "time_stamp_created": 1704131703.0,
                            "comment_text": "I don’t walk with a book but I do listen to audiobooks on my stationary bike and do 8-15 miles a day. I switch it up with movies and YouTube depending on what I’m feeling but hoping my audiobooks this year.",
                            "user": "justanother1014",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuwpfv/",
                            "children": []
                        },
                        {
                            "comment_id": "kfvf29c",
                            "parent_comment_id": "kfum38s",
                            "time_stamp_created": 1704138305.0,
                            "comment_text": "I don't really get the downvotes... This is some good advice! I usually walk around the room with a book in hand as well. Maybe that's just because I'm a bit hyperactive at times and can't sit still, but my body definitely does benefit from it! Besides, I don't have the neckaches that often occur after I've read a book in an absurd position. ;)",
                            "user": "Idan_Orion_Vane",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvf29c/",
                            "children": []
                        },
                        {
                            "comment_id": "kfwq7ii",
                            "parent_comment_id": "kfum38s",
                            "time_stamp_created": 1704155718.0,
                            "comment_text": "No idea why you were downvoted — perhaps people thought you were implying the OP needed to lose weight? Personally, walking in circles (and reading aloud) is one of the only ways I can focus while reading books. I become bored, achey, anxious, sleepy, and just generally uncomfortable if I spend more than ~20 minutes sitting while reading. I’m also an extraordinarily slow reader, so I make very little progress when sitting. I know these are issues probably related to my being on the spectrum and having a poor attention span and lots of excess energy, but like you said, I also just find them enjoyable and they help keep one active.",
                            "user": "Reddit_Inuarashi",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwq7ii/",
                            "children": [
                                {
                                    "comment_id": "kfy1bes",
                                    "parent_comment_id": "kfwq7ii",
                                    "time_stamp_created": 1704176240.0,
                                    "comment_text": ">No idea why you were downvoted Just a couple people downvoted for no reason, then everyone else joined the bandwagon without even bothering to read the comment. Just how reddit works, after all, if the comment has a \"-\" in the rating, it must be bad, so add your own downvote and move on to the next one. In regards to downsides for reading in a stationary position, I already forgot about the sleepiness, lol. No matter how interesting the book was, reading it while sitting on lying on my stomach just had me fighting to keep my eyes open from the sleepiness. Now that I'm waking around with the book, even if it's on the duller side, it's never putting me to sleep. And that on top of not getting sore, numb and uncomfortable in general.",
                                    "user": "rmpumper",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfy1bes/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfu4d9v",
            "parent_comment_id": null,
            "time_stamp_created": 1704120205.0,
            "comment_text": "Unpopular opinions: No one but you cares how many books you put down in one year, our reading abilities and speed are unique to us as an individual, AND anyone who spends all their free time reading- needs to get another hobby. Read to make yourself happy, to reset, to open your mind, to learn, to disconnect or maybe to reconnect, to feel, to laugh or cry— but don’t make reading some unhealthy competition",
            "user": "Dangerous_Split_7476",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu4d9v/",
            "children": [
                {
                    "comment_id": "kfu99o2",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704122511.0,
                    "comment_text": "I did a 52/year challenge for the first time in years in 2023. Combination of long books (500+ pages), short stories, audiobooks, etc. Managed to hit 86. Now, I'm retired and 76 and don't own a TV, so reading and music are my main entertainments. I read for pleasure and to learn. Almost 50/50 fiction and non-fiction. I don't intend to do a challenge this year, but it was fun to see my total.",
                    "user": "oldhippy1947",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu99o2/",
                    "children": [
                        {
                            "comment_id": "kfuapef",
                            "parent_comment_id": "kfu99o2",
                            "time_stamp_created": 1704123149.0,
                            "comment_text": "I am paid to read and write for a living. I can work through approximately 10,000 pages/day of which 30-45% require analytical in-depth review, while composing 60+ pages of my own daily. My grandma read a novel a day throughout her retirement until she died at 95. So when people want to make it some competition I quite literally roll my eyes. It’s great if people want to challenge themselves, but it’s become toxic. And social media has intensified this problem. And People are trying to reach some goal whist neglecting other areas of their life- social and relationships, physical fitness, and the biggest one for me is mental health- they’d rather dive into a book than work on themselves. Toxic. I stand by what I said. Reading isn’t a competition….",
                            "user": "Dangerous_Split_7476",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuapef/",
                            "children": [
                                {
                                    "comment_id": "kfuf1cw",
                                    "parent_comment_id": "kfuapef",
                                    "time_stamp_created": 1704124979.0,
                                    "comment_text": "To do 10,000 pages per day, even if you read every hour without sleep or anything else, you'd have to read over 400 pages an hour. Taking out 8 hours for sleep and eating but nothing else, you'd have to read over 600 pages per hour. Realistically, you have at best 12 hours a day to read, which would mean over 800 pages an hour. The average person reads roughly 50 pages an hour. Reading comprehension starts to fall off a cliff for everyone around 160 pages an hour. Writing can vary, and it depends on what you're writing. But very generally, 1,000 words (roughly 3 pages) an hour is a decent pace. A fast typist types 100 words per minute or about 20 pages an hour. Taking out all creative aspects and just typing as fast as possible without thinking, 60 pages would take around 3 hours, even if you're an exceptionally fast typist. You're completely right that reading isn't a competition, which makes these claims odd.",
                                    "user": "Vegtam1297",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuf1cw/",
                                    "children": [
                                        {
                                            "comment_id": "kfurutg",
                                            "parent_comment_id": "kfuf1cw",
                                            "time_stamp_created": 1704129920.0,
                                            "comment_text": "Well, considering it’s my JOB, which requires a specific skill set, specific language, and advanced education, it’s be quite impractical to think most people could do this. Reading skills are important, knowing which information is important, and which is not and/or repetitive, makes a big difference. I can skim the MAJORITY of the amount of work I process- it’s repetitive in many cases- I’ve already read it 100 times. Learning to hone reading skills early on gave me an easy advantage in life, which is unfortunate. I wish everyone had these abilities- but they don’t, And most people (75%) washout before making it through training… and I’m not even the fastest nor have the highest productivity!!! Which means… I’m not the best. There’s people out there better than me. So my point is, not everyone has the same ability to read and comprehend the same speed or amount of info. BECAUSE we’re unique. Not everyone’s brains were built the same. Not everyone had the same upbringing or the same amount of time. My grandma passed something onto me and my teachers, mentors, and family honed by abilities- I’m forever grateful. Her son, my father, absolutely could not, if his life depended on it, read as either of us do/did. I couldn’t read a Russian novel at the same speed, or complete an analysis of a complex mathematical theory (I flunked Calc II HARD), or compose a symphony. These are not my strong skills. That’s okay. The percentages of what needs analysis and which can be skimmed is important, and I work 10-12 hour days. My typing speed is dependent on the work- but also on being able to quickly layout an individual template and essentially filling it in with the vital information. But typing and “reports” or narratives are skills I worked in- for 25 + years. It’s my job!! And wherever I stand, there’s receptionists, transcriptionists, and bloggers who type faster than me I have no doubts. Honestly I’m not the best at anything, and likely- either are you. That’s why it’s. Not. A competition. WTF cares with the exception of my CEO, direct sup., and my clients? Why would I ever bring it up in casual conversation? I wouldn’t because no one cares. Shit most people don’t even like to talk about my job much less the specifics. But never have I ever had someone in person be like- oh how many books have you read this year? How many pages can you read per minute of x, y, z subject? How many research articles did you make it through? How many words do you type a minute? Literally, never. NEVER. It’s automatically a superiority based question. It’s. Weird. Reading outside of work is supposed to be FUN. I read an enjoyable book at my inner narrative speed of choice- I can re-read books quickly, but I might choose to linger and savory a new juicy thriller. A balanced life is important for overall health. We all have different levels of ability And reading for enjoyment is what you make of it. Making it a social media competition is cringe- Give me a top three favorite reads. Give me a review that makes me itch to visit a locally owned bookstore. Tell why you think that book was so hard to digest. But I will not now nor ever give a shit how many books you read. And no one else does either. Rant over. Have a good one and accepting book recs",
                                            "user": "Dangerous_Split_7476",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfurutg/",
                                            "children": [
                                                {
                                                    "comment_id": "kfv8y6y",
                                                    "parent_comment_id": "kfurutg",
                                                    "time_stamp_created": 1704136122.0,
                                                    "comment_text": ">I can work through approximately 10,000 pages/day of which 30-45% require analytical in-depth review, while composing 60+ pages of my own daily. 1) This is what you said. You didn't say you skim through pages that you've already read 100 times. And it's in response to a thread about reading books, so the implication is that you can read 10,000 pages/day, not just skim some stuff for certain info you need. This bit of information is completely irrelevant and unnecessary in this context. Your combing through a bunch of pages you've already read in order to pick out certain info you need is not remotely close to reading a book. 2) Your \"particular set of skills\" is also irrelevant. I'm glad you trained for that. What you're doing is still not at all the same as reading a book, and so it has no place here. And your claim of superiority doesn't help anything. 3) You said 3,000-4,500 pages require analytical in-depth review. Even skimming through that many pages without the in-depth review would take a good 8+ hours just for that less than half of the total you mentioned. Adding in-depth review would mean going a whole lot slower. 4) You said you can write 60 pages a day in addition to all that \"reading\". I'm pointing out that even an exceptionally fast typist would take 3+ hours to type out 60 pages, and that's without any kind of thinking involved, just typing the words. I assume you're typing up manuscript pages or documents or reports that require thought and planning, which means it would take considerably more than 3 hours. 5) You gave this information completely unsolicited. Someone replied agreeing with your post, and you decided to offer this information for no reason at all. Which goes against your entire point. You ask \"Why would I ever bring it up in casual conversation?\". Well, you just did. This whole thread is you tooting your own horn, while trying to pretend you're not. 6) If you like to keep reading as something you do for pleasure, go for it. I'm not into making it a competition either (which is why I don't post about how fast I am at reading unsolicited). But if some people like to compare themselves against others, who really cares? For some people, the competition gives them the drive to do the thing.",
                                                    "user": "Vegtam1297",
                                                    "corresponding_post_id": "18vx8ip",
                                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv8y6y/",
                                                    "children": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfu9htd",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704122613.0,
                    "comment_text": "Why is spending all your free time reading not a good enough hobby?",
                    "user": "FoghornLegday",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu9htd/",
                    "children": [
                        {
                            "comment_id": "kfub86k",
                            "parent_comment_id": "kfu9htd",
                            "time_stamp_created": 1704123376.0,
                            "comment_text": "Because it’s unhealthy….. physically, mentally, and socially… a hobby shouldn’t be all encompassing of your free time. We’re complex species and require socialization, physical activity, and mental stimulation (and it can’t all come from one source!!!!)",
                            "user": "Dangerous_Split_7476",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfub86k/",
                            "children": [
                                {
                                    "comment_id": "kfv70z4",
                                    "parent_comment_id": "kfub86k",
                                    "time_stamp_created": 1704135434.0,
                                    "comment_text": "I work eight hours a day where i walk and bile, talk to people and think. I come home, i read.",
                                    "user": "dontbeahater_dear",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv70z4/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvh2fw",
                                    "parent_comment_id": "kfub86k",
                                    "time_stamp_created": 1704139024.0,
                                    "comment_text": "I agree. Unless people are on the treadmill whilst reading, everybody should have an active hobby too",
                                    "user": "tinasnow-poty",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvh2fw/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfvnpvw",
                                    "parent_comment_id": "kfub86k",
                                    "time_stamp_created": 1704141395.0,
                                    "comment_text": "Weird to see the amount of downvotes you got. I wouldn't have considered that a controversial statement at all!",
                                    "user": "kace91",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvnpvw/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfucwh1",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704124094.0,
                    "comment_text": "This comment needs to be higher up! It really grates me how people get competitive over how many books they read in a year, rushing to finish a book before midnight on the 31st, talking about whether audiobooks or dnfs should be allowed on your \"count\"... You do you, who cares!",
                    "user": "forleaseknobbydot",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfucwh1/",
                    "children": [
                        {
                            "comment_id": "kfudn5t",
                            "parent_comment_id": "kfucwh1",
                            "time_stamp_created": 1704124401.0,
                            "comment_text": "I honestly had no idea it went that deep… I’m doubling down on my statement 😂",
                            "user": "Dangerous_Split_7476",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfudn5t/",
                            "children": []
                        },
                        {
                            "comment_id": "kfus6hq",
                            "parent_comment_id": "kfucwh1",
                            "time_stamp_created": 1704130044.0,
                            "comment_text": "Counting books **is** them doing them. Why is it so hard to understand that different people enjoy different things? I'm not competing with anyone when I'm tracking books. Number go up, make me happy. It's not that deep.",
                            "user": "KiwiTheKitty",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfus6hq/",
                            "children": [
                                {
                                    "comment_id": "kfxtyyu",
                                    "parent_comment_id": "kfus6hq",
                                    "time_stamp_created": 1704172267.0,
                                    "comment_text": "It's literally not when you folks are arguing in this very subreddit about whether *other people* are allowed to count audiobooks in their count. \"You do you\" means one thing and one thing only, but nice try.",
                                    "user": "forleaseknobbydot",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxtyyu/",
                                    "children": [
                                        {
                                            "comment_id": "kfyunr1",
                                            "parent_comment_id": "kfxtyyu",
                                            "time_stamp_created": 1704197627.0,
                                            "comment_text": "\"You folks\" who are you talking about lol, not *me*. Nice try though.",
                                            "user": "KiwiTheKitty",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfyunr1/",
                                            "children": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "comment_id": "kfuus2a",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704130999.0,
                    "comment_text": "I agree so much here. It's weird how people put books on such a high pedestal. I've gained huge insights from books I've read, I've also wasted a lotttt of time on books. Just like video games, films, music, anything else. The hobby/object itself is not as important as the relationship to it and how it serves that person.",
                    "user": "ExoticPumpkin237",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuus2a/",
                    "children": [
                        {
                            "comment_id": "kfv3joq",
                            "parent_comment_id": "kfuus2a",
                            "time_stamp_created": 1704134188.0,
                            "comment_text": "The way you worded this is perfection. That last line is sums up my babbling perfectly",
                            "user": "Dangerous_Split_7476",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv3joq/",
                            "children": []
                        }
                    ]
                },
                {
                    "comment_id": "kfw1z8p",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704146484.0,
                    "comment_text": "Totally agree - I read 52 books in a year a few times, but it was very, very time consuming (imo reading takes more brain power than watching netflix or movies or being on reddit, all the things people itt were comparing it to, unless you're reading, idk, really simple stuff). It took up literally ALL of my free time. Basically I decided I was more of a 30-Books-A-Year person, which left ample time for other hobbies and interests. If people love mowing through books and knocking things off their to-read list, then that's awesome! If it's a struggle, then why not be okay with having less lofty goals and trying to build up to a bigger number if that's what you *really* want to do, instead of trying to make it happen all at once and maybe exhausting yourself.",
                    "user": "gnosticheaven",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfw1z8p/",
                    "children": []
                },
                {
                    "comment_id": "kfwtofm",
                    "parent_comment_id": "kfu4d9v",
                    "time_stamp_created": 1704157036.0,
                    "comment_text": "Oh no, people definitely care about how many books you read. I don’t know, they seem to see it as a personal insult of humble brag. It’s actually kinda weird. I just see it as setting a goal, no different than setting a goal to work out three times per week. They see it as a slight.",
                    "user": "Avilola",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwtofm/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu4f8e",
            "parent_comment_id": null,
            "time_stamp_created": 1704120234.0,
            "comment_text": "Audiobooks are generally 8-12 hours. Some get real crazy at 30+ (Game Of Thrones, Wheel of Time.), but you can do 1 book a week if you keep it on religiously during your free time.",
            "user": "Virtual-One-5660",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu4f8e/",
            "children": [
                {
                    "comment_id": "kfvd17o",
                    "parent_comment_id": "kfu4f8e",
                    "time_stamp_created": 1704137579.0,
                    "comment_text": "I dont think he was asking how to listen to a book a week.",
                    "user": "earlesstoadvine",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvd17o/",
                    "children": [
                        {
                            "comment_id": "kfvjf4h",
                            "parent_comment_id": "kfvd17o",
                            "time_stamp_created": 1704139868.0,
                            "comment_text": "> Is it mostly audio books? \\- OP mentioned audiobooks, and I answered his audiobook question.",
                            "user": "Virtual-One-5660",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvjf4h/",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kfu520o",
            "parent_comment_id": null,
            "time_stamp_created": 1704120541.0,
            "comment_text": "〜insomnia〜",
            "user": "spaghettisburg",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu520o/",
            "children": [
                {
                    "comment_id": "kfv26wh",
                    "parent_comment_id": "kfu520o",
                    "time_stamp_created": 1704133696.0,
                    "comment_text": "honestly this is the correct answer lol",
                    "user": "quaygirlquayyy",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfv26wh/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu78vc",
            "parent_comment_id": null,
            "time_stamp_created": 1704121589.0,
            "comment_text": "15-20 hours a book is a lot I’m a slow reader and regular 400/500 page books take me around 12-14 hours",
            "user": "Novae224",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu78vc/",
            "children": [
                {
                    "comment_id": "kfvvbg6",
                    "parent_comment_id": "kfu78vc",
                    "time_stamp_created": 1704144053.0,
                    "comment_text": "Yeah, this shocked me, it seems like a huge over-estimate. Kindle has \"typical reading time stats\", and the first 5 novels I clicked on in my kindle had \"typical reading time\" of 5-7 hours. If OP reads 3X slower than typical, that's totally fine, but they shouldn't think they need to read a book a week if it really takes them 15-20 hours. A book every 3-4 weeks is also ok! Reading should be fun.",
                    "user": "Scaaaary_Ghost",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvvbg6/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfu8iow",
            "parent_comment_id": null,
            "time_stamp_created": 1704122177.0,
            "comment_text": "do not do this. savour the book.",
            "user": "makdunalds_",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfu8iow/",
            "children": [
                {
                    "comment_id": "kfuiw0q",
                    "parent_comment_id": "kfu8iow",
                    "time_stamp_created": 1704126522.0,
                    "comment_text": "Agree. I read books like I’m watching movie, I don’t rush the pace, I prefer to absorb the story and setting. For me, this is a more rewarding reading experience.",
                    "user": "pi20",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuiw0q/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfubvxs",
            "parent_comment_id": null,
            "time_stamp_created": 1704123659.0,
            "comment_text": "I'm a slow reader so I'm lucky to read 3 books a month. If I'm listening to a book that number could go up but I enjoy taking my time. Also it can depend on the books. Popular fiction/ sci fi / fantasy usually go fast but more challenging books can slow me down considerably I have noticed that since reading more, my pace has picked up. I generally think \"speed\" reading challenges can easily become the equivalent of a hot dog eating contest",
            "user": "elethrir",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfubvxs/",
            "children": [
                {
                    "comment_id": "kfzd012",
                    "parent_comment_id": "kfubvxs",
                    "time_stamp_created": 1704207023.0,
                    "comment_text": "That's still a considerable number of books per year when you add it up. Some people have more time than others - not replacing TV or other activities with reading necessarily, but with other life commitments so it will vary from person to person. I was doing a college course at night last year so between assignments and reading material for college, the time I had available to read books for pleasure was limited, but my course is finished now and I'm getting back to reading for fun.",
                    "user": "karlachameleon",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfzd012/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfufkek",
            "parent_comment_id": null,
            "time_stamp_created": 1704125195.0,
            "comment_text": "A few years ago I was commuting to London for work, about 1.5 hours door to door on public transport. So I could easily finish an average book a week if I wanted to. I can also get through books very quickly these day either audiobooks as I always have time during chores and so on. Doing a book a week every week just for some dumb internet thing is very silly though. No way anyone can retain most of what they read that way.",
            "user": "SillyMattFace",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfufkek/",
            "children": [
                {
                    "comment_id": "kfuszk9",
                    "parent_comment_id": "kfufkek",
                    "time_stamp_created": 1704130343.0,
                    "comment_text": "Yes, public transportation can really add to your reading time. And, if you’re sufficiently engrossed and miss a stop or three, you can console yourself that you’ve added even more time …. ;)",
                    "user": "Sundae_2004",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuszk9/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kfuo2zu",
            "parent_comment_id": null,
            "time_stamp_created": 1704128499.0,
            "comment_text": "Read however much you want, but wtf. 15-20 hours for 300-400 pages is insane. Like if you have a good flow going, you can get a sub minute per page. But I'd imagine the standard is 90 seconds for a page. Which still is a max of 10 hours for a 400-page book.",
            "user": "DarkSylince",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfuo2zu/",
            "children": [
                {
                    "comment_id": "kfvq9jl",
                    "parent_comment_id": "kfuo2zu",
                    "time_stamp_created": 1704142278.0,
                    "comment_text": "this!! everyone has different lifestyles and commitments and priorities but 15-20 hours for a normal book unless you’re an incredibly slow reader (they didn’t say), that seems excessive.",
                    "user": "Kind_Orange_9057",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvq9jl/",
                    "children": []
                },
                {
                    "comment_id": "kfvtnly",
                    "parent_comment_id": "kfuo2zu",
                    "time_stamp_created": 1704143468.0,
                    "comment_text": "Some people subvocalize when they read, so they basically read at the pace of verbal narration. So, for example, the Gone Girl book is 464 pages, and a 19 hour audiobook. There's no right or wrong way to read, everyone reads at their own pace.",
                    "user": "Moist_Succotash",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfvtnly/",
                    "children": [
                        {
                            "comment_id": "kfwb9jj",
                            "parent_comment_id": "kfvtnly",
                            "time_stamp_created": 1704149926.0,
                            "comment_text": "Yup, that's me! I'm a super slow reader because even in my head I read things like an audio drama. I can't even imagine just reading without a head voice lol",
                            "user": "Barackobrock",
                            "corresponding_post_id": "18vx8ip",
                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwb9jj/",
                            "children": [
                                {
                                    "comment_id": "kfwjp9o",
                                    "parent_comment_id": "kfwb9jj",
                                    "time_stamp_created": 1704153192.0,
                                    "comment_text": "“Head voice” hahaha love that! And yep, same!",
                                    "user": "bluev0lta",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwjp9o/",
                                    "children": []
                                },
                                {
                                    "comment_id": "kfwoc0m",
                                    "parent_comment_id": "kfwb9jj",
                                    "time_stamp_created": 1704155000.0,
                                    "comment_text": "I’m glad I’m not the only one! I only recently found out that people don’t ‘speak’ every word in their head while reading when I was discussing it with my husband… I was confused at how fast he read and he was confused when I said I can’t read the words unless I say them",
                                    "user": "Grumpasaurussss",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfwoc0m/",
                                    "children": [
                                        {
                                            "comment_id": "kfxkngi",
                                            "parent_comment_id": "kfwoc0m",
                                            "time_stamp_created": 1704167845.0,
                                            "comment_text": "This is me and my husband. He was playing a game a few months ago and something popped up to read. I had an audible reaction to something towards the bottom of the section, and he stopped reading looked at me and was like, \"what was that?\" I guess he thought I was reacting to something else and I just said \"oh, sorry. Keep reading it.\" He got to the portion I reacted to about a minute later, looked at me again and was like, \"no way you got all the way to the bottom of that so quickly.\" This guy decided to test my reading speed vs his, so pulled up a flavor text information thing in his game, said start, and told me to tell him when I was done. He timed me, then read the same passage himself. I read it in like 24 seconds and he read it in like 2 minutes. We got into a bit of a conversation about it, a d I was like, \"bruh, I don't know what to tell you. I'm neurospicy and can't sed/hear things in my head, or I hear the wrong things and they repeat in my head over and over and over and over again so I try to avoid hearing things, which redirected me to reading. When you go through a couple hundred books a year as a kid for years on end, you pick up some shortcuts, my guy.",
                                            "user": "KhaiPanda",
                                            "corresponding_post_id": "18vx8ip",
                                            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfxkngi/",
                                            "children": []
                                        }
                                    ]
                                },
                                {
                                    "comment_id": "kfx0fs8",
                                    "parent_comment_id": "kfwb9jj",
                                    "time_stamp_created": 1704159651.0,
                                    "comment_text": "I do this when I’m fully enjoying and immersing myself in the book. I read the voices in what I would imagine to be the character’s voices and picture the scene as it’s unfolding. I picture the character’s movements, tones and facial expressions. If I’m not enjoying the book so much then I start skimming and don’t picture it so vividly but the whole fun of a good book is trying to immerse myself in their world!",
                                    "user": "Urban_mist",
                                    "corresponding_post_id": "18vx8ip",
                                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kfx0fs8/",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "comment_id": "kg05whc",
            "parent_comment_id": null,
            "time_stamp_created": 1704217837.0,
            "comment_text": "I find little pockets of time to read. I’ll read while I’m eating breakfast, lunch, winding down from the day/before bed. All the little time pockets have added up enough to help me finish more books. It does help that I also tend to read books around 300 pages, anything longer than that and it takes a bit longer.",
            "user": "Bv1_jpg",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg05whc/",
            "children": [
                {
                    "comment_id": "kg06elp",
                    "parent_comment_id": "kg05whc",
                    "time_stamp_created": 1704218009.0,
                    "comment_text": "Plus, there are seasons to reading. It’s winter and I don’t want to be outside, so I have more time to read. During the summer it’ll be less. The pressure of a book a week is a lot, but just finding a pace that works for the season of life you’re in makes reading more enjoyable. I tried to do that in 2022, and ended up reading 7 books because it felt like a chore. Going into 2023, my main goal was to just enjoy reading again, and I read 52. Do what feels best for you!",
                    "user": "Bv1_jpg",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg06elp/",
                    "children": []
                }
            ]
        },
        {
            "comment_id": "kg06zql",
            "parent_comment_id": null,
            "time_stamp_created": 1704218212.0,
            "comment_text": "\"where do people find the time?\" Instead of using your time to post on reddit trying discover how people could possibly read, get off reddit and read. That's all. That's all you do.",
            "user": "EternallyReturn",
            "corresponding_post_id": "18vx8ip",
            "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg06zql/",
            "children": [
                {
                    "comment_id": "kg0gm61",
                    "parent_comment_id": "kg06zql",
                    "time_stamp_created": 1704221540.0,
                    "comment_text": "Gosh so many salty messages But many nice kind helpful ones too Thanks all!",
                    "user": "Immediate-Leading338",
                    "corresponding_post_id": "18vx8ip",
                    "link": "/r/books/comments/18vx8ip/how_to_read_a_book_a_week/kg0gm61/",
                    "children": []
                }
            ]
        }
    ]
}