[
    {
        "user": "AutoModerator",
        "time": "2024-10-25 23:17:25",
        "message": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "user": "Deleted",
        "time": "2024-10-25 23:20:23",
        "message": "[deleted]"
    },
    {
        "user": "ClusterFoxtrot",
        "time": "2024-10-25 23:20:45",
        "message": "Imagine being told, \"I'm sorry. That's against state law.\"\n\n\nAnd your first response is to punch the person who isn't even getting paid. Your body, my choice!"
    },
    {
        "user": "transcriptoin_error",
        "time": "2024-10-25 23:24:41",
        "message": "The earlier article omitted mention of party affiliation, but of *course* it was a MAGA man-baby\n\n >SAN ANTONIO — A 63-year-old Bexar County man was arrested after allegedly punching an election clerk when he was asked to take off his hat supporting presidential candidate Donald Trump, breaking polling site rules.\n\n>Jesse Lutzenberger faces charges of injury to an elderly person for assaulting the 69-year-old poll worker Thursday evening at the Johnston Library voting site.\n\n>Bexar County Sheriff Javier Salazar called it an “ugly incident,” saying there was no place for violence in elections.\n\n>“There was nothing life-threatening, but it was still an ugly incident where I can’t think of something like this happening in my time as sheriff,” Salazar said.\n\n>Officials said Lutzenberger arrived around 6:30 p.m. to vote and put on his hat supporting a candidate. Documents specified it was a red “Make American Great Again” cap, referencing Trump’s campaign slogan.\n\n>It’s against Texas election rules, however, to wear badges or attire referencing candidates or measures on the ballot while in a polling place. Salazar said a poll worker at Johnston Library reminded Lutzenberger about the rules, and he removed it before casting his ballot.\n\n>Upon leaving, however, Lutzenberger allegedly put the hat back on while still in the building. An election clerk “told him that was unacceptable,” Salazar said, and began to escort him out. That’s when Lutzenberger allegedly turned physical, throwing his arm and then “several punches” at the clerk before leaving.\n\n>Bexar County Sheriff’s deputies investigated and took Lutzenberger into custody at his home Friday. He has since been released after posting bail on a $30,000 bond."
    },
    {
        "user": "Glittering_Lunch_776",
        "time": "2024-10-25 23:24:46",
        "message": "MAGA: violent for the smallest reasons."
    },
    {
        "user": "McNuttyNutz",
        "time": "2024-10-25 23:27:09",
        "message": "Lock this snowflake up"
    },
    {
        "user": "ChickpeaDemon",
        "time": "2024-10-25 23:40:32",
        "message": ">Jesse Lutzenberger faces charges of injury to an elderly person for assaulting a 69-year- old poll worker Thursday evening at the Johnson Library voting site. \n\nI’m a so fucking sick of maga filth."
    },
    {
        "user": "PenisRancherYoloSwag",
        "time": "2024-10-25 23:24:22",
        "message": "They love infringing on others’ rights, but when they can’t do whatever they want they resort to violence."
    },
    {
        "user": "hawkrew",
        "time": "2024-10-25 23:53:17",
        "message": "MAGA is a cancer"
    },
    {
        "user": "Autoganz",
        "time": "2024-10-26 00:30:08",
        "message": "Released on $30,000 bond.\n\nIt’s insane to me the lengths people will go to in support of a man who wouldn’t reciprocate the same support for them."
    },
    {
        "user": "Gogs85",
        "time": "2024-10-25 23:34:34",
        "message": "Here in MA it’s the same.  Poll workers often have to remind people they can’t wear political attire to the polls.  Happens pretty regularly, on both sides of the aisle (some people forget the rules don’t know them), and most people follow the rule once informed.  I’m sure MAGA people are sometimes so daft that they feel like it’s persecution though."
    },
    {
        "user": "ManufacturerThis7741",
        "time": "2024-10-26 00:55:47",
        "message": "Y'know how harming a police officer gets like a 5 year sentence enhancement or so?\n\n  \nWe need to do that with every civil servant.\n\n  \nPunch a poll worker? 5 years.\n\nPunch a FEMA worker? 5 years.\n\nPunch a teacher? That's a paddlin' and 5 years"
    },
    {
        "user": "raysun888",
        "time": "2024-10-25 23:23:18",
        "message": "My 78 year old mother signed up to be a poll worker, it was a 2 year stint and the presidential election is thankfully her last obligation. Shit like this is why I asked her not to, as the only issues they’ve had are from the maga crowd and it’s only going to get worse. Edit for spelling."
    },
    {
        "user": "KaisarDragon",
        "time": "2024-10-25 23:39:41",
        "message": "Yeah, on brand for someone that would vote for Trump."
    },
    {
        "user": "JeffSteinMusic",
        "time": "2024-10-25 23:21:44",
        "message": "Being White and Republican means getting to believe whatever you want and do whatever you want without fear of consequence.\n\nThere will be a GoFundMe to bail this guy out and pay his fines in no time.\n\nBet this same guy was flouting mask “mandates” during the pandemic with the exact same spirit of self-assured impunity."
    },
    {
        "user": "mattjb",
        "time": "2024-10-26 00:00:40",
        "message": "It's not surprising when you consider 1 in 4 MAGA supports political violence like the fascists they are.\n\nhttps://www.usatoday.com/story/news/politics/elections/2024/09/10/1-in-4-republicans-pro-political-violence/75142467007/"
    },
    {
        "user": "IsGoingTTaM",
        "time": "2024-10-26 00:28:53",
        "message": "MAGA is a cancer to the world."
    },
    {
        "user": "keyjan",
        "time": "2024-10-25 23:54:41",
        "message": "So, maybe more severe penalties for assaulting election or poll workers ?"
    },
    {
        "user": "skiddle33",
        "time": "2024-10-26 01:11:29",
        "message": "According to the sheriff, \"the victim is no worse for wear other than some marks to his face.\"\n\nTalk about downplaying a serious physical assault.\n\nA 69 year old poll worker was punched hard enough by some irate d-psh-t to leave marks on the victim's face. I'd think that would be pretty unsettling for some time, not to mention dampen people's interest in volunteering for poll work."
    },
    {
        "user": "bbbinson123",
        "time": "2024-10-25 23:23:01",
        "message": "Aren’t there any other charges that can be brought?"
    },
    {
        "user": "ghastlypxl",
        "time": "2024-10-25 23:57:02",
        "message": "Imagine being that sensitive you’ve gotta lash out because you can’t wear your favorite hat ):"
    },
    {
        "user": "tjb122982",
        "time": "2024-10-26 00:30:51",
        "message": "So much for the MAGA movement being peaceful"
    },
    {
        "user": "Marokiii",
        "time": "2024-10-26 02:36:46",
        "message": "Charge the person with terrorism. They used an act of violence to intimidate a poll worker."
    },
    {
        "user": "geekwadpimp",
        "time": "2024-10-25 23:41:13",
        "message": "Telling a Christian Conservative that they have to follow rules is the worst thing you can do to them, and nowadays, they quickly resort to violence. They feel absolutely justified in doing so."
    },
    {
        "user": "lizkbyer",
        "time": "2024-10-25 23:42:28",
        "message": "Panic is setting in…. They are getting itchy"
    },
    {
        "user": "PM_ME_NIETZSCHE",
        "time": "2024-10-25 23:48:47",
        "message": "Of course it was a MAGA. Absolute snowflakes. ❄️"
    },
    {
        "user": "divot31",
        "time": "2024-10-26 00:05:42",
        "message": "Fuck these assholes."
    },
    {
        "user": "ColdAdmirableSponge",
        "time": "2024-10-26 00:32:45",
        "message": "Can the left stop stoking hatred and outrage for just two seconds?!?! I can’t believe Kamala has done this /s"
    },
    {
        "user": "SpunkySix6",
        "time": "2024-10-26 00:43:03",
        "message": "The party of law and order /s"
    },
    {
        "user": "Significant-Self5907",
        "time": "2024-10-26 00:09:49",
        "message": "Only one side is radicalized. Only one."
    },
    {
        "user": "the2belo",
        "time": "2024-10-25 23:36:18",
        "message": "Move over, brownshirts. The redhats are here."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 00:27:13",
        "message": "[deleted]"
    },
    {
        "user": "omgpuppiesarecute",
        "time": "2024-10-26 00:30:35",
        "message": "How completely and totally on brand."
    },
    {
        "user": "Boone1997",
        "time": "2024-10-26 01:00:18",
        "message": "They can’t even stop the cult worship for 10 minutes…"
    },
    {
        "user": "GeorgeLovesBOSCO",
        "time": "2024-10-26 01:18:13",
        "message": "Hey remember that Harris supporter that was told to remove their Harris hat at a polling station so they threw a tantrum OH WAIT NO THAT HASNT FUCKING HAPPENED"
    },
    {
        "user": "youreallcucks",
        "time": "2024-10-26 02:50:17",
        "message": "The victim was 69 years old, and while the sheriff said \"There was nothing life-threatening\", but I'm pretty sure any assault on an individual at that age is life threatening."
    },
    {
        "user": "2HDFloppyDisk",
        "time": "2024-10-25 23:29:05",
        "message": "Domestic terrorism"
    },
    {
        "user": "baskinrobbers",
        "time": "2024-10-25 23:21:03",
        "message": "I'm surprised he can get past a metal detector with all that lead in his brain."
    },
    {
        "user": "RiffRaffCatillacCat",
        "time": "2024-10-26 00:10:08",
        "message": "Typical MAGA. Lacks to decency and morality to follow the basic rules that everyone must adhere to, then predictably falls back on the only thing they know: violence."
    },
    {
        "user": "Avenger772",
        "time": "2024-10-26 02:50:24",
        "message": "What a fucking brave ass tough guy punching an elderly woman. \n\nThese people don't belong in society. They clearly don't want to live in one. Put them in the fucking woods."
    },
    {
        "user": "bandalooper",
        "time": "2024-10-26 03:29:35",
        "message": ">Sheriff Salazar implored the [Re]public[ans] to “tone down” the anger. \n\nDemocrats ain’t doin’ this bullshit. Fucking MAGA troglodytes need the babysitters in public."
    },
    {
        "user": "original208",
        "time": "2024-10-25 23:39:22",
        "message": "Really classy people, maga republicans."
    },
    {
        "user": "ogreofnorth",
        "time": "2024-10-25 23:45:36",
        "message": "During Murkowski’s write in campaign, which she won, she was going to give out those rubber bracelets with her name on them, so they could spell her name right.  They said they would made everyone take ‘em off for this same reason, if I can’t wear that, you can’t wear your MAGA hat."
    },
    {
        "user": "zaparthes",
        "time": "2024-10-25 23:52:58",
        "message": "MAGAs are defined and united by violence and cynicism."
    },
    {
        "user": "ptcounterpt",
        "time": "2024-10-26 00:09:11",
        "message": "Some real American patriots! MAGA is a terrorist group: the true enemy within."
    },
    {
        "user": "MargieGunderson70",
        "time": "2024-10-26 00:15:41",
        "message": "Dude is 63. That's old enough to be able handle yourself in public, no? Pathetic."
    },
    {
        "user": "Great_cReddit",
        "time": "2024-10-26 00:25:01",
        "message": "This is how they behave when he *isn't* in office. Imagine how this is going to ramp up if he's elected..."
    },
    {
        "user": "antsmasher",
        "time": "2024-10-26 00:37:20",
        "message": "These people act like entitled children."
    },
    {
        "user": "HallucinogenicFish",
        "time": "2024-10-26 00:38:23",
        "message": "63-year-old voter punches 69-year-old poll worker. \n\nSMH 🤦🏼‍♀️"
    },
    {
        "user": "Ok-disaster2022",
        "time": "2024-10-26 00:50:40",
        "message": "I hope this person has the books thrown at them as and loses the right to vote as a felon. \n\n\nMay they spend a decade in prison. \n\n\nPoll workers are more important to society that cops."
    },
    {
        "user": "toejam78",
        "time": "2024-10-26 00:55:57",
        "message": "Trump: I’ll pay his legal fees.\n\n[he won’t]"
    },
    {
        "user": "oflowz",
        "time": "2024-10-26 01:29:16",
        "message": "Well silver lining is  he won’t be be to vote anymore after his assault conviction in Texas."
    },
    {
        "user": "Tokyo-MontanaExpress",
        "time": "2024-10-26 02:39:06",
        "message": "Assaulting a poll worker is a literal act of terrorism: you're violently scaring voters away from the voting center."
    },
    {
        "user": "wormee",
        "time": "2024-10-26 02:59:09",
        "message": "Trump has shown them that rules don’t matter. Look at how Leon doesn’t care about the DOJ warning. Consequences are for suckers and losers."
    },
    {
        "user": "One_Hot_Doggy",
        "time": "2024-10-26 03:06:05",
        "message": "Party of law and order ladies and gentlemen"
    },
    {
        "user": "Day_of_Demeter",
        "time": "2024-10-26 03:19:31",
        "message": "MAGA thinks they own the country and that they're above the law. They think everyone else are a class of people the law binds but doesn't protect, and that *they're* the ones who the law protects but doesn't bind."
    },
    {
        "user": "Inocain",
        "time": "2024-10-26 03:30:47",
        "message": "Throwing away voting rights to own the libs."
    },
    {
        "user": "NachosWithJalapenos",
        "time": "2024-10-26 03:31:47",
        "message": "Christ, he's Hispanic.  You'll be the first one on the trains, genius."
    },
    {
        "user": "t_11",
        "time": "2024-10-25 23:54:46",
        "message": "Hillary was wrong to call the deplorable…\n\n😒😒"
    },
    {
        "user": "Important_Raccoon667",
        "time": "2024-10-26 00:09:35",
        "message": ">\"The victim is no worse for wear other than some marks to his face,” Salazar said, adding the poll worker didn’t have to be hospitalized.\n\nI guess this Texas sheriff considers the trauma of physical assault/battery a nothingburger. Not exactly surprised unfortunately."
    },
    {
        "user": "love_is_an_action",
        "time": "2024-10-26 00:20:08",
        "message": "What a dumb fuckin’ chimp."
    },
    {
        "user": "mizkayte",
        "time": "2024-10-26 00:32:05",
        "message": "The party of law and order."
    },
    {
        "user": "Mo_Zen",
        "time": "2024-10-26 01:01:02",
        "message": "Turn Texas Blue."
    },
    {
        "user": "i_and_eye",
        "time": "2024-10-26 01:01:29",
        "message": "They're a bunch of violent weirdos."
    },
    {
        "user": "LoveButton",
        "time": "2024-10-26 01:09:54",
        "message": "Aww, I can't wear my cultist garb while I vote against my best interests?! Damn liberals and their desire to keep the world fair for everyone..."
    },
    {
        "user": "BleuBoy777",
        "time": "2024-10-26 01:25:59",
        "message": "The party of law and order y'all. \"Just comply\" only applies to brown and black folk I guess..."
    },
    {
        "user": "crazyhorseeee",
        "time": "2024-10-26 01:38:56",
        "message": "They arrested him. Now charge and convict him. Send a clear message."
    },
    {
        "user": "Stranger-Sun",
        "time": "2024-10-26 02:31:57",
        "message": "Glad he was arrested. Some time away from society might help this asshole."
    },
    {
        "user": "Fuckaliscious1",
        "time": "2024-10-26 02:33:49",
        "message": "Lock him up!  \n\nSounds like felony assault in Texas since the victim was elderly and multiple punches were thrown."
    },
    {
        "user": "993targa",
        "time": "2024-10-26 03:10:20",
        "message": "Another MAGA felon"
    },
    {
        "user": "Phydorex",
        "time": "2024-10-26 03:25:06",
        "message": "Filthy Violent Democrats who...\n\nWait, what's that? I am being told in my non existent earpiece that its the other way around.\n\nMeanwhile..."
    },
    {
        "user": "PropofolMargarita",
        "time": "2024-10-26 00:29:30",
        "message": "And here is the problem if we ever do rid ourselves of Trump.\n\nHis violent trash supporters will still be violent trash."
    },
    {
        "user": "Outside_Crafty",
        "time": "2024-10-25 23:31:21",
        "message": "What a bunch of losers."
    },
    {
        "user": "ImaginationBig8868",
        "time": "2024-10-25 23:35:26",
        "message": "Off to jail"
    },
    {
        "user": "MK5",
        "time": "2024-10-25 23:39:00",
        "message": "\"Ah, arrogance and stupidity all in the same package. How efficient of you!\""
    },
    {
        "user": "Radiant-Disaster-618",
        "time": "2024-10-26 00:00:55",
        "message": "repub dickwads, each and every one."
    },
    {
        "user": "math-yoo",
        "time": "2024-10-26 00:03:21",
        "message": "Do you want to lose your right to vote, this is how you get ants."
    },
    {
        "user": "kathryn2a",
        "time": "2024-10-26 00:11:53",
        "message": "American please respect the rules. Show the world we can get through this election without violence. The children of this country need us to model that we can have peaceful elections. They are already watching and listening to candidates lies, bullying, name calling, inappropriate sexual comments, basically everything they are exposed to is what we are telling kids not do. But it is ok for presidential candidates."
    },
    {
        "user": "KiscoKid1",
        "time": "2024-10-26 00:20:12",
        "message": "Rip up his ballot. If you can’t follow the rules, you can’t vote. Simple"
    },
    {
        "user": "GamingGeekette",
        "time": "2024-10-26 00:38:09",
        "message": "I voted today and saw signs posted saying the same thing. I was super glad not to witness any assaults because people just listened."
    },
    {
        "user": "Adexavus",
        "time": "2024-10-26 00:40:55",
        "message": "The douch bag in front of me in Florida had a maga hat. No one else in the long stretch in the ling had anything political but 1 guy"
    },
    {
        "user": "craigeryjohn",
        "time": "2024-10-26 00:52:32",
        "message": "I voted today and a Maga Hatter slipped through only to be reprimanded for wearing it after he had voted. He said he made a new law and didn't take it off. "
    },
    {
        "user": "gnatdump6",
        "time": "2024-10-26 00:58:07",
        "message": "Domestic Terrorism"
    },
    {
        "user": "dogswelcomenopeople",
        "time": "2024-10-26 01:14:17",
        "message": "He SHOULD be charged with Assault and Battery as well as Election interference!"
    },
    {
        "user": "Kantjil1484",
        "time": "2024-10-26 01:26:40",
        "message": "Takes a real douchebag to take on an old man. It’s Friday, jerk gets to sit in jail til Monday. 🤬"
    },
    {
        "user": "thefragileapparatus",
        "time": "2024-10-26 01:30:08",
        "message": "I used to live in Texas and in 2008 I had an Obama sticker on my vehicle. When I went to vote an election worker walked up to me and told me to move my vehicle further away from the polling place. Naturally I punched him in the face."
    },
    {
        "user": "chaos_cloud",
        "time": "2024-10-26 01:58:29",
        "message": "MAGAts are nasty, violent criminals."
    },
    {
        "user": "Unfiltered_America",
        "time": "2024-10-26 02:19:40",
        "message": "\"The sheriff said “several dozen deputies” have been taken off patrol duties to respond exclusively to any issues arising at polling sites during the ongoing early voting period. Up until Thursday night, most incidents were deemed “swatting-type” calls in which callers report a situation that isn’t happening\"\n\n\nMaga are terrorists."
    },
    {
        "user": "Minute-Plantain",
        "time": "2024-10-26 02:27:17",
        "message": "The guy in the MAGA hat is voting for Trump in the belief that he will bring in an America where people like him get to punch poll workers with zero consequences."
    },
    {
        "user": "PadreSJ",
        "time": "2024-10-26 02:31:23",
        "message": "Isn't violence at a polling site a felony enhancement?\n\nWould be a shame if he lost his ability to vote in the future."
    },
    {
        "user": "crashomon",
        "time": "2024-10-26 02:50:34",
        "message": "Two MAGA had to cover their shirts today in Chicago once inside the polling place. We don’t mess around."
    },
    {
        "user": "TeacherRecovering",
        "time": "2024-10-26 02:53:07",
        "message": "Flordia allows pro Harris and Pro Putin T shirts and hats.\nBut not talking to people.\n\n\nI want to set up a table and give out \"loaner\" t-shirts.  "
    },
    {
        "user": "madammoiselle85",
        "time": "2024-10-26 02:57:47",
        "message": "What else does anyone expect from maga, they are full of hate and violence."
    },
    {
        "user": "No-Heat8467",
        "time": "2024-10-26 03:05:55",
        "message": "Perfect, one less maga voter"
    },
    {
        "user": "CuriositySauce",
        "time": "2024-10-26 03:08:39",
        "message": "I believe the line at every polling (or at least most) that explicitly prohibits campaigning beyond it isn’t just for the local politicians. It’s to neutralize any candidate endorsement expressed through attire, signage, or verbal address so a fair, neutral, and no-pressure environment is maintained for the voting public. Not a new rule, just respectful civic expectations to minimize disruptions. The hate wearing jackass was waaaaaaay in the wrong and unwittingly demonstrated why this policy exists."
    },
    {
        "user": "spam__likely",
        "time": "2024-10-26 03:14:12",
        "message": "I got yelled at by an old  guy, same situation, lucky is wife was there too so she made him shut up and take off the hat."
    },
    {
        "user": "ourredsouthernsouls",
        "time": "2024-10-26 03:16:18",
        "message": "This should be a fucking felony."
    },
    {
        "user": "thetacotony",
        "time": "2024-10-26 03:16:33",
        "message": "Getting felony assault charges to own the libs 😂"
    },
    {
        "user": "smartypants333",
        "time": "2024-10-26 03:18:38",
        "message": "\"No worse for wear, except for some marks on his face.\"\n\nThe dude punched a 69 year old man in the face hard enough to leave marks.\n\nLock him up."
    },
    {
        "user": "druscarlet",
        "time": "2024-10-26 03:31:55",
        "message": "I would press charges and sue them for bodily harm.  Their life would not be worth living."
    },
    {
        "user": "YellojD",
        "time": "2024-10-26 03:33:17",
        "message": "Poll worker in 2016 (Sacramento) made me leave and take off my Bernie Sanders shirt before voting in 2016. “Electioneering” or whatever it’s called. \n\nI left, turned the shirt inside out, went back in and voted. Never once thought about punching the poll worker."
    },
    {
        "user": "Lynda73",
        "time": "2024-10-26 03:36:06",
        "message": ">The victim is no worse for wear other than some marks to his face,” Salazar said, adding the poll worker didn’t have to be hospitalized.\n\nThat seems rather dismissive."
    },
    {
        "user": "SportGamerDev0623",
        "time": "2024-10-26 03:41:07",
        "message": "Republicans are a law and order people except for when it applies to them…"
    },
    {
        "user": "CrystalSplice",
        "time": "2024-10-26 03:42:49",
        "message": "I’m honestly surprised it took this long for something like this to happen. It will get worse."
    },
    {
        "user": "Dapper-Percentage-64",
        "time": "2024-10-26 03:45:12",
        "message": "When you say \" asking the public \" to tone down the anger  ,could we just read maga maniacs ?"
    },
    {
        "user": "Javasndphotoclicks",
        "time": "2024-10-26 00:51:54",
        "message": "A 63-year-old going to jail for a wannabe dictator."
    },
    {
        "user": "GDPisnotsustainable",
        "time": "2024-10-25 23:46:17",
        "message": "Russia loves this"
    },
    {
        "user": "IdahoDuncan",
        "time": "2024-10-26 00:14:54",
        "message": "Crimes and misdemeanors party."
    },
    {
        "user": "Msmdpa",
        "time": "2024-10-26 00:16:16",
        "message": "One weakling defending another."
    },
    {
        "user": "nuckle",
        "time": "2024-10-26 00:17:34",
        "message": "Of course they did. Absolute bottom of the barrel people."
    },
    {
        "user": "sirferrell",
        "time": "2024-10-26 00:37:52",
        "message": "And so it begins"
    },
    {
        "user": "HappyFunNorm",
        "time": "2024-10-26 00:38:09",
        "message": "Yeah. That sounds about right. "
    },
    {
        "user": "Evening_Jury_5524",
        "time": "2024-10-26 00:55:09",
        "message": "Lead poisoning is sad"
    },
    {
        "user": "Fridaybird1985",
        "time": "2024-10-26 01:02:13",
        "message": "Ironically I feel good about this be a the pol worker is ok and they arrested the guy. Looks like Texas is taking pol security seriously."
    },
    {
        "user": "FiFiLB",
        "time": "2024-10-26 01:06:27",
        "message": "So please tell me he got arrested before he got the chance to vote."
    },
    {
        "user": "Darroy",
        "time": "2024-10-26 01:12:24",
        "message": "In Ohio, we are also not supposed to wear political messages while going to the poles.\n\nAt least one county (each county controls its own elections in Ohio) has instructed its election workers to not say a damn thing this year.\n\nThey have also handed out materials on the CLARA method of de-escalation."
    },
    {
        "user": "basketballsteven",
        "time": "2024-10-26 01:18:17",
        "message": "And so the violence begins to be reported."
    },
    {
        "user": "Lord_Yoon",
        "time": "2024-10-26 01:26:38",
        "message": "MAGA loves to point to the other side they’re the violent one lol"
    },
    {
        "user": "TheWhiteGuardian",
        "time": "2024-10-26 01:32:36",
        "message": "The party of law and order huh."
    },
    {
        "user": "whelpthatslife",
        "time": "2024-10-26 01:33:35",
        "message": "Always republicans always republicans"
    },
    {
        "user": "The_Albinoss",
        "time": "2024-10-26 01:36:24",
        "message": "MAGA is a bunch of angry, stupid apes. There is no such thing as a good person in that camp."
    },
    {
        "user": "ddiddy171",
        "time": "2024-10-26 01:40:09",
        "message": "He can’t be without his maga hat for 5 minutes 🤦‍♀️"
    },
    {
        "user": "-Here-There-",
        "time": "2024-10-26 01:42:08",
        "message": "Old bastard would probably suck on Trump’s fat tits to console himself from those scary mean poll workers. MAGA mfs are soft as hell."
    },
    {
        "user": "chrisnlnz",
        "time": "2024-10-26 01:57:16",
        "message": "Just a fascist doing fascist things."
    },
    {
        "user": "moosejaw296",
        "time": "2024-10-26 02:05:32",
        "message": "Genuinely surprised that is a Texas law"
    },
    {
        "user": "terrible_rider",
        "time": "2024-10-26 02:11:55",
        "message": "I’m done. I’m gonna go after these fucks like nobody’s business."
    },
    {
        "user": "funksoldier83",
        "time": "2024-10-26 02:14:06",
        "message": "Charge that POS with terrorism and election interference."
    },
    {
        "user": "No_Clue_7894",
        "time": "2024-10-26 02:17:46",
        "message": "If only he knew he knew\n\n[Trump’s Project 2025 Raises Prescription Drug Costs For Seniors](http://democrats-budget.house.gov/trumps-project-2025-raises-prescription-drug-costs-seniors)\n\n\n\nIN THE SPOTLIGHT\n \n\n[Trump Administration Showing Hostility Towards People with Disabilities](https://www.pwdf.org/trump-administration-showing-hostility-towards-people-with-disabilities/)\nBy: PWDF Program Manager for Public Awareness and Education, Naveen Makhdum\n\n\nThe democrats [Medicare Drug Price Negotiation Program: Negotiated Prices for Initial Price Applicability Year 2026](https://www.cms.gov/newsroom/fact-sheets/medicare-drug-price-negotiation-program-negotiated-prices-initial-price-applicability-year-2026)\n\nMore homeless veterans and boomers if trump returns \n\n[Trump threatens Social Security’s stability](https://www.miningjournal.net/opinion/2024/10/trump-threatens-social-securitys-stability/)\n\n\n[Imminent catastrophic public danger’: Hundreds of doctors sound new alarm about Trump](https://www.reddit.com/r/AnythingGoesNews/s/3LNr3CvBZ6)"
    },
    {
        "user": "alien_from_Europa",
        "time": "2024-10-26 02:18:01",
        "message": "I would normally be against having federal agents or the National Guard at polling places  but it seems necessary. I wouldn't trust local police to handle this. Someone is going to shoot one up."
    },
    {
        "user": "jkjustjoshing",
        "time": "2024-10-26 02:18:58",
        "message": "I’m a poll worker in upstate NY. Interestingly, MAGA hats are allowed in NY polling locations, since it’s not explicitly referencing 1) a candidate on the ballot, 2) a party on the ballot, or 3) a ballot proposal on the ballot. \n\nA Trump shirt or a “Vote Red” (I believe “red/blue” count as a party reference) hat wouldn’t be allowed. \n\nDuring training they asked if a “Biden” shirt would be allowed and we all said no. Trick question, Biden isn’t on the ballot!"
    },
    {
        "user": "pantib01",
        "time": "2024-10-26 02:22:27",
        "message": "Just the kind of behavior I’d expect from the maga cult follower"
    },
    {
        "user": "cometshoney",
        "time": "2024-10-26 02:23:16",
        "message": "Color me shocked. 🙄🙄 An old Trump supporter punching an even older poll worker over his stupid hat? The one he was supposed to take off upon entering the building simply out of common courtesy, anyway? Who could have seen that coming from a guy who thinks every non-MAGA is the enemy within? This will be repeated many, many times before November 5, and we still have the prayer circle freaks and other assorted weirdos assembling outside of the counting centers to look forward to."
    },
    {
        "user": "gmil3548",
        "time": "2024-10-26 02:29:03",
        "message": "Hopefully they throw him in jail until 11/6, that’s the karma he deserves"
    },
    {
        "user": "Jadziyah",
        "time": "2024-10-26 02:30:58",
        "message": "And it won't be the last time it happens this season either"
    },
    {
        "user": "WaitUntilTheHighway",
        "time": "2024-10-26 02:31:35",
        "message": "They’re a healthy bunch who really have a mature handle on their big emotions."
    },
    {
        "user": "Brilliant-Message562",
        "time": "2024-10-26 02:32:09",
        "message": "UH OH sounds like someone won’t be voting at all in the future! Dumb ass"
    },
    {
        "user": "Fall-of-Enosis",
        "time": "2024-10-26 02:57:43",
        "message": "Thank you Oregon, that in all my years of voting, I've never had to go to a polling station or wait in line to cast my vote."
    },
    {
        "user": "Wenzdayzmom",
        "time": "2024-10-26 02:59:09",
        "message": "But Amurka is a FREE COUNTRY! I can do anything I want, anytime. But YOU — no, you must do what I want!"
    },
    {
        "user": "Representative-Sir97",
        "time": "2024-10-26 03:05:28",
        "message": "Can you spell e-x-a-m-p-l-e?"
    },
    {
        "user": "shonuff_supreme",
        "time": "2024-10-26 03:45:18",
        "message": "What a snowflake"
    },
    {
        "user": "Quinnna",
        "time": "2024-10-26 03:49:38",
        "message": "This guy will be a hero and on Fox news representing the law and order party who votes for a felon."
    },
    {
        "user": "More_Set_7268",
        "time": "2024-10-26 03:53:08",
        "message": "Typical Nazi sympathizer behavior. Scum of the earth"
    },
    {
        "user": "tooheavybroo",
        "time": "2024-10-26 03:54:12",
        "message": "Brought to you by the party of “law and order”"
    },
    {
        "user": "StubbornNobody",
        "time": "2024-10-26 03:56:38",
        "message": "That's definitely going to end well for them. /s"
    },
    {
        "user": "Pxlfreaky",
        "time": "2024-10-26 03:58:49",
        "message": "This definitely won’t be the only time this happens this election. I would not want to be anywhere near red voting districts."
    },
    {
        "user": "Phont22",
        "time": "2024-10-26 03:59:19",
        "message": "Terrorists gonna terrorize."
    },
    {
        "user": "Independent-Bug-9352",
        "time": "2024-10-26 03:59:42",
        "message": "If we don't resolve this people's inability to sort truth from falsehood and instead seeking affirmation instead of information, then Democracies around the world are going to crumble and it's going to get very bad very quickly.\n\nBillionaires and corporations and foreign operatives and shitty media is destroying our nation and the world."
    },
    {
        "user": "FlashyPaladin",
        "time": "2024-10-26 04:04:23",
        "message": "lol, he can’t vote now"
    },
    {
        "user": "Kazooguru",
        "time": "2024-10-25 23:37:30",
        "message": "Lutzenberger. That sounds like a nice Nazi name. His family probably immigrated to the U.S. after the war because the Nazis destroyed Germany. Jesse Lutzenberger wants to MAKE AMERICA GERMANY AGAIN"
    },
    {
        "user": "Killerderp",
        "time": "2024-10-26 01:05:46",
        "message": "Stay classy, Texas 🙄"
    },
    {
        "user": "Listening_Heads",
        "time": "2024-10-26 01:07:22",
        "message": "Imagine how much trouble he would be in if it wasn’t Texas."
    },
    {
        "user": "Prudent_Coyote5462",
        "time": "2024-10-26 02:42:20",
        "message": "Stay classy, TX"
    },
    {
        "user": "Girlindaytona",
        "time": "2024-10-26 03:05:22",
        "message": "Texas will treat him like a hero"
    },
    {
        "user": "mediocretes",
        "time": "2024-10-26 03:27:29",
        "message": "That voter should lose their citizenship."
    },
    {
        "user": "SurroundTop1863",
        "time": "2024-10-26 01:00:16",
        "message": "What an idiot. The poll workers are doing their job."
    },
    {
        "user": "Hair_I_Go",
        "time": "2024-10-26 01:05:09",
        "message": "I’m so glad I voted early. I’ve been worried that the 5 th will just be a shit show, I can stop worrying about it now"
    },
    {
        "user": "Mtbruning",
        "time": "2024-10-26 01:23:43",
        "message": "Can you vote from jail?"
    },
    {
        "user": "CoolOPMan",
        "time": "2024-10-26 01:48:34",
        "message": "Trump voters are all miserable unhappy dumb fucks"
    },
    {
        "user": "downtownfreddybrown",
        "time": "2024-10-26 01:51:26",
        "message": "Now we know who ain't voting this year"
    },
    {
        "user": "scotchyscotch18",
        "time": "2024-10-26 01:53:35",
        "message": "What a good way to make yourself ineligible to vote in future elections"
    },
    {
        "user": "Natural_Fix1926",
        "time": "2024-10-26 01:55:11",
        "message": "Fuck these Troglodytes.  And people want to talk about Antifa?!"
    },
    {
        "user": "zoo32",
        "time": "2024-10-26 01:55:22",
        "message": "Please vote ppl. And if you have any decency, don’t vote for the convicted felon and rapist"
    },
    {
        "user": "YouWereBrained",
        "time": "2024-10-26 01:55:25",
        "message": "Probably some country asshole"
    },
    {
        "user": "davechri",
        "time": "2024-10-26 01:56:00",
        "message": "“The party of law and order.”"
    },
    {
        "user": "Unusual-Answer-3422",
        "time": "2024-10-26 02:00:05",
        "message": "I'm sick and tired of these entitled fucks. I hope he is vigorously prosecuted."
    },
    {
        "user": "AlexKingstonsGigolo",
        "time": "2024-10-26 02:00:31",
        "message": "Dear republicans,\n\nDo you really want to vote in accordance with this fool? Do you want to be the party of political violence?"
    },
    {
        "user": "castion5862",
        "time": "2024-10-26 02:09:03",
        "message": "I hope they were arrested for assault"
    },
    {
        "user": "ClaytonRumley",
        "time": "2024-10-26 02:10:29",
        "message": "When will these commie fascist libs get it? HIS BODY, HIS CHOICE!\n\nCheckmate, libs.\n\n/s"
    },
    {
        "user": "BloopityBlue",
        "time": "2024-10-26 02:46:17",
        "message": "Stay classy maga"
    },
    {
        "user": "Wolfspirit4W",
        "time": "2024-10-26 02:48:57",
        "message": "I did early voting in Texas today and there was a woman in line that had a \"Team Trump 45\" hat. No one called her out on it and a poll worker even directly interacted with her while they were straightening the line..."
    },
    {
        "user": "uofmguy33",
        "time": "2024-10-26 02:55:15",
        "message": "Keep it classy MAGA lol"
    },
    {
        "user": "GOPAuthoritarianPOS",
        "time": "2024-10-26 02:57:58",
        "message": "*shocked Pikachu face*"
    },
    {
        "user": "brett15m",
        "time": "2024-10-26 03:13:50",
        "message": "I have a very hard time coming up with any reason to punch a 70 year old human.  70 year old anything else, watch ya back"
    },
    {
        "user": "PoopieButt317",
        "time": "2024-10-26 03:17:46",
        "message": "Still lives with mom and dad"
    },
    {
        "user": "NotSpaghettiTuesday",
        "time": "2024-10-26 03:20:41",
        "message": "Classy 🤬"
    },
    {
        "user": "sleaziep",
        "time": "2024-10-26 03:27:27",
        "message": "Is it just me, or does it seem like nobody involved in this report was prepared to be on camera?"
    },
    {
        "user": "Due-Egg4743",
        "time": "2024-10-26 03:33:01",
        "message": "It's probably best to blend in with the crowd at your polling spot. It's pretty \"yee haw\" in Tennessee and plenty of people wear cowboy hats casually out in public."
    },
    {
        "user": "keajohns",
        "time": "2024-10-26 03:55:43",
        "message": "But there are good people on both sides."
    },
    {
        "user": "reddsal",
        "time": "2024-10-26 04:00:35",
        "message": "He was arrested and charged.  All you Law and Order MAGAts don’t like it much when the laws get applied to you, do you?"
    },
    {
        "user": "pogopogo890",
        "time": "2024-10-26 04:01:25",
        "message": "63, I guess that’s still a boomer, getting dangerously close to genX"
    },
    {
        "user": "Chummyiota",
        "time": "2024-10-26 04:03:05",
        "message": "The piece of shits name is Jesse Lutzenberger. Come on, internet. Do your thing."
    },
    {
        "user": "VVynn",
        "time": "2024-10-26 04:06:44",
        "message": "Republicans don’t care about laws."
    },
    {
        "user": "Annual-Jump3158",
        "time": "2024-10-26 04:06:47",
        "message": "This is not how elections should be.\n\nAnd anybody with half a brain knows that it's all the product of the baseless fear-mongering on the right.  It's always \"pedophiles\", \"eating babies\", \"mystery laptops with damning evidence\", and always, always with zero solid evidence to at least attempt to substantiate what are already batshit insane accusations.\n\nThese escalations are not sane."
    },
    {
        "user": "Vast_Revolution_4513",
        "time": "2024-10-26 04:07:33",
        "message": "Do I agree with this ….. ABSOLUTELY NOT….. as Americans I wish and pray we could get back to respecting one another and peace. Although, weird rule in my opinion. You wouldn’t tell someone going to an OU/TX game they can’t wear their fan gear ?! Wish the government would get back to enforcing legit laws and real probs instead of dumb ones… again just my opinion and I’m entitled to it without hate and backlash."
    },
    {
        "user": "Top-Sell4574",
        "time": "2024-10-26 04:08:34",
        "message": "Hillary was too kind when she called them deplorable. "
    },
    {
        "user": "Wtnesbitt10",
        "time": "2024-10-26 02:46:46",
        "message": "It’s Texas aren’t they all on the same side? WTF!"
    },
    {
        "user": "CanWeTalkEth",
        "time": "2024-10-25 23:51:43",
        "message": "Just for context, voters in some states are allowed to wear campaign gear into a polling place to cast a vote and leave. \n\nBattery is never acceptable of course, this is more of a PSA and to let folks know this isn’t a universal law."
    },
    {
        "user": "SetterOfTrends",
        "time": "2024-10-26 00:40:13",
        "message": "Ya damned deep state satanist — thar ain’t gonna be no votin’ booths next time, d’ya hear‽‽ An’ Trump’s gonna make ever’body wear one-a these gaddamn hats er else!!"
    },
    {
        "user": "FresherAllways",
        "time": "2024-10-26 00:18:58",
        "message": "Arm the pollworkers. Let them defend the process, the ballots, the boxes, and themselves, with lethal force."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 02:15:24",
        "message": "[deleted]"
    },
    {
        "user": "mdog73",
        "time": "2024-10-26 01:52:57",
        "message": "Why can’t you wear a hat when voting?"
    },
    {
        "user": "cyberbubba2000",
        "time": "2024-10-26 03:32:29",
        "message": "Did you hear about the hate filled democrat who lied over and over and over and over and over and over and over and over?"
    },
    {
        "user": "Key-Ranger-8528",
        "time": "2024-10-26 00:42:14",
        "message": "It was probably an ANTIFA!!!"
    },
    {
        "user": "Ill_Brief7498",
        "time": "2024-10-25 23:39:16",
        "message": "At my polling place in Texas there was because they gave up an “ advice on how to vote, for democrats “ it was weird and a candidate for one of the local offices asking people to vote for them. Not sure what party the candidate belonged to but the whole thing was weird! They were not there today!?! Just weird stuff!"
    },
    {
        "user": "Deleted",
        "time": "2024-10-25 23:22:27",
        "message": "[deleted]"
    },
    {
        "user": "mizkayte",
        "time": "2024-10-26 00:32:54",
        "message": "I always laugh at their law and order BS. Such hypocritical asses. My BIL has mouthed off on it despite his multiple DUIs and jail time."
    },
    {
        "user": "Uptownbandit",
        "time": "2024-10-26 00:23:19",
        "message": "Texas poll worker here. As long as your clothing doesn't have a candidate's name, a Party name, a party logo, or a particularly identifiable slogan such as \"Make America Great Again\" you shouldn't have a problem. Things may vary around the State, so I'm just going by my training. As an example we had a discussion about whether or not \"When we fight, we win\" was enough of an identifiable slogan that it wouldn't be allowed, but the general consensus was it was not, and I'm in a very Red County."
    },
    {
        "user": "justinbaumann",
        "time": "2024-10-26 00:59:53",
        "message": "A Fascist. This is what Fascists do."
    },
    {
        "user": "OverlyExpressiveLime",
        "time": "2024-10-26 01:03:01",
        "message": "They care about the law when they are told to. Bunch of lemmings in a cult"
    },
    {
        "user": "Morbidly-Obese-Emu",
        "time": "2024-10-26 01:37:23",
        "message": "They care about the law when it hurts the people they don’t like."
    },
    {
        "user": "crudedrawer",
        "time": "2024-10-26 01:37:16",
        "message": "They’re just bad people"
    },
    {
        "user": "yoho808",
        "time": "2024-10-26 01:03:50",
        "message": "But they are the LaW aNd OrDeR party!"
    },
    {
        "user": "RLVNTone",
        "time": "2024-10-26 01:51:00",
        "message": "Literally"
    },
    {
        "user": "jerfoo",
        "time": "2024-10-26 02:07:27",
        "message": "But they do care about \"law and order\" if it's aimed at the right people"
    },
    {
        "user": "jthill",
        "time": "2024-10-26 02:41:27",
        "message": "Soft on crime."
    },
    {
        "user": "nononoh8",
        "time": "2024-10-26 03:05:04",
        "message": "Hope he was hauled of in handcuffs and they do time."
    },
    {
        "user": "SaltedPaint",
        "time": "2024-10-26 03:15:27",
        "message": "MAGA doesn't give a fuck about the law when it doesn't matter where you show your support"
    },
    {
        "user": "ekalav83",
        "time": "2024-10-26 03:19:37",
        "message": "The other day I heard on NPR of some guy saying It apparently inspires him, a convicted felon, to run for office. It is infact legal for a convicted felon to still run for office."
    },
    {
        "user": "talondigital",
        "time": "2024-10-26 03:24:52",
        "message": "As it turns out, Democrats are the party of Law and Order."
    },
    {
        "user": "theparadisecrab",
        "time": "2024-10-25 23:22:15",
        "message": "A 69-year old too. These magats are disgusting!"
    },
    {
        "user": "No_Beginning_6834",
        "time": "2024-10-25 23:48:10",
        "message": "His first response was actually to comply so he could vote for his God emperor. Then chose violence after that. So just the act of voting for his cult leader made him think he was the law and that violence was appropriate."
    },
    {
        "user": "Immediate_Loquat_246",
        "time": "2024-10-25 23:34:26",
        "message": "I'm not surprised considering what happened to the Arlington cemetery staff."
    },
    {
        "user": "No_Doubt2922",
        "time": "2024-10-25 23:52:17",
        "message": "The party of angry old men who hate the world."
    },
    {
        "user": "Uptownbandit",
        "time": "2024-10-26 00:23:02",
        "message": "Some guy was throwing a fit last night, because he was head to toe maga gear and they kicked him out. He was screaming “I’m calling the governor!” They responded “oh good! Maybe he can explain the law to you in a way you’ll understand.”"
    },
    {
        "user": "Plagiarised-Name",
        "time": "2024-10-26 00:02:14",
        "message": "A lot of conservatives have anger problems and are intensely uncomfortable to be around in public when something sets them off, they make complete jackasses out of themselves but in their brain they are coming off as tough or something."
    },
    {
        "user": "MyHusbandIsGayImNot",
        "time": "2024-10-26 01:26:05",
        "message": "After seeing how these people reacted to mask mandates, I’m not surprised."
    },
    {
        "user": "dougmc",
        "time": "2024-10-26 01:30:56",
        "message": "> And your first response is to punch the person who isn’t even getting paid. \n\nMinor nit: most (all?) poll workers here are paid.  Not a lot, but still paid.\n\nedit:\n\nIt's [$20-$22/hr](https://votetravis.gov/current-election-information/become-an-election-worker/). so more than I thought!"
    },
    {
        "user": "Raa03842",
        "time": "2024-10-26 00:23:38",
        "message": "The party of law and order. What a joke."
    },
    {
        "user": "whabt",
        "time": "2024-10-26 01:25:09",
        "message": "For what it's worth, almost all pollworkers get some compensation, usually between $100-350. It's too important that people actually show up and do the work to gamble with volunteers, typically."
    },
    {
        "user": "babyFaceAboveDaSink",
        "time": "2024-10-26 01:37:37",
        "message": "Saw that during COVID. Whining about wearing masks"
    },
    {
        "user": "nuclearswan",
        "time": "2024-10-26 00:36:23",
        "message": "Poll workers get paid."
    },
    {
        "user": "warblingContinues",
        "time": "2024-10-26 02:18:12",
        "message": "On par for MAGA.  They are literal Nazis, thinking they can do whatever they want whenever they want."
    },
    {
        "user": "TheUpperHand",
        "time": "2024-10-25 23:35:29",
        "message": "States (lefts and) rights"
    },
    {
        "user": "alittlelebowskiua",
        "time": "2024-10-26 01:41:41",
        "message": "They don't get paid? Wtaf?! Why don't they get paid exactly?"
    },
    {
        "user": "Yugan-Dali",
        "time": "2024-10-26 01:43:41",
        "message": "The GOP is the party of law and order! (I lay down the law and order you around.) Family values! (Trump paid a porn star a high value price when he cheated on his family.)"
    },
    {
        "user": "RipCityGGG",
        "time": "2024-10-26 02:00:00",
        "message": "Maybe he said get that shit off you head you fuckwit"
    },
    {
        "user": "cometshoney",
        "time": "2024-10-26 02:25:25",
        "message": "They get $20 per day in my state. Surely an old person should expect to be physically assaulted for that kind of cash, right? 🙄🙄 \n\nI seriously don't understand those people. Why are they so damn mad all the time?"
    },
    {
        "user": "fakeuser515357",
        "time": "2024-10-26 02:31:36",
        "message": "Imagine being told \"you need to remove your hat\" and your response is violence."
    },
    {
        "user": "Hikingcanuck92",
        "time": "2024-10-26 03:14:21",
        "message": "Wait, are poll workers not paid in the US? That’s messed up. \n\nI’m Canada, depending on your role, it’s like 3-400 per day! (And yeah, we get more that one day to vote…usually there’s like a week of advance in person voting)"
    },
    {
        "user": "ghostnthegraveyard",
        "time": "2024-10-26 03:22:10",
        "message": "In a library"
    },
    {
        "user": "DeeBagwell",
        "time": "2024-10-26 03:35:42",
        "message": "> Your body, my choice!\n\nWouldn't that also apply to the people telling others what hats they can wear?"
    },
    {
        "user": "Jenks_in_Wonderland",
        "time": "2024-10-26 03:38:38",
        "message": "I hope that he enjoys jail. Hopefully their jail cell will include a signed fist from cellmate DJT.2025. "
    },
    {
        "user": "Electronic_Macaron_9",
        "time": "2024-10-26 03:48:09",
        "message": "\"Take yer hat off boy, that's a $100 dollar voting booth\""
    },
    {
        "user": "DemThrowaways478",
        "time": "2024-10-26 04:07:39",
        "message": "Murder all MAGAs"
    },
    {
        "user": "AbsoluteZeroUnit",
        "time": "2024-10-26 03:05:17",
        "message": "This story is awful, but those are not the details of the story and you are spreading disinformation.\n\nHe was told to take it off.  \n\nHe took it off.\n\nHe cast his ballot.  \n\nHe began walking out.  \n\nHe put the hat back on.\n\nHe was told he can't do that and was escorted out.\n\nHe punched a 69-year-old volunteer.\n\nEverything about this guy is garbage, but he didn't walk up to a friendly \"hey there neighborino, I see you have a fashionable red hat on, but unfortunately, you'll have to take that off while you're in here\" and immediately start pummelling.\n\nWhat he did was unacceptable, but if things got to a point where he had to be escorted out, there was clearly some escalation already happening."
    },
    {
        "user": "hugepedlar",
        "time": "2024-10-25 23:57:45",
        "message": "Dude should be charged with election interference too, or whatever the appropriate obstruction related charge is."
    },
    {
        "user": "chad2261",
        "time": "2024-10-26 00:11:31",
        "message": "lol did anyone actually wonder? The headlines write themselves and frankly I don’t understand how anyone with a republican affliction doesn’t just live in a constant state of mortified second hand embarrassment."
    },
    {
        "user": "minus2cats",
        "time": "2024-10-26 01:18:49",
        "message": "> “There was nothing life-threatening, but it was still an ugly incident where I can’t think of something like this happening in my time as sheriff,” Salazar said.\n\nSheriff is a dipshit, incidents like this have been common since MAGA started."
    },
    {
        "user": "Chess42",
        "time": "2024-10-26 01:14:10",
        "message": "They were wearing a MAGA hat, why was this in question?"
    },
    {
        "user": "LegDayDE",
        "time": "2024-10-26 01:59:56",
        "message": "Shame he voted before he was arrested"
    },
    {
        "user": "tolacid",
        "time": "2024-10-26 02:12:47",
        "message": "Ugh. Of course it's my hometown."
    },
    {
        "user": "Laughing_AI",
        "time": "2024-10-26 00:35:58",
        "message": "Man tell me about it, I made a post that mocked the conservative sub here and have nonstop been getting hate from them since.   It actually validates all my points about them!\n\nBut of course, they dont get that, they just get angrier and angrier.\n\nI have no clue how someone can live life like that... but it makes me feel alot better about how I live my life and treat people.  Their example makes a great lesson on exactly how NOT to be."
    },
    {
        "user": "silentgiant87",
        "time": "2024-10-26 01:24:43",
        "message": "they punched a 69 year old?!? JFC"
    },
    {
        "user": "frisbeemassage",
        "time": "2024-10-26 03:56:18",
        "message": "Clinton was NOT WRONG when she called them deplorable. Every single MAGA can suck a bag of dicks"
    },
    {
        "user": "LadyDomme7",
        "time": "2024-10-26 00:01:01",
        "message": "More like herpes - we’ll never get rid of them. Cancer can be cured."
    },
    {
        "user": "Mike7676",
        "time": "2024-10-26 03:59:14",
        "message": "As I understand it, that's 3k up front yes? How the hell does someone like that justify taking that money and just tossing it? I live very well and I couldn't fathom doing something that would cost my family that "
    },
    {
        "user": "snoo_spoo",
        "time": "2024-10-25 23:42:35",
        "message": "Most people are pretty good about zipping up their jacket or turning their shirt inside-out or whatever. It's a shame this guy decided to be an asshole."
    },
    {
        "user": "oldteen",
        "time": "2024-10-25 23:44:40",
        "message": "IMO, like those in this article, some are self-rightousness and _feel_ they're above the law..just like their cult leader believes."
    },
    {
        "user": "Cheaperthantherapy13",
        "time": "2024-10-26 01:50:08",
        "message": "That’s the law in our state, but in our elections officer training we were told to ‘let it go if they’re not making a scene’ because ‘it’s better to not kick up a fuss if we don’t need to.’ Which is also what we were told to do if a voter decides to open carry a firearm into our polling station. \n\nAnd yes, it is a deep red district in a blue state (Trump didn’t even bother to have a campaign team in our state). I thought the ‘20 election was crazy but I’m really dreading next Tuesday."
    },
    {
        "user": "JadeSpeedster1718",
        "time": "2024-10-26 03:03:23",
        "message": "Most are Christian so persecution complex is the norm for them."
    },
    {
        "user": "gooddogisgood",
        "time": "2024-10-26 02:00:44",
        "message": "Absolutely right."
    },
    {
        "user": "iamrdux",
        "time": "2024-10-26 03:23:01",
        "message": "just keep it above the equator"
    },
    {
        "user": "daitenshe",
        "time": "2024-10-26 03:33:10",
        "message": "Had to make sure it wasn’t in my area since I had the same start to a scenario happen when I went to early vote. Guy rolls in with a MAGA hat and went full Karen when the older worker told him he had to take it off to vote. The ol’ “I’m going to need your credentials so I can speak to your manager shtick” like a loser"
    },
    {
        "user": "caseyanthonyftw",
        "time": "2024-10-26 00:08:56",
        "message": "Actually, the [guy was kinda brown looking lol](https://news4sanantonio.com/news/local/election-clerk-assaulted-as-polls-close-in-san-antonio).\n\nBut yeah, screw that guy."
    },
    {
        "user": "Burnt_Ernie",
        "time": "2024-10-26 00:18:34",
        "message": "> Bet this same guy was flouting mask “mandates” during the pandemic\n\nNo doubt about it, and probably looks identical to the crazed moron in this pic:\n\nhttps://imgur.com/a/magalomaniac-lAP4f4F"
    },
    {
        "user": "Helpuswenoobs",
        "time": "2024-10-26 01:51:31",
        "message": "Imagine how many people will think it's okay now too, since the sherrif and media are borh downplaying it so much."
    },
    {
        "user": "Mike7676",
        "time": "2024-10-26 04:01:25",
        "message": "I've met the sherrif a few times and like him, have voted for him. This is a big miss on his part and something he should address."
    },
    {
        "user": "Helpuswenoobs",
        "time": "2024-10-26 01:52:51",
        "message": "Sorry, I forgot, remind me of when they were before again?"
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:31:43",
        "message": "Class 3 felony, 30k bond"
    },
    {
        "user": "PaidDemocratTroll",
        "time": "2024-10-25 23:48:15",
        "message": "8 years is a long time for a black-indian woman to be their president"
    },
    {
        "user": "Helpuswenoobs",
        "time": "2024-10-26 01:47:44",
        "message": ">That's old enough to be able handle yourself in public, no?\n\nYou forget he's a MAGA."
    },
    {
        "user": "UsualAnybody1807",
        "time": "2024-10-26 01:23:08",
        "message": "Remember the cop who punched an elderly demonstrator in Buffalo, NY in 2020? That is a perfect example of what we will have in store for us, except it will be the National Guard instead of local cops.\n\nNormally I don't use a Wikipedia link to info, but check out all of the news stories that are used as sources in the link. [https://en.wikipedia.org/wiki/Buffalo\\_police\\_shoving\\_incident](https://en.wikipedia.org/wiki/Buffalo_police_shoving_incident)"
    },
    {
        "user": "Laughing_AI",
        "time": "2024-10-26 00:42:24",
        "message": "Ive heard this said! She was obviously 100% correct.  \n\nWe can only hope SOME of them are able a modicum of self introspection, and can someday see the light to becoming better rational people.  I wont hold my breath though."
    },
    {
        "user": "UsualAnybody1807",
        "time": "2024-10-26 01:24:54",
        "message": "My brother told me in 2016 he was proud to be one of Hillary's deplorables. It's a badge of honor for them, bunch of thugs."
    },
    {
        "user": "RetiredHotBitch",
        "time": "2024-10-26 01:40:24",
        "message": "Salazar is actually the best Sheriff the county has had in a long time, spoke at the DNC, regularly stands against Abbot/Paxton, stands up for immigrants…I’m sure he will take this seriously."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:40:56",
        "message": "He’s been charged with a class 3 felony, 30k bond. His wife must be so proud."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:32:06",
        "message": "Charged with class 3 felony assault, 30k bond"
    },
    {
        "user": "fineboi",
        "time": "2024-10-26 00:56:03",
        "message": "Hopefully they go back into hiding for 8 years and figure out how they will steal the election after Kamala’s 2 terms are up."
    },
    {
        "user": "jcmacon",
        "time": "2024-10-26 00:38:55",
        "message": "Assaulting Ng a poll worker is a felony if I recall, and he might just lose his right to vote in future elections."
    },
    {
        "user": "8_of_clubs",
        "time": "2024-10-26 00:55:25",
        "message": "i’m hoping he didn’t get to vote?"
    },
    {
        "user": "ShadowyFlows",
        "time": "2024-10-26 00:49:26",
        "message": "Imagine making Donald fucking Trump your entire identity."
    },
    {
        "user": "MetalMamaRocks",
        "time": "2024-10-26 01:04:10",
        "message": "He probably would've been the first one crying about a Harris/Walz T-shirt."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:42:22",
        "message": "He was charged with a class 3 felony, 30k bond"
    },
    {
        "user": "DoctorTheWho",
        "time": "2024-10-26 01:41:08",
        "message": "Honestly, attacking a poll worker should be grounds for incarceration without bail until the day after election night."
    },
    {
        "user": "Maven3679",
        "time": "2024-10-26 01:34:28",
        "message": "I see what ya did there"
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:32:32",
        "message": "Charged with a class 3 felony, 30k bond"
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:29:42",
        "message": "It depends on the state. In AZ, he would be just fine wearing the hat."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:28:54",
        "message": "It is and he has been charged with a class 3 felony for it. 30k bond."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:43:00",
        "message": "No. He was able to vote. The assault happened after."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:33:49",
        "message": "Class 3 felony assault, 30k bond"
    },
    {
        "user": "TheRedPython",
        "time": "2024-10-26 02:58:01",
        "message": "My polling place when I lived in KC was actually at the National Guard armory in 2020. I wish it were in a similar place where I'm at now."
    },
    {
        "user": "Schiffy94",
        "time": "2024-10-26 02:34:47",
        "message": "So walking in with a McCain/Palin sign is allowed?"
    },
    {
        "user": "Puzzled-Grocery-8636",
        "time": "2024-10-26 02:09:26",
        "message": "Maybe originally from New Braunfels?\n\nI nearly got into a fight back when Trump was President because someone recognized my Minnesota accent and said, \"You're one of those liberals huh? Wanna go outside and settle this?\"\n\nLike WTF dude, I just went to Pappadeaux's to eat some fish, leave me the fuck alone.\n\nWhat is wrong with Texans?"
    },
    {
        "user": "Helpuswenoobs",
        "time": "2024-10-26 01:39:01",
        "message": "No, but you can run for president instead of going to jail apparently."
    },
    {
        "user": "2happylovers",
        "time": "2024-10-26 02:03:16",
        "message": "Yes, yes they do. All while announcing their intentions via their actions and accusations. Acting like a bunch of spoiled, entitled, 5 year olds!"
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:34:20",
        "message": "They were. Charged with class 3 felony assault. 30k bond."
    },
    {
        "user": "cturtl808",
        "time": "2024-10-26 03:31:22",
        "message": "Was there another poll worker closer to the door? Outside the electioneering zone, the hat is permissible."
    },
    {
        "user": "wondy",
        "time": "2024-10-26 00:12:51",
        "message": "Correct. I'm in Southern California and am a poll worker this upcoming election. During training we were told voters cannot display a candidate's name, likeness, or logo; however, slogans are acceptable. So if somebody comes into vote with a shirt that says, \"I'm with her\" or \"Make America Great Again\" we can't ask them to cover it up because technically it's allowed."
    },
    {
        "user": "PraiseAzolla",
        "time": "2024-10-26 02:23:17",
        "message": "In Virginia, the law explicitly allows wearing a candidates name, slogan, etc, on a hat or clothing as long as you're a voter there to cast a ballot."
    },
    {
        "user": "tjb122982",
        "time": "2024-10-26 00:31:49",
        "message": "No then they will shoot anyone they deem a threat"
    },
    {
        "user": "Schiffy94",
        "time": "2024-10-26 02:35:43",
        "message": "That's not even close to accurate."
    },
    {
        "user": "Safe_Proposal3292",
        "time": "2024-10-26 02:25:57",
        "message": "Does it say that in the article? Is that true?"
    },
    {
        "user": "Xankth",
        "time": "2024-10-26 02:27:07",
        "message": "In Texas, you can't wear anything supporting or opposing a candidate within a certain distance of a polling site.  You also can't set up signs, hold signs or audibly try to convince others of which candidate they should vote for."
    },
    {
        "user": "shutupandevolve",
        "time": "2024-10-26 03:36:26",
        "message": "Trump is not a Democrat"
    },
    {
        "user": "snoo_spoo",
        "time": "2024-10-25 23:44:56",
        "message": "People are allowed to talk to you and offer literature outside a certain boundary--maybe a hundred feet? IDK, it varies from one place to another, but most states have some sort of electioneering rule. TBH, one of my favorite early voting places is a grocery store because there's no point trying to push cards since they have no idea who's going in to shop and who's going in to vote."
    },
    {
        "user": "bjbkar",
        "time": "2024-10-26 01:39:25",
        "message": "bUt ThEy bAcK tHe Blue"
    },
    {
        "user": "CountyBeginning6510",
        "time": "2024-10-25 23:23:35",
        "message": "I am doubting he was let in to vote after assaulting someone."
    },
    {
        "user": "KinkyPaddling",
        "time": "2024-10-26 02:07:05",
        "message": "Greg Abbott would just pardon him anyway."
    },
    {
        "user": "pr0b0ner",
        "time": "2024-10-26 00:44:29",
        "message": "Party of law and order for people that are different than them. They're following the most sacred law of being a white guy who falls in line. If you're not white, not a guy, and ESPECIALLY if you don't fall in line, you're breaking the rules and need law and/or order applied to your ass."
    },
    {
        "user": "A_Texas_Jarvis",
        "time": "2024-10-26 01:09:49",
        "message": "I was in line in Montgomery county texas and people had maga hats and shirts, dude had the fight fight fight shirt. One of them was harassing the workers there. Texas aint so friendly anymore. "
    },
    {
        "user": "tryingtoavoidwork",
        "time": "2024-10-26 00:50:28",
        "message": "I remember people losing their goddamn minds because BLM was allowed and not MAGA."
    },
    {
        "user": "MountainMan2_",
        "time": "2024-10-26 03:40:09",
        "message": "> As an example we had a discussion about whether or not \"When we fight, we win\" was enough of an identifiable slogan that it wouldn't be allowed, but the general consensus was it was not, and I'm in a very Red County.\n\nTo be fair, in very red counties it's unlikely anyone has even heard a kamala slogan. I assume the consensus is her slogan is more like \"I'm going to let illegals sex change your unborn babies\""
    },
    {
        "user": "ClusterFoxtrot",
        "time": "2024-10-25 23:29:57",
        "message": "Thankfully they weren't hurt. Sheriff even seems flustered about it."
    },
    {
        "user": "Disturbing_Trend_666",
        "time": "2024-10-26 00:24:03",
        "message": "Vermin through and through, every last one of them. The worst of us. The worst of humanity, period."
    },
    {
        "user": "snarky_spice",
        "time": "2024-10-26 01:43:42",
        "message": "I saw a tiktok of another Trump couple that were asked to return without their Trump shirts and they were having a tantrum. The annoying thing was they were asking other people in line, if they thought it was okay to do this in “America” and people were standing up for them. I don’t think a lot of folks know about the no clothing rule. They just want to be oppressed so bad."
    },
    {
        "user": "opinionsareus",
        "time": "2024-10-26 00:26:05",
        "message": " Ice! Another MAGAT with a felony. Assault and Battery. Also, a Federal crime. Make this loser PAY!"
    },
    {
        "user": "AntiworkDPT-OCS",
        "time": "2024-10-25 23:29:29",
        "message": "It was the lead talking.\n\n\nI'm not excusing him. I was aiming for a sad joke."
    },
    {
        "user": "doorbell2021",
        "time": "2024-10-26 00:52:57",
        "message": "Deplorable, some would even say."
    },
    {
        "user": "AkaDutchess",
        "time": "2024-10-26 02:16:17",
        "message": "They’re fucking nazis."
    },
    {
        "user": "mutantmagnet",
        "time": "2024-10-26 03:43:49",
        "message": "It wasn't his first response.\n\n  \nThe guy complied when he entered the building.\n\n  \nWhen he was leaving, after he voted, he put the hat back on but was hanging around inside which lead to a second reminder. They tried escorting him out and that's when he retaliated.\n\n  \nAlso he is 63.\n\n  \nHe should've complied the 2nd time around but I was reading the article expecting him to be in his 40's or 50's and attacking on the first reminder."
    },
    {
        "user": "ultraviolentfuture",
        "time": "2024-10-26 01:33:03",
        "message": "Dude was 63 himself lol, no spring chicken"
    },
    {
        "user": "Rough_Idle",
        "time": "2024-10-26 02:08:57",
        "message": "I was going to say, considering the advanced ages of the poll workers in my hometown, he guy probably doesn't have a lot of hit points"
    },
    {
        "user": "Sea_Dawgz",
        "time": "2024-10-26 02:17:27",
        "message": "A 63 year old. \n\nHe punched a 69 year old!"
    },
    {
        "user": "FredFredrickson",
        "time": "2024-10-26 03:25:38",
        "message": "Always have been."
    },
    {
        "user": "thisusedyet",
        "time": "2024-10-26 03:51:03",
        "message": "Puncher or Punchee?"
    },
    {
        "user": "Optimal-Hedgehog-546",
        "time": "2024-10-26 04:05:34",
        "message": "What a piece of shit"
    },
    {
        "user": "atgrey24",
        "time": "2024-10-26 01:35:04",
        "message": "The guy throwing the punch is 63, so at least he's fighting in his age bracket"
    },
    {
        "user": "okletstrythisagain",
        "time": "2024-10-26 00:40:11",
        "message": "This is the essence of the platform at this point. Over time the blatant authoritarianism has superseded the bigotry."
    },
    {
        "user": "kellysmom01",
        "time": "2024-10-25 23:53:42",
        "message": "It’s like … “*Tell us you don’t give **two shits** about the Constitution or the Rule of Law* without saying those exact words.” And isn’t Texas the SHOW-ME STATE? (OOPS, that be **Missouri**, but there’s plenty of ass-foolery going on there, too.)\n\nDoesn’t it make you so … tired. The world, which has plenty of its own warts and buboes, is laughing at us. Or, at least they’re laughing until they need some USA help."
    },
    {
        "user": "UsualAnybody1807",
        "time": "2024-10-26 01:09:51",
        "message": "Only happy when they are hurting others."
    },
    {
        "user": "-AdonaitheBestower-",
        "time": "2024-10-26 00:57:35",
        "message": "I was about to say. Wait, poll workers in America aren't paid??? I got $400 for my day (Australia)."
    },
    {
        "user": "ClusterFoxtrot",
        "time": "2024-10-26 01:11:21",
        "message": "Til\nI thought they were volunteer positions? Or maybe its they don't have training really and I'm associating it with some other inadequacy of our election system. "
    },
    {
        "user": "NorthNThenSouth",
        "time": "2024-10-26 03:13:12",
        "message": "We do, though it’s a small amount and it varies by county (I’m a current poll worker)"
    },
    {
        "user": "AtalanAdalynn",
        "time": "2024-10-26 03:31:28",
        "message": "They were told to do something and no one tells them to do anything!"
    },
    {
        "user": "CranberrySchnapps",
        "time": "2024-10-26 00:06:17",
        "message": "Just waiting for Ken Paxton to swoop in and make this go away."
    },
    {
        "user": "mamajamala",
        "time": "2024-10-26 00:05:17",
        "message": "I hope there are state & federal charges incoming. He deserves it!"
    },
    {
        "user": "Driftedryan",
        "time": "2024-10-26 00:52:05",
        "message": "They should charge him and take his vote out for shit like that. The guy can't wait till j6 to go storm the capital again"
    },
    {
        "user": "CORenaissanceMan",
        "time": "2024-10-26 03:46:34",
        "message": "Assault or battery charges are probably more serious and pending."
    },
    {
        "user": "SuperCleverPunName",
        "time": "2024-10-26 04:09:08",
        "message": "Nah, if this is a first offence, he should get first offence consequences. In another timeline, I can fully imagine that if people were being told to take off their Bernie4Prez merch, some might react emotionally with violence. \n\nSmack him over the head, give him community service, and throw him on the street."
    },
    {
        "user": "transcriptoin_error",
        "time": "2024-10-26 00:14:47",
        "message": "> constant state of mortified second hand embarrassment\n\nThat would require a level of self-awareness which would probably preclude their affiliation, if it were to exist in the first place."
    },
    {
        "user": "syntax138",
        "time": "2024-10-26 01:50:24",
        "message": "He also said “tone down the violence “!! Wtf? Not “ stop the violence”???"
    },
    {
        "user": "transcriptoin_error",
        "time": "2024-10-26 01:17:07",
        "message": "> They were wearing a MAGA hat, why was this in question? \n\n\nBecause it was not stated in the article that was posted earlier, before this one. [Edit: It was left vague at the time of publication — now it looks like that article has been updated.]\n\nhttps://www.reddit.com/r/politics/comments/1gc4o84/poll_worker_assaulted_at_early_voting_center_in/ltqyx6y/"
    },
    {
        "user": "Jacktac",
        "time": "2024-10-26 02:16:57",
        "message": "A 63-year old punched a 69-year old, elder on elder violence."
    },
    {
        "user": "ContrarianDouchebag",
        "time": "2024-10-26 03:13:50",
        "message": "Spontaneous remission is a thing, too.\n\nLet's just hope."
    },
    {
        "user": "krepitch",
        "time": "2024-10-26 00:55:47",
        "message": "That's the default with these guys, though.  They'd have to decide to NOT be an asshole."
    },
    {
        "user": "jello_sweaters",
        "time": "2024-10-26 00:27:11",
        "message": "\"Jesse Lutzenberger\"?\n\n>On the way out of the polling site, he put his hat back on while still in the building, and an election clerk told him that was not acceptable and began to escort him out. As they were about to exit the libraryLutzenberger struck the 69-year-old election clerk several times in the chest and face\n\nI'm pretty sure his ethnic group is \"asshole\"."
    },
    {
        "user": "FizzgigsRevenge",
        "time": "2024-10-26 01:00:29",
        "message": "Welcome to Texas. lol"
    },
    {
        "user": "OuchieMuhBussy",
        "time": "2024-10-26 01:31:25",
        "message": "In my experience with racists, like on /pol/ or similar places, there are a lot of people who would not pass the Peter Griffin skin tone test."
    },
    {
        "user": "tjb122982",
        "time": "2024-10-26 01:57:06",
        "message": "Idk a long time ago if ever"
    },
    {
        "user": "Laughing_AI",
        "time": "2024-10-26 00:39:31",
        "message": "Yeah the 8 years of Obama broke them, and another strong intelligent  president of color, this time a woman, will SET THEM ON FIRE"
    },
    {
        "user": "Great_cReddit",
        "time": "2024-10-26 01:48:07",
        "message": "Oh yeah I distinctly remember that situation. Yup, I fear it will be worse than this. All we can hope is that these polls are bullshit and that in 2024 the Dems are the silent majority."
    },
    {
        "user": "Infamous-Sky-1874",
        "time": "2024-10-26 02:23:38",
        "message": "In Texas? Either Paxton will lean on the local prosecutor to toss the charges or Abbott will just pardon the guy."
    },
    {
        "user": "KiscoKid1",
        "time": "2024-10-26 01:10:30",
        "message": "The article said he voted and was on his way out when the assault occurred."
    },
    {
        "user": "Adexavus",
        "time": "2024-10-26 01:39:32",
        "message": "They eating the dogs, they are eating the cats\n\nThe magical box told me so"
    },
    {
        "user": "FiFiLB",
        "time": "2024-10-26 03:43:16",
        "message": "Damn"
    },
    {
        "user": "jkjustjoshing",
        "time": "2024-10-26 03:02:44",
        "message": "As long as it doesn’t mention Republicans, yes. \n\nThat said, Poll Workers are retirees or (like me) people who use a vacation day at work to contribute to a smooth election - do your best to not make our days more difficult or stressful ❤️❤️"
    },
    {
        "user": "CanWeTalkEth",
        "time": "2024-10-26 03:16:07",
        "message": "Thanks. Too bad I’m getting downvoted. Thought it was a good PSA.\n\nI’m a poll worker in my state."
    },
    {
        "user": "CanWeTalkEth",
        "time": "2024-10-26 03:15:31",
        "message": "Thanks. Too bad I’m getting downvoted. Thought it was a good PSA. \n\nI’m a poll worker in my state."
    },
    {
        "user": "rsiii",
        "time": "2024-10-26 04:07:28",
        "message": "Isn't that what Republicans want anyway?"
    },
    {
        "user": "FresherAllways",
        "time": "2024-10-26 00:51:48",
        "message": "then people should behave themselves and vote in a polite, orderly fashion."
    },
    {
        "user": "Schiffy94",
        "time": "2024-10-26 02:35:49",
        "message": "No and no"
    },
    {
        "user": "Ill_Brief7498",
        "time": "2024-10-25 23:50:55",
        "message": "🤷🏽‍♀️ I just do my research and vote for who I’m going to vote for regardless of 🎉 party!"
    },
    {
        "user": "Ill_Brief7498",
        "time": "2024-10-25 23:48:57",
        "message": "And this happened at a grocery store!"
    },
    {
        "user": "Ill_Brief7498",
        "time": "2024-10-25 23:47:48",
        "message": "I know… it’s was weird as in my area this has never happened before ever!!! And I understand why the MAGA hat was not to be worn as it is considered camping!"
    },
    {
        "user": "GloomyAd2653",
        "time": "2024-10-26 03:29:03",
        "message": "They mean “black & blue,” like the bruises that MAGA like to leave from the punch!"
    },
    {
        "user": "Deleted",
        "time": "2024-10-25 23:26:13",
        "message": "[deleted]"
    },
    {
        "user": "BobInWry",
        "time": "2024-10-25 23:28:33",
        "message": "Read the article.  The assault happened after he'd cast his vote"
    },
    {
        "user": "Epitometric",
        "time": "2024-10-26 03:59:30",
        "message": "Lol read the article. he already voted then put the hat back on"
    },
    {
        "user": "plucharc",
        "time": "2024-10-26 03:36:49",
        "message": "I wonder if attacking a poll worker is a Federal crime?"
    },
    {
        "user": "mizkayte",
        "time": "2024-10-26 01:05:20",
        "message": "Yup. So much this."
    },
    {
        "user": "AbacusWizard",
        "time": "2024-10-26 01:45:51",
        "message": "> Texas aint so friendly anymore. \n\nWas it ever?"
    },
    {
        "user": "woodrobin",
        "time": "2024-10-26 00:57:11",
        "message": "It does make sense, though.  Black Lives Matter is an issue.  Make America Great Again is a candidate campaign slogan.  \n  \nThey could probably get away with a \"Blue Lives Matter\" or \"All Lives Matter\" hat or shirt.  That may be just an insipid twist on the BLM movement, but it would still be an issue, not a slogan."
    },
    {
        "user": "Dartagnan1083",
        "time": "2024-10-26 03:00:57",
        "message": "I remember in 2018 during the California fires, magats were up in arms over \"BLM\" being reported in the area. Thankfully it never went anywhere even after people figured out it was Bureau of Land Management being abbreviated over radios (which was still ignored."
    },
    {
        "user": "GloomyAd2653",
        "time": "2024-10-26 03:32:21",
        "message": "Bureau of Land Management?/s"
    },
    {
        "user": "readzalot1",
        "time": "2024-10-26 00:57:50",
        "message": "Not hurt, or not seriously hurt? Any punch is going to do some harm."
    },
    {
        "user": "Alacrout",
        "time": "2024-10-26 00:35:40",
        "message": "In 2016, I believed most Trump voters were good people who got scammed. I say “most,” but feel the need to acknowledge that there has always been a very vocal chunk of them who are absolutely terrible.\n\nI think this was me trying to rationalize to myself how TF he even got nominated, let alone NOT lose in a landslide.\n\nI may have been naive. Idk. I try not to think about it anymore.\n\nBecause NOW I know for a fact that there are NO “good people” who support Trump.\n\nThere is not one single good person who could have lived through the last 8 years and somehow still fall for Trump’s scam."
    },
    {
        "user": "OuchieMuhBussy",
        "time": "2024-10-26 01:24:27",
        "message": "Vermin is what he calls migrants. Don’t sink to their level, they revel in it. Instead, just call them what they are: fascists. They hate being being called that more than anything."
    },
    {
        "user": "herdingMonkees",
        "time": "2024-10-26 02:16:48",
        "message": "like a basket of deplorables..."
    },
    {
        "user": "PunxatawnyPhil",
        "time": "2024-10-26 02:17:28",
        "message": "Lowlife dipshits. "
    },
    {
        "user": "Notquitearealgirl",
        "time": "2024-10-26 02:22:19",
        "message": "Try not to think like this. It's a never ending cycle of dehumanizing the supposed  enemy and then chaos and violence for people who for the most part don't even know what the fuck is going on. In any period and any culture. \n\nI get it. People suck, faith in humanity is dead, whatever, but seriously there is no moral way to dehumanize other people. It's not fair or right, nor it it productive. \n\nAt the very least if you just can't help it, go more with the they are hopeless and can't be reached and should be ignored and maybe even disenfranchised instead of purging them from earth, but even then you just end up advocating for elitist and anti democratic sentiments essentially in defense of liberal democracy. Which seems counter productive."
    },
    {
        "user": "Mike7676",
        "time": "2024-10-26 03:52:21",
        "message": "It's ridiculous I agree. However, I made the choice a long while ago to believe that this kind of desperate, acting out behavior belies something very scared . They might win, it's absolutely a possibility. But my wife came home from a school event very upset over an exit poll that seemed to show that early voters were split between parties. I think we are going to see something very different. While I don't think in my state we will see this \"blue wave\" we are going to see that people are fucking tired of this bullshit no policy behavior. It's fear, fear of \"other\". That's all the Republicans have, all they ever had. We have a real way forward in this country. Vote! The party of small government has sinned mightily against us, make them pay where it counts. In their precious, precious positions."
    },
    {
        "user": "Immediate_Loquat_246",
        "time": "2024-10-26 00:04:36",
        "message": "Tired and still in the state of shock I guess? I honestly thought the country was better than this. I had no idea we still had such a significant amount of racist and sexist morons that clearly don't understand the true dangers of fascism. And of course people who just want to own the libs I guess."
    },
    {
        "user": "PsychoNerd91",
        "time": "2024-10-26 01:11:36",
        "message": "The world is not laughing at all. The world is side-eyeing this election because for many it will have devastating consequences to their own country. "
    },
    {
        "user": "Scrapybara_",
        "time": "2024-10-26 02:22:09",
        "message": "Misery is the show me state"
    },
    {
        "user": "OuchieMuhBussy",
        "time": "2024-10-26 01:25:47",
        "message": "The pain is the point. That’s the “sadism” component of Trump’s malignant narcissism."
    },
    {
        "user": "Mec26",
        "time": "2024-10-26 01:20:04",
        "message": "Depends on the role."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:23:46",
        "message": "Wow thats a lot, in my state it's only $250 and you can't leave the whole day."
    },
    {
        "user": "CriticalEngineering",
        "time": "2024-10-26 01:23:08",
        "message": "People generally refer to them as volunteers, because they volunteer to do the work. It’s generally paid, but not well paid in any way. \n\nThere are also poll observers and greeters that are partisan in many places that are strictly volunteer and unpaid, but are an important part of the process."
    },
    {
        "user": "alittlelebowskiua",
        "time": "2024-10-26 03:15:06",
        "message": "Good!\n\nI've staffed and worked in polling stations in the UK and the thought of not paying people for that blew my mind!"
    },
    {
        "user": "Single_9_uptime",
        "time": "2024-10-26 00:22:12",
        "message": "He doesn’t control local prosecutions, thankfully. Bexar County is San Antonio, they don’t have some MAGA prosecutor’s office, so hopefully there will be consequences."
    },
    {
        "user": "ZwVJHSPiMiaiAAvtAbKq",
        "time": "2024-10-26 02:10:35",
        "message": "Yep, \"violent moron\" is the default for MAGA and it's been obvious since at least Charlottesville."
    },
    {
        "user": "Helpuswenoobs",
        "time": "2024-10-26 02:01:36",
        "message": ">if ever"
    },
    {
        "user": "FauxReal",
        "time": "2024-10-26 01:27:19",
        "message": "OK, but there are MAGA poll workers too. And poll workers shouldn't need to be armed guards in an escalating battle where people will want to challenge them knowing they have guns. I know the good guy with a gun thing is a trope, but let's keep it to the movies since it doesn't always work so great in real life."
    },
    {
        "user": "Safe_Proposal3292",
        "time": "2024-10-26 02:44:24",
        "message": "That’s what I thought lol"
    },
    {
        "user": "snoo_spoo",
        "time": "2024-10-25 23:50:11",
        "message": "Whoa. That *is* surprising."
    },
    {
        "user": "snoo_spoo",
        "time": "2024-10-25 23:48:49",
        "message": "Wow, that is different, then. I guess the local Dems must be fired up?"
    },
    {
        "user": "s3rv0",
        "time": "2024-10-26 00:07:28",
        "message": "Technically though... He wasn't a felon until after he voted. And if we get into the weeds in \"You cast your vote before the election so let's find ways to invalidate it before November 5th,\" we'd be setting a precedent that SOME OTHER FOLKS would sure love for us to do. \n\nCount his vote. Throw his ass in jail."
    },
    {
        "user": "LieverRoodDanRechts",
        "time": "2024-10-25 23:40:35",
        "message": "Dumb European here, how would you know which vote is his? Do you register votes? \n\nMaybe I’m wrong but I’m pretty sure here in the EU something like that would be impossible to do since once a vote is cast it is completely anonymous.\n\nEdit: English hard"
    },
    {
        "user": "snoo_spoo",
        "time": "2024-10-25 23:41:00",
        "message": "No. He wasn't dropping off a ballot, he was actually voting. There's no way to un-count it."
    },
    {
        "user": "Slimymushroom",
        "time": "2024-10-26 01:04:30",
        "message": "Correction: If you vote then die or otherwise become inactive in Oregon that ballot is still valid."
    },
    {
        "user": "Dartagnan1083",
        "time": "2024-10-26 02:54:24",
        "message": "Seems rather harsh. I think other states allow the vote to be counted if the recorder receives it before the voter is certified dead."
    },
    {
        "user": "Gothic_Sunshine",
        "time": "2024-10-26 03:00:22",
        "message": "Is that how it is in Oregon? In California, if you legitimately cast a ballot while alive, then die prior to the election, the vote gets counted. You were eligible when you cast it. Georgia is the same, which is why Jimmy Carter voted as early as possible in case he passes away."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:09:59",
        "message": "That would only work for mail in ballots before they take them out of the envelope. Early voting is just like voting on election day, once you vote it's in the ballot box anonymously."
    },
    {
        "user": "A_Texas_Jarvis",
        "time": "2024-10-26 03:03:11",
        "message": "The cities yea and where I was at was like 3 miles from houston in a nice area."
    },
    {
        "user": "PompadourPrincess",
        "time": "2024-10-26 02:32:24",
        "message": "They've still got sundown towns"
    },
    {
        "user": "tryingtoavoidwork",
        "time": "2024-10-26 00:58:24",
        "message": "Yeah it makes perfect sense if you're not the kind of person who thinks everyone is looking to fuck you personally"
    },
    {
        "user": "spam__likely",
        "time": "2024-10-26 03:16:03",
        "message": "It is because BLM is not on the ballot. Anything directly related to a ballot issue or candidate is not allowed."
    },
    {
        "user": "ClusterFoxtrot",
        "time": "2024-10-26 01:02:45",
        "message": "I guess not seriously? The sheriff noted some scratches but no need for hospital. No wonder old people don't want to do this anymore "
    },
    {
        "user": "poseidons1813",
        "time": "2024-10-26 02:30:26",
        "message": "Yeah but if it was a maga guy he's probably as weak as Donald."
    },
    {
        "user": "holyerthanthou",
        "time": "2024-10-26 02:15:45",
        "message": "You’ve clearly never been punched"
    },
    {
        "user": "Firemonkey00",
        "time": "2024-10-26 03:25:19",
        "message": "I mean I literally got punched in the face by my psycho ex gf.  She literally threw her entire body into the swing and barely even made me feel a small thump.  Was frankly awkward. And I feel like my face hurt her hand more than she ever was going to hurt me with that shit"
    },
    {
        "user": "null_input",
        "time": "2024-10-26 01:10:02",
        "message": "They're deplorable. Hillary was right."
    },
    {
        "user": "angrydeuce",
        "time": "2024-10-26 01:19:13",
        "message": "In 2016 I knew a nontrivial number of people who voted for Trump in protest.  Imagine their surprise when he fucking ended up winning."
    },
    {
        "user": "MountainMan2_",
        "time": "2024-10-26 03:46:36",
        "message": "I think most Trump supporters were good people back then. It's being a Trump supporters that has made them awful. The alt right pipeline leads you to fear, hate and despair, it's a known thing. Right wing conspiracists are always unhappy."
    },
    {
        "user": "Disturbing_Trend_666",
        "time": "2024-10-26 01:42:49",
        "message": "That word bounces right off of them. I want them to know I think as little of them as they think of illegal immigrants. I want them to know that they're the illegals in this democracy. They have no home here and are not welcome and I'd kick them out if I could. Fascists are a cancer and should be removed from the body politic."
    },
    {
        "user": "mgwair11",
        "time": "2024-10-26 02:58:29",
        "message": "Vermin is precisely the correct term though:\n\n*“people perceived as despicable and as causing problems for the rest of society.”*"
    },
    {
        "user": "AllUsernamesInUse_",
        "time": "2024-10-26 02:06:18",
        "message": "I appreciate the sentiment and in better times I would agree, but unfortunately the civility of the early 2000s is gone"
    },
    {
        "user": "AllUsernamesInUse_",
        "time": "2024-10-26 03:33:21",
        "message": "Honestly I think we are at a point that it would be better if we did find some way to split the country up into certain segments. I know, unrealistic, the logistics, how to do it, how to agree on it, etc. But if there was some way to just allow the red states to go their own separate way and do whatever the hell they want and leave the rest of us alone, what a dream."
    },
    {
        "user": "kellysmom01",
        "time": "2024-10-26 00:11:15",
        "message": "Hate to say it out loud, but I really think a whole lot of people are not very smart. They don’t question statements, made into a microphone, that make no sense. They obviously didn’t pay attention to civics class. They don’t read. They vote against their own best interests (out of a feeling of powerlessness?) I actually had someone say to me, “Well, Trump says he’s going to make America great again. And what’s so wrong with that?” Oy."
    },
    {
        "user": "-AdonaitheBestower-",
        "time": "2024-10-26 02:40:32",
        "message": "I was signing off voters from the registration rolls, counting the amount of ballot papers put in boxes and organising the queues. Those were all paid, hbu?"
    },
    {
        "user": "-AdonaitheBestower-",
        "time": "2024-10-26 02:39:43",
        "message": "I think it's the same when you adjust for currency, and I could go on break for 30 minutes so I just walked home lol and then back"
    },
    {
        "user": "tolos",
        "time": "2024-10-26 02:50:45",
        "message": "I read it more as a reminder. When the convicted murderer announced on social media he wanted to kill protestors, then went to a protest and murdered Garrett Foster, Ken Paxton jizzed his pants pardoning the terrorist the second he was able to."
    },
    {
        "user": "FresherAllways",
        "time": "2024-10-26 01:37:18",
        "message": "agree to disagree."
    },
    {
        "user": "AlexKingstonsGigolo",
        "time": "2024-10-26 02:02:06",
        "message": "Spoiler alert: those \"other folks\" are going to do that anyway. Never obey in advance: https://www.carnegie.org/our-work/article/twenty-lessons-fighting-tyranny/"
    },
    {
        "user": "Vulpes_Corsac",
        "time": "2024-10-26 03:02:41",
        "message": "Depends on the state I think, at least it seemed that way in some of the threads about dying after sending in a vote that were popping up.  Some would count that vote because it was cast prior to felony conviction.  Some would trash the vote because he was ineligible on voting day, if convicted that fast.  There's no precedent set, because it's simply how the law is already structured in those states.\n\nWon't be convicted that fast, so his vote counts, so it doesn't much matter."
    },
    {
        "user": "proletariat_sips_tea",
        "time": "2024-10-26 03:37:11",
        "message": "They already did that in 2000. It's already precedent."
    },
    {
        "user": "FinsToTheLeftTO",
        "time": "2024-10-26 00:02:39",
        "message": "I believe they use nested envelopes. The outside one has the voter’s identification so they can mark off that they received the ballot and the voter can’t vote on election day in person.\n\nOn election day they open the outer envelope and discard or shred it. The inner envelopes have no identification on them and they are then opened, the ballot removed, and tabulated."
    },
    {
        "user": "wirthmore",
        "time": "2024-10-25 23:45:22",
        "message": "Dumb American here. I dunno either…\n\nAll I can imagine is, in the states that use mailed-in ballots, the ballots are sealed in an envelope which has the name, address, and signature of the voter. If these are kept sealed until Election Day, then the names on the envelope can be compared to a list of the registered voters who passed away since the ballots were sent out. \n\nBut in-person voting? The kind where you pull a lever/push a button/select on a video screen? No clue if there’s any way to remove a vote after the fact."
    },
    {
        "user": "Deleted",
        "time": "2024-10-25 23:50:57",
        "message": "[deleted]"
    },
    {
        "user": "Hardass_McBadCop",
        "time": "2024-10-26 01:07:52",
        "message": "You are correct. Once the ballot is cast there's no way to know whose it was and it will be counted. All that is recorded is *if* he voted or not.\n\nEdit: To clarify, this is for in person voting. Obviously mailed ballots will have your name attached."
    },
    {
        "user": "AtalanAdalynn",
        "time": "2024-10-26 03:22:18",
        "message": "They're able to invalidate the votes of people who die before the election, so there's some way to do it."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:12:03",
        "message": "Same here, what these people are referring to can only happen with mail in ballots since they have two envelopes. But in person voting it just goes into the ballot box, can't be taken back."
    },
    {
        "user": "BukkitCrab",
        "time": "2024-10-25 23:53:09",
        "message": "Depending on the state he lives in, his ballot probably won't be counted until election day."
    },
    {
        "user": "shoobe01",
        "time": "2024-10-26 02:57:01",
        "message": "If I get punched such that cops are called and esp if it makes the news, I insist you all take me to the hospital so all injuries are checked in detail and documented.\n\nSheriffs don't get to say if you are injured enough for medical care."
    },
    {
        "user": "MountainMan2_",
        "time": "2024-10-26 03:44:09",
        "message": "I ran a poll station back in the 2014 election. Did you know you can run one of those before you can vote in one in GA?\n\nRegardless, that job really gave me context on the kind of people that vote in person. If I was in my sixties the harassment alone would have been enough for me to quit."
    },
    {
        "user": "AbacusWizard",
        "time": "2024-10-26 01:48:07",
        "message": "Note that she specifically said that *half* of them were “deplorable” (and defined exactly what she meant by that) and that the other half were people with genuine grievances that had been largely ignored and that the government needed to start actually listening to them and addressing their problems. *She was acknowledging them and offering them an offramp*.\n\nAnd then the Republican propagandists took the one phrase completely out of context and said “she’s callin’ us all deplorables!!”"
    },
    {
        "user": "AtalanAdalynn",
        "time": "2024-10-26 03:26:53",
        "message": "It was telling when she said only part of them were deplorable and they all assumed it was about them."
    },
    {
        "user": "Ok-Entertainment829",
        "time": "2024-10-26 03:54:50",
        "message": "And despicable?"
    },
    {
        "user": "AllUsernamesInUse_",
        "time": "2024-10-26 02:07:11",
        "message": "I fully agree and I wish more people who considered themselves left-leaning would not be afraid to express it the way that you put it right here. I am the same as you on this. Don't ever apologize for being this way either, they have called us so much worse and treat us like we aren't even human, and we are supposed to always be the better people and let it brush off our back like it's nothing. I'm sick of being the nice guy."
    },
    {
        "user": "Immediate_Loquat_246",
        "time": "2024-10-26 00:21:59",
        "message": "All the more reason education cannot be left up to the states. We see how well that went with abortion /s. I'm going to toss religion in there as well, being used as part to justify bigotry and ignorance. I'll never forget this one guy who was a trump supporter that said that a woman could never be president of the United States because of what Eve did in the garden of Eden..."
    },
    {
        "user": "therealstupid",
        "time": "2024-10-26 03:39:53",
        "message": "\"Well, Harris says she's going to give every family in America $6,000. And what's wrong with that? Are you voting against getting $6,000?\"\n\nMatch em sound bite for soundbite."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 02:42:10",
        "message": "Literally can't leave the polling place here, to make sure nothing is tampered with."
    },
    {
        "user": "FauxReal",
        "time": "2024-10-26 03:00:43",
        "message": "Oh you don't think MAGA poll workers are willing to shoot people? You're probably right."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:10:52",
        "message": "Mail on ballots work like that not in person early voting."
    },
    {
        "user": "gcwardii",
        "time": "2024-10-26 02:15:43",
        "message": "Yes, nested envelopes—but (at least in Wisconsin) the outer one is to get the ballot and return envelope to the voter, and the inner one is for the voter to return the ballot. The return envelope is used to record participation, then the envelope is opened, the envelopes and ballots are separated from each other, and the ballots are counted. The envelopes are saved."
    },
    {
        "user": "bathwhat",
        "time": "2024-10-26 03:09:31",
        "message": "Early voting in Texas where I live is you check in at a desk with your drivers license or other form of ID.  They put your name down and have you sign next to your name. \n\nYou're given a ballot, which is a long blank sheet of paper that goes into the computerized voting booth. Make your picks, check your choices on the screen, then a print out comes out of the computerized voting booth which has a bar code at the top and all your choices so you can review your votes again.  \n\nCheck the selections on the ballot and feed it into a tabulation machine near the exit.. The machine is probably reading the bar code at the top of the sheet."
    },
    {
        "user": "sciguyCO",
        "time": "2024-10-26 00:02:01",
        "message": "I’d say it’d be impossible. One of the key design features of our election system is anonymous ballots. Once a ballot has left the hand of the voter or (if mailed) removed from its envelope, there’s no way to differentiate one person’s ballot from another. At least within a given voting jurisdiction. My local races / measures are different from someone the next town over. But it’d be the same as my neighbor’s. \n\nMy state (and probably most) has unique ids on the mail-in ballots to prevent duplicates / counterfeits being counted, but there isn’t (or at least shouldn’t be) anything tying that ballot to any particular voter. It’s a separate disconnected system."
    },
    {
        "user": "Tack0s",
        "time": "2024-10-26 03:00:14",
        "message": "It's Texas, don't try to make sense of it. We are the next Florida, just bigger, richer, with not only religious fanatic oil barons trying to turn us into a theocracy, but we also have the Tech Bro and Pod Cast Bro Gods Musk and Joe Rogan.\n\n\"Lasciate ogne speranza, voi ch'intrate\""
    },
    {
        "user": "willaisacat",
        "time": "2024-10-26 03:39:47",
        "message": "Shouldn't be. That would invalidate the entire process and play into the hands of election deniers. This idiot will get his punishment in the  courts. I hope."
    },
    {
        "user": "whabt",
        "time": "2024-10-26 01:19:55",
        "message": "Used to be an election official in Florida, and in FL and most other states, early in-person voting is properly secret; there's no reliable way to match a paper ballot to a specific voter once it goes through the machine, unless like they are the only voter that day or something."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:14:43",
        "message": "Really that's weird, only ever had to do that with mail or emergency ballot before actual early voting became a thing. Since covid early voting in my state is just like voting on election day, you place your ballot in the ballot box/scanner."
    },
    {
        "user": "whabt",
        "time": "2024-10-26 01:21:30",
        "message": "Some states do early voting by issuing mail ballots that you fill out and then deliver on site."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 01:26:22",
        "message": "[deleted]"
    },
    {
        "user": "digger70chall",
        "time": "2024-10-25 23:54:39",
        "message": "you can't pull the ballot out though...ballots don't have names on them so you can't know which he dropped in the bin."
    },
    {
        "user": "SpaceTimeinFlux",
        "time": "2024-10-26 02:02:42",
        "message": "Republicans are so craven and cynical. You can't say anything that can get clip chimped and spread around by spin doctors and propaganda outlets. \n\nIm so sick of these degenerate fucking assholes. None of their bullshit is good for anybody except their billionaire overlords."
    },
    {
        "user": "TuffNutzes",
        "time": "2024-10-26 02:22:15",
        "message": "Of course, now we know they are all deplorables."
    },
    {
        "user": "Glass-Shock5882",
        "time": "2024-10-26 02:29:35",
        "message": "It's *Mainstreaming 101*; \ninfiltrate Group, \nDo horrible shit ,\nget called out, rightfully,\napply individual barb to said new Group,  \nrally Group around said infiltrators,   \nmove on to the next."
    },
    {
        "user": "Oirish-Oriley444",
        "time": "2024-10-26 04:08:54",
        "message": "Snowflakes.  Weak. Easily offended. And love dishing it out,   = maga"
    },
    {
        "user": "Disturbing_Trend_666",
        "time": "2024-10-26 02:10:35",
        "message": "Exactly. I am fucking better. I ain't fucking nicer."
    },
    {
        "user": "-AdonaitheBestower-",
        "time": "2024-10-26 02:44:29",
        "message": "How would something be tampered with?"
    },
    {
        "user": "abzurdleezane",
        "time": "2024-10-26 01:28:17",
        "message": "Actually here in MA that's exactly what happens for both early in-person voting as well as mail-in ballots. I've used both methods."
    },
    {
        "user": "gcwardii",
        "time": "2024-10-26 02:19:13",
        "message": "Early voting technically is in-person absentee voting. Each early voting ballot (at least in Wisconsin) is stored in a “return” envelope with the voter’s information on it, to record voter participation on Election Day. Then they’re opened, the ballots are separated from the envelopes, and the ballots are counted."
    },
    {
        "user": "AlexKingstonsGigolo",
        "time": "2024-10-26 02:03:02",
        "message": "Some places put early ballots in sealed envelopes with the voter's name on it."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 01:21:46",
        "message": "[deleted]"
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 01:50:04",
        "message": "Which state? When I last resided stateside I was in TX, and early in-person voting was the same as voting on election day."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 00:10:27",
        "message": "[deleted]"
    },
    {
        "user": "poseidons1813",
        "time": "2024-10-26 02:31:04",
        "message": "Deplorable was far too kind."
    },
    {
        "user": "DifferentCloudQ",
        "time": "2024-10-26 02:40:40",
        "message": "That's why it was taken so personal. They knew half actually meant everybody. She just didn't know that."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 02:57:15",
        "message": "I was the head person at my polling place and had keys to open the ballot box since we had to open it at the end of the day to take out the ballots and put them in a lock box. Also to open it up if there was a jam or anything and other scenarios like if the scanner malfunctioned. So yeah that person could theoretically take some ballots out and leave, get rid of them and come back. Take a stack of ballots out and bring them back filled out to stuff the ballot box."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:35:39",
        "message": "Weird, I'm next door in RI and in person early voting is just like election day. So in MA they confirm your info once you check in but then will have to confirm it again when they get around to count it? Going to take forever to count the early vote."
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 01:49:03",
        "message": "TX early voting is the same as election day voting or it was when I resided there before I moved overseas. I will check with my brother who still resides in TX to double check if they changed those procedures."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 02:26:00",
        "message": "My state it's not like that. Seems like such a big waste of time."
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 01:38:58",
        "message": "Was everyone also voting the same way you were? That makes sense in your situation, same thing would happen in my state if you tried to vote early and had requested a mail in ballot, you need to vote provisional ballot."
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 01:46:09",
        "message": "I voted early in the state of Texas, when I resided in the US.  When you report to a ballot location you vote precisely the same way you would vote on election day.\n\nSince this event happened in Texas, his vote wasn't sealed in an envelope they use a voting machine that involves dials. You rotate the dial around till it hits the way you'd like to vote and then select. You also have the option of straight party ticket voting.  Which sets everything to the party of your choice.\n\nFurther info: You were required to check in with your ID and they mark you off the list of people who are registered to vote in your district. Ironically some poll workers were unaware that a US passport counted as an ID.\n\nEdited: clarity. I vote from abroad now."
    },
    {
        "user": "bigstupidgf",
        "time": "2024-10-26 01:01:38",
        "message": "What is the point of this comment?  This is a story about a man who was voting in person.  He did not vote by mail or absentee ballot.  Why are people having this conversation?"
    },
    {
        "user": "digger70chall",
        "time": "2024-10-26 00:22:46",
        "message": "sure, it sounds like this guy voted in person during early voting...Texans don't put early votes in an envelope do they?\n\nI work elections in Florida so I get that not all systems are exactly the same. Everyone voting early here will show an ID get put through an electronic voter system to make sure they didn't mail in a ballot. Signature gets checked on an electronic pad and their ballot is printed off to fill out. Nothing on the ballot identifies them. They drop it off in the tabulator which is a big bin. There is no order to them after they fall in.\n\nI understand mail in ballots having a signature on them. I have used them a bunch when overseas."
    },
    {
        "user": "gcwardii",
        "time": "2024-10-26 02:27:49",
        "message": "Wisconsin clerks/poll workers are not allowed to open the envelopes until the polls open on Election Day. Maybe that’s part of it.\n\nETA I’m not defending that process. I think they should be allowed to start sooner."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 01:16:13",
        "message": "[deleted]"
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 01:53:18",
        "message": "Texas (when I resided in the US) early voting was the exact same way as voting on the regular election day. You went to the voter registration, checked your name, showed your ID, went to the booths. At the booths you then used the dial to make your selections. Texas allows straight party voting, or selection voting.  If you did the straight party ticket you then had to select your choices for whatever ballot measures were also on the ballot.  Then you were done.\n\nIf you went through and picked candidate by candidate then you spent a LOT of time with that dial (I picked candidate by candidate, so I got really familiar with that stupid thing). \n\nAs far as I know, and I will check with my brother who still resides in TX. Nothing has changed since I left."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 00:29:57",
        "message": "[deleted]"
    },
    {
        "user": "GotenRocko",
        "time": "2024-10-26 02:29:55",
        "message": "Yeah probably, in my state it's just like voting on election day, you mark your ballot and put in the scanner that puts it in the ballot box. So it's counted right there and then."
    },
    {
        "user": "Expert-Mechanic3717",
        "time": "2024-10-26 02:32:29",
        "message": "It was different for me a couple of days ago.  When I arrived I got my ticket with number like normal, though I also got a regular size sheet of paper with an arrow near the top.  When you get to the booth, you insert the page into something reminiscent of a copy machine feeder and you use a touchscreen to cast your votes; the circular dial is no longer there which took a second to get used to.  Once you review and submit your vote onscreen, your votes are printed out and you take the sheet of your votes and then submit it into another document feeder by an election official on your way out."
    },
    {
        "user": "UWSpindoctor",
        "time": "2024-10-26 02:46:06",
        "message": "Straight party voting is gone and at least at my polling place the machine was different but yes early voting follows the same process as Election Day voting in Texas."
    },
    {
        "user": "digger70chall",
        "time": "2024-10-26 00:33:27",
        "message": "Yeah it's all tracked electronically when your ballot is issued. It'll flag if you requested a mail in ballot or if they received a mail in ballot from you.\n\n  \nIf someone insists on voting or says someone must've stolen their mail in then we'll let them cast provisional ballot."
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 03:44:10",
        "message": "Wow, they upgraded? I admit, I didn't expect that to ever happen.  I noticed in the overseas ballot that the straight party ticket was gone, but I wasn't entirely sure if they'd only removed it for overseas ballots or if it was everywhere (my brother informed me it's completely gone now).  I've already sent mine back, am hoping it arrives in time."
    },
    {
        "user": "Ferelwing",
        "time": "2024-10-26 03:41:51",
        "message": "I was about to update it about the straight ticket voting. I'll just upvote your comment instead. My brother let me know that straight party tickets have disappeared (I have an overseas ballot, and noticed it wasn't on it but I wasn't sure if that was just for overseas voters or if it had changed completely)."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 00:35:44",
        "message": "[deleted]"
    },
    {
        "user": "digger70chall",
        "time": "2024-10-26 00:43:16",
        "message": "Right, but if someone votes in person and that vote is tabulated by the machine it's done. Can't really fix it."
    },
    {
        "user": "Deleted",
        "time": "2024-10-26 00:52:20",
        "message": "[deleted]"
    },
    {
        "user": "digger70chall",
        "time": "2024-10-26 00:54:48",
        "message": "makes sense, all the states are different"
    }
]